{
    "recipe": {
        "title": "12-Minute Saucy Chicken Breasts with Limes ",
        "ingredients": [
            "2 teaspoons ground cumin",
            "2 teaspoons ground turmeric",
            "1 teaspoon paprika",
            "1 teaspoon kosher salt, plus more",
            "1 whole skin-on, bone-in chicken breast (about 1 1/2 pounds), split",
            "1 tablespoon olive oil",
            "2 limes, halved"
        ],
        "instructions": [
            "Place a 10\" cast-iron skillet in oven; preheat oven to 475°F. Lay your hands on another heavy skillet or saucepan the same diameter or smaller and tear off an 8\" piece of foil; set aside near stove.",
            "Mix cumin, turmeric, paprika, and 1 tsp. salt in a small bowl. Brace yourself: This next step requires some light butchery, but it’s easy. Place chicken skin side down on a cutting board and find the short row of small rib bones near the outer edge of the breast. Grip them with your fingers and pull them off (or use a paring knife or shears). Next: along the center line where the breast was cut in half, there’s a dark, vaguely rectangular bone—it almost looks like an anvil. Sometimes it’s in one piece, or both sides will have a half of it. It doesn’t matter: Grip the bone with your fingers and pull it out, then tease out the strip of flexible cartilage just below it. All done! Now the chicken will lay flat in the pan, which is why it cooks so quickly.",
            "Season both sides of chicken with salt, then with all of the spice rub. Remove hot skillet from oven and set over medium-high heat. Add oil, then lay chicken into pan, skin side down. Use a spatula to firmly press chicken against surface, then add 1 lime to pan, placing sides down. Cook until skin is starting to brown, about 2 minutes. Transfer skillet to oven, lay reserved foil over chicken, then weight with second pan. Cook 10 minutes.",
            "Remove pan from oven and turn chicken over; cook second side in residual heat 1 minute. Squeeze juice from cooked limes into pan; transfer chicken and pan juices to a plate and serve with remaining lime halves."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a3002b6ff2e7d346fdd7cfd/6:4/w_274%2Ch_169/12-minute-saucy-chicken-breasts-with-lime-recipe-BA-121217.jpg",
        "color": 5779031
    }
}