{
    "recipe": {
        "title": "3-Ingredient Flaky Flatbread ",
        "ingredients": [
            "2 cups plus 1 tablespoon all-purpose flour",
            "1 teaspoon kosher salt",
            "1/2 teaspoon baking powder",
            "Olive oil (for greasing)",
            "1 cup (2 sticks) unsalted butter, softened, divided"
        ],
        "instructions": [
            "Whisk flour, salt, and baking powder in a large bowl. Make a well in the center and slowly add 2/3 cup water, mixing with your hands or a wooden spoon, until a shaggy dough forms. Knead dough in bowl until smooth and elastic, about 4 minutes. Transfer dough to a clean work surface. Wipe out bowl and grease lightly with oil. Return dough to bowl, cover with a kitchen towel, and let rest 30 minutes.",
            "Turn out dough onto a clean work surface. Using a bench scraper or large knife, cut into 6 equal pieces. Shape into balls, cover, and let rest 15 minutes more.",
            "Grease a large cookie sheet or the underside of a rimmed baking sheet with 1 Tbsp. butter. Line another rimmed baking sheet with parchment.",
            "Place 1 piece of dough on prepared cookie sheet. Pat down to a flat oval with your fingertips, then smear 2 Tbsp. butter over dough. Press and slide dough outward with your fingertips, stretching to a very thin oval, about 12x10\".",
            "Starting at 1 long end, roll dough over itself to create a long tube about 1\" wide; flatten slightly. Starting at 1 short end, roll into a coil like a jelly roll. Transfer to parchment-lined sheet; cover with a kitchen towel. Repeat with remaining dough. Freeze, covered, 15 minutes.",
            "Working one at a time, turn coil on its side and flatten to a disc with your palm. Using a rolling pin, roll into a rough oval about 8x4\". Transfer to freezer. Repeat with remaining coils and freeze until ready to use.",
            "Heat 1 Tbsp. butter in a griddle or large nonstick skillet over medium-high. Add 2 pieces of dough, reduce heat to medium, and cook flatbread until bottom is golden brown with large bubbles forming underneath, about 3 minutes. Flip and continue to cook until second side is golden brown, about 1 minute more. Repeat with remaining dough, adding 1 Tbsp. butter before each batch."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5695440fdc18ea6c22c9ba64/6:4/w_274%2Ch_169/EP_01112016_3ingredient_flakeybread.jpg"
    }
}