{
    "recipe": {
        "title": "5-Minute Protein Truffles ",
        "ingredients": [
            "1/2 cup natural, unsweetened nut or seed butter (e.g., peanut, cashew, sunflower, or tahini)",
            "3 tablespoons honey, agave nectar, or pure maple syrup",
            "1/8 teaspoon fine sea salt",
            "2/3 cup lightly packed all-natural, sweetened vanilla whey protein powder",
            "Miniature semisweet chocolate chips or cacao nibs",
            "Unsweetened, natural cocoa powder",
            "Unsweetened flake or shredded coconut, plain or toasted",
            "Finely chopped toasted or raw nuts (e.g., almonds, walnuts, pistachios, hazelnuts)",
            "Toasted or raw seeds, finely chopped if needed (e.g., sesame, chia, pepitas, hemp hearts, sunflower)",
            "Finely chopped dried fruit (e.g., cherries, raisins, apricots, blueberries)",
            "Matcha powder",
            "Quick-cooking rolled oats"
        ],
        "instructions": [
            "1. Mix the nut or seed butter, honey, and salt in a medium bowl until blended. Add the protein powder, stirring until completely combined (mixture will be firm).",
            "2. Protein powders vary in terms of their dryness. Hence if the mixture seems too wet, add a bit more protein powder, or some ground oats or flaxseed meal, until the mixture comes together as a dough. If the mixture seems too dry, add some milk (nondairy or dairy) or water, one tablespoon at a time, until the mixture comes together as a dough.",
            "3. Scoop about 1 1/2 tablespoons of the mixture into your hands and shape into 1-inch balls.",
            "4. If desired, place one or more of the suggested coatings in small shallow dishes. Roll each ball in the coating, gently pressing to adhere. Place the balls in an airtight container and store in the refrigerator."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad505719925f464b3b484d/6:4/w_274%2Ch_169/51200210_hires_1x1.jpg",
        "color": 9048117
    }
}