{
    "recipe": {
        "title": "Abiquiu Smoked Chicken Sausages in Cornhusks ",
        "ingredients": [
            "2 teaspoons sea salt",
            "1/2 teaspoon New Mexico red chile powder, such as Rancho de Chimayo or your favorite brand",
            "1/4 teaspoon New Mexico green chile powder, such as Rancho de Chimayo or your favorite brand",
            "1 tablespoon freshly ground black pepper",
            "3 pounds ground chicken, turkey, pork, or beef",
            "1/3 cup cream-style corn",
            "2 tablespoons chopped sweet onion",
            "2 large cloves garlic, minced",
            "1/4 cup fire-roasted Hatch chile peppers, mild or hot",
            "2 tablespoons New Mexico honey",
            "16 dry cornhusks, soaked in warm water for 20 minutes",
            "16 (5-inch-long) pieces of twine",
            "Pico de gallo or salsa, for serving",
            "8-inch soft corn or flour tortillas, for serving"
        ],
        "instructions": [
            "Mix the sea salt, chile powders, and black pepper together in a large bowl. Add the ground chicken, corn, onion, garlic, Hatch peppers, and honey and combine with your hands until the meat is evenly seasoned. Remove the cornhusks from the water and place them on a cotton towel to absorb excess water. Heat your grill or smoker to 250°F. Form a sausage cylinder with your hands, using about 6 ounces of the sausage mixture. Set the sausage aside on a plate and repeat until you have 8 sausages. Place each sausage on a wet cornhusk, top with a second cornhusk, wrap the cornhusks around the sausage, and tie each end with twine. Smoke for 1 1/2 to 2 hours, or until done. Serve with homemade pico de gallo or your favorite salsa and a soft corn or flour tortilla. You can eat them as a wrap or tostada style with a fork.",
            "Mix the sea salt, chile powders, and black pepper together in a large bowl. Add the ground chicken, corn, onion, garlic, Hatch peppers, and honey and combine with your hands until the meat is evenly seasoned.",
            "Remove the cornhusks from the water and place them on a cotton towel to absorb excess water.",
            "Heat your grill or smoker to 250°F.",
            "Form a sausage cylinder with your hands, using about 6 ounces of the sausage mixture. Set the sausage aside on a plate and repeat until you have 8 sausages. Place each sausage on a wet cornhusk, top with a second cornhusk, wrap the cornhusks around the sausage, and tie each end with twine.",
            "Smoke for 1 1/2 to 2 hours, or until done.",
            "Serve with homemade pico de gallo or your favorite salsa and a soft corn or flour tortilla. You can eat them as a wrap or tostada style with a fork."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55fc0b0acb84959337fd44e9/6:4/w_274%2Ch_169/51166420_abiquiu-smoked-chicken-sausages.jpg"
    }
}