{
    "recipe": {
        "title": "All Green Salad with Citrus Vinaigrette ",
        "ingredients": [
            "2 tablespoons finely chopped shallot",
            "2 tablespoons red wine vinegar",
            "1/2 teaspoon finely grated lemon zest, plus 1 tablespoon fresh lemon juice",
            "1 tablespoon fresh orange juice",
            "2 teaspoons honey",
            "1/3 cup extra-virgin olive oil",
            "Kosher salt and freshly ground pepper",
            "Kosher salt",
            "2 bunches asparagus (about 1 1/2 pounds), ends trimmed and cut on a diagonal into 1-inch pieces",
            "1 romaine heart, roughly chopped",
            "1 English hothouse cucumber, trimmed, halved lengthwise, and thinly sliced",
            "1 ripe avocado, cut into 1/2-inch cubes",
            "15 basil leaves, torn",
            "1/3 cup torn fresh dill fronds",
            "Freshly ground black pepper"
        ],
        "instructions": [
            "Whisk shallot, vinegar, lemon zest, lemon juice, orange juice, and honey in a medium bowl until combined. Add oil in a steady stream, whisking constantly, until combined. Season with salt and pepper; set aside.",
            "For the salad: Bring a large pot of salted water to a boil; prepare a large bowl of ice water and a rimmed baking sheet lined with paper towels. Add asparagus to the boiling water and cook until crisp tender, 1-2 minutes. Remove with a slotted spoon or spider and immediately plunge into the ice water until chilled, then use slotted spoon to transfer asparagus to baking sheet to drain. In a large bowl, combine romaine, cucumber, avocado, basil, dill, and blanched asparagus. Drizzle with desired amount of dressing, season with salt and pepper, and toss gently to combine. Serve salad with remaining dressing on the side.",
            "Bring a large pot of salted water to a boil; prepare a large bowl of ice water and a rimmed baking sheet lined with paper towels. Add asparagus to the boiling water and cook until crisp tender, 1-2 minutes. Remove with a slotted spoon or spider and immediately plunge into the ice water until chilled, then use slotted spoon to transfer asparagus to baking sheet to drain.",
            "In a large bowl, combine romaine, cucumber, avocado, basil, dill, and blanched asparagus. Drizzle with desired amount of dressing, season with salt and pepper, and toss gently to combine. Serve salad with remaining dressing on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5506fb4ebfe86f110bb54072/6:4/w_274%2Ch_169/EP-03132015-passover-salad-6x4.jpg",
        "color": 5909513
    }
}