{
    "recipe": {
        "title": "Almond-Crust Raspberry Cheesecake ",
        "ingredients": [
            "1 pint raspberries",
            "1 tablespoon granulated sugar",
            "Vegetable oil cooking spray",
            "2 cups slivered almonds",
            "1/4 cup packed light-brown sugar",
            "2 tablespoons unsalted butter, melted",
            "Parchment paper",
            "20 oz lowfat cream cheese, at room temperature",
            "3/4 cup granulated sugar",
            "3/4 cup lowfat sour cream",
            "1 teaspoon pure vanilla extract",
            "4 large eggs"
        ],
        "instructions": [
            "Heat oven to 325°. Lightly coat an 8\" springform pan with cooking spray. Line bottom of pan with a round of parchment paper and wrap the outside with foil. In a small saucepan, simmer raspberries, granulated sugar and 2 tablespoons water over medium heat; cook until sauce thickens, 10 minutes. Set aside. In a food processor, pulse almonds until very finely ground. Add brown sugar,butter and a pinch of salt; pulse briefly to combine. Transfer to prepared pan and press firmly into bottom to form an even crust. Add cream cheese, granulated sugar, sour cream and vanilla to food processor; puree until smooth. Add eggs 1 at a time, blending after each addition. Pour filling onto crust. Spoon raspberry sauce on top and swirl using the tip of a knife, wiping it clean occasionally. Place springform pan in a 9\" x 13\" baking pan. Add warm water to come 1 inch up side of springform pan. Bake until cheesecake center jiggles slightly, 50 to 60 minutes. Let stand at room temperature until cool enough to touch. Remove springform pan from water, cover cake with foil and refrigerate at least 4 hours or overnight. Run a table knife between edge of cheesecake and springform pan before gently removing side of pan.",
            "Heat oven to 325°. Lightly coat an 8\" springform pan with cooking spray. Line bottom of pan with a round of parchment paper and wrap the outside with foil. In a small saucepan, simmer raspberries, granulated sugar and 2 tablespoons water over medium heat; cook until sauce thickens, 10 minutes. Set aside.",
            "In a food processor, pulse almonds until very finely ground. Add brown sugar,butter and a pinch of salt; pulse briefly to combine. Transfer to prepared pan and press firmly into bottom to form an even crust. Add cream cheese, granulated sugar, sour cream and vanilla to food processor; puree until smooth. Add eggs 1 at a time, blending after each addition. Pour filling onto crust. Spoon raspberry sauce on top and swirl using the tip of a knife, wiping it clean occasionally.",
            "Place springform pan in a 9\" x 13\" baking pan. Add warm water to come 1 inch up side of springform pan. Bake until cheesecake center jiggles slightly, 50 to 60 minutes. Let stand at room temperature until cool enough to touch. Remove springform pan from water, cover cake with foil and refrigerate at least 4 hours or overnight. Run a table knife between edge of cheesecake and springform pan before gently removing side of pan."
        ],
        "picture_link": "https://assets.epicurious.com/photos/555a15a0100d9bda6d81eefa/6:4/w_274%2Ch_169/51235380_almond-crust-raspberry-cheesecake_1x1.jpg"
    }
}