{
    "recipe": {
        "title": "Almond Cakes ",
        "ingredients": [
            "2 tablespoons (30 g) unsalted butter, melted, for buttering 21 financier molds",
            "1 cup (140 g) finely ground almonds",
            "1 2/3 cups (210 g) confectioners sugar",
            "1/2 cup (70g) unbleached all-purpose flour",
            "Pinch of salt",
            "3/4 cup (185 g) egg whites (5 to 6)",
            "3/4 cup (6 ounces; 185 g) unsalted butter, melted and cooled"
        ],
        "instructions": [
            "Preheat the oven to 450°F(230°C).",
            "With a pastry brush, use the 2 tablespoons melted butter to thoroughly butter the financier molds. Arrange them side by side, but not touching, on a baking sheet. Place the baking sheet with the buttered molds in the freezer to resolidify the butter and make the financiers easier to unmold.",
            "In a large bowl, combine the almonds, sugar, flour, and salt. Mix to blend. Add the egg whites and mix until thoroughly blended. Add the 3/4 cup butter and mix until thoroughly blended. The mixture will be fairly thin and pourable.",
            "Spoon the batter into the molds, filling them almost to the rim. Place the baking sheet in the center of the oven. Bake until the financiers just being to rise, about 7 minutes. Reduce the heat to 400°F(205°C). Bake until the financiers are a light, delicate brown and begin to firm up, about another 7 minutes. Turn off the oven heat and let the financiers rest in the oven until firm, about another 7 minutes.",
            "Remove the baking sheet from the oven and let the financiers cool in the molds for 10 minutes. Unmold. (Note: Wash molds immediately with a stiff brush in hot water without detergent so that they retain their seasoning.) The financiers may be stored in an airtight container for several days."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57cedb1b3c3d8c346d0ada3c/6:4/w_274%2Ch_169/almond-cakes.jpg",
        "color": 14629950
    }
}