{
    "recipe": {
        "title": "Almond-Pistachio Nougatine ",
        "ingredients": [
            "3/4 cup sugar",
            "1/3 cup light corn syrup",
            "3/4 cup plus 2 tbsp sliced almonds",
            "1/3 cup chopped pistachios",
            "2 tbsp unsalted butter"
        ],
        "instructions": [
            "Making the Caramel Put the sugar and corn syrup in a medium saucepan and make a light caramel: Place saucepan over medium heat. The sugar will melt and start to caramelize. When the mixture is pale brown, add the almonds, pistachios, and butter. Mix well to coat the nuts in the caramel and toast them lightly.",
            "Put the sugar and corn syrup in a medium saucepan and make a light caramel: Place saucepan over medium heat. The sugar will melt and start to caramelize. When the mixture is pale brown, add the almonds, pistachios, and butter. Mix well to coat the nuts in the caramel and toast them lightly.",
            "Making the Nougatine Working quickly, turn the mixture out onto a sheet of parchment paper or onto a silicone mat. Place a second sheet or mat on top, then roll out the nougatine very thinly with a rolling pin. To finish, cut out the desired shapes using a knife or a pair of scissors. If the nougatine hardens too much to cut, reheat it in a 275°F oven for 4 to 5 minutes to soften it a little. (Store in an airtight container, away from moisture, for up to 1 month.)",
            "Working quickly, turn the mixture out onto a sheet of parchment paper or onto a silicone mat. Place a second sheet or mat on top, then roll out the nougatine very thinly with a rolling pin. To finish, cut out the desired shapes using a knife or a pair of scissors. If the nougatine hardens too much to cut, reheat it in a 275°F oven for 4 to 5 minutes to soften it a little. (Store in an airtight container, away from moisture, for up to 1 month.)"
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac920e19925f464b3abe83/6:4/w_274%2Ch_169/51228610_almond-pistachio-nougatine_1x1.jpg"
    }
}