{
    "recipe": {
        "title": "Aloo Gobhi Stuffing ",
        "ingredients": [
            "1 stick (1/2 cup) unsalted butter plus additional for buttering pan",
            "1 (24-inch) baguette, cut into 3/4-inch cubes (8 cups)",
            "3 medium onions, coarsely chopped",
            "3 medium carrots, cut into 1/4-inch dice",
            "3 celery ribs, cut into 1/4-inch dice",
            "1 1/2 lb russet (baking) potatoes, peeled and cut into 1/2-inch dice",
            "1 (2-lb) head cauliflower, trimmed and cut into 1/2-inch-wide florets and stem pieces",
            "2 1/2 teaspoons curry powder (preferably Madras)",
            "1 1/2 teaspoons sea salt",
            "1 teaspoon black pepper",
            "1 teaspoon cumin seeds",
            "1/4 teaspoon cayenne",
            "1 1/2 cups reduced-sodium chicken broth (12 fl oz)",
            "1 1/2 cups unsalted roasted cashews (7 oz)"
        ],
        "instructions": [
            "Put oven racks in upper and lower thirds of oven and preheat oven to 350°F. Butter a shallow 3-quart baking dish (13 by 9 inches). Spread bread cubes in 1 layer in 2 large shallow baking pans and bake, switching position of pans halfway through baking, until dry, 20 to 25 minutes. Remove from oven. Increase oven temperature to 450°F. Cut 1 stick butter into pieces, then heat in a deep 12-inch nonstick skillet over moderate heat until foam subsides. Add onions, carrots, celery, and potatoes and cook, stirring occasionally, until vegetables are softened, about 8 minutes. Add cauliflower and cook, stirring, until cauliflower is crisp-tender, about 8 minutes.Stir in curry powder, salt, pepper, cumin, and cayenne and cook, stirring, 2 minutes. Transfer to a large bowl and toss with bread cubes. Add broth and 1 cup cashews, then toss to coat. Spread stuffing in baking dish and cover tightly with buttered foil (buttered side down). Bake in upper third of oven until heated through, about 20 minutes. Remove foil and sprinkle remaining 1/2 cup cashews over top, then bake until top is browned, about 10 minutes more.",
            "Put oven racks in upper and lower thirds of oven and preheat oven to 350°F. Butter a shallow 3-quart baking dish (13 by 9 inches).",
            "Spread bread cubes in 1 layer in 2 large shallow baking pans and bake, switching position of pans halfway through baking, until dry, 20 to 25 minutes. Remove from oven.",
            "Increase oven temperature to 450°F.",
            "Cut 1 stick butter into pieces, then heat in a deep 12-inch nonstick skillet over moderate heat until foam subsides. Add onions, carrots, celery, and potatoes and cook, stirring occasionally, until vegetables are softened, about 8 minutes. Add cauliflower and cook, stirring, until cauliflower is crisp-tender, about 8 minutes.Stir in curry powder, salt, pepper, cumin, and cayenne and cook, stirring, 2 minutes. Transfer to a large bowl and toss with bread cubes. Add broth and 1 cup cashews, then toss to coat.",
            "Spread stuffing in baking dish and cover tightly with buttered foil (buttered side down). Bake in upper third of oven until heated through, about 20 minutes. Remove foil and sprinkle remaining 1/2 cup cashews over top, then bake until top is browned, about 10 minutes more."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df2baf3a00aeb2f1d5dd4/6:4/w_274%2Ch_169/231000.jpg"
    }
}