{
    "recipe": {
        "title": "Alton's T-Day Gravy ",
        "ingredients": [
            "3 1/4 to 3 1/2 pounds chicken wings or turkey wings",
            "2 tablespoons vegetable oil",
            "11 cups water, divided",
            "1 large onion, coarsely chopped",
            "1 large celery stalk, coarsely chopped",
            "1 large carrot, coarsely chopped",
            "2 fresh parsley sprigs",
            "2 fresh thyme sprigs",
            "1 small bay leaf",
            "5 tablespoons all purpose flour",
            "Roasting pan with pan juices reserved from turkey",
            "2 cups dry white wine",
            "1 tablespoon chopped fresh parsley",
            "1 teaspoon chopped fresh thyme",
            "1 teaspoon chopped fresh sage"
        ],
        "instructions": [
            "Preheat oven to 450°F. Toss wings and oil in large bowl to coat; transfer to large roasting pan. Roast 45 minutes. Turn wings over; roast until deep golden brown, about 20 minutes. Add 1 cup water to pan and continue roasting wings 10 minutes longer.",
            "Transfer wings with liquid to large pot, scraping in any browned bits from roasting pan. Add remaining 10 cups water, onion, celery, carrot, and herbs to pot. Bring to boil. Reduce heat to medium-low and simmer uncovered until reduced to 5 cups stock, about 3 1/2 hours. Strain through sieve set over large glass bowl. Press on solids in sieve to release as much stock as possible. Cool 30 minutes, then refrigerate overnight. (Stock can be made 3 days ahead. Cover and keep refrigerated.)",
            "Transfer fat \"cap\" from surface of chilled stock to small bowl. Dry fat with paper towels. Using hands, break fat into pieces. Measure 5 tablespoons fat and transfer to another bowl; add flour and stir to form smooth paste. Refrigerate schmaltz manié until cold. Roll into 1/2-inch balls. (Can be made 2 days ahead. Cover schmaltz manié and stock separately and refrigerate.)",
            "For gravy: Pour pan juices from turkey roasting pan into fat separator or large measuring cup; spoon off fat if using measuring cup. Place roasting pan over 2 burners. Add wine and boil 1 minute, scraping up browned bits. Pour wine with bits into heavy large saucepan. Pourin pan juices from fat separator, leaving fat behind, or add degreased pan juices from measuring cup. Add herbs and stock to same saucepan. Bring to boil. Whisk in schmaltz manié balls 1 at a time (or paste by teaspoonfuls), cooking gravy briefly after each few additions to judge consistency and boiling gravy until reduced to 4 cups and thick enough to coat spoon, whisking often, about 6 minutes. Season gravy to taste with salt and pepper. Serve gravy with turkey.",
            "Pour pan juices from turkey roasting pan into fat separator or large measuring cup; spoon off fat if using measuring cup. Place roasting pan over 2 burners. Add wine and boil 1 minute, scraping up browned bits. Pour wine with bits into heavy large saucepan. Pourin pan juices from fat separator, leaving fat behind, or add degreased pan juices from measuring cup. Add herbs and stock to same saucepan. Bring to boil. Whisk in schmaltz manié balls 1 at a time (or paste by teaspoonfuls), cooking gravy briefly after each few additions to judge consistency and boiling gravy until reduced to 4 cups and thick enough to coat spoon, whisking often, about 6 minutes. Season gravy to taste with salt and pepper.",
            "Serve gravy with turkey."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de5f87b55306961bfd93c/6:4/w_274%2Ch_169/233170.jpg",
        "color": 5725917
    }
}