{
    "recipe": {
        "title": "Amaranth \"Risotto\" With Mushrooms ",
        "ingredients": [
            "1 ounce dried porcini mushrooms (about 1 cup)",
            "2 cups boiling water plus 2 1/2 cups cold water",
            "6 tablespoons unsalted butter",
            "2 tablespoons olive oil",
            "1 large yellow onion, finely chopped (about 1 1/2 cups)",
            "2 cups amaranth",
            "1 1/2 teaspoons salt, or to taste",
            "3 garlic cloves, finely chopped",
            "1 pound sliced mushrooms (white, baby bella, cremini, or a mixture)",
            "1 tablespoon soy sauce",
            "3 tablespoons sherry (any type from dry to cream)",
            "Freshly ground black pepper to taste",
            "1 teaspoon chopped fresh thyme, or to taste"
        ],
        "instructions": [
            "Put the dried porcini mushrooms in a heatproof bowl and pour the 2 cups of boiling water over them. Let the porcini mushrooms soak until tender, 10 to 15 minutes, then lift them from the liquid and squeeze any excess liquid into the bowl. Finely chop the porcini mushrooms. Reserve the porcini mushrooms and the liquid separately. In a heavy 4-quart pot over moderately low heat, warm 1 tablespoon butter and 1 tablespoon oil. Add the onion and cook, covered and stirring occasionally, until tender and lightly golden, 10 to 15 minutes. Add the amaranth and stir to coat it with the butter and oil. Slowly add the reserved porcini mushroom soaking liquid, leaving any grit at the bottom of the bowl. Add the 2 1/2 cups cold water, cover the pot, and bring the mixture to a boil, whisking occasionally. Using a heatproof rubber spatula, push any seeds clinging to the side of the pot into the liquid, then reduce the heat to low and continue to simmer, covered, until the liquid is absorbed, 20 to 25 minutes. Stir in 1 teaspoon salt, or to taste. Remove the pot from the heat and let the amaranth stand, covered, 5 to 10 minutes. While the amaranth is simmering, in a 12-inch heavy skillet over moderate heat, melt 1 tablespoon of the remaining butter with the remaining 1 tablespoon oil. Add the garlic and cook, stirring, for 30 seconds. Add the reserved porcini mushrooms, along with the fresh sliced mushrooms, the remaining 1/2 teaspoon salt, and the soy sauce and sauté until the mushrooms are softened and juicy, 8 to 10 minutes. Add the sherry and continue to sauté until the mushrooms are tender, about 2 minutes. Season with salt and freshly ground black pepper. Remove the pan from the heat then stir in the thyme. Cut the remaining 4 tablespoons butter into small pieces, add it to the pan, and stir until melted. Spoon the amaranth onto plates or into soup bowls and top with the mushroom mixture.",
            "Put the dried porcini mushrooms in a heatproof bowl and pour the 2 cups of boiling water over them. Let the porcini mushrooms soak until tender, 10 to 15 minutes, then lift them from the liquid and squeeze any excess liquid into the bowl. Finely chop the porcini mushrooms. Reserve the porcini mushrooms and the liquid separately.",
            "In a heavy 4-quart pot over moderately low heat, warm 1 tablespoon butter and 1 tablespoon oil. Add the onion and cook, covered and stirring occasionally, until tender and lightly golden, 10 to 15 minutes.",
            "Add the amaranth and stir to coat it with the butter and oil. Slowly add the reserved porcini mushroom soaking liquid, leaving any grit at the bottom of the bowl. Add the 2 1/2 cups cold water, cover the pot, and bring the mixture to a boil, whisking occasionally. Using a heatproof rubber spatula, push any seeds clinging to the side of the pot into the liquid, then reduce the heat to low and continue to simmer, covered, until the liquid is absorbed, 20 to 25 minutes. Stir in 1 teaspoon salt, or to taste. Remove the pot from the heat and let the amaranth stand, covered, 5 to 10 minutes.",
            "While the amaranth is simmering, in a 12-inch heavy skillet over moderate heat, melt 1 tablespoon of the remaining butter with the remaining 1 tablespoon oil. Add the garlic and cook, stirring, for 30 seconds. Add the reserved porcini mushrooms, along with the fresh sliced mushrooms, the remaining 1/2 teaspoon salt, and the soy sauce and sauté until the mushrooms are softened and juicy, 8 to 10 minutes. Add the sherry and continue to sauté until the mushrooms are tender, about 2 minutes. Season with salt and freshly ground black pepper.",
            "Remove the pan from the heat then stir in the thyme. Cut the remaining 4 tablespoons butter into small pieces, add it to the pan, and stir until melted. Spoon the amaranth onto plates or into soup bowls and top with the mushroom mixture."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54aca96419925f464b3ae6f8/6:4/w_274%2Ch_169/51216010_amaranth-risotto_1x1.jpg"
    }
}