{
    "recipe": {
        "title": "Amatriciana (Guanciale, Tomato, and Pecorino Romano) ",
        "ingredients": [
            "2 1/2 ounces (70 grams) guanciale, cut into thin strips",
            "2–3 tablespoons extra virgin olive oil",
            "1 small onion (any kind), chopped (optional but recommended)",
            "1 pound (450 grams) red, ripe sauce tomatoes, broken into pieces, or canned Italian peeled tomatoes, drained",
            "1 small piece dried chile",
            "salt",
            "1 pound (450 grams) pasta (see note below)",
            "7 rounded tablespoons (70 grams) grated pecorino (see headnote)"
        ],
        "instructions": [
            "Put the guanciale and oil in a saucepan. Turn the heat to medium and heat gently so the guanciale renders some fat and starts to brown. Taste a piece to assess how salty it is. Then, when it just begins to become crisp, add the chopped onion (if using) and sauté gently until transparent. Add the tomatoes and chile, then taste for salt (how much you need will depend on the guanciale). Finish cooking the sauce, covered, over low heat. You'll know it's done when the liquid has thickened somewhat and the fat shows on the surface, about 20 minutes. Make-ahead note: This much can be done earlier in the day, but this sauce is not customarily made in advance or kept, except casually as leftovers for the next day. Bring 5 quarts (5 liters) of water to a boil in an 8-quart (8-liter) pot over high heat. Add 3 tablespoons kosher salt, then add the pasta and cook, stirring occasionally, until al dente. Warm a serving bowl or platter in a low oven. If the oven is not practical, warm the bowl just before use with hot water, even a ladleful of the pasta cooking water. Drain the pasta and put it in the warmed serving bowl. Toss it first with the grated cheese, then with the sauce. Serve immediately.",
            "Put the guanciale and oil in a saucepan. Turn the heat to medium and heat gently so the guanciale renders some fat and starts to brown. Taste a piece to assess how salty it is. Then, when it just begins to become crisp, add the chopped onion (if using) and sauté gently until transparent. Add the tomatoes and chile, then taste for salt (how much you need will depend on the guanciale).",
            "Finish cooking the sauce, covered, over low heat. You'll know it's done when the liquid has thickened somewhat and the fat shows on the surface, about 20 minutes.",
            "Make-ahead note: This much can be done earlier in the day, but this sauce is not customarily made in advance or kept, except casually as leftovers for the next day.",
            "Bring 5 quarts (5 liters) of water to a boil in an 8-quart (8-liter) pot over high heat. Add 3 tablespoons kosher salt, then add the pasta and cook, stirring occasionally, until al dente.",
            "Warm a serving bowl or platter in a low oven. If the oven is not practical, warm the bowl just before use with hot water, even a ladleful of the pasta cooking water.",
            "Drain the pasta and put it in the warmed serving bowl. Toss it first with the grated cheese, then with the sauce. Serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/555cf3d4100d9bda6d82176e/6:4/w_274%2Ch_169/51221420_carbonara-em-guanciale-egg_6x4.jpg"
    }
}