{
    "recipe": {
        "title": "Andouille Cornbread Stuffing ",
        "ingredients": [
            "1 tablespoon olive oil",
            "1 pound andouille sausage links, quartered lengthwise, then cut crosswise into 1/4-inch-thick pieces (about 3 cups)",
            "8 cups chopped onions (about 2 3/4 pounds), divided",
            "5 cups chopped celery (about 10 stalks with leaves), divided",
            "3 cups mixed chopped red, yellow, and/or green bell peppers, divided",
            "1 teaspoon dried thyme",
            "1/4 teaspoon cayenne pepper",
            "2 large eggs",
            "1/2 cup (or more) low-salt chicken broth",
            "Green Onion-Jalapeño Cornbread",
            "1/4 cup (1/2 stick) butter, melted"
        ],
        "instructions": [
            "Heat oil in heavy large pot over medium-high heat. Add sausage and sauté until browned, about 6 minutes. Add 6 cups onions, 4 cups celery, and 2 cups bell peppers; sauté until vegetables are brown, about 20 minutes. Add remaining onions, celery, and bell peppers, then thyme and cayenne; sauté until vegetables begin to soften, about 5 minutes. Season with salt and pepper. (Can be made 1 day ahead. Cool slightly. Cover and chill.) Preheat oven to 350°F. Butter 15x10x2-inch glass baking dish. Whisk eggs and 1/2 cup broth in medium bowl. Crumble cornbread into very large bowl. Add vegetable and egg-broth mixtures; toss. Mix in more broth by 1/4 cupfuls if dressing is dry. Transfer dressing to prepared dish. Drizzle with butter. Bake dressing uncovered until golden brown and slightly crisp on top, about 45 minutes.",
            "Heat oil in heavy large pot over medium-high heat. Add sausage and sauté until browned, about 6 minutes. Add 6 cups onions, 4 cups celery, and 2 cups bell peppers; sauté until vegetables are brown, about 20 minutes. Add remaining onions, celery, and bell peppers, then thyme and cayenne; sauté until vegetables begin to soften, about 5 minutes. Season with salt and pepper. (Can be made 1 day ahead. Cool slightly. Cover and chill.)",
            "Preheat oven to 350°F. Butter 15x10x2-inch glass baking dish. Whisk eggs and 1/2 cup broth in medium bowl. Crumble cornbread into very large bowl. Add vegetable and egg-broth mixtures; toss. Mix in more broth by 1/4 cupfuls if dressing is dry. Transfer dressing to prepared dish. Drizzle with butter.",
            "Bake dressing uncovered until golden brown and slightly crisp on top, about 45 minutes."
        ],
        "picture_link": null
    }
}