{
    "recipe": {
        "title": "Andouille and Beef Burgers with Spicy Mayo and Caramelized Onions ",
        "ingredients": [
            "3/4 cup mayonnaise",
            "1 tablespoon fresh lemon juice",
            "1 teaspoon Cajun or Creole seasoning blend",
            "1/4 teaspoon hot pepper sauce",
            "1/2 pound andouille sausage, cut into scant 1/4-inch cubes",
            "3/4 cup pecans, toasted, chopped",
            "1 teaspoon salt",
            "1/4 teaspoon ground black pepper",
            "1 1/2 pounds ground beef chuck or ground beef (20 percent fat)",
            "1 1/2 pounds onions, thinly sliced",
            "2 tablespoons olive oil plus more for brushing grill rack",
            "3 garlic cloves, minced",
            "1 tablespoon golden brown sugar",
            "6 large hamburger buns, split",
            "8 ounces crumbled blue cheese",
            "12 pickled okra pods, halved lengthwise*",
            "3 cups watercress tops"
        ],
        "instructions": [
            "Mix all ingredients in small bowl. Cover and chill.",
            "Do ahead: Can be made 2 days ahead. Keep chilled.",
            "For burgers: Toss first 4 ingredients in large bowl. Add beef; blend gently. Shape mixture into six 1/2-inch-thick patties. Transfer patties to small baking sheet. Do ahead: Can be made 1 day ahead. Cover and chill.",
            "Toss first 4 ingredients in large bowl. Add beef; blend gently. Shape mixture into six 1/2-inch-thick patties. Transfer patties to small baking sheet.",
            "Do ahead: Can be made 1 day ahead. Cover and chill.",
            "For onions: Prepare barbecue (medium-high heat). Toss onions and next 3 ingredients in large skillet. Place skillet on grill; cook until onions are golden, stirring often, about 25 minutes. Remove from grill; season with salt and pepper. Brush grill rack with olive oil. Grill buns, cut side down, until golden, about 2 minutes. Transfer buns to work surface. Grill burgers until brown on bottom, about 3 minutes. Turn over; sprinkle with cheese. Grill until burgers are cooked to desired doneness, about 3 minutes for medium. Place some onions, then burger, on each bun bottom. Top each with okra and watercress. Spread mayonnaise on cut side of bun tops; place on burgers. Serve with remaining mayonnaise.",
            "Prepare barbecue (medium-high heat). Toss onions and next 3 ingredients in large skillet. Place skillet on grill; cook until onions are golden, stirring often, about 25 minutes. Remove from grill; season with salt and pepper.",
            "Brush grill rack with olive oil. Grill buns, cut side down, until golden, about 2 minutes. Transfer buns to work surface. Grill burgers until brown on bottom, about 3 minutes. Turn over; sprinkle with cheese. Grill until burgers are cooked to desired doneness, about 3 minutes for medium. Place some onions, then burger, on each bun bottom. Top each with okra and watercress. Spread mayonnaise on cut side of bun tops; place on burgers. Serve with remaining mayonnaise.",
            "*Shopping tip: Look for pickled okra where the pickles and relishes are displayed.",
            "*Shopping tip: Look for pickled okra where the pickles and relishes are displayed."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd76ef3a00aeb2f1d27aa/6:4/w_274%2Ch_169/235323.jpg",
        "color": 11374172
    }
}