{
    "recipe": {
        "title": "Andouille Gougères ",
        "ingredients": [
            "1/2 cup unsalted butter",
            "1/2 tsp kosher salt plus more",
            "1 cup all-purpose flour",
            "5 eggs",
            "2 1/2 oz Gruyère, grated",
            "4 oz andouille sausage, chopped"
        ],
        "instructions": [
            "Preheat oven to 425° with racks in upper and lower thirds. Line 2 baking sheets with parchment paper.",
            "In a large saucepan, combine 1 cup water, butter, and 1/2 tsp salt. Bring to a boil over medium-high heat. When butter has melted, add flour all at once, stirring vigorously with a wooden spoon. Reduce heat to medium; keep stirring until mixture has formed a smooth, thick paste and pulls away from sides of pan, about 3 minutes. Transfer to bowl of a stand mixer fitted with paddle attachment or to a large heatproof bowl.",
            "If using a stand mixer, add 4 eggs, 1 at a time, mixing on low speed until egg is incorporated and dough is smooth before adding the next egg.",
            "If mixing by hand, add 4 eggs, 1 at a time, stirring with a wooden spoon until egg is incorporated and dough is smooth before adding the next egg. The mixture should be very thick, smooth, and shiny. Stir in Gruyère and andouille.",
            "Use a tablespoon measure to drop dough into 1\" rounds about 1 1/2\" apart on prepared baking sheets. You should have about 24 gougères.",
            "In a small bowl, whisk remaining egg with a pinch of salt. Brush the top of each gougère with egg wash.",
            "Bake for 15 minutes. Reduce oven to 375°, rotate baking sheets, and continue baking until gougères are puffed and browned, about 15 minutes more. Serve warm or at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54aaf0076529d92b2c02fdf7/6:4/w_274%2Ch_169/51256900_andouille-gougeres_1x1.jpg",
        "color": 10290433
    }
}