{
    "recipe": {
        "title": "Anise-Spiced Squash Soup with Fennel Chips ",
        "ingredients": [
            "1 large fennel bulb (sometimes called anise; 1 pound), trimmed and bulb cut into 1/2-inch pieces",
            "3-pound butternut squash, peeled, seeded, and cut into 1/2-inch pieces",
            "1 medium onion, chopped",
            "1/4 teaspoon anise seeds",
            "2 tablespoons unsalted butter",
            "5 cups water",
            "1 cup water",
            "1/2 cup sugar",
            "2 tablespoons fresh lemon juice",
            "1 small fennel bulb (1/2 pound), trimmed",
            "Special equipment: Silpat or Exopat nonstick reusable baking-sheet liner*",
            "sour cream"
        ],
        "instructions": [
            "Cook fennel, squash, onion, and anise seeds in butter in a 6- to 8-quart pot over moderate heat, covered, stirring occasionally, 15 minutes. Add water and simmer, covered, until squash is very tender, 25 to 30 minutes.",
            "Purée soup in batches in a blender (use caution when blending hot liquids) and season with salt and pepper.",
            "Make fennel chips: Preheat oven to 225°F. Boil water and sugar in a small saucepan, stirring, until sugar is dissolved. Remove from heat and add lemon juice. Cut fennel bulb lengthwise into paper-thin slices using a mandoline or other manual slicer. Pour sugar mixture over fennel in a bowl and let stand 5 minutes. Put Silpat or Exopat pad on a baking sheet. Shake off excess liquid from fennel slices and arrange on pad in 1 layer (don't let slices touch). Bake in middle of oven 1 hour, or until dry and crisp. Working quickly, carefully peel chips off liner and transfer to a rack to cool. Top soup with chips.",
            "Preheat oven to 225°F.",
            "Boil water and sugar in a small saucepan, stirring, until sugar is dissolved. Remove from heat and add lemon juice. Cut fennel bulb lengthwise into paper-thin slices using a mandoline or other manual slicer. Pour sugar mixture over fennel in a bowl and let stand 5 minutes.",
            "Put Silpat or Exopat pad on a baking sheet. Shake off excess liquid from fennel slices and arrange on pad in 1 layer (don't let slices touch). Bake in middle of oven 1 hour, or until dry and crisp. Working quickly, carefully peel chips off liner and transfer to a rack to cool. Top soup with chips.",
            "*Available at bakeware shops and by mail order from Bridge Kitchenware, (800) 274-3435 or (212) 838-1901",
            "*Available at bakeware shops and by mail order from Bridge Kitchenware, (800) 274-3435 or (212) 838-1901"
        ],
        "picture_link": null,
        "color": 7999552
    }
}