{
    "recipe": {
        "title": "Apple Cobbler ",
        "ingredients": [
            "1/2 cup golden raisins",
            "1/2 cup Calvados or apple brandy",
            "3 1/2 pound Gala apples (7 to 8)",
            "1 1/2 tablespoons fresh lemon juice",
            "1/2 stick unsalted butter",
            "3/4 cup granulated sugar",
            "1 1/2 cups all-purpose flour",
            "2 teaspoons baking powder",
            "Rounded 1/4 teaspoon salt",
            "3/4 cup plus 1 tablespoon heavy cream, divided",
            "1 1/2 tablespoons turbinado sugar such as Sugar in the Raw for sprinkling",
            "Equipment: a well-seasoned 10-inch cast-iron skillet; a 2 1/4-inch round cookie cutter",
            "Accompaniment: heavy cream"
        ],
        "instructions": [
            "Simmer raisins and Calvados in a small saucepan over medium heat until liquid is reduced to 3 tablespoons, about 4 minutes. Remove from heat and let macerate, covered, 30 minutes. Meanwhile, preheat oven to 425°F with rack in middle. While raisins macerate, peel and core apples, then cut into 1-inch pieces. Toss with lemon juice. Melt butter in skillet and sprinkle granulated sugar evenly over it. Add apples along with raisins and Calvados (skillet will be full). Cook apples over medium-high heat, without stirring, until juices are deep golden and bubbling, 18 to 23 minutes (don't worry if juices color unevenly). Transfer skillet to oven and bake, uncovered, 20 minutes.",
            "Simmer raisins and Calvados in a small saucepan over medium heat until liquid is reduced to 3 tablespoons, about 4 minutes. Remove from heat and let macerate, covered, 30 minutes.",
            "Meanwhile, preheat oven to 425°F with rack in middle.",
            "While raisins macerate, peel and core apples, then cut into 1-inch pieces. Toss with lemon juice.",
            "Melt butter in skillet and sprinkle granulated sugar evenly over it. Add apples along with raisins and Calvados (skillet will be full). Cook apples over medium-high heat, without stirring, until juices are deep golden and bubbling, 18 to 23 minutes (don't worry if juices color unevenly). Transfer skillet to oven and bake, uncovered, 20 minutes.",
            "Make biscuit topping while apples bake: Stir together flour, baking powder, and salt, then add 3/4 cup cream and stir just until a dough forms. Gather dough into a ball and transfer to a lightly floured surface. Gently knead 6 times, then pat dough into an 8-inch round. Cut out as many rounds as possible with lightly floured cutter. Gather scraps and pat out, then cut out more rounds. (You will have about 12.)",
            "Stir together flour, baking powder, and salt, then add 3/4 cup cream and stir just until a dough forms. Gather dough into a ball and transfer to a lightly floured surface. Gently knead 6 times, then pat dough into an 8-inch round. Cut out as many rounds as possible with lightly floured cutter. Gather scraps and pat out, then cut out more rounds. (You will have about 12.)",
            "Assemble and bake cobbler: Arrange biscuits on apples about 1/2 inch apart and brush tops with remaining tablespoon cream. Sprinkle with turbinado sugar and bake until biscuits are puffed and golden, about 15 minutes. Cool in skillet 20 minutes before serving.",
            "Arrange biscuits on apples about 1/2 inch apart and brush tops with remaining tablespoon cream. Sprinkle with turbinado sugar and bake until biscuits are puffed and golden, about 15 minutes. Cool in skillet 20 minutes before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d77f0f9a841923089d54e/6:4/w_274%2Ch_169/241522_hires.jpg"
    }
}