{
    "recipe": {
        "title": "Apple Crostata with Crystallized Ginger ",
        "ingredients": [
            "1 1/2 cups all purpose flour",
            "1 1/2 tablespoons sugar",
            "1/2 teaspoon (scant) salt",
            "10 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
            "3 tablespoons (or more) ice water",
            "1 1/2 pounds medium-size Golden Delicious apples, peeled, halved, cored, cut into 1/8-inch-thick slices (about 5 1/2 cups)",
            "5 tablespoons sugar",
            "2 tablespoons (packed) minced crystallized ginger",
            "2 teaspoons fresh lemon juice",
            "2 tablespoons (1/4 stick) unsalted butter, cut into 1/2-inch cubes",
            "2 tablespoons (about) whole milk",
            "1/3 cup apricot preserves, warmed",
            "Vanilla ice cream or sweetened whipped cream"
        ],
        "instructions": [
            "Combine flour, sugar, and salt in processor; blend 5 seconds. Add butter; using on/off turns, cut in until mixture resembles coarse meal. Add 3 tablespoons ice water. Using on/off turns, blend until moist clumps form, adding more water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic; chill at least 1 hour and up to 1 day.",
            "For filling: Position rack in center of oven and preheat to 425°F. Combine apples, 3 tablespoons sugar, crystallized ginger, and lemon juice in large bowl; toss gently to blend.",
            "Position rack in center of oven and preheat to 425°F. Combine apples, 3 tablespoons sugar, crystallized ginger, and lemon juice in large bowl; toss gently to blend.",
            "Roll out dough on large sheet of parchment paper to 14-inch round. Transfer parchment with dough to large baking sheet. Arrange 3/4 of apple mixture in center of dough, mounding just slightly, forming 8-inch-diameter circle and leaving 3-inch plain border. Overlap remaining apple slices in concentric circles atop apple layer. Fold plain edge of crust over apples, leaving apples exposed in center. Gently fold and pinch dough edge to seal any cracks. Sprinkle apples with 1 tablespoon sugar, then dot apples with butter. Brush crust with milk and sprinkle with remaining 1 tablespoon sugar. Bake crostata until crust is golden brown and apples are tender, about 40 minutes. Remove from oven. Brush apples with warm apricot preserves. Cool on baking sheet 15 minutes. Slide long knife under crostata to loosen. (Can be made 4 hours ahead. Let stand on sheet at room temperature. Rewarm in 425°F oven 5 minutes before serving.) Serve warm with vanilla ice cream or sweetened whipped cream, as desired.",
            "Roll out dough on large sheet of parchment paper to 14-inch round. Transfer parchment with dough to large baking sheet. Arrange 3/4 of apple mixture in center of dough, mounding just slightly, forming 8-inch-diameter circle and leaving 3-inch plain border. Overlap remaining apple slices in concentric circles atop apple layer. Fold plain edge of crust over apples, leaving apples exposed in center. Gently fold and pinch dough edge to seal any cracks. Sprinkle apples with 1 tablespoon sugar, then dot apples with butter. Brush crust with milk and sprinkle with remaining 1 tablespoon sugar.",
            "Bake crostata until crust is golden brown and apples are tender, about 40 minutes. Remove from oven. Brush apples with warm apricot preserves. Cool on baking sheet 15 minutes. Slide long knife under crostata to loosen. (Can be made 4 hours ahead. Let stand on sheet at room temperature. Rewarm in 425°F oven 5 minutes before serving.) Serve warm with vanilla ice cream or sweetened whipped cream, as desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560e9d33f3a00aeb2f1d69c9/6:4/w_274%2Ch_169/107668.jpg",
        "color": 6599061
    }
}