{
    "recipe": {
        "title": "Apple Phyllo Strudel ",
        "ingredients": [
            "6 green apples, peeled, cored, and sliced (about 2 pounds apples)",
            "1/2 cup cried cranberries or dried cherries (about 2 1/2 ounces)",
            "1/2 cup packed brown sugar",
            "1 teaspoon cinnamon",
            "6 (1216-inch) sheets phyllo dough",
            "butter-flavored nonstick cooking spray, or a mixture of 1 teaspoon melted butter and 1 teaspoon almond oil",
            "1/2 cup amaretti crumbs or graham cracker crumbs",
            "12 ounces nonfat vanilla yogurt or frozen vanilla yogurt",
            "12 mint sprigs",
            "36 raspberries",
            "cinnamon cream"
        ],
        "instructions": [
            "1. Preheat the oven to 350 degrees. Combine the apples, dried cranberries, brown sugar and cinnamon in a saucepan and cook for about 10 minutes or until tender. Let stand for 10 minutes to cool. 2. Layer 2 sheets of the phyllo on a work surface and spray with nonstick cooking spray; sprinkle with cookie crumbs. Repeat the layers 2 times with the remaining sheets. Spread the apple mixture over the phyllo. Roll the phyllo from the 12-inch side to enclose the filling. 3. Place the roll on a baking sheet sprayed with nonstick cooking spray. Bake for 25 minutes. Cool for 10 minutes before slicing to serve. Arrange on serving plates. 4. Serve with vanilla yogurt or frozen vanilla yogurt and top with the mint and raspberries. You may also serve with cinnamon cream.",
            "1. Preheat the oven to 350 degrees. Combine the apples, dried cranberries, brown sugar and cinnamon in a saucepan and cook for about 10 minutes or until tender. Let stand for 10 minutes to cool.",
            "2. Layer 2 sheets of the phyllo on a work surface and spray with nonstick cooking spray; sprinkle with cookie crumbs. Repeat the layers 2 times with the remaining sheets. Spread the apple mixture over the phyllo. Roll the phyllo from the 12-inch side to enclose the filling.",
            "3. Place the roll on a baking sheet sprayed with nonstick cooking spray. Bake for 25 minutes. Cool for 10 minutes before slicing to serve. Arrange on serving plates.",
            "4. Serve with vanilla yogurt or frozen vanilla yogurt and top with the mint and raspberries. You may also serve with cinnamon cream."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd7917b55306961bfaa73/6:4/w_274%2Ch_169/235684.jpg"
    }
}