{
    "recipe": {
        "title": "Apple Brownies ",
        "ingredients": [
            "1 cup (145 g) all-purpose flour",
            "1 teaspoon ground cinnamon",
            "1/2 teaspoon baking powder",
            "1/2 teaspoon table salt",
            "1/4 teaspoon baking soda",
            "8 tablespoons (1 stick; 113 g) salted butter, melted and cooled, plus more for greasing pan",
            "1 cup (210 g) granulated sugar",
            "1 large egg",
            "1/2 cup (60 g) chopped walnuts",
            "2 large firm-sweet apples, such as Pink Lady, Honeycrisp, or Golden Delicious (about 1 pound total), peeled, cored, and cut into 1/2-inch cubes",
            "11- by 7-inch baking dish (brownie pan)"
        ],
        "instructions": [
            "Preheat the oven to 350° and set a rack to the middle position. Generously grease the 11-by 7-inch baking baking dish with butter and set aside. In a medium bowl, whisk together the flour, cinnamon, baking powder, salt, and baking soda. Set aside. In the bowl of a standing mixer at high speed or using a hand-held mixer, beat together the butter, sugar, and egg until pale, about 2 minutes. Add the walnuts and apples and stir by hand until evenly combined. Add the flour mixture and stir until combined, another 30 seconds. Spread the batter into the prepared pan and bake until golden brown and lightly firm to the touch, 40 to 50 minutes. Let cool on a rack for 30 minutes, then cut into 12 bars and transfer to a serving platter.",
            "Preheat the oven to 350° and set a rack to the middle position. Generously grease the 11-by 7-inch baking baking dish with butter and set aside.",
            "In a medium bowl, whisk together the flour, cinnamon, baking powder, salt, and baking soda. Set aside. In the bowl of a standing mixer at high speed or using a hand-held mixer, beat together the butter, sugar, and egg until pale, about 2 minutes. Add the walnuts and apples and stir by hand until evenly combined. Add the flour mixture and stir until combined, another 30 seconds.",
            "Spread the batter into the prepared pan and bake until golden brown and lightly firm to the touch, 40 to 50 minutes. Let cool on a rack for 30 minutes, then cut into 12 bars and transfer to a serving platter."
        ],
        "picture_link": null
    }
}