{
    "recipe": {
        "title": "Apple Crunch Pie ",
        "ingredients": [
            "1 cup plus 2 tablespoons all purpose flour",
            "1/2 cup cake flour",
            "2 tablespoons sugar",
            "1/2 teaspoon salt",
            "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
            "3 tablespoons frozen solid vegetable shortening, cut into 1/2-inch cubes",
            "5 tablespoons (or more) chilled whole milk",
            "1 cup all purpose flour",
            "3/4 cup (packed) golden brown sugar",
            "1/2 cup old-fashioned oats",
            "1 teaspoon ground cinnamon",
            "6 tablespoons (3/4 stick) unsalted butter, melted",
            "4 8- to 9-ounce Golden Delicious apples, peeled, quartered, cored, sliced 1/4 inch thick, each slice cut crosswise into 3 pieces",
            "1 tablespoon sugar",
            "1 tablespoon fresh lemon juice",
            "3 tablespoons apricot preserves",
            "1 egg yolk beaten with 1 tablespoon whipping cream (for glaze)"
        ],
        "instructions": [
            "For crust: Blend first 4 ingredients in processor. Add butter and shortening; using on/off turns, process until butter is reduced to pea-size pieces. Add 5 tablespoons milk and blend until moist clumps form, adding more milk by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic; chill at least 1 hour and up to 1 day.",
            "Blend first 4 ingredients in processor. Add butter and shortening; using on/off turns, process until butter is reduced to pea-size pieces. Add 5 tablespoons milk and blend until moist clumps form, adding more milk by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic; chill at least 1 hour and up to 1 day.",
            "for topping: Combine first 4 ingredients in medium bowl. Gradually add butter, stirring until moist clumps form. (Can be made 1 day ahead. Cover; chill.)",
            "Combine first 4 ingredients in medium bowl. Gradually add butter, stirring until moist clumps form. (Can be made 1 day ahead. Cover; chill.)",
            "For filling: Preheat oven to 400°F. Stir apples, sugar and lemon juice in large bowl to blend.",
            "Preheat oven to 400°F. Stir apples, sugar and lemon juice in large bowl to blend.",
            "Roll out dough on lightly floured sheet of parchment paper to 14-inch round, occasionally lifting and turning dough to prevent sticking. Transfer dough on parchment to rimless baking sheet. Leaving 2-inch plain border, spread preserves over center of dough. Sprinkle preserves with 3/4 cup topping mixture. Spoon apple mixture over topping, mounding slightly in center; sprinkle apples with remaining topping. Using parchment as aid, fold dough border in over apple filling (border will not cover filling completely). Press border firmly to hold shape and keep in place. Carefully peel back parchment. Brush border generously with glaze. Bake pie until crust is set, about 25 minutes. Reduce temperature to 325°F. Bake until apples are tender, covering topping loosely with foil if browning too quickly, about 40 minutes longer. Cool pie on baking sheet at least 30 minutes. Serve warm or at room temperature.",
            "Roll out dough on lightly floured sheet of parchment paper to 14-inch round, occasionally lifting and turning dough to prevent sticking. Transfer dough on parchment to rimless baking sheet. Leaving 2-inch plain border, spread preserves over center of dough. Sprinkle preserves with 3/4 cup topping mixture. Spoon apple mixture over topping, mounding slightly in center; sprinkle apples with remaining topping. Using parchment as aid, fold dough border in over apple filling (border will not cover filling completely). Press border firmly to hold shape and keep in place. Carefully peel back parchment. Brush border generously with glaze.",
            "Bake pie until crust is set, about 25 minutes. Reduce temperature to 325°F. Bake until apples are tender, covering topping loosely with foil if browning too quickly, about 40 minutes longer. Cool pie on baking sheet at least 30 minutes. Serve warm or at room temperature."
        ],
        "picture_link": null
    }
}