{
    "recipe": {
        "title": "Apple Crisp ",
        "ingredients": [
            "1 cup all-purpose flour",
            "2/3 cup packed dark brown sugar",
            "3/4 teaspoon ground cinnamon",
            "1/8 teaspoon salt",
            "8 tablespoons (1 stick) unsalted butter, cut into 1/2-inch pieces and chilled",
            "2 pounds firm, sweet apples (4 to 5 medium-large apples)",
            "Up to 1/4 cup water",
            "Vanilla ice cream or heavy cream",
            "Equipment: 8-inch-square baking dish, preferably ceramic, glass, enamel-coated cast-iron, or stainless steel (avoid aluminum or uncoated cast-iron)"
        ],
        "instructions": [
            "Make the crisp topping: In a medium bowl, whisk together the flour, brown sugar, cinnamon, and salt. Add the butter pieces and use your fingers to rub the mixture together until the butter is incorporated and the mixture resembles coarse crumbs. Cover with plastic wrap and place in the refrigerator to chill while you prepare the apple filling.",
            "In a medium bowl, whisk together the flour, brown sugar, cinnamon, and salt. Add the butter pieces and use your fingers to rub the mixture together until the butter is incorporated and the mixture resembles coarse crumbs. Cover with plastic wrap and place in the refrigerator to chill while you prepare the apple filling.",
            "Make the apple filling: Position a rack in the center of the oven and preheat to 375°F. Peel the apples and cut them in half lengthwise. Scoop out the cores and discard. Cut the apple halves lengthwise into 1/2- to 3/4-inch-thick slices—there should be about 6 cups total. Transfer the apple slices to an ungreased 8-inch-square baking dish and spread them out evenly. Drizzle up to 1/4 cup of water over the apples—use less water if the apples are particularly juicy. Scatter the crisp topping evenly over the fruit without pressing down on it. Bake until the topping is browned, the apples are tender when pierced with a knife, and the juices are bubbling, about 45 to 50 minutes. Transfer to a wire rack to cool for 10 minutes. Serve warm, with or without a scoop of vanilla ice cream or a drizzle of heavy cream. DO AHEAD: Apple crisp can be baked, cooled completely, covered, and kept at room temperature for 1 day. Reheat, uncovered, in a warm oven until heated through.",
            "Position a rack in the center of the oven and preheat to 375°F.",
            "Peel the apples and cut them in half lengthwise. Scoop out the cores and discard. Cut the apple halves lengthwise into 1/2- to 3/4-inch-thick slices—there should be about 6 cups total. Transfer the apple slices to an ungreased 8-inch-square baking dish and spread them out evenly. Drizzle up to 1/4 cup of water over the apples—use less water if the apples are particularly juicy.",
            "Scatter the crisp topping evenly over the fruit without pressing down on it. Bake until the topping is browned, the apples are tender when pierced with a knife, and the juices are bubbling, about 45 to 50 minutes. Transfer to a wire rack to cool for 10 minutes. Serve warm, with or without a scoop of vanilla ice cream or a drizzle of heavy cream. DO AHEAD: Apple crisp can be baked, cooled completely, covered, and kept at room temperature for 1 day. Reheat, uncovered, in a warm oven until heated through."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad3a0619925f464b3b16c7/6:4/w_274%2Ch_169/51203860_apple-crisp_1x1.jpg"
    }
}