{
    "recipe": {
        "title": "Apple Celery Granita ",
        "ingredients": [
            "1 (1,000-mg) vitaminutes C tablet (ascorbic acid), crushed to a powder with back of a spoon",
            "1/3 cup sugar",
            "3 Granny Smith apples (1 1/2 pounds), cut lengthwise into 1-inch-thick sticks",
            "6 medium celery ribs without leaves (1 pound)",
            "1/2 teaspoon wasabi paste or powdered wasabi",
            "1 to 1 1/2 teaspoons water",
            "Flaky sea salt such as Maldon",
            "1 to 2 tablespoons fruity extra-virgin olive oil",
            "Equipment: an electric juice extractor"
        ],
        "instructions": [
            "Put crushed vitaminutes C and sugar in a 1-quart container that will fit under spout of juicer. Using juicer, juice apples and celery into container. Spoon off foam and stir until sugar is dissolved. Pour into an 8- to 9-inch square stainless-steel or glass baking pan and freeze until partially frozen, about 1 hour. Scrape and stir with a fork, crushing any lumps. Continue to freeze, scraping once or twice, until evenly frozen, about 2 hours more. Stir together wasabi and enough water to make a pourable sauce. Scrape granita to lighten, then serve sprinkled lightly with sea salt and drizzled lightly with oil and wasabi sauce.",
            "Put crushed vitaminutes C and sugar in a 1-quart container that will fit under spout of juicer.",
            "Using juicer, juice apples and celery into container. Spoon off foam and stir until sugar is dissolved.",
            "Pour into an 8- to 9-inch square stainless-steel or glass baking pan and freeze until partially frozen, about 1 hour. Scrape and stir with a fork, crushing any lumps. Continue to freeze, scraping once or twice, until evenly frozen, about 2 hours more.",
            "Stir together wasabi and enough water to make a pourable sauce.",
            "Scrape granita to lighten, then serve sprinkled lightly with sea salt and drizzled lightly with oil and wasabi sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/557ef5e181ac1e5023675543/6:4/w_274%2Ch_169/238975_apple-celery-granita_6x4.jpg"
    }
}