{
    "recipe": {
        "title": "Apple Crepes with Calvados Butter Sauce ",
        "ingredients": [
            "1 cup whole milk",
            "1/2 cup cornstarch",
            "1/4 cup all purpose flour",
            "3 large eggs",
            "3 tablespoons unsalted butter, melted",
            "2 tablespoons sugar",
            "1 tablespoon Calvados or other apple brandy",
            "1 teaspoon vanilla extract",
            "1/4 teaspoon coarse kosher salt",
            "6 tablespoons (3/4 stick) unsalted butter, room temperature",
            "1/2 cup sugar",
            "1/4 teaspoon coarse kosher salt",
            "3 tablespoons Calvados or other apple brandy",
            "2 tablespoons (1/4 stick) unsalted butter",
            "2 medium-size Golden Delicious apples, peeled, cored, cut into 1/2-inch cubes",
            "3 tablespoons sugar",
            "1/4 teaspoon coarse kosher salt",
            "1/4 teaspoon ground cinnamon",
            "2 tablespoons Calvados or other apple brandy"
        ],
        "instructions": [
            "For crepes: Combine all ingredients in blender and blend until smooth. DO AHEAD Crepe batter can be made 1 day ahead. Cover and refrigerate. Reblend before using. Line plate with paper towel or parchment paper. Heat 9-inch-diameter nonstick skillet with 7-inch-diameter bottom over medium heat. Add 2 tablespoons batter to skillet; tilt and rotate skillet to spread batter evenly over bottom. Cook until center of crepe is cooked through and edges are lightly browned, about 1 minute. Run spatula around crepe and invert onto prepared paper-towel-lined plate. Repeat with remaining batter, placing paper towel or parchment paper between crepes, making at least 18 crepes. DO AHEAD Can be made 1 day ahead. Cover and refrigerate.",
            "Combine all ingredients in blender and blend until smooth. DO AHEAD Crepe batter can be made 1 day ahead. Cover and refrigerate. Reblend before using.",
            "Line plate with paper towel or parchment paper. Heat 9-inch-diameter nonstick skillet with 7-inch-diameter bottom over medium heat. Add 2 tablespoons batter to skillet; tilt and rotate skillet to spread batter evenly over bottom. Cook until center of crepe is cooked through and edges are lightly browned, about 1 minute. Run spatula around crepe and invert onto prepared paper-towel-lined plate. Repeat with remaining batter, placing paper towel or parchment paper between crepes, making at least 18 crepes. DO AHEAD Can be made 1 day ahead. Cover and refrigerate.",
            "For calvados butter sauce: Using electric mixer, beat butter in medium bowl until well blended. Add sugar and coarse salt; beat until fluffy. Gradually beat in Calvados just until incorporated. DO AHEAD Can be made 1 day ahead. Cover and refrigerate.",
            "Using electric mixer, beat butter in medium bowl until well blended. Add sugar and coarse salt; beat until fluffy. Gradually beat in Calvados just until incorporated. DO AHEAD Can be made 1 day ahead. Cover and refrigerate.",
            "For apples: Melt butter in heavy large skillet over medium heat. Add apples; sprinkle with sugar, coarse salt, and cinnamon. Sauté until apples are tender, about 3 minutes. Add Calvados and cook until most of liquid evaporates, about 2 minutes. Remove from heat. DO AHEAD Can be made 2 hours ahead. Let stand at room temperature. Preheat oven to 300°F. Place crepe stack (with paper towels between crepes) on rimmed baking sheet. Cover baking sheet with foil and seal at edges; warm in oven until crepes are heated through, about 20 minutes for cold crepes and 15 minutes for room-temperature crepes. Stir Calvados butter sauce in small saucepan over medium-low heat until melted and heated through. Rewarm apple mixture over medium heat, stirring occasionally, about 3 minutes. Place 1 crepe on plate, browned side down. Spoon 2 teaspoons Calvados sauce over crepe, then fold crepe into quarters. Repeat with remaining crepes and Calvados butter sauce, placing 3 crepes on each plate. Spoon apples over crepes on each. Spoon any remaining sauce over crepes and serve.",
            "Melt butter in heavy large skillet over medium heat. Add apples; sprinkle with sugar, coarse salt, and cinnamon. Sauté until apples are tender, about 3 minutes. Add Calvados and cook until most of liquid evaporates, about 2 minutes. Remove from heat. DO AHEAD Can be made 2 hours ahead. Let stand at room temperature.",
            "Preheat oven to 300°F. Place crepe stack (with paper towels between crepes) on rimmed baking sheet. Cover baking sheet with foil and seal at edges; warm in oven until crepes are heated through, about 20 minutes for cold crepes and 15 minutes for room-temperature crepes.",
            "Stir Calvados butter sauce in small saucepan over medium-low heat until melted and heated through. Rewarm apple mixture over medium heat, stirring occasionally, about 3 minutes. Place 1 crepe on plate, browned side down. Spoon 2 teaspoons Calvados sauce over crepe, then fold crepe into quarters. Repeat with remaining crepes and Calvados butter sauce, placing 3 crepes on each plate. Spoon apples over crepes on each. Spoon any remaining sauce over crepes and serve."
        ],
        "picture_link": null
    }
}