{
    "recipe": {
        "title": "Apple Walnut Bundt Cake ",
        "ingredients": [
            "150 grams or 1/2 cup plus 1 1/2 tablespoons (140 ml) eggs (about 3 large eggs)",
            "100 grams or 1 cup walnut halves",
            "300 grams or 2 1/2 cups (lightly spooned into the cup and leveled off) bleached all-purpose flour",
            "5.5 grams or 1 teaspoon baking soda",
            "6 grams or 1 teaspoon fine sea salt",
            "4.4 grams or 2 teaspoons ground cinnamon",
            "4 large tart apples (657 grams or 1 1/2 pounds) / 525 grams or 4 cups diced",
            "269 grams or 1 1/4 cups (296 ml) canola or safflower oil",
            "200 grams or 1 cup granulated sugar",
            "163 grams or 3/4 cup light brown sugar",
            "2 teaspoons (10 ml) pure vanilla extract",
            "Caramel Sauce and Glaze (optional)",
            "The pan must be a minimum 12 cup capacity, such as a Nordic Ware Anniversary Bundt Pan with 10 to 15 cup capacity, or a 12 cup Bundt pan, coated with baking spray with flour; or a 16 cup two-piece angel food pan, bottom lined with parchment, then coated with baking spray with flour"
        ],
        "instructions": [
            "Twenty minutes or longer before toasting the walnuts, set an oven rack in the lower third of the oven. Set the oven at 350ºF/175ºC.",
            "Mise en place: Thirty minutes to 1 hour ahead, set the eggs on the counter at room temperature (65º to 75ºF/19º to 24ºC). TOAST AND CHOP THE WALNUTS: Spread the walnuts evenly on a cookie sheet and bake for 5 minutes. Turn the walnuts onto a clean dish town and roll and rub them around to loosen the skins. Discard any loose skins and let the nuts cool completely. Chop medium coarse. In a medium bowl, whisk together the flour, baking soda, salt, and cinnamon. Peel, core, and cut the apples into 1/8 to 1/4 inch dice.",
            "Thirty minutes to 1 hour ahead, set the eggs on the counter at room temperature (65º to 75ºF/19º to 24ºC).",
            "TOAST AND CHOP THE WALNUTS: Spread the walnuts evenly on a cookie sheet and bake for 5 minutes. Turn the walnuts onto a clean dish town and roll and rub them around to loosen the skins. Discard any loose skins and let the nuts cool completely. Chop medium coarse.",
            "In a medium bowl, whisk together the flour, baking soda, salt, and cinnamon.",
            "Peel, core, and cut the apples into 1/8 to 1/4 inch dice.",
            "Make the batter: Into the bowl of a stand mixer, weigh or measure the eggs. Add the oil, granulated and brown sugars, and the vanilla. Attach the flat beater and beat on medium speed for 1 minute, until blended. Add the flour mixture and beat on low speed for 20 seconds, just until incorporated. Scrape down the sides of the bowl. Detach the bowl from the stand and with a large spoon stir in the apples and walnuts. Spoon the batter into the prepared pan.",
            "Into the bowl of a stand mixer, weigh or measure the eggs. Add the oil, granulated and brown sugars, and the vanilla. Attach the flat beater and beat on medium speed for 1 minute, until blended.",
            "Add the flour mixture and beat on low speed for 20 seconds, just until incorporated. Scrape down the sides of the bowl.",
            "Detach the bowl from the stand and with a large spoon stir in the apples and walnuts. Spoon the batter into the prepared pan.",
            "Bake the cake: Bake for 50 to 60 minutes, or until a wire cake tester inserted near the center comes out clean and the cake springs back when pressed lightly in the center.",
            "Bake for 50 to 60 minutes, or until a wire cake tester inserted near the center comes out clean and the cake springs back when pressed lightly in the center.",
            "Cool the cake: Let the cake cool in the pan on a wire rack for 30 minutes. If using a straight sided pan, run a metal spatula between the sides of the pan and the cake. Invert the cake onto a wire rack that has been lightly coated with nonstick cooking spray and cool completely for about 1 1/2 hours. Drizzle Caramel Sauce and Glaze over the cake after unmolding.",
            "Let the cake cool in the pan on a wire rack for 30 minutes. If using a straight sided pan, run a metal spatula between the sides of the pan and the cake. Invert the cake onto a wire rack that has been lightly coated with nonstick cooking spray and cool completely for about 1 1/2 hours.",
            "Drizzle Caramel Sauce and Glaze over the cake after unmolding."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b8859564bc3523b8d9f130a/6:4/w_274%2Ch_169/apple-walnut-bundt-cake-recipe-083018.jpg",
        "color": 4743428
    }
}