{
    "recipe": {
        "title": "Apple Galettes with Caramel Sauce ",
        "ingredients": [
            "1 (17 1/4 ounce) package frozen puff pastry, thawed",
            "1 large egg yolk",
            "1/3 cup pure almond paste (not marzipan; 4 ounces)",
            "7 tart, crisp baking apples such as Granny Smith, peeled, cored, and thinly sliced",
            "1/4 cup fresh lemon juice (from 2 medium lemons)",
            "3 tablespoons plus 1 teaspoon granulated sugar",
            "3/4 cup granulated sugar",
            "3/4 cup heavy cream",
            "1/8 teaspoon salt",
            "1/2 cup confectioner's sugar",
            "1 quart vanilla ice cream"
        ],
        "instructions": [
            "Preheat oven to 400°F.",
            "Preheat oven to 400°F.",
            "Make apple galettes: Roll puff pastry dough to 1/4-inch thickness (the store-bought variety will most likely be this thickness). Using saucer or other 5-inch round as stencil, cut dough into 10 circles. Prick bottom all over with fork. Chill until firm, about 30 minutes. In small bowl, whisk together egg and 2 teaspoons water. Brush each puff pastry circle with egg wash. Roll approximately 1 teaspoon almond paste into ball, then flatten into disc and place in center of puff pastry circle. Repeat for remaining puff pastry circles. Arrange about 25 apple slices on top of each puff pastry circle. Brush each with lemon juice, then sprinkle with 1 teaspoon sugar. Bake until apples are tender and edges of puff pastry are light golden brown, 16 to 18 minutes.",
            "Roll puff pastry dough to 1/4-inch thickness (the store-bought variety will most likely be this thickness). Using saucer or other 5-inch round as stencil, cut dough into 10 circles. Prick bottom all over with fork. Chill until firm, about 30 minutes.",
            "In small bowl, whisk together egg and 2 teaspoons water. Brush each puff pastry circle with egg wash.",
            "Roll approximately 1 teaspoon almond paste into ball, then flatten into disc and place in center of puff pastry circle. Repeat for remaining puff pastry circles. Arrange about 25 apple slices on top of each puff pastry circle. Brush each with lemon juice, then sprinkle with 1 teaspoon sugar. Bake until apples are tender and edges of puff pastry are light golden brown, 16 to 18 minutes.",
            "Make caramel sauce: In heavy 2-quart saucepan over moderately high heat, combine sugar with 1/4 cup water and bring to boil. Continue cooking, swirling pan occasionally (do not stir), until light golden brown, 6 to 8 minutes. Remove from heat and stir in cream and salt. Return to heat and bring to boil. Remove from heat and keep warm.",
            "In heavy 2-quart saucepan over moderately high heat, combine sugar with 1/4 cup water and bring to boil. Continue cooking, swirling pan occasionally (do not stir), until light golden brown, 6 to 8 minutes. Remove from heat and stir in cream and salt. Return to heat and bring to boil. Remove from heat and keep warm.",
            "To serve: Dust galettes with powdered sugar and serve with caramel sauce and vanilla ice cream.",
            "Dust galettes with powdered sugar and serve with caramel sauce and vanilla ice cream."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a7af9a84192308a1c88/6:4/w_274%2Ch_169/240489_hires.jpg"
    }
}