{
    "recipe": {
        "title": "Apple and Honey Financier Tart ",
        "ingredients": [
            "1/2 cup confectioners' sugar",
            "3/4 cup plus 2 tablespoons all-purpose flour",
            "Pinch of salt",
            "4 1/2 tablespoons unsalted butter, softened",
            "1 large egg yolk",
            "3 tablespoons unsalted butter",
            "1/2 cup slivered almonds",
            "1/4 cup plus 3 tablespoons confectioners' sugar",
            "1/4 cup plus 2 tablespoons all-purpose flour",
            "2 tablespoons cornstarch",
            "Pinch of salt",
            "4 large egg whites",
            "2 tablespoons honey",
            "1/4 cup heavy cream",
            "1 vanilla bean, split",
            "5 tablespoons (2 1/2 ounces) unsalted butter",
            "3 medium Golden Delicious apples, peeled, cored, and cut into 1/4-inch dice",
            "1/4 cup honey",
            "2 tablespoons Calvados or applejack",
            "2 tablespoons honey"
        ],
        "instructions": [
            "Sift together the confectioners' sugar, flour, and salt into a bowl.",
            "Place the butter in a food processor and process until smooth, about 15 seconds. Scatter the flour mixture over the butter, add the egg, and process just until the dough forms a mass; do not overmix. Turn the dough out onto the counter and shape into a disc, wrap in plastic wrap, and refrigerate for at least 2 hours or up to 24 hours. The dough may be well wrapped and frozen for up to 1 month.",
            "Let the dough stand at room temperature for 15 minutes to soften. Flour 2 pieces of parchment paper. Dust the disc of dough lightly with flour and place in between the parchment sheets. Roll the dough into a 12-inch circle. Lift the dough in the parchment, remove 1 sheet, and flip to transfer the dough into the tart pan. Press the dough into the pan and roll the pin over the top of the pan to remove excess dough. Prick the bottom of the tart shell all over with a fork. Chill the tart shell for 20 minutes. (The tart shell can be refrigerated for up to 24 hours.)",
            "Make the financier batter: Preheat the oven to 350° F. Melt the butter in a small skillet over medium heat. Reduce the heat to medium-low and cook the butter until it begins to brown and has a nutty fragrance, about 3 minutes. Set aside to cool. In a food processor, pulse the slivered almonds until finely ground, about 45 seconds. Transfer the ground almonds to a medium bowl. Sift the confectioners' sugar over the almonds. Add the flour, cornstarch, and salt and gently whisk to combine. In another medium bowl, combine the cooled browned butter, egg whites, honey, and cream. Scrape the seeds from the vanilla bean (reserve the pod for another use) into the bowl and whisk to combine. Add the dry ingredients and whisk just until combined. Set aside.",
            "Preheat the oven to 350° F. Melt the butter in a small skillet over medium heat. Reduce the heat to medium-low and cook the butter until it begins to brown and has a nutty fragrance, about 3 minutes. Set aside to cool.",
            "In a food processor, pulse the slivered almonds until finely ground, about 45 seconds. Transfer the ground almonds to a medium bowl. Sift the confectioners' sugar over the almonds. Add the flour, cornstarch, and salt and gently whisk to combine.",
            "In another medium bowl, combine the cooled browned butter, egg whites, honey, and cream. Scrape the seeds from the vanilla bean (reserve the pod for another use) into the bowl and whisk to combine. Add the dry ingredients and whisk just until combined. Set aside.",
            "Make the apple filling: and fragrant, about 5 minutes. Add the diced apples, honey, and Calvados and cook, stirring occasionally, until it no longer tastes of alcohol, 2 to 4 minutes. Drain the apples in a strainer set over a bowl, reserving 1/4 cup of the liquid. Transfer the apples to a bowl and stir in the 1/4 cup reserved liquid.",
            "and fragrant, about 5 minutes. Add the diced apples, honey, and Calvados and cook, stirring occasionally, until it no longer tastes of alcohol, 2 to 4 minutes. Drain the apples in a strainer set over a bowl, reserving 1/4 cup of the liquid. Transfer the apples to a bowl and stir in the 1/4 cup reserved liquid.",
            "Assemble the tart: Place the dough-lined tart pan on a rimmed baking sheet. Spread the apple filling evenly in the tart shell. Scrape the financier batter over the apples, covering them completely. Bake the tart until the top is golden brown and a toothpick inserted into the center comes out clean 45 to 50 minutes,. Place the tart on a wire rack.",
            "Place the dough-lined tart pan on a rimmed baking sheet. Spread the apple filling evenly in the tart shell. Scrape the financier batter over the apples, covering them completely.",
            "Bake the tart until the top is golden brown and a toothpick inserted into the center comes out clean 45 to 50 minutes,. Place the tart on a wire rack.",
            "Glaze the tart: Put the honey in a heatproof glass bowl and microwave on high until hot, 10 to 15 seconds (or heat in a small saucepan). Brush the honey over the top of the hot tart. Cool the tart completely before serving.",
            "Put the honey in a heatproof glass bowl and microwave on high until hot, 10 to 15 seconds (or heat in a small saucepan). Brush the honey over the top of the hot tart. Cool the tart completely before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/555b6c0b644d45515b75824d/6:4/w_274%2Ch_169/51253420_apple-honey-financier-tart_6x4.jpg",
        "color": 16143662
    }
}