{
    "recipe": {
        "title": "Apricot Crumble Parfait ",
        "ingredients": [
            "1 cup dried California apricots, coarsely chopped",
            "2 tablespoons sugar",
            "1/3 cup all-purpose flour",
            "1/3 cup old-fashioned oats",
            "1/4 cup plus 2 tablespoons (packed) light brown sugar",
            "3 tablespoons chilled unsalted butter, cut into small pieces",
            "1/8 teaspoon kosher salt",
            "Pinch of cinnamon",
            "2 pints vanilla bean ice cream"
        ],
        "instructions": [
            "Cook apricots, sugar, and 1 cup water in a small heavy saucepan over low heat, stirring occasionally, until apricots are plump, soft, and just beginning to break down, about 30 minutes. Transfer compote to a small bowl and let cool completely. DO AHEAD: Can be made 1 week ahead. Cover and refrigerate.",
            "For crumble: Preheat oven to 350°F. Combine all ingredients in a large bowl. Rub mixture with your fingertips until butter is completely incorporated and mixture resembles wet sand. Spread out on a rimmed baking sheet. Bake, stirring occasionally, until golden brown, 15-17 minutes. Let cool completely. DO AHEAD: Can be made 3 days ahead. Store airtight at room temperature.",
            "Preheat oven to 350°F. Combine all ingredients in a large bowl. Rub mixture with your fingertips until butter is completely incorporated and mixture resembles wet sand. Spread out on a rimmed baking sheet.",
            "Bake, stirring occasionally, until golden brown, 15-17 minutes. Let cool completely. DO AHEAD: Can be made 3 days ahead. Store airtight at room temperature.",
            "For assembly: Scoop 2 tablespoons ice cream into each small jar or sturdy glass. Spoon 1 tablespoon apricot compote over ice cream and top with 1 tablespoon crumble. Repeat with remaining ingredients for 6 layers total. Freeze for 30 minutes to set.",
            "Scoop 2 tablespoons ice cream into each small jar or sturdy glass. Spoon 1 tablespoon apricot compote over ice cream and top with 1 tablespoon crumble. Repeat with remaining ingredients for 6 layers total. Freeze for 30 minutes to set."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b0b1f1c6a78d1a4a609d9c/6:4/w_274%2Ch_169/395889_apricot-crumble-parfait_1x1.jpg",
        "color": 2492623
    }
}