{
    "recipe": {
        "title": "Apricot Rice Pudding Pops ",
        "ingredients": [
            "1 cup whole milk",
            "3/4 cup plus 2 tablespoons canned unsweetened coconut milk",
            "1/4 cup heavy cream",
            "1 lemongrass stalk, tough outer layer removed, thinly sliced",
            "1 tablespoons minced peeled ginger",
            "1/2 vanilla bean, split lengthwise",
            "3 tablespoons short-grain rice (such as arborio)",
            "1/4 cup 1/4\" pieces dried apricots",
            "1/4 cup sugar",
            "Ingredient info: Unsweetened coconut milk is available at many supermarkets. Lemongrass can be found at Asian markets and some supermarkets.",
            "8 ice-pop molds; 8 ice-pop sticks"
        ],
        "instructions": [
            "Combine milk, coconut milk, cream, lemongrass, ginger, and 1/2 cup water in a medium saucepan. Scrape in seeds from vanilla bean; add bean. Bring to a boil; remove from heat, cover, and let steep for 15 minutes. Meanwhile, place rice and 1/2 cup water in a small bowl; let stand for 10 minutes (to soften and release some starch). Drain. Strain coconut-milk mixture through a fine-mesh sieve into a medium saucepan. Add rice; bring to a boil. Reduce heat to low, cover, and simmer (do not stir or rice will become too starchy) until rice is very tender, 30-35 minutes. Let cool slightly. Stir in apricots and sugar. Divide mixture among ice-pop molds. Freeze until beginning to set, 30-45 minutes. Insert a stick into each pop. Freeze until firm, about 1 hour longer. DO AHEAD: Pops can be made 2 weeks ahead. Keep frozen.",
            "Combine milk, coconut milk, cream, lemongrass, ginger, and 1/2 cup water in a medium saucepan. Scrape in seeds from vanilla bean; add bean. Bring to a boil; remove from heat, cover, and let steep for 15 minutes.",
            "Meanwhile, place rice and 1/2 cup water in a small bowl; let stand for 10 minutes (to soften and release some starch). Drain.",
            "Strain coconut-milk mixture through a fine-mesh sieve into a medium saucepan. Add rice; bring to a boil. Reduce heat to low, cover, and simmer (do not stir or rice will become too starchy) until rice is very tender, 30-35 minutes. Let cool slightly.",
            "Stir in apricots and sugar. Divide mixture among ice-pop molds. Freeze until beginning to set, 30-45 minutes. Insert a stick into each pop. Freeze until firm, about 1 hour longer. DO AHEAD: Pops can be made 2 weeks ahead. Keep frozen."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b0a4c91cc76a014cfad8a6/6:4/w_274%2Ch_169/51104480_apricot-rice-pudding-pops_1x1.jpg"
    }
}