{
    "recipe": {
        "title": "Arctic Char Tostadas ",
        "ingredients": [
            "3 Tbsp. fish sauce",
            "1 cup unseasoned rice vinegar",
            "1/4 cup sliced scallions",
            "1 1/2\" piece ginger, peeled, finely grated",
            "Kosher salt",
            "1/4 tsp. finely grated lemon zest",
            "1/2 cup farmer’s cheese or whole-milk ricotta",
            "Kosher salt",
            "1 (8-oz.) boneless arctic char or salmon fillet",
            "Extra-virgin olive oil (for drizzling)",
            "4 (4\"–6\") tostadas",
            "Cilantro leaves with tender stems, sliced serrano chiles, capers, and lime wedges (for serving)"
        ],
        "instructions": [
            "Heat a small saucepan over medium. When hot, pour in 1 Tbsp. fish sauce. It should bubble up vigorously and then get thicker and slightly darker, about 30 seconds. Repeat with remaining fish sauce, incorporating 1 Tbsp. at a time. Carefully add vinegar (it may spatter), then transfer mixture to a small bowl; let cool. Stir in scallions and ginger. Taste and season with salt.",
            "Tostadas: Preheat oven to 300°F. Mix lemon zest into cheese in a small bowl; season with salt and set aside. Place fish on a rimmed baking sheet and drizzle very lightly with oil; season with salt. Bake until just opaque throughout, about 5 minutes for char and 8–10 minutes for salmon. Remove from oven and break apart into large flakes. Drizzle with vinaigrette. Divide reserved cheese mixture among tostadas. Top with fish, then cilantro, chiles, and capers. Serve with lime wedges.",
            "Preheat oven to 300°F. Mix lemon zest into cheese in a small bowl; season with salt and set aside. Place fish on a rimmed baking sheet and drizzle very lightly with oil; season with salt. Bake until just opaque throughout, about 5 minutes for char and 8–10 minutes for salmon. Remove from oven and break apart into large flakes. Drizzle with vinaigrette.",
            "Divide reserved cheese mixture among tostadas. Top with fish, then cilantro, chiles, and capers. Serve with lime wedges.",
            "Do Ahead Vinaigrette can be made 1 week ahead. Cover and chill.",
            "Vinaigrette can be made 1 week ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c6442dca442d063bee9947b/6:4/w_274%2Ch_169/arctic-char-tostadas-recipe-BA-010819.jpg"
    }
}