{
    "recipe": {
        "title": "Aromatic Braised Chicken with Fried Onions ",
        "ingredients": [
            "2 1/2 pounds chicken thighs with bone, skin discarded",
            "4 medium shallots, quartered",
            "5 garlic cloves, chopped",
            "1 tablespoon minced peeled ginger",
            "2 sprigs fresh curry leaves, leaves removed from stems",
            "1 teaspoon cayenne",
            "1/4 teaspoon black peppercorns",
            "10 whole cloves",
            "1 (1-inch) piece cinnamon stick",
            "1 teaspoon distilled white vinegar",
            "1/2 cup water",
            "About 2 cups vegetable oil",
            "1 medium onion, thinly sliced",
            "3 teaspoons all-purpose flour, divided"
        ],
        "instructions": [
            "Toss all ingredients except water, oil, onion, and flour with 1 teaspoon salt in a wide heavy medium pot. Marinate chicken, covered and chilled, 1 hour. Add water and bring to a boil, then simmer, covered, until chicken is tender, 40 minutes to 1 hour. Meanwhile, heat 1 1/2 inches oil in a small heavy saucepan over medium heat until hot but not smoking. Toss onion with 1 teaspoon flour, then fry in 2 batches, stirring frequently (do not let burn), until golden brown, 2 to 3 minutes per batch. Transfer with a slotted spoon to paper towels. Reserve 3 tablespoons oil. Remove chicken from cooking liquid, reserving liquid, and gently pat dry. 3Heat reserved oil in a 12-inch heavy skillet over medium-high heat until it shimmers, then brown chicken all over, about 6 minutes total. Transfer to a platter. Add remaining 2 teaspoons flour to fat in skillet and cook, stirring, 1 minute. Add chicken-cooking liquid (with aromatics and spices) and simmer, stirring, until slightly thickened, about 2 minutes. Season with salt and pour over chicken. Top with fried onions.",
            "Toss all ingredients except water, oil, onion, and flour with 1 teaspoon salt in a wide heavy medium pot. Marinate chicken, covered and chilled, 1 hour.",
            "Add water and bring to a boil, then simmer, covered, until chicken is tender, 40 minutes to 1 hour.",
            "Meanwhile, heat 1 1/2 inches oil in a small heavy saucepan over medium heat until hot but not smoking.",
            "Toss onion with 1 teaspoon flour, then fry in 2 batches, stirring frequently (do not let burn), until golden brown, 2 to 3 minutes per batch. Transfer with a slotted spoon to paper towels. Reserve 3 tablespoons oil.",
            "Remove chicken from cooking liquid, reserving liquid, and gently pat dry. 3Heat reserved oil in a 12-inch heavy skillet over medium-high heat until it shimmers, then brown chicken all over, about 6 minutes total. Transfer to a platter.",
            "Add remaining 2 teaspoons flour to fat in skillet and cook, stirring, 1 minute. Add chicken-cooking liquid (with aromatics and spices) and simmer, stirring, until slightly thickened, about 2 minutes. Season with salt and pour over chicken. Top with fried onions."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d7864f3a00aeb2f1cb540/6:4/w_274%2Ch_169/242308_hires.jpg"
    }
}