{
    "recipe": {
        "title": "Arroz Caldo (Chicken Rice Porridge) ",
        "ingredients": [
            "200 g (7 oz / 1 cup) white glutinous rice",
            "100 g (3 1/2 oz / 1/2 cup) jasmine or medium-grain rice",
            "1.7 kg (3 lb 12 oz) whole chicken, jointed into 4 pieces, bone in",
            "60 ml (2 fl oz / 1/4 cup) vegetable oil",
            "9 garlic cloves, 6 thinly sliced, 3 finely chopped",
            "1 large onion, finely chopped",
            "4 cm (1 1/2-inch) piece ginger, peeled and cut into julienne",
            "60 ml (2 fl oz / 1/4 cup) fish sauce",
            "2 spring onions (scallions), very thinly sliced",
            "6 hard-boiled eggs, peeled and halved",
            "Sesame oil (optional) and 8 kalamansi or lime wedges, to serve"
        ],
        "instructions": [
            "Place both of the rices in a bowl, cover with cold water and set aside to soak. Place the chicken in a large saucepan or stockpot and cover with 2.5 litres (85 fl oz / 10 cups) water. Bring to the boil over medium heat, skimming any scum from the surface, then reduce the heat to low–medium and simmer for 40 minutes, or until the juices run clear when the thickest part of the thigh is pierced with a knife. Remove the chicken from the stock and set aside to cool slightly; reserve the stock.",
            "Put the vegetable oil and sliced garlic in a large saucepan over medium heat and stir continuously for 5 minutes, or until the garlic is golden. Remove with a slotted spoon and drain on paper towel. Return the saucepan to the heat, add the onion and cook for 5 minutes, stirring until soft. Add the chopped garlic and ginger and stir for a further 2 minutes, or until fragrant.",
            "Drain the rice, add to the pan with the onion and stir for 2 minutes, or until the rice grains are well coated. Add the fish sauce and 2 litres (68 fl oz / 8 cups) of the stock, bring to the boil, then reduce the heat to medium and cook for 20 minutes, or until the rice is very soft and starting to break up, and the mixture has thickened. Thin with a little extra stock to a porridge-like consistency, then season with salt flakes.",
            "Shred the chicken, discarding the skin and bones. Divide three-quarters of the chicken among serving bowls, then ladle over the rice mixture. Top with the remaining chicken, then scatter with the fried garlic and spring onion. Serve with hardboiled eggs, sesame oil, if using, and kalamansi."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a7894d5c6aea21096d5582f/6:4/w_274%2Ch_169/Filipino-Cure-for-the-Common-Cold-31012018.jpg"
    }
}