{
    "recipe": {
        "title": "Arroz con Pollo ",
        "ingredients": [
            "8 bone-in, skin-on chicken thighs (about 2 pounds), rinsed and patted dry",
            "Kosher salt and freshly ground black pepper to taste",
            "3 tablespoons olive oil",
            "1 yellow onion, finely chopped",
            "1 green bell pepper, cored, seeded, and chopped",
            "3 jarred piquillo peppers, sealed and chopped, or 1 red bell pepper, cored, seeded, and chopped",
            "3 garlic cloves, chopped",
            "2 Roma (plum) tomatoes, halved, seeded, and chopped",
            "1/2 teaspoon ground Espelette pepper, cayenne pepper, or hot paprika",
            "2 bay leaves",
            "2 tablespoons tomato paste",
            "1 cup basmati rice",
            "1 small packet (1 1/4 teaspoons) Sazón seasoning",
            "1/2 teaspoon saffron threads",
            "3 cups store-bought low-sodium broth",
            "Hot sauce, such as Crystal, to taste",
            "2 tablespoons chopped fresh cilantro",
            "2 tablespoons chopped fresh flat-leaf parsley",
            "1 cup plain whole-milk yogurt for serving",
            "Lime zest (optional)"
        ],
        "instructions": [
            "1. Season the chicken on both sides with salt and pepper. In a large straight-sided skillet, heat the oil over medium-high heat until rippling. Sear the chicken thighs, turning once, until golden brown, 8 to 10 minutes per side. Transfer to a plate and set aside.",
            "2. Drain half the oil from the pan and return the pan to the heat. Add the onion, bell pepper, piquillos, garlic, tomatoes, Espelette, and bay leaves and cook, stirring, until the onion begins to brown, 6 to 8 minutes. Stir in the tomato paste and cook, stirring, until it begins to caramelize, 3 to 4 minutes.",
            "3. Add the rice, Sazón, and saffron and cook, stirring, for 2 to 3 minutes. Pour in the chicken stock, season with salt, pepper, and hot sauce, stir, and bring to a boil. Reduce the heat to maintain a simmer and nestle the chicken thighs skin side up in the rice. (Try not to submerge the skin, so it stays crisp as the rice cooks.) Cook, partially covered, until the rice has absorbed the liquid and the chicken is cooked through, 25 to 30 minutes. If the chicken skin is not crisp, place the pan under a hot broiler until the chicken is crispy and golden brown on top.",
            "4. To serve, remove the bay leaves, sprinkle the cilantro and parsley over the rice, and gently stir to incorporate. Serve directly from the pan, with the yogurt sprinkled with lime zest and the bottle of hot sauce on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad80a019925f464b3b8fd0/6:4/w_274%2Ch_169/51190840_arroz-con-pollo_1x1.jpg",
        "color": 6960483
    }
}