{
    "recipe": {
        "title": "Artichoke Caponata (Capunata 'i Cacuocciuli) ",
        "ingredients": [
            "35-ounce can Italian plum tomatoes, drained",
            "2 garlic cloves",
            "1/4 cup extra-virgin olive oil",
            "2 teaspoons sugar",
            "1/2 teaspoon dried basil",
            "6 ounce large green olives with pits (20)",
            "3 lemons",
            "2 pounds baby artichokes, about 2 1/2 by 1 1/2 inches (20)",
            "1/3 cup extra-virgin olive oil",
            "4 celery ribs, halved crosswise",
            "2 tablespoons capers, rinsed",
            "1/4 cup red-wine vinegar"
        ],
        "instructions": [
            "Crush tomatoes in a bowl with your hand. Cook garlic in oil in a 1 1/2-quart saucepan over low heat, turning occasionally, until pale golden, about 10 minutes. Discard garlic. Stir in tomatoes, sugar, basil, and salt and pepper to taste. Simmer vigorously, uncovered, stirring occasionally, until sauce is reduced to a thick pulp, about 20 minutes.",
            "Prepare vegetables: Smash olives with a meat pounder or flat side of a large knife. Remove pits. Soak olives 30 minutes in cold water, changing water every 10 minutes. Drain. Juice 2 lemons into a large bowl half filled with cold water and add lemon halves. Working with 1 artichoke at a time and running knife through remaining lemon before each cut, trim about ‚ inch from tops and cut off stems. Pull off tough outer leaves and quarter artichokes lengthwise. Put them in lemon water as trimmed. Drain artichokes well and pat dry. Heat oil in a large heavy skillet over moderately high heat, then sauté artichokes, stirring, 2 minutes. Add salt to taste and cook over moderately low heat, stirring occasionally, until crisp-tender, 15 to 20 minutes. While artichokes cook, blanch celery in boiling water 2 minutes and transfer with tongs to a bowl of cold water to stop cooking. Thinly slice. Add celery, olives, and capers to artichokes. Cook over moderately low heat, stirring occasionally, until hot. Stir in vinegar and cook 1 minute. Add tomato sauce and salt and pepper to taste. Simmer 5 minutes. Serve at room temperature with a few grindings of black pepper.",
            "Smash olives with a meat pounder or flat side of a large knife. Remove pits. Soak olives 30 minutes in cold water, changing water every 10 minutes. Drain. Juice 2 lemons into a large bowl half filled with cold water and add lemon halves. Working with 1 artichoke at a time and running knife through remaining lemon before each cut, trim about ‚ inch from tops and cut off stems. Pull off tough outer leaves and quarter artichokes lengthwise. Put them in lemon water as trimmed.",
            "Drain artichokes well and pat dry. Heat oil in a large heavy skillet over moderately high heat, then sauté artichokes, stirring, 2 minutes. Add salt to taste and cook over moderately low heat, stirring occasionally, until crisp-tender, 15 to 20 minutes. While artichokes cook, blanch celery in boiling water 2 minutes and transfer with tongs to a bowl of cold water to stop cooking. Thinly slice.",
            "Add celery, olives, and capers to artichokes. Cook over moderately low heat, stirring occasionally, until hot. Stir in vinegar and cook 1 minute. Add tomato sauce and salt and pepper to taste. Simmer 5 minutes. Serve at room temperature with a few grindings of black pepper."
        ],
        "picture_link": null
    }
}