{
    "recipe": {
        "title": "Artichoke, Spinach, and Prosciutto Flatbreads with Spicy Honey ",
        "ingredients": [
            "3 tablespoons olive oil",
            "4 garlic cloves, thinly sliced",
            "2 tablespoons finely chopped flat-leaf parsley",
            "1 (10-ounce) package frozen spinach, thawed",
            "1 (9-ounce) package frozen artichoke hearts, thawed",
            "Kosher salt, freshly ground black pepper",
            "2 tablespoons finely grated lemon zest",
            "Cornmeal (for pans)",
            "1 pound frozen pizza dough, thawed",
            "All-purpose flour (for surface)",
            "1/2 pound Parmesan cheese, grated on the large holes of a box grater (about 2 cups), divided",
            "3 tablespoons honey",
            "1 1/2 teaspoons red pepper flakes",
            "2 ounces thinly sliced prosciutto"
        ],
        "instructions": [
            "Position racks in middle and upper third of oven and preheat to 475ºF. Heat oil in large heavy skillet over medium. Add garlic and parsley and cook, stirring, 30 seconds. Add spinach and artichokes, toss to coat, and cook, covered, until artichokes are tender, 10–12 minutes. Uncover and simmer, stirring occasionally, until juices thicken, about 2 minutes. Season with 1/2 tsp. salt and a pinch of black pepper. Remove from heat and stir in lemon zest. Sprinkle 2 rimless baking sheets with cornmeal. Roll out half of the dough on floured surface to a 12x7\" oval. Transfer to baking sheet. Repeat with remaining dough. Sprinkle each round with 1/2 cup Parmesan, then top evenly with artichoke and spinach mixture. Top with remaining 1 cup Parmesan and season with a pinch of salt and black pepper. Bake, rotating sheets halfway through, until crust is golden brown, 20–22 minutes. Meanwhile, combine honey and red pepper flakes in a small bowl. Remove flatbreads from oven. Top with prosciutto and drizzle with spicy honey. Cut flatbreads into wedges and serve.",
            "Position racks in middle and upper third of oven and preheat to 475ºF.",
            "Heat oil in large heavy skillet over medium. Add garlic and parsley and cook, stirring, 30 seconds. Add spinach and artichokes, toss to coat, and cook, covered, until artichokes are tender, 10–12 minutes. Uncover and simmer, stirring occasionally, until juices thicken, about 2 minutes. Season with 1/2 tsp. salt and a pinch of black pepper. Remove from heat and stir in lemon zest.",
            "Sprinkle 2 rimless baking sheets with cornmeal. Roll out half of the dough on floured surface to a 12x7\" oval. Transfer to baking sheet. Repeat with remaining dough.",
            "Sprinkle each round with 1/2 cup Parmesan, then top evenly with artichoke and spinach mixture. Top with remaining 1 cup Parmesan and season with a pinch of salt and black pepper. Bake, rotating sheets halfway through, until crust is golden brown, 20–22 minutes.",
            "Meanwhile, combine honey and red pepper flakes in a small bowl.",
            "Remove flatbreads from oven. Top with prosciutto and drizzle with spicy honey. Cut flatbreads into wedges and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/562543f953de6d0d5cdfad43/6:4/w_274%2Ch_169/EP_10192015_freezerpanty_artichokepizze.jpg"
    }
}