{
    "recipe": {
        "title": "Ashkenazic Layered Pastry (Fluden) ",
        "ingredients": [
            "4 cups bleached all-purpose flour",
            "2 teaspoons double-acting baking powder",
            "3/4 teaspoon salt",
            "1/3 cup sugar",
            "1 1/2 cups vegetable shortening, or 1 cup shortening and 1/2 cup chilled butter or margarine",
            "4 large egg yolks, or 2 large egg yolks and 1 large egg",
            "1/2 cup water, or 1/4 cup water and 1/4 cup milk or sweet white wine",
            "2 tablespoons white wine vinegar or mild cider vinegar",
            "1 cup (4 ounces) chopped almonds, hazelnuts, pecans, or walnuts",
            "1/2 cup sugar",
            "2 cups (24 ounces) apricot preserves, strawberry jam, orange marmalade, or Prune Lekvar",
            "1 to 1 1/2 cups (4 to 6 ounces) grated fresh or unsweetened desiccated coconut (optional)",
            "1 cup dried currants or raisins (optional)"
        ],
        "instructions": [
            "To make the pastry: Sift together the flour, baking powder, and salt. Mix in the sugar. Cut in the shortening to resemble coarse crumbs. Combine the eggs, water, and vinegar. Stir into the flour mixture until the dough just holds together. Form into a ball. To make the pastry in a food processor: In a food processor fitted with a steel blade, combine the flour, sugar, baking powder, and salt. Add the butter and pulse 4 times. Add the shortening and pulse until the consistency of coarse crumbs, about 4 pulses. Combine the eggs, water and vinegar. Add to the flour mixture and pulse until the dough begins to hold together. If the dough is too dry, pulse a little additional water, 1 teaspoon at a time. Form into a ball.",
            "To make the pastry: Sift together the flour, baking powder, and salt. Mix in the sugar. Cut in the shortening to resemble coarse crumbs. Combine the eggs, water, and vinegar. Stir into the flour mixture until the dough just holds together. Form into a ball. To make the pastry in a food processor: In a food processor fitted with a steel blade, combine the flour, sugar, baking powder, and salt. Add the butter and pulse 4 times. Add the shortening and pulse until the consistency of coarse crumbs, about 4 pulses. Combine the eggs, water and vinegar. Add to the flour mixture and pulse until the dough begins to hold together. If the dough is too dry, pulse a little additional water, 1 teaspoon at a time. Form into a ball.",
            "2. On a piece of waxed paper or plastic wrap or on a lightly floured surface, roll the dough into a rectangle with the narrow end facing you. Fold the top third of the dough toward you, then fold the bottom third upward. Turn the dough so that a narrow end faces front and roll into a rectangle. Fold in thirds again. Press to hold together. (If the pastry is made without the rolling and folding, it does not turn out as flaky.) Wrap in plastic wrap and refrigerate for at least 4 hours or up to 4 days, or store in the freezer for up to 2 months. Let stand at room temperature until malleable but not soft, about 30 minutes.",
            "3. Preheat the oven to 350°F (325°F if using a glass pan). Grease a 13-by-9-inch baking pan.",
            "4. Divide the dough into thirds. On a piece of waxed paper or plastic wrap or on a floured surface, roll out each piece of dough into a 13-by-9-inch rectangle. Fit a rectangle into the prepared pan and spread with half of the filling. Repeat the layering with the remaining pastry and filling, ending with pastry.",
            "5. Bake for 20 minutes. Reduce the heat to 325°F (300°F if using a glass pan) and bake until golden brown, about 40 additional minutes. Place on a rack and let cool for at least 1 hour. Cover and store at room temperature for 1 to 2 days.",
            "To make the filling: Combine the nuts and sugar. Spread the jam over the dough and sprinkle with the nut mixture and, if desired, the coconut and/or currants.",
            "To make the filling: Combine the nuts and sugar. Spread the jam over the dough and sprinkle with the nut mixture and, if desired, the coconut and/or currants.",
            "VARIATION Sour Cream Flaky Fluden: Omit the vinegar and egg yolks and add 6 tablespoons sour cream.",
            "Sour Cream Flaky Fluden: Omit the vinegar and egg yolks and add 6 tablespoons sour cream."
        ],
        "picture_link": null,
        "color": 11162014
    }
}