{
    "recipe": {
        "title": "Asian Chicken and Cilantro Meatballs ",
        "ingredients": [
            "12 fresh, frozen, or dried kaffir lime leaves, coarsely chopped",
            "1 pound (500 g) boneless, skinless free-range chicken breast meat",
            "2 tablespoons toasted sesame oil",
            "1 tablespoon soy sauce",
            "1 tablespoon Vietnamese fish sauce",
            "3 tablespoons minced fresh ginger, or 1 tablespoon ground ginger",
            "1 teaspoon fine sea salt",
            "1/2 cup (40 g) plain dry bread crumbs",
            "1/2 cup (125 ml) minced scallions, white and green parts",
            "1 large egg, free-range and organic",
            "1/4 cup minced fresh chives",
            "1 cup loosely packed fresh cilantro leaves, plus more for garnish",
            "1 tablespoon Kaffir Lime Powder (optional)",
            "Chicken stock or vegetable bouillon, warmed, for serving",
            "An electric spice mill; a small jar with a lid; a baking sheet lined with baking parchment; a food processor; a bamboo steamer."
        ],
        "instructions": [
            "Make the Kaffir Lime Powder, if using: In the spice mill, grind the leaves to a fine powder. Store in the jar with the lid securely tightened at room temperature for up to 1 month. (Makes 2 tablespoons powder.)",
            "In the spice mill, grind the leaves to a fine powder. Store in the jar with the lid securely tightened at room temperature for up to 1 month. (Makes 2 tablespoons powder.)",
            "Make the soup: Cut the chicken into 1-inch (2.5 cm) cubes. Spread the meat in a single layer on the baking sheet, cover with plastic wrap, and freeze for 1 hour. The chicken should be stiff. (Freezing will help the food processor blade cut the meat cleanly rather than tearing or smearing it.) Place the cubes in the food processor and process for about 15 seconds, until the chicken is coarsely ground. Transfer the chicken to a large bowl, add 1 tablespoon of the sesame oil and the remaining ingredients (except the stock), and use your hands to blend the mixture To prevent the mixture from sticking, wet your hands with cold water, then shape the mixture into 1 1/2-inch (3 cm) balls, about the size of golf balls. In a medium saucepan, bring 1 quart (1 l) water to a boil over high heat. Arrange the meatballs side by side in the steamer, cover, and place on top of the saucepan. Steam until cooked through, about 5 minutes (see page 15 for best tips on steaming techniques and equipment). In a skillet, heat the remaining 1 tablespoon sesame oil over medium-high heat and sear the meatballs for a few minutes to create a crunchy, colorful exterior. Serve in the chicken stock or vegetable stock, and garnish with fresh cilantro leaves.",
            "Cut the chicken into 1-inch (2.5 cm) cubes. Spread the meat in a single layer on the baking sheet, cover with plastic wrap, and freeze for 1 hour. The chicken should be stiff. (Freezing will help the food processor blade cut the meat cleanly rather than tearing or smearing it.)",
            "Place the cubes in the food processor and process for about 15 seconds, until the chicken is coarsely ground. Transfer the chicken to a large bowl, add 1 tablespoon of the sesame oil and the remaining ingredients (except the stock), and use your hands to blend the mixture",
            "To prevent the mixture from sticking, wet your hands with cold water, then shape the mixture into 1 1/2-inch (3 cm) balls, about the size of golf balls.",
            "In a medium saucepan, bring 1 quart (1 l) water to a boil over high heat.",
            "Arrange the meatballs side by side in the steamer, cover, and place on top of the saucepan. Steam until cooked through, about 5 minutes (see page 15 for best tips on steaming techniques and equipment). In a skillet, heat the remaining 1 tablespoon sesame oil over medium-high heat and sear the meatballs for a few minutes to create a crunchy, colorful exterior. Serve in the chicken stock or vegetable stock, and garnish with fresh cilantro leaves."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58b5afa6c7cd7f116cf66e05/6:4/w_274%2Ch_169/asian-chicken-cilantro-meatballs-022817.jpg"
    }
}