{
    "recipe": {
        "title": "Asparagus and Fontina Quiche ",
        "ingredients": [
            "1 pound asparagus, ends trimmed",
            "6 large eggs",
            "1 cup heavy cream",
            "1 teaspoon garlic salt",
            "1 teaspoon freshly ground black pepper",
            "8 ounces Fontina cheese, grated (about 2 cups)",
            "2 ounces Gruyère cheese, grated (about 1/2 cup)",
            "1 unbaked homemade or store-bought 9-inch pie crust"
        ],
        "instructions": [
            "Preheat the oven to 350°F. Using a vegetable peeler, slice the asparagus lengthwise into long, thin strips, starting just under the tip of each stalk. Leave the tips whole. (Alternatively, cut the asparagus into 1-inch pieces.) In a pot with a steamer insert or in a covered sauté pan fitted with an expandable steamer basket, bring 2 inches of water to a boil. Add the asparagus to the steamer insert or basket, cover, and steam until tender, about 30 seconds for strips and about 3 minutes for pieces. Rinse the asparagus under cold water to stop the cooking. Drain well and set aside. In a large bowl, whisk together the eggs, cream, garlic salt, and pepper. Stir in the Fontina, Gruyère, and reserved asparagus. Pour the mixture into the unbaked pie shell. Bake until lightly golden and set in the center when the pan is gently pushed, 40 to 45 minutes. If the crust is browning too quickly, cover it with foil to prevent it from burning. Remove from the oven and let stand for 5 to 10 minutes before serving. Cut into 6 or 8 slices and serve warm or at room temperature. The quiche is best served the day it is made. Tightly wrap leftovers with plastic wrap and store in the refrigerator for up to 2 days.",
            "Preheat the oven to 350°F.",
            "Using a vegetable peeler, slice the asparagus lengthwise into long, thin strips, starting just under the tip of each stalk. Leave the tips whole. (Alternatively, cut the asparagus into 1-inch pieces.)",
            "In a pot with a steamer insert or in a covered sauté pan fitted with an expandable steamer basket, bring 2 inches of water to a boil. Add the asparagus to the steamer insert or basket, cover, and steam until tender, about 30 seconds for strips and about 3 minutes for pieces.",
            "Rinse the asparagus under cold water to stop the cooking. Drain well and set aside.",
            "In a large bowl, whisk together the eggs, cream, garlic salt, and pepper. Stir in the Fontina, Gruyère, and reserved asparagus.",
            "Pour the mixture into the unbaked pie shell.",
            "Bake until lightly golden and set in the center when the pan is gently pushed, 40 to 45 minutes. If the crust is browning too quickly, cover it with foil to prevent it from burning.",
            "Remove from the oven and let stand for 5 to 10 minutes before serving. Cut into 6 or 8 slices and serve warm or at room temperature.",
            "The quiche is best served the day it is made. Tightly wrap leftovers with plastic wrap and store in the refrigerator for up to 2 days."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b05b46a652eca3c4b33c06a/6:4/w_274%2Ch_169/asparagus-fontina-quiche-recipe-HC-052218.jpg"
    }
}