{
    "recipe": {
        "title": "Asparagus and Two-Cheese Quiche with Hash-Brown Crust ",
        "ingredients": [
            "4 medium russet potatoes (about 2 pounds), peeled",
            "1 1/2 teaspoons kosher salt, divided",
            "3/4 teaspoon freshly ground black pepper, divided",
            "2 tablespoons vegetable oil",
            "3 tablespoons unsalted butter, divided",
            "4 medium shallots, thinly sliced",
            "6 large eggs, room temperature",
            "1 1/4 cups half-and-half",
            "1 teaspoon mustard powder",
            "Pinch of grated nutmeg",
            "1 tablespoon finely chopped tarragon",
            "5 ounces Fontina cheese, grated (about 1 1/2 cups)",
            "4 ounces fresh goat cheese, crumbled (about 3/4 cup)",
            "1/2 bunch asparagus (about 1/2 pound), ends trimmed",
            "A 10-inch cast-iron skillet, such as Lodge"
        ],
        "instructions": [
            "Preheat oven to 350°F. Using the coarse grater disk on a food processor or the largest holes on a box grater, shred potatoes. Toss with 1 tsp. salt and 1/2 tsp. pepper in a large bowl. Transfer to a clean dishtowel, gather together ends of towel, and thoroughly wring out excess liquid over the sink; Transfer potatoes to a bowl and set aside.",
            "Heat oil and 2 Tbsp. butter in a 10\" cast-iron skillet over medium-high until butter is melted. Add potatoes and immediately start forming into a crust by pushing potatoes flat against bottom and sides of pan with a 1/2-cup dry measuring cup. Continue cooking, pressing potatoes up sides of pan if they start shrinking, until potatoes are bound together and bottom of crust is starting to brown, about 10 minutes. Remove pan from heat and set aside.",
            "Meanwhile, melt remaining 1 Tbsp. butter in a small skillet over medium heat. Add shallots and sauté until translucent, 5-6 minutes; set aside.",
            "Whisk eggs, half-and-half, mustard powder, nutmeg, remaining 1/2 teaspoon salt, and remaining 1/4 teaspoon pepper in another large bowl. Whisk in tarragon and set aside.",
            "Sprinkle Fontina cheese, goat cheese, and sautéed shallots evenly over bottom of crust, then pour in egg mixture. Arrange asparagus decoratively on top. Bake until quiche is set and crust is well browned, 30-35 minutes. Let cool to room temperature before cutting into wedges and serving from the pan."
        ],
        "picture_link": "https://assets.epicurious.com/photos/550845493f2f10b2690874c4/6:4/w_274%2Ch_169/EP-03122015-quiche-edge-hires.jpg"
    }
}