{
    "recipe": {
        "title": "Asparagus Green Onion Sauté ",
        "ingredients": [
            "2 pounds asparagus, tough ends discarded and halved crosswise at a sharp diagonal",
            "1/2 pound string beans, tops trimmed and halved crosswise at a sharp diagonal",
            "1 bunch scallions (about 8)",
            "2 tablespoons extra virgin olive oil"
        ],
        "instructions": [
            "Bring a 5- to 6-quart pot of water seasoned with 1 tablespoon kosher salt to a boil. Cook asparagus and string beans until just tender, 5 to 6 minutes. Drain, then transfer in a single layer to paper or kitchen towels to dry. Separate white parts from green parts of scallions. Halve whites lengthwise. Halve green parts lengthwise and again in half crosswise. You should have approximately 3-inch pieces. Heat oil in a large, heavy skillet over medium-high heat until oil shimmers. Add white parts of scallions and sauté until they just begin to wilt and turn golden, about 2 minutes. Add asparagus, green beans, and 1/4 teaspoon salt and sauté to heat through, 1 minute. Add green parts of scallions and continue to sauté until they just begin to wilt, about 1 minute more. Adjust seasoning if necessary and serve with a fresh grind of black pepper.",
            "Bring a 5- to 6-quart pot of water seasoned with 1 tablespoon kosher salt to a boil. Cook asparagus and string beans until just tender, 5 to 6 minutes. Drain, then transfer in a single layer to paper or kitchen towels to dry.",
            "Separate white parts from green parts of scallions. Halve whites lengthwise. Halve green parts lengthwise and again in half crosswise. You should have approximately 3-inch pieces.",
            "Heat oil in a large, heavy skillet over medium-high heat until oil shimmers. Add white parts of scallions and sauté until they just begin to wilt and turn golden, about 2 minutes.",
            "Add asparagus, green beans, and 1/4 teaspoon salt and sauté to heat through, 1 minute. Add green parts of scallions and continue to sauté until they just begin to wilt, about 1 minute more. Adjust seasoning if necessary and serve with a fresh grind of black pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b18fae9a93d64c380abb83/6:4/w_274%2Ch_169/394989_asparagus-green-onion_1x1.jpg"
    }
}