{
    "recipe": {
        "title": "Aunt Geraldine's Chocolate Cake ",
        "ingredients": [
            "2 cups all-purpose flour",
            "2 cups sugar",
            "1/4 teaspoon salt",
            "1 cup strong coffee",
            "1 cup (2 sticks) unsalted butter, cut into pieces",
            "1/2 cup unsweetened cocoa powder",
            "1/2 cup buttermilk",
            "2 eggs, beaten to blend",
            "1 teaspoon ground cinnamon",
            "1 teaspoon baking soda",
            "1 teaspoon vanilla extract",
            "1/2 cup unsweetened cocoa powder",
            "1/2 cup (1 stick) unsalted butter, cut into pieces",
            "6 to 8 tablespoons buttermilk",
            "1 1-pound package powdered sugar",
            "1 teaspoon vanilla extract",
            "1 cup chopped walnuts, toasted"
        ],
        "instructions": [
            "For cake: Preheat oven to 350°F. Butter 9x13-inch pan; dust pan with flour. Sift flour, sugar and salt into large bowl. Combine coffee, butter, and cocoa in heavy medium saucepan. Stir over medium heat until mixture is smooth and comes to boil. Pour coffee mixture over flour mixture; stir until blended. Add buttermilk, eggs, cinnamon, baking soda and vanilla and stir until well blended. Pour batter into prepared pan. Bake cake until tester inserted into center comes out clean, about 30 minutes. Cool cake in pan on rack.",
            "Preheat oven to 350°F. Butter 9x13-inch pan; dust pan with flour. Sift flour, sugar and salt into large bowl. Combine coffee, butter, and cocoa in heavy medium saucepan. Stir over medium heat until mixture is smooth and comes to boil. Pour coffee mixture over flour mixture; stir until blended. Add buttermilk, eggs, cinnamon, baking soda and vanilla and stir until well blended. Pour batter into prepared pan.",
            "Bake cake until tester inserted into center comes out clean, about 30 minutes. Cool cake in pan on rack.",
            "For frosting: Combine cocoa, butter and 6 tablespoons buttermilk in heavy large saucepan over high heat. Stir until mixture is smooth and comes to boil. Remove from heat. Add powdered sugar and vanilla and beat frosting until smooth, adding more buttermilk by tablespoons if frosting is too thick.",
            "Combine cocoa, butter and 6 tablespoons buttermilk in heavy large saucepan over high heat. Stir until mixture is smooth and comes to boil. Remove from heat. Add powdered sugar and vanilla and beat frosting until smooth, adding more buttermilk by tablespoons if frosting is too thick.",
            "Spread frosting over cake in pan. Sprinkle walnuts over. (Can be made 1 day ahead. Cover and chill. Let stand at room temperature 3 hours before serving.)",
            "Spread frosting over cake in pan. Sprinkle walnuts over. (Can be made 1 day ahead. Cover and chill. Let stand at room temperature 3 hours before serving.)"
        ],
        "picture_link": null
    }
}