{
    "recipe": {
        "title": "Autumn Kale Salad ",
        "ingredients": [
            "1/2 head garlic",
            "6 tablespoons extra-virgin olive oil, plus 1 teaspoon for roasting garlic",
            "1 small delicata squash, unpeeled and thinly sliced, seeds removed",
            "1 teaspoon kosher salt",
            "Pinch of freshly ground black pepper",
            "2 tablespoons apple cider vinegar",
            "2 tablespoons fresh lemon juice",
            "1 teaspoon honey",
            "Pinch of cayenne pepper or hot paprika (optional)",
            "1 large head lacinato kale, thickest ribs removed",
            "1/2 cup golden raisins",
            "1/2 cup hazelnuts or almonds, toasted and chopped",
            "Shaved Parmesan cheese (optional)"
        ],
        "instructions": [
            "Preheat the oven to 400ºF. Trim about 1 inch off the head of the garlic, exposing the cloves. Drizzle 1 teaspoon of the olive oil on the garlic skins and rub it in. Wrap the garlic in aluminum foil and place on a baking sheet in the oven. Roast for 30 to 40 minutes, or until the individual cloves are completely soft. Remove from the oven and set aside. At the same time as you roast the garlic, roast the squash. Place the squash pieces in a small bowl and coat with 2 tablespoons of the oil, 1 teaspoon of the salt, and the black pepper. Spread out the squash on a large baking sheet and roast for about 20 minutes, flipping halfway through, until the pieces are browned and cooked through. Set aside to cool to room temperature. In a small bowl, stir together the remaining 4 tablespoons oil, vinegar, lemon juice, honey, remaining 1 teaspoon salt, and the cayenne (if using). Squeeze out the roasted garlic into the dressing. Stir well, breaking up the garlic. Set aside. Wash and dry the kale thoroughly and slice it into thin strips. Place it in a large bowl and add the dressing a bit at a time, using your hands to massage the kale leaves gently until the volume is reduced and they look softened and shiny. You may have leftover dressing. Add the raisins, nuts, and squash pieces and toss. Serve the salad at room temperature. Top with shaved Parmesan, if desired",
            "Preheat the oven to 400ºF. Trim about 1 inch off the head of the garlic, exposing the cloves. Drizzle 1 teaspoon of the olive oil on the garlic skins and rub it in. Wrap the garlic in aluminum foil and place on a baking sheet in the oven. Roast for 30 to 40 minutes, or until the individual cloves are completely soft. Remove from the oven and set aside.",
            "At the same time as you roast the garlic, roast the squash. Place the squash pieces in a small bowl and coat with 2 tablespoons of the oil, 1 teaspoon of the salt, and the black pepper. Spread out the squash on a large baking sheet and roast for about 20 minutes, flipping halfway through, until the pieces are browned and cooked through. Set aside to cool to room temperature.",
            "In a small bowl, stir together the remaining 4 tablespoons oil, vinegar, lemon juice, honey, remaining 1 teaspoon salt, and the cayenne (if using). Squeeze out the roasted garlic into the dressing. Stir well, breaking up the garlic. Set aside.",
            "Wash and dry the kale thoroughly and slice it into thin strips. Place it in a large bowl and add the dressing a bit at a time, using your hands to massage the kale leaves gently until the volume is reduced and they look softened and shiny. You may have leftover dressing. Add the raisins, nuts, and squash pieces and toss.",
            "Serve the salad at room temperature. Top with shaved Parmesan, if desired"
        ],
        "picture_link": "https://assets.epicurious.com/photos/57dff76f5a8cf33069fa4f05/6:4/w_274%2Ch_169/Rosh-Hashanah-Gefilte-Variations-salad-19092016.jpg"
    }
}