{
    "recipe": {
        "title": "Avocado Pound Cake ",
        "ingredients": [
            "3 cups all-purpose flour",
            "1/2 cup yellow cornmeal",
            "1/2 teaspoon salt",
            "1 1/2 teaspoons baking powder",
            "1 1/2 teaspoons baking soda",
            "3/4 cup (1 1/2 sticks) unsalted butter, softened",
            "3 cups granulated sugar",
            "1 cup plus 2 tablespoons ripe mashed avocados",
            "4 large eggs",
            "2 teaspoons pure vanilla extract",
            "3/4 cup buttermilk"
        ],
        "instructions": [
            "Place a rack in the center and upper third of the oven and preheat to 350 degrees F. Grease and flour two 9x5-inch loaf pans and set aside. In a medium bowl, whisk together flour, cornmeal, salt, baking powder, and baking soda. Set aside. In the bowl of an electric stand mixer fitted with a paddle attachment, beat butter and sugar on medium speed until light and fluffy, 3 to 5 minutes. Add avocado and beat for another 2 minutes. Stop mixer and scrape down the sides of the bowl as necessary. Add eggs, one at a time, beating on medium speed for 1 minute after each addition. Stop the mixer and scrape down to make sure everything is thoroughly mixed. Beat in vanilla. With the mixer on low speed, add half of the flour mixture. Beat until just incorporated. Add the buttermilk and the remaining flour mixture. Beat until just incorporated. Remove bowl from the stand mixer, and finish incorporating the batter with a spatula. Divide the batter between the pans and bake on alternating racks for 30 minutes. After 30 minutes, rotate racks and bake for another 15 to 25 minutes, or until a skewer inserted in the center comes out clean. Let cool in pans for 20 minutes before inverting onto a wire rack to cool completely. Cake will last, well wrapped, at room temperature for up to 4 days.",
            "Place a rack in the center and upper third of the oven and preheat to 350 degrees F. Grease and flour two 9x5-inch loaf pans and set aside.",
            "In a medium bowl, whisk together flour, cornmeal, salt, baking powder, and baking soda. Set aside.",
            "In the bowl of an electric stand mixer fitted with a paddle attachment, beat butter and sugar on medium speed until light and fluffy, 3 to 5 minutes. Add avocado and beat for another 2 minutes. Stop mixer and scrape down the sides of the bowl as necessary.",
            "Add eggs, one at a time, beating on medium speed for 1 minute after each addition. Stop the mixer and scrape down to make sure everything is thoroughly mixed. Beat in vanilla.",
            "With the mixer on low speed, add half of the flour mixture. Beat until just incorporated. Add the buttermilk and the remaining flour mixture. Beat until just incorporated. Remove bowl from the stand mixer, and finish incorporating the batter with a spatula.",
            "Divide the batter between the pans and bake on alternating racks for 30 minutes. After 30 minutes, rotate racks and bake for another 15 to 25 minutes, or until a skewer inserted in the center comes out clean. Let cool in pans for 20 minutes before inverting onto a wire rack to cool completely.",
            "Cake will last, well wrapped, at room temperature for up to 4 days."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b18f349a93d64c380ab974/6:4/w_274%2Ch_169/395113_avocado-pound-cake_1x1.jpg"
    }
}