{
    "recipe": {
        "title": "Baby Back Ribs with Tamarind Glaze ",
        "ingredients": [
            "2 racks baby back pork ribs (3 1/2–4 pounds total), halved crosswise",
            "5 ounces ginger, peeled, chopped",
            "1 orange wedge (about 1/8 of orange)",
            "5 star anise pods",
            "2 1/2 cups unfiltered apple juice",
            "1 tablespoon Diamond Crystal or 2 teaspoons Morton kosher salt",
            "6 habanero chiles, halved lengthwise, seeds removed if desired, divided",
            "1/4 cup plus 1/3 (lightly packed) light brown sugar",
            "1/2 cup ketchup",
            "1/3 cup apple cider vinegar",
            "1/4 cup tamarind concentrate",
            "3 tablespoons honey",
            "Vegetable oil (for grill)",
            "Kosher salt",
            "1 Persian cucumber, thinly sliced",
            "1/2 small red onion, thinly sliced",
            "1/2 serrano chile, very thinly sliced",
            "2 teaspoons fresh lime juice",
            "Micro cilantro and/or cilantro sprigs and lime wedges (for serving)"
        ],
        "instructions": [
            "Place ribs in a large Dutch oven or other heavy pot. Add ginger, orange wedge, star anise, apple juice, salt, half of chiles, and 1/4 cup brown sugar. Pour in water just to cover pork and bring to a simmer over medium heat. Reduce heat so liquid is at a very gentle simmer, partially cover pot, and braise, turning racks a few times, until meat is fork-tender and nearly (but not quite) falling off the bones, 1 1/2–2 hours. Chop remaining chiles while ribs are cooking and set aside.",
            "Carefully transfer ribs to a rimmed baking sheet and let cool. Cut between ribs to create 2-rib pieces.",
            "Meanwhile, crank up the heat under the Dutch oven to high and add ketchup, vinegar, tamarind concentrate, honey, remaining 1/3 cup brown sugar, and reserved chopped chiles to braising liquid. Cook, stirring often, until glaze is thick enough to coat a spoon (it should be reduced to 1–1 1/2 cups), 30–45 minutes. Strain into a large measuring cup; discard solids. Let settle so oil rises to surface. Pour off oil into a small bowl; set aside.",
            "Salad and assembly: Prepare a grill for medium heat; oil grate. Working one at a time, dip ribs into glaze to coat. Grill ribs, turning several times, until glaze is lightly charred, about 5 minutes total. Transfer ribs to a platter; season with salt. Drizzle with remaining glaze and reserved oil. Toss cucumber, onion, chile, and lime juice in a medium bowl to combine; season with salt. Scatter salad over ribs and top with micro cilantro. Serve with lime wedges.",
            "Prepare a grill for medium heat; oil grate. Working one at a time, dip ribs into glaze to coat. Grill ribs, turning several times, until glaze is lightly charred, about 5 minutes total. Transfer ribs to a platter; season with salt. Drizzle with remaining glaze and reserved oil.",
            "Toss cucumber, onion, chile, and lime juice in a medium bowl to combine; season with salt. Scatter salad over ribs and top with micro cilantro. Serve with lime wedges.",
            "Do Ahead Ribs can be braised 1 day ahead. Let cool in liquid; cover and chill.",
            "Ribs can be braised 1 day ahead. Let cool in liquid; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59496b4c214b311c5ab9e3d6/6:4/w_274%2Ch_169/indian-spiced-babyback-ribs-with-tamarind-glaze-BA-062017.jpg",
        "color": 15613894
    }
}