{
    "recipe": {
        "title": "Bacon-Fat Gingersnaps ",
        "ingredients": [
            "3/4 cup bacon fat (from 1 1/2 to 2 pounds bacon), at room temperature",
            "1 cup sugar, plus 1/4 cup for rolling",
            "1/4 cup molasses (not blackstrap) or cane syrup, such as Steen's or Lyle's",
            "1 large egg",
            "2 cups all-purpose flour",
            "1 1/2 teaspoons kosher salt",
            "2 teaspoons baking soda",
            "2 teaspoons ground ginger",
            "1/2 teaspoon ground cloves",
            "1/2 teaspoon ground cinnamon"
        ],
        "instructions": [
            "Combine all the ingredients in a food processor, and pulse until a smooth, stiff dough forms. Wrap the dough in plastic and chill in the refrigerator for a few hours. Preheat the oven to 350 degrees. Line two baking sheets with parchment paper. Put the 1/4 cup sugar in a shallow bowl. Breaking off 1-tablespoon lumps, roll the dough into balls, drop into the sugar, roll to coat, and place 2 inches apart on the baking sheets. Bake for 10 to 12 minutes, until the cookies are dark brown. Let cool on the baking sheets for a few minutes, then transfer to a rack to cool completely.",
            "Combine all the ingredients in a food processor, and pulse until a smooth, stiff dough forms. Wrap the dough in plastic and chill in the refrigerator for a few hours.",
            "Preheat the oven to 350 degrees. Line two baking sheets with parchment paper.",
            "Put the 1/4 cup sugar in a shallow bowl. Breaking off 1-tablespoon lumps, roll the dough into balls, drop into the sugar, roll to coat, and place 2 inches apart on the baking sheets.",
            "Bake for 10 to 12 minutes, until the cookies are dark brown. Let cool on the baking sheets for a few minutes, then transfer to a rack to cool completely."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b04313cae54b6703414187/6:4/w_274%2Ch_169/51128400_bacon-fat-gingersnaps-_1x1.jpg"
    }
}