{
    "recipe": {
        "title": "Baja-Style Tempura Fish ",
        "ingredients": [
            "1 1/2 cups water",
            "1/2 cup fresh lime juice",
            "10 cloves garlic, sliced",
            "2 serrano chiles, stemmed and sliced",
            "2 teaspoons dried Mexican oregano, ground (page 161)",
            "1 tablespoon fine sea salt",
            "2 pounds young shark fillet, cut into 4 by 3/4-inch strips (see headnote)",
            "3/4 cup plus 1 tablespoon ice water",
            "2 1/2 teaspoons yellow mustard (optional)",
            "1 cup bleached all-purpose flour",
            "Vegetable oil, for deep-frying",
            "10 (5 1/2-inch) soft white corn tortillas (page 13), for serving",
            "Garnish: Baja Cabbage Slaw (page 145), lime wedges, and pickled jalapeño rings"
        ],
        "instructions": [
            "To make the marinade, in a large bowl, combine the 1 1/2 cups water, lime juice, garlic, chiles, oregano, and salt. Add the fish strips and let marinate for at least 20 minutes.",
            "To make the tempura batter, in a separate bowl, whisk together the ice water and mustard. Gently stir in the flour, but don’t overmix; a few small lumps are okay. Cover and refrigerate for 30 minutes.",
            "Drain the shark pieces and pat them dry with a paper towel.",
            "Have a plate lined with paper towels ready. In a large, heavy-bottomed pot, heat at least 2 to 3 inches of oil over medium heat until it reaches 360°F on a deep-fat thermometer. Remove the batter from the refrigerator and stir once more. Dredge the fish pieces in the batter, a few at a time, to evenly coat. Drop them in the hot fat, 2 pieces at a time, adding 2 more pieces every 30 seconds (fry no more than 4 pieces at a time). Monitor the temperature of the hot oil throughout frying, letting the oil return to proper temperature, if necessary, between batches; to ensure crispness, it must remain a constant 360°F to 380°F. If too low, the fish will be oily; if too hot, the pieces will burn.",
            "Fry them until crisp, light golden brown, and floating in the oil, about 2 1/2 minutes per batch. With a fine-mesh skimmer, transfer the fish tempura to the paper-towel-lined plate to absorb the excess oil. Repeat with the remaining pieces of fish. During frying, be sure to remove any pieces of floating batter, or they will burn and darken the oil, which will transfer a burned flavor to the tempura. Serve immediately.",
            "To serve, lay the tortillas side by side, open face and overlapping on a platter. Divide the slaw and filling equally between the tortillas and top with salsa and garnish. Grab, fold, and eat right away. Or build your own taco: lay a tortilla, open face, in one hand. Spoon on some slaw, then filling, top with salsa, fold, and eat right away."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56098f456a59cdb91b5f7952/6:4/w_274%2Ch_169/363453_hires.jpg",
        "color": 11017305
    }
}