{
    "recipe": {
        "title": "Baked Herbed Gefilte Fish ",
        "ingredients": [
            "1/4 cup olive oil, plus more for drizzling",
            "2 teaspoons paprika",
            "2 teaspoons dried parsley",
            "2 pinches ground allspice",
            "1/2 teaspoon kosher salt",
            "1/2 teaspoon freshly ground black pepper",
            "One 22-ounce loaf frozen gefilte fish, paper removed, not thawed",
            "1 large onion, sliced in rounds",
            "2 garlic cloves, minced"
        ],
        "instructions": [
            "1. Preheat the oven to 350°F. 2. Pour the olive oil into the bottom of a 9 x 5-inch loaf pan. Add the paprika, parsley, 1 pinch of the allspice, the salt, and pepper. Roll the frozen loaf in the oil and spices to coat. Remove the loaf from the pan, arrange the onion on the bottom of the pan, and place the loaf on top of the onion. Sprinkle with the garlic and the remaining 1 pinch allspice. Finish with a drizzle of olive oil. Bake, covered, for 2 hours. 3. Cool the gefilte fish completely, then place it in a resealable container and refrigerate it for at least 4 hours or overnight. Serve cold, sliced and topped with the onions.",
            "1. Preheat the oven to 350°F.",
            "2. Pour the olive oil into the bottom of a 9 x 5-inch loaf pan. Add the paprika, parsley, 1 pinch of the allspice, the salt, and pepper. Roll the frozen loaf in the oil and spices to coat. Remove the loaf from the pan, arrange the onion on the bottom of the pan, and place the loaf on top of the onion. Sprinkle with the garlic and the remaining 1 pinch allspice. Finish with a drizzle of olive oil. Bake, covered, for 2 hours.",
            "3. Cool the gefilte fish completely, then place it in a resealable container and refrigerate it for at least 4 hours or overnight. Serve cold, sliced and topped with the onions."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ca97531f13bb9b2edf6636/6:4/w_274%2Ch_169/51230410_baked-herbed-gefilte-fish_6x4.jpg"
    }
}