{
    "recipe": {
        "title": "Baked Penne with Green Chiles ",
        "ingredients": [
            "2 cups (480 ml) whole milk",
            "1 cup (240 ml) heavy cream",
            "One 15-ounce (425-g) can crushed tomatoes",
            "One 4-ounce (115-g) can diced green chiles, drained",
            "2 cups (230 g) shredded sharp Cheddar or Mexican blend cheese",
            "1 heaping tablespoon Dijon mustard",
            "Salt and pepper",
            "1 pound (455 g) penne or ziti",
            "1 cup (100 g) freshly grated Pecorino or Parmesan cheese"
        ],
        "instructions": [
            "Preheat the oven to 500°F (260°C), with a rack in the middle position. Bring a large pot of water to a boil over high heat. Meanwhile, in a 13 by 9-inch (33 by 23-cm) baking dish, stir together the milk, cream, tomatoes, chiles, Cheddar, and mustard. Season with 1 teaspoon salt and some pepper, then set the tomato mixture aside.",
            "When the water boils, season it generously with salt; it should taste like seawater. When it returns to a boil, add the pasta, quickly stir to separate the noodles, then cover the pot. When the water returns to a boil again, uncover and boil the pasta until very al dente, stirring occasionally.",
            "Drain the pasta thoroughly, then pour the noodles on top of the tomato mixture and toss to combine. Gently “shake” the dish to distribute the ingredients, then top evenly with the Pecorino.*",
            "Bake until bubbling and lightly browned, about 12 minutes. Let rest for 5 to 10 minutes before serving.",
            "Make Ahead Prepare to * without preheating the oven, then keep, covered, in the refrigerator for up to 3 days or in the freezer for up to 1 month. Bake, covered, at 350°F (175°C) until hot, about 30 to 60 minutes (if frozen), uncovering for the last 10 minutes or so.",
            "Prepare to * without preheating the oven, then keep, covered, in the refrigerator for up to 3 days or in the freezer for up to 1 month. Bake, covered, at 350°F (175°C) until hot, about 30 to 60 minutes (if frozen), uncovering for the last 10 minutes or so.",
            "Staggered Serve hot or warm. It will keep, loosely covered, in a 200°F (90°C) oven for up to 2 hours.",
            "Serve hot or warm. It will keep, loosely covered, in a 200°F (90°C) oven for up to 2 hours."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59a862ef4dac1b653786f1cd/6:4/w_274%2Ch_169/baked-penne-pasta-with-green-chiles-recipe-083117.jpg",
        "color": 15973657
    }
}