{
    "recipe": {
        "title": "Baked Pears with Sauternes Custard Sauce ",
        "ingredients": [
            "8 firm-ripe Bartlett pears",
            "1/2 cup raisins, chopped",
            "1/2 cup packed light brown sugar",
            "1/2 teaspoon finely grated fresh orange zest",
            "1/2 teaspoon finely grated fresh lemon zest",
            "1 cup plus 2 tablespoons Sauternes or other white dessert wine",
            "6 large egg yolks",
            "1/4 cup granulated sugar",
            "Accompaniment: Madeleines"
        ],
        "instructions": [
            "Preheat oven to 375°F. Peel pears, leaving stems intact, then core from bottom using a melon-ball cutter or a sharp small knife. Stir together raisins, brown sugar, zests, and 2 tablespoons Sauternes and fill pear cavities with mixture. Stand pears upright in a buttered baking dish just large enough to hold them and pour remaining cup Sauternes over pears. Cover dish tightly with foil and bake in middle of oven until tender, 30 to 40 minutes. Transfer pears to a serving dish or plates using a metal spatula to hold filling in place and pour cooking liquid through a sieve into a bowl. Whisk together yolks and granulated sugar in a large metal bowl and add hot cooking liquid in a stream, whisking constantly. Put bowl over a pan of barely simmering water and vigorously whisk, or beat with a handheld electric mixer, until mixture is tripled in volume and registers 160°F on an instant-read thermometer, 3 to 5 minutes. Serve pears warm with sauce.",
            "Preheat oven to 375°F.",
            "Peel pears, leaving stems intact, then core from bottom using a melon-ball cutter or a sharp small knife. Stir together raisins, brown sugar, zests, and 2 tablespoons Sauternes and fill pear cavities with mixture. Stand pears upright in a buttered baking dish just large enough to hold them and pour remaining cup Sauternes over pears.",
            "Cover dish tightly with foil and bake in middle of oven until tender, 30 to 40 minutes. Transfer pears to a serving dish or plates using a metal spatula to hold filling in place and pour cooking liquid through a sieve into a bowl.",
            "Whisk together yolks and granulated sugar in a large metal bowl and add hot cooking liquid in a stream, whisking constantly. Put bowl over a pan of barely simmering water and vigorously whisk, or beat with a handheld electric mixer, until mixture is tripled in volume and registers 160°F on an instant-read thermometer, 3 to 5 minutes.",
            "Serve pears warm with sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea8667b55306961bff778/6:4/w_274%2Ch_169/105517.jpg"
    }
}