{
    "recipe": {
        "title": "Baked Artichoke Dip ",
        "ingredients": [
            "5 tablespoons (packed) grated Romano cheese (about 1 ounce)",
            "3 tablespoons light mayonnaise",
            "3 tablespoons light sour cream",
            "1/2 teaspoon dried marjoram",
            "1/4 teaspoon ground black pepper",
            "1/4 teaspoon onion salt",
            "1/8 teaspoon garlic powder",
            "1 14-ounce can artichoke hearts packed in water, well drained, chopped into 1/4-inch pieces",
            "1/4 teaspoon paprika",
            "French-bread baguette slices, toasted"
        ],
        "instructions": [
            "Whisk 4 tablespoons grated Romano cheese, light mayonnaise, light sour cream, dried marjoram, black pepper, onion salt, and garlic powder in medium bowl to blend. Stir in chopped artichoke hearts. Transfer mixture to 1 1/2-cup ramekin. (Can be prepared 1 day ahead. Cover mixture and refrigerate.) Preheat oven to 375°F. Bake dip until heated through, about 20 minutes (about 30 minutes if chilled). Preheat broiler. Sprinkle dip with remaining 1 tablespoon grated Romano cheese and paprika. Broil until cheese melts, about 2 minutes. Serve warm with toasted baguette slices.",
            "Whisk 4 tablespoons grated Romano cheese, light mayonnaise, light sour cream, dried marjoram, black pepper, onion salt, and garlic powder in medium bowl to blend. Stir in chopped artichoke hearts. Transfer mixture to 1 1/2-cup ramekin. (Can be prepared 1 day ahead. Cover mixture and refrigerate.)",
            "Preheat oven to 375°F. Bake dip until heated through, about 20 minutes (about 30 minutes if chilled).",
            "Preheat broiler. Sprinkle dip with remaining 1 tablespoon grated Romano cheese and paprika. Broil until cheese melts, about 2 minutes. Serve warm with toasted baguette slices."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57aa142447750f3f7bc358ef/6:4/w_274%2Ch_169/baked-artichoke-dip.jpg"
    }
}