{
    "recipe": {
        "title": "Baked Apples with Prunes, Almonds, and Amaretto ",
        "ingredients": [
            "1 teaspoon granulated sugar",
            "1 cup blanched almonds, divided",
            "8 tablespoons (1 stick) unsalted butter, melted, slightly cooled, divided",
            "1/3 cup prunes (about 8)",
            "3 tablespoons amaretto, plus more for drizzling",
            "4 tablespoons light brown sugar, divided",
            "Kosher salt",
            "4 Macintosh or other baking apples, cored",
            "1/4 cup chilled heavy cream"
        ],
        "instructions": [
            "Preheat oven to 300°F. Toss granulated sugar, 1/2 cup almonds, and 1 Tbsp. butter in a bowl. Spread out on a rimmed baking sheet; bake, tossing once or twice, until nuts are golden brown and sugar is caramelized, 10–12 minutes. Let cool.",
            "Process prunes, 3 Tbsp. amaretto, 2 Tbsp. brown sugar, 4 Tbsp. butter, a pinch of salt, and remaining 1/2 cup almonds in a food processor until nuts are ground and mixture forms a coarse paste. Transfer to a disposable piping bag or resealable plastic bag.",
            "Using a paring knife, cut a line around equators of apples, just scoring the skin but not cutting down into the flesh (this will prevent them from bursting during baking). Place each apple on individual squares of parchment paper large enough to form a pouch around apple.",
            "Snip a 1\" hole in pastry bag or one corner of plastic bag and pipe prune mixture into apple cavities to fill. Drizzle with remaining 3 Tbsp. butter, then sprinkle with remaining 2 Tbsp. brown sugar and lightly drizzle with amaretto.",
            "Gather up parchment paper around each apple and tie tightly closed with kitchen twine. Place parcels on a rimmed baking sheet and bake until apples give no resistance when a skewer is poked into flesh through parchment paper, 35–45 minutes for Macintosh or 50–65 minutes for firmer apples. Let cool slightly, then remove kitchen twine.",
            "To serve, top apples with caramelized almonds and drizzle with cream.",
            "Do Ahead Apples can be assembled in their parcels 1 day ahead; chill. Apples can be baked 2 hours ahead. Let sit at room temperature. Reheat in a 200°F oven just before serving.",
            "Apples can be assembled in their parcels 1 day ahead; chill. Apples can be baked 2 hours ahead. Let sit at room temperature. Reheat in a 200°F oven just before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58c6be207c80d64acc70ad1b/6:4/w_274%2Ch_169/baked-apples-with-prunes-almonds-and-amaretto-BA-031317.jpg",
        "color": 7467406
    }
}