{
    "recipe": {
        "title": "Baked Tomatoes ",
        "ingredients": [
            "1/2 loaf Italian bread (about 8 ounces)",
            "5 to 6 sprigs flat-leaf Italian parsley",
            "1 medium clove garlic",
            "1 tablespoon capers",
            "1 teaspoon salt",
            "3 tablespoons extra-virgin olive oil, or more as needed",
            "2 large tomatoes or 4 small ones"
        ],
        "instructions": [
            "1. Preheat the oven to 250°F. Cut away and discard the crust from the loaf of bread and cut the loaf in half lengthwise. Bake for 5 minutes on each side. Let cool for 10 to 15 minutes. 2. Raise the oven temperature to 350°F on convection heat or to 375°F in an oven without convection heat. 3. Cut the bread into chunks small enough to fit easily in a food processor. Place them in the food processor and pulse until you have fairly even crumbs that are not too fine. Set aside 1 cup of crumbs and reserve any extra for another use. 4. Finely chop enough parsley leaves to measure about 2 tablespoons. Peel and finely chop the garlic. Put the parsley, garlic, bread crumbs, capers, salt, and olive oil in a mixing bowl. Mix well until the ingredients are evenly distributed and the bread crumbs are well coated with the olive oil. If there doesn't seem to be enough olive oil to coat them all, add a little more. 5. Cut the tomatoes in half crosswise and scoop out all the seeds. Place the tomatoes, cut side up, on a baking sheet. Fill the cavities with a generous amount of the bread-crumb mixture, heaping it on top of each tomato half. 6. Bake until a brown crust forms, about 20 minutes. Serve hot or at room temperature.",
            "1. Preheat the oven to 250°F. Cut away and discard the crust from the loaf of bread and cut the loaf in half lengthwise. Bake for 5 minutes on each side. Let cool for 10 to 15 minutes.",
            "2. Raise the oven temperature to 350°F on convection heat or to 375°F in an oven without convection heat.",
            "3. Cut the bread into chunks small enough to fit easily in a food processor. Place them in the food processor and pulse until you have fairly even crumbs that are not too fine. Set aside 1 cup of crumbs and reserve any extra for another use.",
            "4. Finely chop enough parsley leaves to measure about 2 tablespoons. Peel and finely chop the garlic. Put the parsley, garlic, bread crumbs, capers, salt, and olive oil in a mixing bowl. Mix well until the ingredients are evenly distributed and the bread crumbs are well coated with the olive oil. If there doesn't seem to be enough olive oil to coat them all, add a little more.",
            "5. Cut the tomatoes in half crosswise and scoop out all the seeds. Place the tomatoes, cut side up, on a baking sheet. Fill the cavities with a generous amount of the bread-crumb mixture, heaping it on top of each tomato half.",
            "6. Bake until a brown crust forms, about 20 minutes. Serve hot or at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b17ae21cc76a014cfb0cb3/6:4/w_274%2Ch_169/395749_baked-tomatoes_1x1.jpg"
    }
}