{
    "recipe": {
        "title": "Baked Sardines in Pepperonata ",
        "ingredients": [
            "4 red bell peppers",
            "1/2 cup olive oil, plus more for drizzling",
            "1/2 medium red onion, thinly sliced",
            "2 garlic cloves, thinly sliced",
            "Kosher salt, freshly ground pepper",
            "2 tablespoons tomato paste",
            "1 tablespoon sugar",
            "1/2 cup dry white wine",
            "1/2 cup white wine vinegar",
            "2 tablespoons chopped fresh flat-leaf parsley",
            "2 tablespoons drained capers",
            "1/2 teaspoons dried oregano",
            "8 whole fresh sardines, scaled, gutted, deboned",
            "Chopped fresh dill and grilled crusty bread (for serving)"
        ],
        "instructions": [
            "Preheat broiler. Broil peppers on a broilerproof rimmed baking sheet, turning occasionally, until blistered all over, 8–10 minutes. Transfer to a medium bowl, cover with plastic wrap, and let sit 15 minutes. Peel, seed, and slice into 1/2\"-wide strips.",
            "Reduce oven temperature to 450°F. Heat 1/4 cup oil in a large skillet over medium heat. Add onion and garlic; season with salt and pepper and cook, stirring occasionally, until softened, 8–10 minutes. Increase heat to medium-high, add tomato paste and sugar and cook, stirring, until tomato paste is beginning to darken, about 1 minute. Add wine and vinegar and cook, stirring often, until slightly reduced, about 2 minutes. Mix in roasted peppers, parsley, capers, and oregano. Cook, stirring occasionally, until slightly thickened, about 5 minutes. Transfer pepperonata to a shallow 3-quart baking dish.",
            "Season sardines inside and out with salt and pepper; lay on top of pepperonata. Drizzle with oil and bake until sardines are firm and beginning to brown, 15–20 minutes. Top with dill, drizzle with more oil, and serve with bread."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad3ffc19925f464b3b2734/6:4/w_274%2Ch_169/51205500_pepperonata-sardines_1x1.jpg",
        "color": 10098087
    }
}