{
    "recipe": {
        "title": "Baked Feta and Greens with Lemony Yogurt ",
        "ingredients": [
            "6 Tbsp. extra-virgin olive oil, divided",
            "1 medium onion, sliced",
            "2 bunches hearty greens, such as collard greens and/or Tuscan kale, ribs and stems removed, leaves sliced",
            "1 1/2 tsp. curry powder, divided",
            "2 tsp. kosher salt, divided, plus more",
            "1 tsp. freshly ground black pepper, divided",
            "1 (1/2-lb.) block Greek or Bulgarian feta, sliced 1/2\" thick",
            "4 garlic cloves, crushed",
            "1 (15-oz.) can chickpeas, drained, rinsed",
            "1/2 cup plain whole-milk Greek yogurt",
            "1 Tbsp. fresh lemon juice",
            "Toasted country-style bread (for serving)"
        ],
        "instructions": [
            "Preheat oven to 350°. Heat 2 Tbsp. oil in a large heatproof skillet over medium. Add onion and cook, stirring occasionally, until softened, 6–8 minutes. Add greens in handfuls, letting wilt before adding another handful, and cook, stirring occasionally, until bright green and crisp-tender, about 5 minutes. Add 1/2 tsp. curry powder; season with 1 tsp. salt and 1/2 tsp. pepper. Stir to combine, then add 1 cup water. Lay feta over greens and transfer skillet to oven. Bake until feta is soft, 10–12 minutes.",
            "Meanwhile, heat remaining 4 Tbsp. oil in a medium nonstick skillet over medium. Add garlic and cook, stirring, until fragrant and just beginning to turn golden around the edges, about 2 minutes. Add chickpeas, season with 1 tsp. salt and 1/2 tsp. pepper, and continue to cook, tossing occasionally, until browned and crisp around the edges, 8–10 minutes. Add remaining 1 tsp. curry powder and toss to combine.",
            "Stir yogurt and lemon juice in a small bowl; season with a pinch of salt.",
            "Scatter chickpeas and toasted garlic over greens and feta. Dollop with seasoned yogurt. Serve with toast alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ad4fe57c191ad405a8ad289/6:4/w_274%2Ch_169/Baked-Feta-with-Frozen-Greens-03012018.jpg",
        "color": 11664554
    }
}