{
    "recipe": {
        "title": "Balsamic-Marinated Radicchio with Fresh Ricotta ",
        "ingredients": [
            "2 tablespoons balsamic vinegar",
            "5 garlic cloves, smashed",
            "1 teaspoon fresh lemon juice",
            "1/2 cup plus 2 tablespoon extra-virgin olive oil, divided, plus additional for drizzling",
            "1 pound radicchio (preferably Treviso), quartered lengthwise, or regular radicchio, cut into 2-inch wedges",
            "1/2 cup basil leaves",
            "1/2 pound fresh ricotta"
        ],
        "instructions": [
            "Preheat broiler. Whisk together vinegar, garlic, lemon juice, 1/2 cup oil, and 1/2 teaspoon each of salt and pepper in a large bowl. Put radicchio in a 4-sided sheet pan and toss with remaining 2 tablespoons oil. Broil 5 to 6 inches from heat, turning occasionally, until slightly wilted, 3 to 4 minutes. Add hot radicchio to balsamic marinade and gently toss to coat. Cover bowl (to keep heat in) and marinate, tossing once or twice, at least 1 hour. Transfer radicchio to a serving dish, pouring some of marinade over top. Scatter basil over radicchio. Drizzle ricotta with oil in a small bowl and serve with radicchio.",
            "Preheat broiler.",
            "Whisk together vinegar, garlic, lemon juice, 1/2 cup oil, and 1/2 teaspoon each of salt and pepper in a large bowl.",
            "Put radicchio in a 4-sided sheet pan and toss with remaining 2 tablespoons oil. Broil 5 to 6 inches from heat, turning occasionally, until slightly wilted, 3 to 4 minutes.",
            "Add hot radicchio to balsamic marinade and gently toss to coat. Cover bowl (to keep heat in) and marinate, tossing once or twice, at least 1 hour.",
            "Transfer radicchio to a serving dish, pouring some of marinade over top. Scatter basil over radicchio. Drizzle ricotta with oil in a small bowl and serve with radicchio.",
            "What to drink: Fontaleoni Vernaccia di San Gimignano '07",
            "Fontaleoni Vernaccia di San Gimignano '07"
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a5646a59cdb91b5ff4e8/6:4/w_274%2Ch_169/352870_hires.jpg"
    }
}