{
    "recipe": {
        "title": "Banana Meringue Pudding ",
        "ingredients": [
            "4 large eggs",
            "2/3 cup sugar",
            "1/4 cup cornstarch",
            "4 cups whole milk",
            "2 tablespoons unsalted butter",
            "2 teaspoons vanilla extract",
            "Pinch of kosher salt",
            "1 11-ounce box vanilla wafer cookies",
            "3 ripe bananas, thinly sliced",
            "4 large egg whites",
            "1/2 cup sugar"
        ],
        "instructions": [
            "Lightly whisk eggs in a large bowl just to blend. Whisk sugar and cornstarch in a medium saucepan. Gradually whisk milk into sugar mixture and heat over medium heat, whisking often, until very warm to the touch. Gradually whisk half of hot milk mixture into eggs, then whisk egg mixture back into milk mixture in saucepan.",
            "Cook, whisking constantly, until thickened and whisk leaves a trail in pudding (it should be the consistency of mayonnaise), about 4 minutes. Remove from heat, add butter, vanilla, and salt and whisk until butter is melted and mixture is smooth.",
            "Strain pudding through a fine-mesh sieve into another large bowl. Cover pudding with plastic wrap, pressing directly onto the surface. Chill until cool, about 2 hours.",
            "Assembly: Spread one-third of pudding evenly in a 2-qt. baking dish. Top with half of cookies and half of bananas. Repeat layers one more time and top with remaining third of pudding. Cover and chill at least 4 hours. Just before serving, heat broiler. Using an electric mixer on medium speed, beat egg whites until foamy. With motor running, gradually add sugar. Increase speed to medium-high and beat until stiff peaks form. Spoon meringue over pudding and swirl decoratively. Broil until meringue is dark brown in spots, about 1 minute. Do ahead: Pudding (without meringue) can be assembled 2 days ahead. Keep chilled",
            "Spread one-third of pudding evenly in a 2-qt. baking dish. Top with half of cookies and half of bananas. Repeat layers one more time and top with remaining third of pudding. Cover and chill at least 4 hours.",
            "Just before serving, heat broiler. Using an electric mixer on medium speed, beat egg whites until foamy. With motor running, gradually add sugar. Increase speed to medium-high and beat until stiff peaks form.",
            "Spoon meringue over pudding and swirl decoratively. Broil until meringue is dark brown in spots, about 1 minute.",
            "Do ahead: Pudding (without meringue) can be assembled 2 days ahead. Keep chilled"
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac378c6529d92b2c0391c9/6:4/w_274%2Ch_169/51235890_banana-meringue-pudding_1x1.jpg"
    }
}