{
    "recipe": {
        "title": "Bannock Two Ways ",
        "ingredients": [
            "2 cups (500 mL) all-purpose flour",
            "1 Tbsp (15 mL) baking powder",
            "1 Tbsp (15 mL) white sugar",
            "1/8 tsp salt",
            "2 Tbsp (30 mL) unsalted butter",
            "1 egg",
            "1/4 to 1/2 cup (60 to 125 mL) whole milk",
            "Oil, for frying",
            "For serving: Maple syrup, flaky sea salt",
            "2 cups (500 mL) all-purpose flour, plus extra for rolling",
            "2 1/2 tsp (12 mL) baking powder",
            "1/2 tsp (2 mL) salt",
            "3/4 to 1 cup (185 to 250 mL) water, to start",
            "Oil, for frying"
        ],
        "instructions": [
            "For Greg’s Bella Coola Bannock: Combine the flour, baking powder, sugar, and salt. Using a pastry cutter or knife, cut in the butter until the pieces are pea-sized. Mix in the egg, then pour in about 1/4 cup (60 mL) of milk. Mix together just until a dough forms, adding more milk if needed. Divide the dough into 10 to 12 biscuit-sized pieces. In a large frying pan, pour in about 1/4 inch (6 mm) of oil and heat over medium-high. When the oil is hot, fry the bannock—being careful not to crowd them—until golden brown. Serve immediately with maple syrup and flaky sea salt.",
            "Combine the flour, baking powder, sugar, and salt. Using a pastry cutter or knife, cut in the butter until the pieces are pea-sized. Mix in the egg, then pour in about 1/4 cup (60 mL) of milk. Mix together just until a dough forms, adding more milk if needed. Divide the dough into 10 to 12 biscuit-sized pieces. In a large frying pan, pour in about 1/4 inch (6 mm) of oil and heat over medium-high. When the oil is hot, fry the bannock—being careful not to crowd them—until golden brown. Serve immediately with maple syrup and flaky sea salt.",
            "For Doreen Crowe’s Bannock: In a large bowl, mix the flour, baking powder, salt, and water together to form a dough. If the dough is a bit dry, add more water 1 Tbsp (15 mL) at a time. Turn the dough out onto a floured surface and roll out into a 9×12-inch (23×30-cm) rectangle about 1/4-inch (6-mm) thick. Cut into approximately 3×3-inch (8×8-cm) squares. Heat about 1/4 inch (6 mm) of oil in a large frying pan over medium-high heat, and fry the bannock—being careful not to crowd them—until golden brown, about 2 minutes on each side. Serve warm.",
            "In a large bowl, mix the flour, baking powder, salt, and water together to form a dough. If the dough is a bit dry, add more water 1 Tbsp (15 mL) at a time. Turn the dough out onto a floured surface and roll out into a 9×12-inch (23×30-cm) rectangle about 1/4-inch (6-mm) thick. Cut into approximately 3×3-inch (8×8-cm) squares. Heat about 1/4 inch (6 mm) of oil in a large frying pan over medium-high heat, and fry the bannock—being careful not to crowd them—until golden brown, about 2 minutes on each side. Serve warm."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58b833363939dd22c615d71e/6:4/w_274%2Ch_169/bannock-030217.jpg"
    }
}