{
    "recipe": {
        "title": "Barbecue Chicken Hoecakes with Vinegar Slaw ",
        "ingredients": [
            "1 1/2 pounds skinless boneless chicken thighs",
            "Olive oil",
            "Brown Sugar and Coffee Barbecue Sauce",
            "1 cup yellow cornmeal",
            "1/2 cup all purpose flour",
            "2 teaspoons sugar",
            "1 teaspoon baking powder",
            "3/4 teaspoon salt",
            "1 cup water",
            "2 tablespoons (1/4 stick) butter, melted, plus additional for griddle",
            "3/4 cup coarsely grated sharp cheddar cheese",
            "Vinegar Slaw",
            "2 cups wood chips (such as hickory, apple, or cherry), soaked in 2 cups water for 1 hour, then drained; 13x9x1-inch disposable aluminum foil baking pan"
        ],
        "instructions": [
            "Prepare barbecue (medium-high heat). Spread drained wood chips in disposable foil pan. Remove grill racks from barbecue. Place foil pan with wood chips directly atop hot coals (for charcoal barbecue) or over flames (for gas barbecue). Return grill rack to barbecue. Brush chicken with oil; sprinkle with salt and pepper. When wood chips begin to smoke, place chicken on grill rack above pan with wood chips. Cover grill and smoke chicken until cooked through, turning occasionally, about 18 minutes. Transfer to large bowl and cool slightly. Shred chicken into bite-size strips; place in same bowl. Mix 2 1/2 cups barbecue sauce into chicken. DO AHEAD: Can be made 1 day ahead. Cover and chill. Rewarm chicken in barbecue sauce over medium-low heat before using, adding more barbecue sauce to moisten mixture, if needed.",
            "For hoecakes: Preheat oven to 300°F. Mix first 5 ingredients in medium bowl. Add 1 cup water and melted butter and whisk until well blended. Heat griddle or large nonstick skillet over medium-high heat. Brush with additional melted butter. Working in batches, pour batter by 1/4 cupfuls onto griddle. Using back of spoon, immediately spread batter for each cake into oval shape about 4x21/2 inches; cook until bottom is golden brown, about 2 minutes. Turn cakes over and cook until bottoms are golden brown, 1 to 2 minutes longer. Place hoecakes on baking sheet and transfer to oven to keep warm while making remaining cakes. Place 2 hoecakes on each of 6 plates; sprinkle 1 tablespoon cheddar cheese over each cake. Top each with warm chicken in barbecue sauce. Spoon Vinegar Slaw atop chicken and serve.",
            "Preheat oven to 300°F. Mix first 5 ingredients in medium bowl. Add 1 cup water and melted butter and whisk until well blended. Heat griddle or large nonstick skillet over medium-high heat. Brush with additional melted butter. Working in batches, pour batter by 1/4 cupfuls onto griddle. Using back of spoon, immediately spread batter for each cake into oval shape about 4x21/2 inches; cook until bottom is golden brown, about 2 minutes. Turn cakes over and cook until bottoms are golden brown, 1 to 2 minutes longer. Place hoecakes on baking sheet and transfer to oven to keep warm while making remaining cakes. Place 2 hoecakes on each of 6 plates; sprinkle 1 tablespoon cheddar cheese over each cake. Top each with warm chicken in barbecue sauce. Spoon Vinegar Slaw atop chicken and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3e03d460b4423363f5e4d/6:4/w_274%2Ch_169/354910_chicken-hoecakes_1x1.jpg"
    }
}