{
    "recipe": {
        "title": "Barbecue-Flavored Chickpea Sandwiches ",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil or 2 tablespoons vegetable broth or water",
            "1 medium onion, quartered and sliced",
            "1 medium red bell pepper, cut into short, narrow strips",
            "2/3 cup homemade No-Cook Barbecue Sauce, or store-bought",
            "2 teaspoons good-quality chili powder",
            "1 1/2 to 2 cups cooked or canned (drained and rinsed) chickpeas",
            "2 large fresh pitas, preferably whole wheat",
            "Finely shredded romaine lettuce to taste",
            "Fresh green sprouts, such as broccoli sprouts or pea shoots, to taste (optional)",
            "2 medium ripe fresh tomatoes, thinly sliced"
        ],
        "instructions": [
            "Heat the oil, broth, or water in a medium skillet. Add the onion and sauté. until golden. Add the bell pepper, barbecue sauce, and chili powder, then stir in the chickpeas. Cook over medium heat until the sauce is reduced and envelops the chickpeas and veggies nicely, about 8 minutes. Place whole or half pitas on each serving plate, depending on appetites and what else is being served. Insert a generous amount of lettuce and sprouts and a few slices of tomato into each pita, followed by the chickpea mixture. Eat at once, out of hand.",
            "Heat the oil, broth, or water in a medium skillet. Add the onion and sauté. until golden. Add the bell pepper, barbecue sauce, and chili powder, then stir in the chickpeas. Cook over medium heat until the sauce is reduced and envelops the chickpeas and veggies nicely, about 8 minutes.",
            "Place whole or half pitas on each serving plate, depending on appetites and what else is being served. Insert a generous amount of lettuce and sprouts and a few slices of tomato into each pita, followed by the chickpea mixture. Eat at once, out of hand.",
            "Variations: Substitute 8 ounces of well-drained, well-blotted extra-firm tofu or tempeh, cut into 1/2- inch dice, for the chickpeas. Add half a medium ripe avocado, peeled and thinly sliced, to the sandwiches with the lettuce and tomato.",
            "Substitute 8 ounces of well-drained, well-blotted extra-firm tofu or tempeh, cut into 1/2- inch dice, for the chickpeas.",
            "Add half a medium ripe avocado, peeled and thinly sliced, to the sandwiches with the lettuce and tomato."
        ],
        "picture_link": "https://assets.epicurious.com/photos/595d02e5cc3bca562f8c0c04/6:4/w_274%2Ch_169/barbecue-chickpea-sandwiches-recipe-HC-070517.jpg"
    }
}