{
    "recipe": {
        "title": "Barley Soup with Duck Confit and Root Vegetables ",
        "ingredients": [
            "1/2 cup pearl barley",
            "7 cups water",
            "2 confit duck legs*",
            "2 medium carrots, peeled, quartered lengthwise, then cut crosswise into 1/4-inch-thick pieces (1 cup)",
            "2 medium parsnips, peeled, quartered lengthwise, then cut crosswise into 1/4-inch-thick pieces (1 3/4 cups)",
            "1 garlic clove, finely chopped",
            "3 cups reduced-sodium chicken broth (24 fl oz)",
            "3/4 teaspoon salt",
            "1/4 teaspoon black pepper",
            "1 teaspoon chopped fresh thyme"
        ],
        "instructions": [
            "Simmer barley in 4 cups water, uncovered, in a 5- to 6-quart heavy pot, until almost tender, 20 to 40 minutes. Drain in a sieve. Remove skin and any fat from duck legs. Cook skin and fat in a 1- to 1 1/2-quart heavy saucepan over low heat, stirring occasionally, until fat is rendered, about 8 minutes, then strain through a fine-mesh sieve into a small bowl, discarding skin. Reserve fat. While fat is rendering, remove duck meat from bones, reserving bones, and shred meat into small pieces. Heat 1 tablespoon duck fat (reserving any remainder for another use) in cleaned 5- to 6-quart pot over moderately high heat until hot but not smoking, then sauté carrots and parsnips, stirring frequently, until just golden, about 8 minutes. Add garlic and cook, stirring, 1 minute. Stir in broth, parboiled barley, salt, pepper, duck bones, and remaining 3 cups water and bring to a boil. Reduce heat and simmer, uncovered, stirring occasionally, until vegetables and barley are tender, 15 to 20 minutes. Discard bones and stir in shredded duck meat. Skim any excess fat from top of soup, then stir in thyme. Season with salt and pepper.",
            "Simmer barley in 4 cups water, uncovered, in a 5- to 6-quart heavy pot, until almost tender, 20 to 40 minutes. Drain in a sieve.",
            "Remove skin and any fat from duck legs. Cook skin and fat in a 1- to 1 1/2-quart heavy saucepan over low heat, stirring occasionally, until fat is rendered, about 8 minutes, then strain through a fine-mesh sieve into a small bowl, discarding skin. Reserve fat.",
            "While fat is rendering, remove duck meat from bones, reserving bones, and shred meat into small pieces.",
            "Heat 1 tablespoon duck fat (reserving any remainder for another use) in cleaned 5- to 6-quart pot over moderately high heat until hot but not smoking, then sauté carrots and parsnips, stirring frequently, until just golden, about 8 minutes. Add garlic and cook, stirring, 1 minute.",
            "Stir in broth, parboiled barley, salt, pepper, duck bones, and remaining 3 cups water and bring to a boil. Reduce heat and simmer, uncovered, stirring occasionally, until vegetables and barley are tender, 15 to 20 minutes. Discard bones and stir in shredded duck meat. Skim any excess fat from top of soup, then stir in thyme. Season with salt and pepper.",
            "*Available at dartagnan.com.",
            "*Available at dartagnan.com."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de5c2f9a84192308a7c81/6:4/w_274%2Ch_169/232784.jpg"
    }
}