{
    "recipe": {
        "title": "BA's Best Apple Cider Doughnuts ",
        "ingredients": [
            "2 (3-inch) cinnamon sticks",
            "3 cups apple cider",
            "1/2 cup apple butter",
            "1/2 cup buttermilk",
            "2 teaspoons vanilla extract",
            "1 tablespoon plus 2 teaspoons baking powder",
            "1 teaspoon kosher salt",
            "1/4 teaspoon baking soda",
            "1/4 teaspoon freshly grated nutmeg",
            "3 1/2 cups all-purpose flour, plus more for dusting",
            "1 tablespoon plus 1 teaspoon ground cinnamon, divided",
            "6 tablespoons unsalted butter, room temperature",
            "1/4 cup (packed) light brown sugar",
            "1 1/4 cups granulated sugar",
            "2 large eggs",
            "Vegetable oil (for frying; about 4 cups)",
            "A 3 1/4-inch-diameter cutter, 1 1/4-inch-diameter cutter, deep-fry thermometer"
        ],
        "instructions": [
            "Bring cinnamon sticks and apple cider to a boil in a large skillet over medium-high heat and cook until liquid is thick, syrupy, and reduced to about 1/3 cup, 20–30 minutes. Scrape into a medium bowl and whisk in apple butter, buttermilk, and vanilla until incorporated; set aside.",
            "Whisk baking powder, salt, baking soda, nutmeg, 3 1/2 cups flour, and 1 tsp. ground cinnamon in a medium bowl. Using an electric mixer on medium-high speed, beat butter, brown sugar, and 1/4 cup granulated sugar in a large bowl until light and fluffy, about 4 minutes. Add eggs one at a time, beating until well blended after each addition. Reduce mixer speed to low and add dry ingredients in 2 additions, alternating with cider mixture in 2 additions, starting with dry ingredients and ending with cider mixture (dough will be very soft and sticky).",
            "Scrape dough onto a parchment lined-rimmed baking sheet thoroughly dusted with flour (about 1/3 cup). Dust hands and top of dough with more flour, then gently pat dough to 3/4\" thick. Dust with more flour and tightly cover with plastic wrap; chill dough at least 3 hours.",
            "Whisk remaining 1 cup granulated sugar and 1 Tbsp. cinnamon in a small bowl until no lumps remain.",
            "Working on baking sheet, punch out as many rounds as you can with 3 1/4\" cutter, then use 1 1/4\" cutter to punch out center of each round. Gather doughnut scraps, reserving holes, and gently re-roll without overworking dough; repeat until all dough has been used (you should have 18 doughnuts).",
            "Set a wire rack inside a paper towel-lined rimmed baking sheet. Fit a large pot with deep-fry thermometer and pour in oil to a depth of 3\". Heat over medium-high until thermometer registers 350°F. Working in batches, fry doughnuts until deep golden brown, about 3 minutes per side. Transfer to prepared rack and let cool slightly. Fry doughnut holes until deep golden brown, about 2 minutes per side. Transfer to prepared rack and let cool slightly. Toss warm doughnuts and doughnut holes in cinnamon sugar.",
            "Do Ahead Dough can be made 1 day ahead; cover and chill.",
            "Dough can be made 1 day ahead; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59cbc7bf5e04956c2c577d6b/6:4/w_274%2Ch_169/apple-cider-doughnuts.jpg"
    }
}