{
    "recipe": {
        "title": "BA's Best Morning Buns ",
        "ingredients": [
            "1 (1/4-ounce) envelope active dry yeast (about 2 1/4 teaspoons)",
            "1 cup whole milk, warmed, plus 1/4 cup chilled milk",
            "1 teaspoon plus 1/4 cup honey",
            "4 large eggs, separated, plus 1 large egg yolk",
            "3 1/2 cups (or more) bread flour, divided",
            "1 cup whole wheat flour",
            "2 teaspoons Diamond Crystal or 1 teaspoon Morton kosher salt",
            "2 teaspoons finely grated orange zest (optional)",
            "2 teaspoons vanilla extract",
            "1 cup (2 sticks) unsalted butter, cut into pieces, room temperature",
            "3/4 cup (packed) light brown sugar",
            "1 tablespoon ground cinnamon",
            "3/4 teaspoon ground cardamom",
            "1/2 cup honey, divided",
            "12 tablespoons (1 1/2 sticks) unsalted butter, divided",
            "Bread flour (for surface)",
            "Nonstick vegetable oil spray",
            "Fine sanding sugar or granulated sugar (for sprinkling)"
        ],
        "instructions": [
            "Whisk yeast, 1 cup warm milk, and 1 tsp. honey in the bowl of an electric mixer fitted with paddle attachment to combine, then let sit until foamy, about 5 minutes. Add egg whites, 2 cups bread flour, and remaining 1/4 cup honey and beat with paddle on medium-high speed until mixture is very light and thick, about 3 minutes. Remove paddle, scrape mixture back into bottom of bowl, and sprinkle whole wheat flour and 1 1/2 cups bread flour over top (do not stir). Place bowl in a warm spot and let sit uncovered until mixture is bubbling up around flour, 30–40 minutes.",
            "Add salt, orange zest (if using), vanilla extract, 5 egg yolks, and remaining 1/4 cup cold milk to mixture and mix with dough hook on low speed until a shaggy dough forms. Increase speed to medium and work dough until it is smooth, soft, and elastic and climbing up the hook, 8–10 minutes (it will clear the sides of the bowl but still stick slightly to the bottom; if after 5 minutes the dough is still very sticky, add bread flour a tablespoonful at a time until dough is just tacky). Reduce mixer speed to medium-low and add butter pieces one at a time, letting dough absorb butter completely before adding the next piece. This part takes a while, so be patient. Dough should be very smooth and slightly tacky and have a soft, buoyant texture. Cover and chill at least 8 hours and up to 16 hours.",
            "Filling and assembly: Cook brown sugar, cinnamon, cardamom, 1/4 cup honey, and 8 Tbsp. butter in a small saucepan over low heat, stirring constantly, just until butter is melted and mixture is smooth. Let cool. Punch down dough and turn out onto a lightly floured surface. Divide in half, place 1 piece back into bowl, cover, and chill while you work. Roll out remaining piece of dough on a sheet of lightly floured parchment paper to roughly a 16x12\" rectangle. Spread half of brown sugar mixture over dough. Starting at side closest to you (make sure it’s a long side) and using the parchment paper to help you, roll dough into a tight log. If dough gets too warm or sticky to work with, slide (with parchment) onto a baking sheet and chill until firm, then proceed. Place log, seam side down, on a rimmed baking sheet. Chill until firm, 20–30 minutes. Repeat process with second half of dough and remaining brown sugar mixture. Spray cups of two 12-cup muffin pans with nonstick spray. Place a rack in center of oven and preheat to 350°F. Trim chilled dough logs about 1/2\" from ends and cut each on a slight diagonal into 12 equal pieces. Place, cut side up, in prepared muffin pan and cover loosely with plastic wrap. Let sit at room temperature until puffed and expanded to edges of muffin cups (dough will spring back when poked but hold a slight indentation), 25–35 minutes. Bake buns, rotating pans once left to right and front to back, until golden brown all over, 20–25 minutes. Meanwhile, heat remaining 4 Tbsp. butter and remaining 1/4 cup honey in a small saucepan over low, stirring a bit, until smooth. Remove from heat. Pull buns out of oven and brush tops with butter mixture; sprinkle with sanding sugar. Transfer buns to a wire rack (if sugar cools in pan, it will harden and buns will stick); let cool.",
            "Cook brown sugar, cinnamon, cardamom, 1/4 cup honey, and 8 Tbsp. butter in a small saucepan over low heat, stirring constantly, just until butter is melted and mixture is smooth. Let cool.",
            "Punch down dough and turn out onto a lightly floured surface. Divide in half, place 1 piece back into bowl, cover, and chill while you work. Roll out remaining piece of dough on a sheet of lightly floured parchment paper to roughly a 16x12\" rectangle. Spread half of brown sugar mixture over dough. Starting at side closest to you (make sure it’s a long side) and using the parchment paper to help you, roll dough into a tight log. If dough gets too warm or sticky to work with, slide (with parchment) onto a baking sheet and chill until firm, then proceed. Place log, seam side down, on a rimmed baking sheet. Chill until firm, 20–30 minutes.",
            "Repeat process with second half of dough and remaining brown sugar mixture. Spray cups of two 12-cup muffin pans with nonstick spray. Place a rack in center of oven and preheat to 350°F.",
            "Trim chilled dough logs about 1/2\" from ends and cut each on a slight diagonal into 12 equal pieces. Place, cut side up, in prepared muffin pan and cover loosely with plastic wrap. Let sit at room temperature until puffed and expanded to edges of muffin cups (dough will spring back when poked but hold a slight indentation), 25–35 minutes.",
            "Bake buns, rotating pans once left to right and front to back, until golden brown all over, 20–25 minutes.",
            "Meanwhile, heat remaining 4 Tbsp. butter and remaining 1/4 cup honey in a small saucepan over low, stirring a bit, until smooth. Remove from heat.",
            "Pull buns out of oven and brush tops with butter mixture; sprinkle with sanding sugar. Transfer buns to a wire rack (if sugar cools in pan, it will harden and buns will stick); let cool."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59233d784bc0fc506addbe80/6:4/w_274%2Ch_169/morning-buns-BA-052217.jpg"
    }
}