{
    "recipe": {
        "title": "BA's Best Deep-Dish Apple Pie ",
        "ingredients": [
            "3 1/2 cups all-purpose flour",
            "2 tablespoons granulated sugar",
            "1 1/2 teaspoons kosher salt",
            "1 1/2 cups (3 sticks) chilled unsalted butter, cut into pieces",
            "2 tablespoons apple cider vinegar",
            "4 pounds Pink Lady apples, peeled, cored, thinly sliced",
            "1/3 cup (packed) dark brown sugar",
            "1/4 cup granulated sugar",
            "2 tablespoons fresh lemon juice",
            "2 teaspoons ground cinnamon",
            "1/2 teaspoon kosher salt",
            "1/4 teaspoon ground allspice",
            "1/4 teaspoon ground cardamom",
            "All-purpose flour (for surface)",
            "1 1/2 cups unfiltered apple cider",
            "1 vanilla bean, split lengthwise",
            "2 tablespoons cornstarch",
            "1 large egg",
            "2 tablespoons chilled unsalted butter, cut into pieces",
            "Demerara sugar (for sprinkling)",
            "A 9-inch deep pie dish"
        ],
        "instructions": [
            "Pulse flour, sugar, and salt in food processor to combine. Add butter and process until largest pieces of butter are pea-size. Transfer to a large bowl. Combine vinegar and 1/2 cup ice water in a small bowl and drizzle over flour mixture, mixing with a fork to combine. Mix until shaggy pieces form, then knead in bowl a couple of times with your hands to bring together into a shaggy dough (it will look quite dry). Transfer large clumps of dough to work surface, drizzle 1 Tbsp. ice water over remaining flour mixture in bowl and knead again to bring it together. Add to dough on work surface. Working with half of the dough, press into a single mass, incorporating dry bits, then pat down to make a 3/4\"-thick square. Using a bench scraper or knife, divide dough into 4 pieces. Stack pieces on top of one another, placing any unincorporated dry bits in between layers, and press down to combine. Form dough into a 3/4\"-thick disk and wrap tightly in plastic. Repeat with remaining dough. Chill at least 2 hours. Toss apples with brown sugar, granulated sugar, lemon juice, cinnamon, salt, allspice, and cardamom in a large bowl to coat. Let apples sit until they start to release their juices, at least 1 hour and up to 3 hours. Let dough sit at room temperature 5 minutes to soften. Working one at a time, roll out disks of dough on a lightly floured surface 1/8\" thick. Place each on a parchment-lined baking sheet and chill while you prepare the filling. Preheat oven to 375°F. Place apple cider in a medium saucepan and scrape in seeds from vanilla bean; add pod. Bring to a boil and cook, whisking occasionally, until reduced by two-thirds. Pour off juices that have accumulated in bowl of apples and add to apple cider. Return to a boil and cook until reduced to about 1/2 cup; remove vanilla pod. Stir cornstarch into 3 Tbsp. water in a small bowl to dissolve, then whisk into apple cider. Cook, whisking constantly, until cider mixture is very thick and bubbling, about 1 minute. Let cool slightly, then scrape over apples; toss to coat. Carefully transfer dough round to pie dish. Lift up edges and allow dough to slump down into dish (if too cold to be pliable, let it warm up slightly first). Trim, leaving about 1\" overhang. Beat egg with 1 tsp. water in a small bowl and brush over edges of dough. Scrape in apple filling, creating a mound in the center; dot filling with butter. Place remaining dough round over filling. Trim edges of top round, leaving a 1/2\" overhang. Fold edge of bottom round up and over; press together to seal. Crimp edge and brush top with remaining egg wash. Sprinkle with demerara sugar and cut a few vents in top. Place pie on a foil-lined rimmed baking sheet and chill in freezer 10 minutes. Bake pie until crust is deep golden brown and juices are thick and bubbling, 1 1/2–2 hours (yes: 2 hours!). Transfer pie to a wire rack and let cool at least 4 hours before serving.",
            "Pulse flour, sugar, and salt in food processor to combine. Add butter and process until largest pieces of butter are pea-size. Transfer to a large bowl.",
            "Combine vinegar and 1/2 cup ice water in a small bowl and drizzle over flour mixture, mixing with a fork to combine. Mix until shaggy pieces form, then knead in bowl a couple of times with your hands to bring together into a shaggy dough (it will look quite dry). Transfer large clumps of dough to work surface, drizzle 1 Tbsp. ice water over remaining flour mixture in bowl and knead again to bring it together. Add to dough on work surface. Working with half of the dough, press into a single mass, incorporating dry bits, then pat down to make a 3/4\"-thick square. Using a bench scraper or knife, divide dough into 4 pieces. Stack pieces on top of one another, placing any unincorporated dry bits in between layers, and press down to combine. Form dough into a 3/4\"-thick disk and wrap tightly in plastic. Repeat with remaining dough. Chill at least 2 hours.",
            "Toss apples with brown sugar, granulated sugar, lemon juice, cinnamon, salt, allspice, and cardamom in a large bowl to coat. Let apples sit until they start to release their juices, at least 1 hour and up to 3 hours.",
            "Let dough sit at room temperature 5 minutes to soften. Working one at a time, roll out disks of dough on a lightly floured surface 1/8\" thick. Place each on a parchment-lined baking sheet and chill while you prepare the filling.",
            "Preheat oven to 375°F. Place apple cider in a medium saucepan and scrape in seeds from vanilla bean; add pod. Bring to a boil and cook, whisking occasionally, until reduced by two-thirds. Pour off juices that have accumulated in bowl of apples and add to apple cider. Return to a boil and cook until reduced to about 1/2 cup; remove vanilla pod. Stir cornstarch into 3 Tbsp. water in a small bowl to dissolve, then whisk into apple cider. Cook, whisking constantly, until cider mixture is very thick and bubbling, about 1 minute. Let cool slightly, then scrape over apples; toss to coat.",
            "Carefully transfer dough round to pie dish. Lift up edges and allow dough to slump down into dish (if too cold to be pliable, let it warm up slightly first). Trim, leaving about 1\" overhang. Beat egg with 1 tsp. water in a small bowl and brush over edges of dough. Scrape in apple filling, creating a mound in the center; dot filling with butter. Place remaining dough round over filling. Trim edges of top round, leaving a 1/2\" overhang. Fold edge of bottom round up and over; press together to seal. Crimp edge and brush top with remaining egg wash. Sprinkle with demerara sugar and cut a few vents in top. Place pie on a foil-lined rimmed baking sheet and chill in freezer 10 minutes.",
            "Bake pie until crust is deep golden brown and juices are thick and bubbling, 1 1/2–2 hours (yes: 2 hours!). Transfer pie to a wire rack and let cool at least 4 hours before serving.",
            "Do Ahead Dough can be made 5 days ahead. Keep chilled, or freeze up to 1 month. Pie can be made 1 day ahead. Let cool; store covered with foil at room temperature.",
            "Dough can be made 5 days ahead. Keep chilled, or freeze up to 1 month. Pie can be made 1 day ahead. Let cool; store covered with foil at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a05db11e2fcb73e385c02e8/6:4/w_274%2Ch_169/deep-dish-apple-pie-recipe-BA-111017.jpg"
    }
}