{
    "recipe": {
        "title": "Basic Mead ",
        "ingredients": [
            "12 to 18 pounds of grade-A honey",
            "4 1/2 gallons of tap or bottled water",
            "8 grams (1/4 ounce) of freeze-dried wine, champagne, or dedicated mead yeast"
        ],
        "instructions": [
            "Making mead requires essentially the same basic kit necessary to brew beer at home: primary and secondary plastic-bucket fermenters with air locks and spigots, transfer hosing, a bottle-filler tube, heavy bottles, bottle caps, bottle capper, and a bottle brush and washer. You should be able to find these items for approximately $70 total (excluding the bottles) through a home-brewing supplier, such as The Home Brewery. Bottles cost from $6 to $20 per dozen, depending on style. You might instead buy a couple of cases of beer in returnable bottles, drink the beer, and — after sanitizing them! — reuse those bottles, for the cost of the deposit.",
            "All your equipment must be sanitized or sterilized before use. Ordinary unscented household bleach does the job fine. Put all the equipment (including the lid and stirring spoons) into the fermentation bucket, fill with water, and add 2 teaspoons of unscented bleach. Let it sit for 30 minutes. Drain the water through the spigot, rinse everything in hot water, and allow to air-dry.",
            "Bring the 4 1/2 gallons of water to a boil. Well water, by the way, should be avoided because of potentially high levels of strong tasting minerals like iron. Boiling should remove harsh chlorine from municipal tap water. If you don't own a pot large enough to hold five gallons of water, boil as much as possible. You will add the remaining water to the fermenter later.",
            "Once the water reaches a boil, remove it from the heat and stir in all of the honey. Do not boil the honey, as it reduces the aromatic quality of the finished mead.",
            "While the honey dissolves in the water, put a cup of lukewarm (90 to 100°F) water into a clean bowl. Sprinkle in the yeast and cover the bowl with plastic wrap. When the honey has been fully dissolved in the water and the pot is cool to the touch (not over 80°F), pour the honey-water into the fermentation bucket and stir in the yeast mixture. Note: Cooling the honey-water should take about half an hour. This process can be accelerated with a so-called sink bath, that is, repeatedly immersing the pot in cold water in a sink or basin.",
            "If you have not already added the full 4 1/2 gallons of water, top it off with the balance in bottled water (or tap water if you're confident of its quality).",
            "Seal the bucket and allow the mixture to ferment for two weeks to one month. The progress of fermentation can judged by monitoring the carbon-dioxide bubbles escaping from the air lock: When they drop to one bubble every sixty seconds, fermentation has nearly concluded. Note that is only an issue during this primary fermentation; secondary fermentation has more to do with aging and mellowing and hence is more flexible. When primary fermentation has subsided, siphon the mead over to your secondary fermentation bucket and seal it. Allow one to four months aging time. Do not open the fermenter, as this risks contaminating the mead.",
            "When you decide it has matured enough (and the mead has cleared), you will want to siphon it into sterilized bottles and cap them. Follow the same procedure as you would for home-brewed beer. My book Beer for Dummies has a detailed guide in its Chapter Ten, or consult the web site of the American Homebrewers Association.",
            "Keep in mind that this is a recipe for still (i.e., non-carbonated) mead.",
            "Mead typically improves with age, so the longer you can wait to open the bottles, the better."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5799099920ada1484ddf2ff5/6:4/w_274%2Ch_169/basic-mead.jpg"
    }
}