{
    "recipe": {
        "title": "Basic Oven-Baked Marinated Tempeh ",
        "ingredients": [
            "2 tablespoons tamari or shoyu soy sauce",
            "1 1/2 tablespoons vinegar (white, cider, balsamic, rice, red- or white-wine — whatever you have on hand or goes with the flavors of whatever your end-use recipe is)",
            "1 teaspoon Pickapeppa (optional but good) (see tip, below)",
            "Any combination of the seasonings (see note; optional)",
            "1 tempeh cake (8 ounces), cut in the size or shape appropriate to use",
            "Cooking spray"
        ],
        "instructions": [
            "1. Combine the tamari, vinegar, and Pickapeppa in a nonreactive dish and stir to combine. If using additional seasoning (see below), add it here. Add the tempeh. Marinate at room temperature, turning occasionally, for 20 minutes to 1 hour or refrigerated for up to 2 days. 2. Fifteen minutes before you are ready to cook the tempeh, preheat the oven to 375°F. 3. Place the marinated tempeh pieces on a nonstick baking sheet or one that has been sprayed with cooking spray, allowing plenty of air space between chunks. Bake for 12 to 15 minutes, then flip the pieces over and bake for another 10 minutes. Remove from the oven and use as desired.",
            "1. Combine the tamari, vinegar, and Pickapeppa in a nonreactive dish and stir to combine. If using additional seasoning (see below), add it here. Add the tempeh. Marinate at room temperature, turning occasionally, for 20 minutes to 1 hour or refrigerated for up to 2 days.",
            "2. Fifteen minutes before you are ready to cook the tempeh, preheat the oven to 375°F.",
            "3. Place the marinated tempeh pieces on a nonstick baking sheet or one that has been sprayed with cooking spray, allowing plenty of air space between chunks. Bake for 12 to 15 minutes, then flip the pieces over and bake for another 10 minutes. Remove from the oven and use as desired.",
            "Seasoning Tempeh The above is a basic recipe, designed to be compatible with almost any finished recipe. But the marinade can certainly be zapped up to good effect.",
            "The above is a basic recipe, designed to be compatible with almost any finished recipe. But the marinade can certainly be zapped up to good effect.",
            "Try any one to three of the following additions: • 1 to 3 cloves garlic, pressed • 1 to 2 teaspoons peeled grated ginger • 1/4 to 1/2 teaspoon freshly ground black pepper • 1 to 2 teaspoons honey • 1 teaspoon ground coriander • 1 to 2 teaspoons toasted sesame oil • 1/2 to 1 teaspoon Tabasco or other hot sauce • 1 tablespoon ketchup or tomato paste",
            "• 1 to 3 cloves garlic, pressed",
            "• 1 to 2 teaspoons peeled grated ginger",
            "• 1/4 to 1/2 teaspoon freshly ground black pepper",
            "• 1 to 2 teaspoons honey",
            "• 1 teaspoon ground coriander",
            "• 1 to 2 teaspoons toasted sesame oil",
            "• 1/2 to 1 teaspoon Tabasco or other hot sauce",
            "• 1 tablespoon ketchup or tomato paste"
        ],
        "picture_link": "https://assets.epicurious.com/photos/57b36085ac22d6f011673fe3/6:4/w_274%2Ch_169/basic-oven-baked-marinated-tempeh.jpg"
    }
}