{
    "recipe": {
        "title": "Basic Barbecue Sauce ",
        "ingredients": [
            "3 tablespoons vegetable oil",
            "1 medium-size onion, minced",
            "1 clove garlic, minced",
            "1/4 green bell pepper, cored, seeded, and minced",
            "1/2 cup ketchup",
            "1/2 cup tomato sauce",
            "3 tablespoons cider vinegar, or more to taste",
            "3 tablespoons Worcestershire sauce",
            "2 tablespoons fresh lemon juice",
            "2 tablespoons pineapple juice (optional)",
            "1 teaspoon of your favorite hot sauce, or more to taste",
            "1/2 teaspoon liquid smoke, or 2 tablespoons meat drippings",
            "2 tablespoons molasses",
            "3 tablespoons dark brown sugar, or more to taste",
            "2 tablespoons prepared mustard of your choice",
            "1 teaspoon dry mustard",
            "1/2 teaspoon freshly ground black pepper",
            "Salt"
        ],
        "instructions": [
            "1. Heat the oil in a large nonreactive saucepan over medium heat. Add the onion, garlic, and bell pepper and cook until softened but not brown, about 4 minutes.",
            "2. Stir in the ketchup, tomato sauce, cider vinegar, Worcestershire sauce, lemon juice, pineapple juice (if using), hot sauce, liquid smoke, molasses, brown sugar, prepared and dry mustards, black pepper, and 1 cup of water and bring to a boil. Reduce the heat to low and let the sauce simmer, uncovered, until thickened, about 15 minutes, stirring often to prevent scorching. If the sauce becomes too thick, add a little more water.",
            "3. Remove the barbecue sauce from the heat and taste for seasoning, adding salt to taste and more cider vinegar, hot sauce, and/or brown sugar as necessary; the sauce should be highly seasoned.",
            "4. Transfer the barbecue sauce to a serving bowl and serve warm or at room temperature. The sauce will keep, tightly covered in the refrigerator, for several weeks."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5748b32a43a386796caf9e38/6:4/w_274%2Ch_169/shutterstock_224976823.jpg"
    }
}