{
    "recipe": {
        "title": "Basic Clafoutis ",
        "ingredients": [
            "1 cup whole milk",
            "3 eggs",
            "1/2 cup sugar",
            "1 teaspoon vanilla extract",
            "2 tablespoons butter, melted",
            "1/2 cup all-purpose flour"
        ],
        "instructions": [
            "1. Preheat the oven to 325°F. In a large bowl, whisk together the milk, eggs, sugar, vanilla, and butter until the sugar is dissolved. Add the flour and whisk until smooth. Pour the batter into a cast iron skillet or pie pan. 2. Now add your favorite fruit or flavoring (see below). Bake until the clafoutis is beautifully puffed and golden, 35–40 minutes. Serve immediately. Clafoutis Variations: Concord Grape Clafoutis: Once the batter is in the skillet, scatter 2 cups slightly crushed Concord or other black or red grapes on top. Cherry Clafoutis: Scatter 2 cups pitted cherries onto the batter once it's poured into pie plates. Pear Clafoutis with Pear Eau de Vie: Core 1 ripe pear and cut into pieces. Pour the batter into the skillet and top with the pear pieces. Bake. Drizzle with 2 tablespoons eau de vie and serve immediately. Milk Chocolate and Hazelnut Clafoutis: Melt 1 cup chopped milk chocolate in a large mixing bowl set above a simmering pot of water. Fold in the clafoutis batter until smooth and fully incorporated. Pour into a skillet or pie plate, sprinkle with 1/4 cup coarsely chopped hazelnuts, and bake.",
            "1. Preheat the oven to 325°F. In a large bowl, whisk together the milk, eggs, sugar, vanilla, and butter until the sugar is dissolved. Add the flour and whisk until smooth. Pour the batter into a cast iron skillet or pie pan.",
            "2. Now add your favorite fruit or flavoring (see below). Bake until the clafoutis is beautifully puffed and golden, 35–40 minutes. Serve immediately.",
            "Clafoutis Variations: Concord Grape Clafoutis: Once the batter is in the skillet, scatter 2 cups slightly crushed Concord or other black or red grapes on top. Cherry Clafoutis: Scatter 2 cups pitted cherries onto the batter once it's poured into pie plates. Pear Clafoutis with Pear Eau de Vie: Core 1 ripe pear and cut into pieces. Pour the batter into the skillet and top with the pear pieces. Bake. Drizzle with 2 tablespoons eau de vie and serve immediately. Milk Chocolate and Hazelnut Clafoutis: Melt 1 cup chopped milk chocolate in a large mixing bowl set above a simmering pot of water. Fold in the clafoutis batter until smooth and fully incorporated. Pour into a skillet or pie plate, sprinkle with 1/4 cup coarsely chopped hazelnuts, and bake."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad34b96529d92b2c040585/6:4/w_274%2Ch_169/51208430_basic-clafoutis_1x1.jpg"
    }
}