{
    "recipe": {
        "title": "Beans and Sausage ",
        "ingredients": [
            "1 ancho chile or dried choricero pepper",
            "4 tablespoons olive oil, divided",
            "1 finely chopped red onion",
            "salt",
            "1 pound dried kidney beans, preferably red speckled, or cranberry beans",
            "4 ounces chopped bacon (about 4 slices)",
            "6 smashed peeled garlic cloves, plus 1 finely chopped garlic clove",
            "8 ounces morcilla (Spanish blood sausage) or fresh chorizo (about 2 links)",
            "2 tablespoons apple cider vinegar",
            "1/4 head thinly sliced green cabbage (about 3 cups)",
            "pickled guindilla or other mild pickled peppers"
        ],
        "instructions": [
            "Soak 1 ancho chile or dried choricero pepper in a small bowl of hot water until softened, about 20 minutes; drain. Remove stem and seeds; discard. Set pepper aside. Heat 2 tablespoons olive oil in a large saucepan over medium-high heat. Add 1 finely chopped red onion, season with salt, and cook, stirring often, until soft and just starting to brown, 8–10 minutes. Add 1 pound dried kidney beans, preferably red speckled, or cranberry beans, 4 oounces chopped bacon (about 4 slices), and 6 smashed peeled garlic cloves to saucepan, then add water to cover by 3\". Bring to a simmer and cook, skimming surface and adding more water as needed to keep beans submerged, 1 hour. Add reserved rehydrated pepper and 8 ounces morcilla (Spanish blood sausage) or fresh chorizo (about 2 links) and cook until beans are tender, 60–75 minutes. Transfer sausage to a cutting board and slice. Discard pepper. Mix 2 tablespoons apple cider vinegar into beans and season with salt. Heat 2 tablespoons olive oil in a large skillet over medium-high heat. Add 1 finely chopped garlic clove and cook, stirring, until fragrant, about 30 seconds. Add 1/4 head thinly sliced green cabbage (about 3 cups), season with salt, and cook, tossing often, until softened, about 4 minutes. Serve beans topped with sliced sausage, sautéed cabbage, and pickled guindilla or other mild pickled peppers.",
            "Soak 1 ancho chile or dried choricero pepper in a small bowl of hot water until softened, about 20 minutes; drain. Remove stem and seeds; discard. Set pepper aside.",
            "Heat 2 tablespoons olive oil in a large saucepan over medium-high heat. Add 1 finely chopped red onion, season with salt, and cook, stirring often, until soft and just starting to brown, 8–10 minutes.",
            "Add 1 pound dried kidney beans, preferably red speckled, or cranberry beans, 4 oounces chopped bacon (about 4 slices), and 6 smashed peeled garlic cloves to saucepan, then add water to cover by 3\". Bring to a simmer and cook, skimming surface and adding more water as needed to keep beans submerged, 1 hour. Add reserved rehydrated pepper and 8 ounces morcilla (Spanish blood sausage) or fresh chorizo (about 2 links) and cook until beans are tender, 60–75 minutes.",
            "Transfer sausage to a cutting board and slice. Discard pepper. Mix 2 tablespoons apple cider vinegar into beans and season with salt.",
            "Heat 2 tablespoons olive oil in a large skillet over medium-high heat. Add 1 finely chopped garlic clove and cook, stirring, until fragrant, about 30 seconds. Add 1/4 head thinly sliced green cabbage (about 3 cups), season with salt, and cook, tossing often, until softened, about 4 minutes.",
            "Serve beans topped with sliced sausage, sautéed cabbage, and pickled guindilla or other mild pickled peppers."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac3fb919925f464b3a9b48/6:4/w_274%2Ch_169/51234860_beans-sausage_1x1.jpg"
    }
}