{
    "recipe": {
        "title": "Béarnaise Sauce ",
        "ingredients": [
            "1 tablespoon plus 1 cup (2 sticks) unsalted butter, cut into 1/2\" cubes",
            "3 tablespoons minced shallots",
            "Kosher salt and freshly ground black pepper",
            "2 tablespoons Champagne vinegar or white wine vinegar",
            "2 large egg yolks",
            "1 tablespoon (or more) fresh lemon juice",
            "1 tablespoon finely chopped fresh tarragon"
        ],
        "instructions": [
            "Melt 1 tablespoon butter in a small saucepan over medium heat. Add shallots and a pinch of salt and pepper; stir to coat. Stir in vinegar, reduce heat to medium-low, and cook until vinegar is evaporated, 3-4 minutes. Reduce heat to low and continue cooking shallots, stirring frequently, until tender and translucent, about 5 minutes longer. Transfer shallot reduction to a small bowl and let cool completely. Meanwhile, fill a blender with hot water to warm it; set aside. Melt remaining 1 cup butter in a small saucepan over medium heat until butter is foamy. Transfer butter to a measuring cup. Drain blender and dry well. Combine egg yolks, lemon juice, and 1 tablespoon water in warm, dry blender. Purée mixture until smooth. Remove lid insert. With blender running, slowly pour in hot butter in a thin stream of droplets, discarding milk solids at bottom of measuring cup. Continue blending until a smooth, creamy sauce forms, 2-3 minutes. Pour sauce into a medium bowl. Stir in shallot reduction and tarragon and season to taste with salt, pepper, and more lemon juice, if desired. DO AHEAD: Can be made 1 hour ahead. Cover and let stand at room temperature.",
            "Melt 1 tablespoon butter in a small saucepan over medium heat. Add shallots and a pinch of salt and pepper; stir to coat. Stir in vinegar, reduce heat to medium-low, and cook until vinegar is evaporated, 3-4 minutes. Reduce heat to low and continue cooking shallots, stirring frequently, until tender and translucent, about 5 minutes longer. Transfer shallot reduction to a small bowl and let cool completely.",
            "Meanwhile, fill a blender with hot water to warm it; set aside. Melt remaining 1 cup butter in a small saucepan over medium heat until butter is foamy. Transfer butter to a measuring cup.",
            "Drain blender and dry well. Combine egg yolks, lemon juice, and 1 tablespoon water in warm, dry blender. Purée mixture until smooth. Remove lid insert. With blender running, slowly pour in hot butter in a thin stream of droplets, discarding milk solids at bottom of measuring cup. Continue blending until a smooth, creamy sauce forms, 2-3 minutes. Pour sauce into a medium bowl. Stir in shallot reduction and tarragon and season to taste with salt, pepper, and more lemon juice, if desired. DO AHEAD: Can be made 1 hour ahead. Cover and let stand at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5761ca51e047a6cf1ee82669/6:4/w_274%2Ch_169/bearnaise-sauce.jpg"
    }
}