{
    "recipe": {
        "title": "Beef Braised in Barolo ",
        "ingredients": [
            "6 1/2 to 7-pound boneless beef roast, chuck or bottom round, trimmed of fat",
            "2 teaspoons coarse sea salt or kosher salt, or to taste",
            "1/2 cup extra-virgin olive oil",
            "3 medium onions (1 1/4 pounds total), peeled and quartered",
            "5 big carrots (about 2/3 pound), peeled and cut in 2-inch wedges",
            "6 big celery stalks (2/3 pound total), cut in 2-inch chunks",
            "8 plump garlic cloves, peeled",
            "3 branches fresh rosemary with lots of needles",
            "8 large fresh sage leaves",
            "1/2 teaspoon freshly grated nutmeg",
            "1 1/4 teaspoons whole black peppercorns",
            "1 1/4 ounces dried porcini slices (about 1 1/4 cups, loosely packed)",
            "Three 750-milliliter bottles Barolo, or as needed",
            "3 cups beef stock, or as needed",
            "Freshly ground black pepper to taste",
            "A heavy 6-quart saucepan or enameled cast-iron French oven, round or oval, with a cover; select a pot in which the roast will fit with no more than 2 inches of space around it—the less space in the pot, the less wine you'll need",
            "A meat thermometer"
        ],
        "instructions": [
            "Heat the oven, with a rack in the center, to 250°F.",
            "Season all surfaces of the roast with 1 teaspoon salt. Pour the olive oil into the big pan, and set over medium-high heat. Lay the roast in, and brown it on each side for a minute or two, without moving, until caramelized all over. Remove to a platter.",
            "Still over medium-high heat, drop in the cut vegetables and garlic cloves, toss to coat with oil, and spread out in the pan. Drop in the rosemary, sage leaves, grated nutmeg, peppercorns, dried porcini, and remaining teaspoon salt, and toss all together. Cook for 3 or 4 minutes, stirring frequently and scraping up the browned meat bits on the pan bottom, just until the vegetables soften, then lower the heat.",
            "Push the vegetables to the sides, and return the roast to the pan, laying flat on the bottom. Pour in the three bottles of wine and any meat juices that collected on the platter. The roast should be at least half submerged—add beef stock as needed.",
            "Cover the pot, and heat until the wine is steaming but not boiling. Uncover the pan, and place it in the oven. After 30 minutes, rotate the roast so the exposed meat is submerged in the braising liquid. Braise this way, turning the meat in the pan every 30 minutes, for about 3 hours, until fork-tender. The liquid should not boil&151;if it does, pour in some cold water to stop the bubbling, and lower the oven temperature.",
            "After 4 1/2 hours or so, check the beef with a meat thermometer. When its internal temperature reaches 180°F—it should be easily pierced with a fork—take the pan from the oven. Remove the meat to a platter, with intact carrot and celery pieces to serve as a garnish.",
            "Skim any fat from the braising juices, heat to a boil, and reduce to a saucy consistency that coats the back of a spoon. Pour through a sieve set over a clean container. Press in the juices from the strained herbs and vegetable pieces. Pour in any juices from the meat platter, and season the sauce to taste with salt and freshly ground black pepper. (If you are not going to serve right away, put the meat and reserved vegetables in the sauce to rest and cool, for a couple of hours or overnight.)",
            "To serve, slice the meat crosswise (easier when it is cool). Pour a shallow layer of sauce in a wide skillet, and lay the slices in, overlapping. Heat the sauce to bubbling, spooning it over the beef, so the slices are lightly coated. Lift them with a broad spatula, and slide onto a warm platter, fanned out. Heat the carrots and celery in the sauce too, if you've saved them, and arrange on the platter. Serve, passing more heated sauce at the table."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a37f9a84192308a1bf0/6:4/w_274%2Ch_169/240206.jpg",
        "color": 14489971
    }
}