{
    "recipe": {
        "title": "Beef Stroganoff with Peppered Spaetzle ",
        "ingredients": [
            "2 tablespoons unsalted butter",
            "10 shallots, sliced crosswise into approximately 1/4-inch-thick rings",
            "1 cup sugar",
            "1/2 cup sherry vinegar",
            "4 cups all-purpose flour",
            "1 tablespoon kosher salt",
            "2 tablespoons freshly ground black pepper",
            "2 large eggs",
            "1 cup sour cream",
            "1/2 cup crème fraîche",
            "1 tablespoon freshly ground black pepper, plus more to taste",
            "3 tablespoons olive oil",
            "3 cups (about 12 ounces) black trumpet, portobello, or cremini mushrooms, thoroughly cleaned and roughly chopped",
            "5 cloves garlic, finely chopped",
            "1 shallot, finely chopped",
            "4 sprigs fresh thyme, leaves removed and chopped",
            "6 tablespoons sherry vinegar, plus more to taste",
            "1/2 cup beef stock",
            "3/4 cup grapeseed oil",
            "2 tablespoons truffle oil (optional)",
            "4 (1-inch thick) beef tenderloin steaks (about 2 pounds total)",
            "3 tablespoons olive oil",
            "2 tablespoons unsalted butter",
            "1/2 cup fresh dill, minced",
            "Blender; spaetzle maker, food mill, or colander (If using a colander to make the spaetzle, you'll need two—one to make the spaetzle and one to drain it.)"
        ],
        "instructions": [
            "In a medium, deep sauté pan over moderate heat, melt the butter. Add the shallot rings and sauté until translucent, about 8 minutes. Add the sugar and vinegar and continue cooking until amber in color and thickened to the consistency of molasses, about 20 minutes. DO AHEAD: The shallots can be made in advance and refrigerated, in an airtight container, up to 3 days.",
            "Make the peppered spaetzle: Bring a large pot of salted water to a boil and keep at a bare simmer. Fill a large bowl with very cold ice water. In a second large bowl, whisk together the flour, salt, and pepper. In a blender, combine the eggs, sour cream, and 1 cup water. Purée until smooth then add to the flour mixture and stir to combine (the consistency should be a little thicker than pancake batter, so adjust with more flour or more water as needed). Working over barely simmering water, force half the batter through a spaetzlemaker, food mill, or colander. Let the spaetzle float to the surface—this will take about 1 minute—wait 30 seconds, then use a mesh skimmer or slotted spoon and transfer the spaetzle to the bowl of ice water. Once cool, transfer the spaetzle to a colander to drain. Repeat with the remaining batter. DO AHEAD: Spaetzle can be made in advance and refrigerated, in an airtight container, up to 2 days.",
            "Bring a large pot of salted water to a boil and keep at a bare simmer. Fill a large bowl with very cold ice water.",
            "In a second large bowl, whisk together the flour, salt, and pepper.",
            "In a blender, combine the eggs, sour cream, and 1 cup water. Purée until smooth then add to the flour mixture and stir to combine (the consistency should be a little thicker than pancake batter, so adjust with more flour or more water as needed).",
            "Working over barely simmering water, force half the batter through a spaetzlemaker, food mill, or colander. Let the spaetzle float to the surface—this will take about 1 minute—wait 30 seconds, then use a mesh skimmer or slotted spoon and transfer the spaetzle to the bowl of ice water. Once cool, transfer the spaetzle to a colander to drain. Repeat with the remaining batter. DO AHEAD: Spaetzle can be made in advance and refrigerated, in an airtight container, up to 2 days.",
            "Make the peppered crème fraîche: In a small bowl, stir together the crème fraîche and pepper. The crème fraîche should have an intense pepper note, so add more pepper to taste if necessary. DO AHEAD: The crème fraîche can be made in advance and refrigerated, in an airtight container, up to 1 day.",
            "In a small bowl, stir together the crème fraîche and pepper. The crème fraîche should have an intense pepper note, so add more pepper to taste if necessary. DO AHEAD: The crème fraîche can be made in advance and refrigerated, in an airtight container, up to 1 day.",
            "Make the black trumpet purée: In a large sauté pan over moderately high heat, heat 1 1/2 tablespoons olive oil until hot but not smoking. Add 1/2 the mushrooms and sauté until golden brown, about 1 minute. Add 1/2 the garlic, shallots, and thyme and continue sautéing until the shallots are tender, 1 to 2 minutes. Add 3 tablespoons of vinegar and continue cooking until the vinegar is almost completely evaporated, about 30 seconds. Transfer to a large bowl and repeat with the remaining olive oil, mushrooms, garlic, shallots, thyme, and vinegar. Once all the mushrooms are sautéed, reserve about 1/2 cup. Transfer the remaining mushrooms to a blender, add the beef stock, and purée until smooth. With the blender on, slowly add the grapeseed oil and truffle oil, if using, and continue processing until the sauce is smooth, aerated, and emulsified, about 3 minutes. Season with salt and pepper and a splash of vinegar if necessary.",
            "In a large sauté pan over moderately high heat, heat 1 1/2 tablespoons olive oil until hot but not smoking. Add 1/2 the mushrooms and sauté until golden brown, about 1 minute. Add 1/2 the garlic, shallots, and thyme and continue sautéing until the shallots are tender, 1 to 2 minutes. Add 3 tablespoons of vinegar and continue cooking until the vinegar is almost completely evaporated, about 30 seconds. Transfer to a large bowl and repeat with the remaining olive oil, mushrooms, garlic, shallots, thyme, and vinegar. Once all the mushrooms are sautéed, reserve about 1/2 cup. Transfer the remaining mushrooms to a blender, add the beef stock, and purée until smooth. With the blender on, slowly add the grapeseed oil and truffle oil, if using, and continue processing until the sauce is smooth, aerated, and emulsified, about 3 minutes. Season with salt and pepper and a splash of vinegar if necessary.",
            "Cook the beef: Season the steaks with salt and pepper. In a large heavy skillet over moderately high heat, heat the olive oil until hot but not smoking. Cook the steaks to desired doneness, about 4 minutes per side for medium-rare. Transfer to a cutting board as done and tent with foil. Let rest for about 5 minutes before serving.",
            "Season the steaks with salt and pepper. In a large heavy skillet over moderately high heat, heat the olive oil until hot but not smoking. Cook the steaks to desired doneness, about 4 minutes per side for medium-rare. Transfer to a cutting board as done and tent with foil. Let rest for about 5 minutes before serving.",
            "To serve: In a small saucepan over low heat, warm the mushroom purée. When warm, transfer to a gravy boat or other serving dish. In a large sauté pan over moderately high heat, melt the butter. Add 1/2 of the spaetzle and sauté without stirring until golden brown on the bottom, 2 to 3 minutes. Add the remaining spaetzle, the reserved 1/2 cup of mushrooms, and the shallot marmalade and sauté until warmed through, 3 to 4 minutes. Season with salt and pepper and transfer to a serving dish. Thinly slice the steaks and arrange the meat on a small platter. Dollop the crème fraîche over the meat and sprinkle with the dill. Serve immediately.",
            "In a small saucepan over low heat, warm the mushroom purée. When warm, transfer to a gravy boat or other serving dish.",
            "In a large sauté pan over moderately high heat, melt the butter. Add 1/2 of the spaetzle and sauté without stirring until golden brown on the bottom, 2 to 3 minutes. Add the remaining spaetzle, the reserved 1/2 cup of mushrooms, and the shallot marmalade and sauté until warmed through, 3 to 4 minutes. Season with salt and pepper and transfer to a serving dish.",
            "Thinly slice the steaks and arrange the meat on a small platter. Dollop the crème fraîche over the meat and sprinkle with the dill. Serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b28495a801766f773f83e9/6:4/w_274%2Ch_169/368750_beef-stroganoff_1x1.jpg"
    }
}