{
    "recipe": {
        "title": "Beef Cheek Tacos ",
        "ingredients": [
            "2 tablespoons kosher salt",
            "Juice of 1/2 lemon",
            "Juice of 1/2 orange",
            "Juice of 1 lime",
            "1/2 cup sugar",
            "3 garlic cloves, peeled and smashed",
            "1/2 cup red wine vinegar",
            "1/2 cup whole dried chiles de árbol",
            "1 1/2 whole dried guajillo chiles",
            "1 cup roughly chopped fresh cilantro",
            "2 quarts water",
            "1 pound beef cheeks, cleaned (ask your butcher to do this for you)",
            "1 1/2 tomatillos, charred",
            "1 1/2 cups roughly chopped fresh cilantro",
            "1 1/2 serrano chiles, with seeds",
            "1 1/2 jalapeños peppers with seeds, charred",
            "Juice of 1 lime",
            "2 1/2 garlic cloves, peeled",
            "1/2 cup roughly chopped scallions, charred",
            "1/2 cup natural rice vinegar (not seasoned)",
            "1/4 cup vegetable oil",
            "8 to 10 corn tortillas",
            "Salt and freshly ground black pepper to taste",
            "Chopped white onion",
            "Chopped cilantro"
        ],
        "instructions": [
            "In a large pot, combine all the brine ingredients. Bring the brine to a boil, then remove from the heat and let it cool. Add the beef cheeks to the cooled brine (if you add the meat to the hot brine, the meat will cook instead of marinate). Place the pot in your fridge and marinate the beef cheeks, uncovered, in the brine overnight.",
            "The next morning, set the beef cheeks (still in the brine) over high heat and bring to a boil, then reduce the heat to a simmer and cook, uncovered, until the beef cheeks are tender, about 1 hour.",
            "Remove the beef cheeks from the pot, discarding the brine, and let them cool. Once the cheeks have cooled, roughly chop them into small pieces.",
            "Combine all of the ingredients for the salsa in a blender or food processor and puree.",
            "Heat the oil on a griddle or in a skillet and cook the tortillas over medium heat for 30 seconds to crisp up, then flip. Remove the tortillas and add the beef cheeks to the griddle or skillet, cooking for about 2 minutes, until the meat is caramelized. Season with salt and pepper.",
            "To bring everything together, stack 2 tortillas on a plate and top with beef cheeks. Spoon salsa all over the beef. Garnish with onions and cilantro.",
            "Eat many."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54acc0c66529d92b2c03f69e/6:4/w_274%2Ch_169/51210610_beef-cheek-tacos_1x1.jpg"
    }
}