{
    "recipe": {
        "title": "Beef Stew with Potatoes and Carrots ",
        "ingredients": [
            "5 pounds boneless beef chuck (not lean), cut into 2-inch pieces",
            "3 tablespoons olive oil",
            "3 carrots, quartered",
            "3 celery ribs, quartered",
            "2 medium onions, quartered",
            "1 head garlic, halved crosswise",
            "3 tablespoons tomato paste",
            "1/3 cup balsamic vinegar",
            "1 (750-ml) bottle dry red wine (about 3 3/4 cups)",
            "2 Turkish bay leaves or 1 California",
            "2 thyme sprigs",
            "3 cups reduced-sodium beef broth",
            "3 cups water",
            "2 1/2 pounds small white boiling potatoes",
            "1 1/2 pounds carrots",
            "Equipment: a wide 6-to 8-quart heavy pot with a tight-fitting lid",
            "Accompaniment: crusty bread"
        ],
        "instructions": [
            "Braise beef: Preheat oven to 350°F with rack in middle. Pat beef dry and season with 2 1/2 teaspoons salt and 1 teaspoon pepper. Heat oil in pot over medium-high heat until it shimmers, then brown meat, without crowding, in 3 batches, turning, about 8 minutes per batch. Transfer to a platter. Reduce heat to medium, then add carrots, celery, onions, and garlic and cook, stirring occasionally, until well browned, about 12 minutes. Push vegetables to one side of pot. Add tomato paste to cleared area and cook paste, stirring, 2 minutes, then stir into vegetables. Add vinegar and cook, stirring, 2 minutes. Stir in wine, bay leaves, and thyme and boil until wine is reduced by about two thirds, 10 to 12 minutes. Add broth to pot along with water, beef, and any juices from platter and bring to a simmer. Cover and braise in oven until meat is very tender, about 2 1/2 hours. Set a large colander in a large bowl. Pour stew into colander. Return pieces of meat to pot, then discard remaining solids. Let cooking liquid stand 10 minutes.",
            "Preheat oven to 350°F with rack in middle.",
            "Pat beef dry and season with 2 1/2 teaspoons salt and 1 teaspoon pepper.",
            "Heat oil in pot over medium-high heat until it shimmers, then brown meat, without crowding, in 3 batches, turning, about 8 minutes per batch. Transfer to a platter.",
            "Reduce heat to medium, then add carrots, celery, onions, and garlic and cook, stirring occasionally, until well browned, about 12 minutes.",
            "Push vegetables to one side of pot. Add tomato paste to cleared area and cook paste, stirring, 2 minutes, then stir into vegetables.",
            "Add vinegar and cook, stirring, 2 minutes.",
            "Stir in wine, bay leaves, and thyme and boil until wine is reduced by about two thirds, 10 to 12 minutes.",
            "Add broth to pot along with water, beef, and any juices from platter and bring to a simmer. Cover and braise in oven until meat is very tender, about 2 1/2 hours.",
            "Set a large colander in a large bowl. Pour stew into colander. Return pieces of meat to pot, then discard remaining solids. Let cooking liquid stand 10 minutes.",
            "Cook potatoes and carrots: While beef braises, peel potatoes and cut into 1/2-inch-wide wedges. Slice carrots diagonally (1-inch). Add potatoes and carrots to stew (make sure they are submerged) and simmer, uncovered, stirring occasionally, until potatoes and carrots are tender, about 40 minutes.",
            "While beef braises, peel potatoes and cut into 1/2-inch-wide wedges. Slice carrots diagonally (1-inch).",
            "Add potatoes and carrots to stew (make sure they are submerged) and simmer, uncovered, stirring occasionally, until potatoes and carrots are tender, about 40 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54bac33d2a4b69f8647e90ad/6:4/w_274%2Ch_169/beef-stew-carrots-potatoes-6x4.jpg"
    }
}