{
    "recipe": {
        "title": "Beef Stew with Leeks ",
        "ingredients": [
            "3 tablespoons blended oil (90 percent canola, 10 percent extra-virgin olive)",
            "2 pounds beef stew meat, cut into 1 1/2-inch chunks",
            "Kosher salt and cracked black pepper",
            "1/2 large Spanish or sweet onion, finely chopped",
            "1 carrot, finely chopped",
            "1 stalk celery, finely chopped",
            "1 large leek, cut into thick rounds, washed well in cold water, drained",
            "2 tablespoons tomato paste",
            "1/2 cup red wine",
            "2 tablespoons red wine vinegar",
            "3 to 5 cups water",
            "1 fresh bay leaf or 2 dried leaves",
            "1 large sprig rosemary",
            "1 sprig thyme",
            "1 sprig sage",
            "2 cinnamon sticks",
            "Extra-virgin olive oil",
            "Grated orange zest",
            "1 tablespoon roughly chopped parsley"
        ],
        "instructions": [
            "Place a large, heavy pot or Dutch oven over medium-high heat and add the blended oil. Season the beef aggressively with kosher salt and pepper. When the oil is hot, add the beef and sear on all sides, 5 to 6 minutes. Add all the chopped vegetables to the pan with the beef and sauté for 2 minutes. Add the tomato paste and stir for 1 minute. Deglaze the pan with the red wine and red wine vinegar, and let them reduce completely away.",
            "Add 3 cups of the water, 2 teaspoons salt and a generous grinding of pepper, the bay leaves, rosemary, thyme, sage, and cinnamon. Bring to a boil, then reduce the heat to low and partially cover the pan. Simmer gently for about an hour. Check and, if the mixture is dry, add another cup or two of water. Keep simmering for 15 to 40 minutes more, until the meat is tender and the braising liquid has reduced to a saucy consistency. Remove the bay leaves and cinnamon sticks. Transfer to a platter and drizzle with a little extra-virgin olive oil, and scatter with a little orange zest and the parsley."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54bd6c5de231becc7f3d5a49/6:4/w_274%2Ch_169/beef-stew-leeks-6x4.jpg"
    }
}