{
    "recipe": {
        "title": "Beef and Guinness Pie ",
        "ingredients": [
            "2 pounds boneless beef chuck, cut into 1-inch pieces",
            "2 tablespoons all-purpose flour",
            "1 teaspoon salt",
            "1/2 teaspoon black pepper",
            "2 tablespoons vegetable oil",
            "1 large onion, coarsely chopped",
            "2 garlic cloves, chopped",
            "3 tablespoons water",
            "1 1/2 tablespoons tomato paste",
            "1 cup beef broth",
            "1 cup Guinness or other Irish stout",
            "1 tablespoon Worcestershire sauce",
            "2 teaspoons drained brined green peppercorns, coarsely chopped",
            "2 fresh thyme sprigs",
            "Rough Puff Pastry",
            "1 large egg, lightly beaten",
            "1 tablespoon water",
            "4 (14-ounce) deep bowls or ramekins (4 to 5 inches wide) or similar-capacity ovenproof dishes"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 350°F.",
            "Pat beef dry. Stir together flour, salt, and pepper in a shallow dish. Add beef, turning to coat, then shake off excess and transfer to a plate. Heat oil in a wide 5- to 6-quart ovenproof heavy pot over moderately high heat until just smoking, then brown meat in 3 batches, turning occasionally, about 5 minutes per batch, transferring to a bowl.",
            "Add onion, garlic, and water to pot and cook, scraping up any brown bits from bottom of pot and stirring frequently, until onion is softened, about 5 minutes. Add tomato paste and cook, stirring, 1 minute. Stir in beef with any juices accumulated in bowl, broth, beer, Worcestershire sauce, peppercorns, and thyme and bring to a simmer, then cover and transfer to oven. Braise until beef is very tender and sauce is thickened, about 1 1/4 to 1 1/2 hours. Discard thyme and cool stew completely, uncovered, about 30 minutes. (If stew is warm while assembling pies, it will melt uncooked pastry top.)",
            "Put a shallow baking pan on middle rack of oven and increase oven temperature to 425°F.",
            "Divide cooled stew among bowls (they won't be completely full). Roll out pastry dough on a lightly floured surface with a lightly floured rolling pin into a 13-inch square, about 1/8 inch thick. Trim edges and cut dough into quarters. Stir together egg and water and brush a 1-inch border of egg wash around each square. Invert 1 square over each bowl and drape, pressing sides lightly to help adhere. Brush pastry tops with some of remaining egg wash and freeze 15 minutes to thoroughly chill dough.",
            "Bake pies in preheated shallow baking pan until pastry is puffed and golden brown, about 20 minutes.",
            "Reduce oven temperature to 400°F and bake 5 minutes more to fully cook dough."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56cf4707215d75fa1ae88820/6:4/w_274%2Ch_169/beef-and-guinness-pie.jpg",
        "color": 15808810
    }
}