{
    "recipe": {
        "title": "Beef Empañadas ",
        "ingredients": [
            "2 hard-boiled large eggs",
            "1/2 medium onion, finely chopped",
            "1 tablespoon olive oil",
            "1 garlic clove, finely chopped",
            "1/2 teaspoon ground cumin",
            "1/2 teaspoon dried oregano",
            "3/4 pound ground beef chuck",
            "2 tablespoons raisins",
            "1 1/2 tablespoons chopped pimiento-stuffed olives",
            "1 (14-ounce) can whole tomatoes in juice, drained, reserving 2 tablespoons juice, and chopped",
            "1 package frozen empanada pastry disks, thawed",
            "About 4 cups vegetable oil",
            "a deep-fat thermometer"
        ],
        "instructions": [
            "Cut each egg crosswise into 10 thin slices. Cook onion in olive oil in a heavy medium skillet over medium heat, stirring frequently, until softened. Add garlic, cumin, and oregano and cook, stirring, 1 minute. Stir in beef and cook, breaking up lumps with a fork, until no longer pink, about 4 minutes. Add raisins, olives, 1/2 teaspoon salt, 1/4 teaspoon pepper, and tomatoes with reserved juice, then cook, stirring occasionally, until liquid is reduced but mixture is still moist, about 5 minutes. Spread on a plate to cool. Preheat oven to 200°F with rack in middle. Lay a large sheet of plastic wrap on a dampened work surface (to help keep plastic in place), then roll out an empanada disk on plastic wrap to measure about 6 inches. Place 3 tablespoons meat mixture on disk and top with 2 slices of egg. Moisten edges of disk with water and fold over to form a semicircle, then crimp with a fork. Make more empanadas in same manner. Heat 3/4 inch vegetable oil in a deep 12-inch skillet over medium heat until it registers 360°F on thermometer. Fry empanadas, 2 or 3 at a time, turning once, until crisp and golden, 4 to 6 minutes per batch. Transfer to a shallow baking pan and keep warm in oven. Return oil to 360°F between batches.",
            "Cut each egg crosswise into 10 thin slices.",
            "Cook onion in olive oil in a heavy medium skillet over medium heat, stirring frequently, until softened. Add garlic, cumin, and oregano and cook, stirring, 1 minute. Stir in beef and cook, breaking up lumps with a fork, until no longer pink, about 4 minutes.",
            "Add raisins, olives, 1/2 teaspoon salt, 1/4 teaspoon pepper, and tomatoes with reserved juice, then cook, stirring occasionally, until liquid is reduced but mixture is still moist, about 5 minutes. Spread on a plate to cool.",
            "Preheat oven to 200°F with rack in middle.",
            "Lay a large sheet of plastic wrap on a dampened work surface (to help keep plastic in place), then roll out an empanada disk on plastic wrap to measure about 6 inches. Place 3 tablespoons meat mixture on disk and top with 2 slices of egg. Moisten edges of disk with water and fold over to form a semicircle, then crimp with a fork. Make more empanadas in same manner.",
            "Heat 3/4 inch vegetable oil in a deep 12-inch skillet over medium heat until it registers 360°F on thermometer. Fry empanadas, 2 or 3 at a time, turning once, until crisp and golden, 4 to 6 minutes per batch.",
            "Transfer to a shallow baking pan and keep warm in oven. Return oil to 360°F between batches."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a18f3a00aeb2f1cf74e/6:4/w_274%2Ch_169/239955_hires.jpg"
    }
}