{
    "recipe": {
        "title": "Beer-Brined Grilled Pork Chops ",
        "ingredients": [
            "2 cups water",
            "2 cups dark lager beer",
            "1/4 cup coarse salt",
            "3 tablespoons (packed) dark brown sugar",
            "3 tablespoons mild-flavored (light) molasses",
            "1 cup ice cubes",
            "6 1- to 1 1/4-inch-thick center-cut bone-in pork chops",
            "7 large garlic cloves, minced",
            "3 teaspoons coarsely ground black pepper",
            "2 teaspoons salt",
            "2 teaspoons dried sage leaves"
        ],
        "instructions": [
            "Combine 2 cups water, beer, 1/4 cup coarse salt, sugar, and molasses in large bowl. Stir until salt and sugar dissolve. Stir in ice. Place pork chops in large resealable plastic bag. Pour beer brine over pork chops; seal bag. Refrigerate 4 hours, turning bag occasionally. Prepare barbecue (medium-high heat). Remove pork chops from beer brine; pat dry. Mix garlic, pepper, 2 teaspoons salt, and sage in small bowl. Rub garlic mixture over both sides of pork chops. Grill pork chops until instant-read thermometer inserted into center of chops registers 145°F to 150°F, about 10 minutes per side, occasionally moving chops to cooler part of rack if burning. Transfer chops to platter; cover with foil, and let stand 5 minutes. Serve.",
            "Combine 2 cups water, beer, 1/4 cup coarse salt, sugar, and molasses in large bowl. Stir until salt and sugar dissolve. Stir in ice. Place pork chops in large resealable plastic bag. Pour beer brine over pork chops; seal bag. Refrigerate 4 hours, turning bag occasionally.",
            "Prepare barbecue (medium-high heat). Remove pork chops from beer brine; pat dry. Mix garlic, pepper, 2 teaspoons salt, and sage in small bowl. Rub garlic mixture over both sides of pork chops. Grill pork chops until instant-read thermometer inserted into center of chops registers 145°F to 150°F, about 10 minutes per side, occasionally moving chops to cooler part of rack if burning. Transfer chops to platter; cover with foil, and let stand 5 minutes. Serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea845f9a84192308a9baf/6:4/w_274%2Ch_169/105298.jpg"
    }
}