{
    "recipe": {
        "title": "Beer and Coffee Steaks ",
        "ingredients": [
            "12 ounces dark beer, such as Negra Modelo",
            "1/4 cup Worcestershire sauce",
            "1 tablespoon Tabasco",
            "4 boneless strip steaks (1 1/2 to 2 pounds), trimmed of fat",
            "3 tablespoons finely ground espresso or dark roast coffee",
            "1 tablespoon pure chile powder (such as ancho)",
            "1 teaspoon ground cumin",
            "1 teaspoon sugar",
            "1/2 teaspoon cayenne, or more to taste",
            "1 teaspoon salt",
            "1/2 teaspoon ground black pepper"
        ],
        "instructions": [
            "BEFORE YOU GO: The night before, mix beer, Worcestershire, and Tabasco in large freezer-weight zipper-lock bag. Put steaks in bag, seal, and chill in refrigerator or cooler overnight. The next morning, mix remaining ingredients in small bowl. Remove steaks from marinade and discard marinade. Pat steaks dry with paper towels, then scatter spice mix over steaks, patting it in with your fingers. Slip into clean zipper-lock bags, seal, and chill in cooler.",
            "The night before, mix beer, Worcestershire, and Tabasco in large freezer-weight zipper-lock bag. Put steaks in bag, seal, and chill in refrigerator or cooler overnight.",
            "The next morning, mix remaining ingredients in small bowl. Remove steaks from marinade and discard marinade. Pat steaks dry with paper towels, then scatter spice mix over steaks, patting it in with your fingers. Slip into clean zipper-lock bags, seal, and chill in cooler.",
            "WHEN YOU GET THERE: Remove steaks from cooler aboute 20 minutes before grilling. Heat grill to high and let rack get good and hot. Brush and oil rack, then grill steaks until darkly crusted and done the way you like, about 3 minutes per side for medium-rare (about 145°F on an instant-read thermometer), or 4 to 5 minutes per side for medium (about 160°F on an instant-read thermometer). Let meat rest off heat 5 minutes to redistribute juices.",
            "Remove steaks from cooler aboute 20 minutes before grilling. Heat grill to high and let rack get good and hot. Brush and oil rack, then grill steaks until darkly crusted and done the way you like, about 3 minutes per side for medium-rare (about 145°F on an instant-read thermometer), or 4 to 5 minutes per side for medium (about 160°F on an instant-read thermometer). Let meat rest off heat 5 minutes to redistribute juices."
        ],
        "picture_link": null
    }
}