{
    "recipe": {
        "title": "Beer Bratwurst ",
        "ingredients": [
            "844 grams (1.90 pounds) boneless pork shoulder (or a combination of pork cuts, about 75% lean, 25% fat), cut into 1-in/2.5-cm cubes",
            "362 grams (0.80 pound) boneless veal shoulder or breast, cut into 1-in/2.5-cm cubes",
            "121 grams (1/2 cup) pale ale",
            "22 grams (1 tbsp) fine sea salt",
            "4 grams (1 tsp) sugar",
            "2 grams (1 tsp) caraway seeds",
            "1 gram (1/2 tsp) dry mustard powder",
            "1 gram (1 tsp) fresh thyme leaves",
            "1 gram (1/2 tsp) ground ginger",
            "0.46 gram (1/4 tsp) freshly grated nutmeg",
            "1 gram (1/4 tsp) Cure No. 1",
            "Hog casings, rinsed",
            "Lager-style beer for poaching (optional)"
        ],
        "instructions": [
            "Place the pork and veal on a rimmed baking sheet, transfer to the freezer, and chill until crunchy on the exterior but not frozen solid (30 to 60 minutes). Pour the ale into a shallow baking dish, transfer to the freezer, and chill until the ale is semi-frozen. In a small bowl, add the salt, sugar, caraway seeds, mustard powder, thyme, ginger, nutmeg, and Cure No. 1 and stir to combine. Nest a large mixing bowl in a bowl filled with ice. Grind the meat through the small die (3/16-inch/4-mm) of the grinder into the bowl set in ice. Once all of the meat has been ground, pour the semi-frozen ale through the grinder, into the bowl, which will help push out any meat remaining in the feed tube or wrapped around the auger. Add the spice mixture to the meat and stir with your hands until well incorporated; the mixture will look homogenous and will begin sticking to the bowl. Spoon 2 tbsp of the meat mixture into a nonstick frying pan and spread into a thin patty. Cook the test patty over low heat until cooked through but not browned. Taste the sausage for seasoning and adjust as necessary. Press a sheet of parchment paper or plastic wrap directly on the surface of the meat to prevent oxidation, then cover the bowl tightly with plastic wrap and refrigerate overnight. Alternatively, you can vacuum-seal the mixture. Stuff the sausage into the hog casings and twist into links. Poach the links in water or lager-style beer until an instant-read thermometer inserted into the center of the sausage registers 145°F/63°C. The poached sausages can be grilled and then eaten immediately, or chilled fully in an ice bath and refrigerated, or frozen for longer storage. When you're ready to eat them, grill again or cook in a pan over medium heat until browned and heated through.",
            "Place the pork and veal on a rimmed baking sheet, transfer to the freezer, and chill until crunchy on the exterior but not frozen solid (30 to 60 minutes).",
            "Pour the ale into a shallow baking dish, transfer to the freezer, and chill until the ale is semi-frozen.",
            "In a small bowl, add the salt, sugar, caraway seeds, mustard powder, thyme, ginger, nutmeg, and Cure No. 1 and stir to combine.",
            "Nest a large mixing bowl in a bowl filled with ice. Grind the meat through the small die (3/16-inch/4-mm) of the grinder into the bowl set in ice. Once all of the meat has been ground, pour the semi-frozen ale through the grinder, into the bowl, which will help push out any meat remaining in the feed tube or wrapped around the auger.",
            "Add the spice mixture to the meat and stir with your hands until well incorporated; the mixture will look homogenous and will begin sticking to the bowl.",
            "Spoon 2 tbsp of the meat mixture into a nonstick frying pan and spread into a thin patty. Cook the test patty over low heat until cooked through but not browned. Taste the sausage for seasoning and adjust as necessary.",
            "Press a sheet of parchment paper or plastic wrap directly on the surface of the meat to prevent oxidation, then cover the bowl tightly with plastic wrap and refrigerate overnight. Alternatively, you can vacuum-seal the mixture.",
            "Stuff the sausage into the hog casings and twist into links.",
            "Poach the links in water or lager-style beer until an instant-read thermometer inserted into the center of the sausage registers 145°F/63°C. The poached sausages can be grilled and then eaten immediately, or chilled fully in an ice bath and refrigerated, or frozen for longer storage. When you're ready to eat them, grill again or cook in a pan over medium heat until browned and heated through."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59b6fd3ea76843036aab9e0b/6:4/w_274%2Ch_169/WEEKEND-WARRIOR-Homemade-Brats-06092017.jpg"
    }
}