{
    "recipe": {
        "title": "Beet Panna Cotta and Meyer Lemon Mousse ",
        "ingredients": [
            "1/2 pound red beets, peeled, cut into 1/2\" pieces",
            "2 cups heavy cream",
            "1/2 teaspoon kosher salt",
            "1 teaspoon unflavored powdered gelatin",
            "3 tablespoons honey",
            "1/2 teaspoon vanilla extract",
            "1 tablespoon finely grated Meyer lemon zest",
            "1/2 cup fresh Meyer lemon juice",
            "1/2 cup (1 stick) chilled unsalted butter, cut into pieces, divided",
            "1/2 cup sugar, divided",
            "4 large egg yolks",
            "1 large egg",
            "1/2 cup chilled heavy cream",
            "Six 8-ounce glasses or ramekins"
        ],
        "instructions": [
            "Bring beets, cream, and salt to a simmer over medium heat in a medium saucepan. Cover, reduce heat, and simmer very gently until beets are tender, 25–30 minutes. Let cool slightly.",
            "Meanwhile, combine gelatin and 2 tablespoons cold water in a blender; let sit 5 minutes for gelatin to soften.",
            "Transfer beets and their cooking liquid to blender; add honey and vanilla and purée until smooth. Strain through a fine-mesh sieve into a large bowl; discard solids.",
            "Divide purée among glasses and chill until set, 3 1/2–4 hours.",
            "Do ahead: Panna cotta can be made 3 days ahead. Cover and keep chilled.",
            "Meyer lemon mousse: Bring lemon zest and juice, 1/4 cup butter, and 1/4 cup sugar to a simmer over medium heat in a medium saucepan, stirring to dissolve sugar. Remove from heat. Whisk egg yolks, egg, and remaining 1/4 cup sugar in a small bowl until pale and thick, about 2 minutes. Whisking constantly, slowly pour hot lemon mixture into egg mixture. Transfer back to saucepan and cook over medium-low heat, whisking constantly, until curd is thickened and whisk leaves a trail, about 5 minutes. Remove from heat and add remaining 1/4 cup butter, whisking until melted and curd is smooth. Transfer curd to a bowl and cover with plastic wrap, pressing directly onto surface. Chill until cold, at least 2 hours. When ready to serve, whisk cream in a small bowl to soft peaks and gently fold into curd. Spoon mousse over panna cotta. Do ahead: Lemon curd can be made 3 days ahead. Cover and chill.",
            "Bring lemon zest and juice, 1/4 cup butter, and 1/4 cup sugar to a simmer over medium heat in a medium saucepan, stirring to dissolve sugar. Remove from heat.",
            "Whisk egg yolks, egg, and remaining 1/4 cup sugar in a small bowl until pale and thick, about 2 minutes. Whisking constantly, slowly pour hot lemon mixture into egg mixture. Transfer back to saucepan and cook over medium-low heat, whisking constantly, until curd is thickened and whisk leaves a trail, about 5 minutes. Remove from heat and add remaining 1/4 cup butter, whisking until melted and curd is smooth.",
            "Transfer curd to a bowl and cover with plastic wrap, pressing directly onto surface. Chill until cold, at least 2 hours.",
            "When ready to serve, whisk cream in a small bowl to soft peaks and gently fold into curd. Spoon mousse over panna cotta.",
            "Do ahead: Lemon curd can be made 3 days ahead. Cover and chill."
        ],
        "picture_link": null
    }
}