{
    "recipe": {
        "title": "Beet Consommé ",
        "ingredients": [
            "3 lb medium beets without greens (8 medium; about 4 lb with greens), scrubbed well and trimmed, leaving 1 inch of stems attached",
            "4 qt water",
            "1 1/4 to 1 1/2 lb smoked turkey legs or wings",
            "2 carrots, cut into 1/2-inch pieces",
            "2 celery ribs, cut into 1/2-inch pieces",
            "1 large onion, cut into 1/2-inch pieces",
            "1 garlic clove, smashed",
            "4 sprigs fresh dill plus 2 tablespoons chopped fresh dill",
            "1 Turkish or 1/2 California bay leaf",
            "1 teaspoon salt",
            "1/4 teaspoon whole black peppercorns",
            "2 teaspoons fresh lemon juice",
            "2 teaspoons sugar",
            "Accompaniment: liver and mushroom pirozhki LINK",
            "heavy-duty (sometimes labeled \"fine\") cheesecloth"
        ],
        "instructions": [
            "Boil beets, covered, in water (4 quarts) in a 6- to 8-quart pot over moderate heat until tender, about 40 minutes. Transfer beets with a slotted spoon to a plate to cool slightly, reserving cooking water. When beets are cool enough to handle, slip off skins. Cut 1 beet into 1/4-inch dice and reserve for garnish. Cut remaining beets into 1/2-inch pieces and return to cooking liquid in pot. Add turkey, carrots, celery, onion, garlic, dill sprigs, bay leaf, salt, and peppercorns and simmer, partially covered, 1 1/2 to 2 hours. Pour soup through a dampened cheesecloth-lined sieve set into a 3-quart heavy saucepan, discarding solids. Measure soup: If there is more than 6 cups, boil in cleaned pot until reduced; if there is less, add enough water to total 6 cups.",
            "Skim fat from consommé, then add lemon juice and sugar and heat until hot.",
            "Divide diced beet and chopped dill among 8 shallow soup plates and ladle consomm on top."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd7e67b55306961bfab67/6:4/w_274%2Ch_169/236652.jpg",
        "color": 9261022
    }
}