{
    "recipe": {
        "title": "Beets Don't Kale My Vibe Salad ",
        "ingredients": [
            "2 red beets, peeled and cut into 1/2-inch cubes",
            "1 small red onion, diced into 1/2-inch cubes",
            "3 tablespoons balsamic vinegar",
            "2 tablespoons extra-virgin olive oil",
            "1 tablespoon agave nectar",
            "Salt and cracked pepper to taste",
            "6-8 cups chopped kale",
            "2-3 cups cooked wild rice, kept warm",
            "2-3 grilled chicken breasts, diced and kept warm",
            "Roasted beets (above)",
            "Balsamic vinaigrette",
            "4 oz good-quality goat cheese, crumbled",
            "1/2 cup raw or roasted chopped pecans"
        ],
        "instructions": [
            "For the Beets: Preheat the broiler. In a medium bowl, combine all ingredients and toss to coat well. Place everything on a rimmed baking sheet lined with aluminum foil and broil until the beets are well browned and the onions are caramelized, 7–8 minutes. Keep a close eye on the cooking, because all broilers are different. Once the beets have browned, carefully cover them with another sheet of foil and continue to broil for 5–7 more minutes, or until they have softened slightly. Remove from the oven and allow them to cool to room temperature. (This step can be done ahead of time.)",
            "Preheat the broiler. In a medium bowl, combine all ingredients and toss to coat well. Place everything on a rimmed baking sheet lined with aluminum foil and broil until the beets are well browned and the onions are caramelized, 7–8 minutes. Keep a close eye on the cooking, because all broilers are different. Once the beets have browned, carefully cover them with another sheet of foil and continue to broil for 5–7 more minutes, or until they have softened slightly. Remove from the oven and allow them to cool to room temperature. (This step can be done ahead of time.)",
            "For the Salad: Start by combining the kale, rice, chicken, and beets in a large salad bowl. Drizzle in the desired amount of vinaigrette, and toss well to coat all of the kale with dressing. Serve with crumbled goat cheese and pecans on top.",
            "Start by combining the kale, rice, chicken, and beets in a large salad bowl. Drizzle in the desired amount of vinaigrette, and toss well to coat all of the kale with dressing. Serve with crumbled goat cheese and pecans on top."
        ],
        "picture_link": "https://assets.epicurious.com/photos/554d02e4bf8983523f65b66c/6:4/w_274%2Ch_169/56389570_beets-kale-vibe_6x4.jpg"
    }
}