{
    "recipe": {
        "title": "Beggars' Purses ",
        "ingredients": [
            "5 tablespoons unsalted butter",
            "1 cup whole milk",
            "1/2 cup all-purpose flour",
            "2 large eggs",
            "1/4 teaspoon salt",
            "2 tablespoons chopped chives",
            "16 to 20 long chives (from 1 bunch)",
            "3/4 cup sour cream (preferably at room temperature)",
            "4 ounces domestic caviar such as osetra or rainbow trout"
        ],
        "instructions": [
            "Make crêpe batter: Melt butter in a 10-inch nonstick skillet over medium heat and set aside 2 tablespoons for cooking crêpes. Continue to cook butter remaining in skillet until it has a nutty fragrance and is golden brown, about 2 minutes. Blend brown butter with remaining crêpeingredients, except chives, in a blender until smooth. Add chives and pulse 1 or 2 times to just combine. Let batter stand 30 minutes. Blend brown butter with remaining crêpe ingredients, except chives, in a blender until smooth. Add chives and pulse 1 or 2 times to just combine. Let batter stand 30 minutes.",
            "Melt butter in a 10-inch nonstick skillet over medium heat and set aside 2 tablespoons for cooking crêpes. Continue to cook butter remaining in skillet until it has a nutty fragrance and is golden brown, about 2 minutes. Blend brown butter with remaining crêpeingredients, except chives, in a blender until smooth. Add chives and pulse 1 or 2 times to just combine. Let batter stand 30 minutes.",
            "Blend brown butter with remaining crêpe ingredients, except chives, in a blender until smooth. Add chives and pulse 1 or 2 times to just combine. Let batter stand 30 minutes.",
            "Blanch whole chives: Blanch chives in a small saucepan of boiling water 10 seconds. Drain and plunge into an ice bath. Pat dry.",
            "Blanch chives in a small saucepan of boiling water 10 seconds. Drain and plunge into an ice bath. Pat dry.",
            "Make crêpes: Lightly brush skillet with butter, then heat over medium-high heat until hot but not smoking. Stir batter. With skillet off heat, add a scant 1/4 cup batter, tilting and rotating skillet to coat bottom. (If batter sets too fast, reduce heat slightly.) Cook until golden around edges, 15 to 30 seconds. Loosen with a heatproof plastic spatula, then flip crêpe over with your fingertips. Cook until underside is set, about 30 seconds. Slide onto a plate. Make more crêpes, brushing skillet with butter and stacking crêpes on plate.",
            "Lightly brush skillet with butter, then heat over medium-high heat until hot but not smoking. Stir batter. With skillet off heat, add a scant 1/4 cup batter, tilting and rotating skillet to coat bottom. (If batter sets too fast, reduce heat slightly.) Cook until golden around edges, 15 to 30 seconds. Loosen with a heatproof plastic spatula, then flip crêpe over with your fingertips. Cook until underside is set, about 30 seconds. Slide onto a plate. Make more crêpes, brushing skillet with butter and stacking crêpes on plate.",
            "Assemble purses: Top each crêpe, browned side up, with about 1 1/2 tablespoons sour cream and 2 teaspoon caviar. Gather crêpe around filling and tie 1 or 2 blanched chives in a knot to close purse. Trim ends of chives if necessary.",
            "Top each crêpe, browned side up, with about 1 1/2 tablespoons sour cream and 2 teaspoon caviar. Gather crêpe around filling and tie 1 or 2 blanched chives in a knot to close purse. Trim ends of chives if necessary."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d7923f9a841923089d82a/6:4/w_274%2Ch_169/350233_hires.jpg"
    }
}