{
    "recipe": {
        "title": "Belgian Ale-Braised Brisket ",
        "ingredients": [
            "1 4-pound piece flat-cut beef brisket, untrimmed",
            "Kosher salt",
            "1/4 cup Dijon mustard",
            "1/4 cup (packed) dark brown sugar",
            "1 tablespoon grated peeled ginger",
            "2 tablespoons bacon fat or vegetable oil",
            "2 medium yellow onions, thinly sliced",
            "1/4 cup all-purpose flour",
            "1 bay leaf",
            "1 750-milliliter bottle Belgian-style tripel ale",
            "4 cups beef stock or low-sodium chicken broth"
        ],
        "instructions": [
            "Season brisket with salt. Wrap tightly in plastic and chill at least 8 hours.",
            "Let brisket sit at room temperature 1 hour.",
            "Preheat oven to 400°F. Combine mustard, brown sugar, and ginger in a small bowl. Unwrap brisket, place on a wire rack set inside a large rimmed baking sheet, and rub mustard mixture all over brisket. Roast until top is nicely browned, 30–40 minutes.",
            "Remove brisket from oven and reduce oven temperature to 300°F.",
            "Meanwhile, heat bacon fat in a large heavy ovenproof pot over medium heat. Add onions; season with salt and cook, stirring often, until deep golden brown, 8–10 minutes. Reduce heat to medium-low, add flour, and cook, stirring often, until mixture smells nutty, about 4 minutes. Add bay leaf, ale, and stock. Bring to a simmer. Add brisket, cover, and transfer to oven. Braise, turning every 30 minutes, until fork-tender, 3–4 hours. Discard bay leaf.",
            "Transfer brisket to a cutting board and let rest at least 20 minutes.",
            "If braising liquid is thin, bring to a boil, reduce, and simmer, skimming surface as needed, until thick enough to coat a spoon; season with salt, if needed. Slice brisket against the grain. Serve with braising liquid.",
            "DO AHEAD: Brisket can be braised 2 days ahead. Cover and chill in braising liquid."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad3bac6529d92b2c041561/6:4/w_274%2Ch_169/51205460_ale-brisket_1x1.jpg",
        "color": 813499
    }
}