{
    "recipe": {
        "title": "Beluga Lentil Caviar on Blini ",
        "ingredients": [
            "1/2 cup black beluga lentils",
            "2 cups water",
            "2 teaspoons kosher salt",
            "2 tablespoons minced capers, packed in brine",
            "2 tablespoons brine from the caper jar",
            "4 tablespoons vegan mayonnaise",
            "1 tablespoon Miso Mayo or white miso paste",
            "1/2 cup buckwheat flour",
            "1/2 cup organic, unbleached, all-purpose flour",
            "2 teaspoons baking powder",
            "1 1/4 cups nondairy milk (almond, soy, or rice)",
            "3 tablespoons vegan butter, melted",
            "Vegan butter or nonstick cooking spray, as needed",
            "1/2 bunch fresh chives, minced for garnish"
        ],
        "instructions": [
            "Make the beluga lentil caviar: Rinse the lentils and put them in a small pot with the water. Bring to a gentle simmer, cover, and cook for about 20 minutes, or until the lentils are soft. Drain the cooked lentils and place them in medium bowl. Add the salt, capers, and caper brine. Mix well and refrigerate for a minimum of 2 hours, and a maxi¬mum of 2 days. Make the vegan sauce: Mix the vegan mayonnaise with the Miso Mayo in a small bowl and refrigerate until needed. Make the blini: In a medium bowl, combine the flours and baking powder. Whisk the nondairy milk and melted butter into the flour until a batter forms. Allow the batter to rest a few minutes. Heat a large nonstick pan over medium heat. Add a small dab of butter to the pan or spray it with nonstick cooking spray. To form each blin, pour a little more than a tablespoon of batter into the pan. You can usually cook 4 to 6 blini at a time. Wait until the pancakes begin to show air bubbles all over the tops and the bottoms are brown. Flip the blini over and cook until golden brown. Using the back of a spoon, spread a small amount of the Vegan Sour \"Cream\" on each blin, add a teaspoon of the beluga lentil caviar, and top with a pinch of minced chives. Serve immediately.",
            "Make the beluga lentil caviar: Rinse the lentils and put them in a small pot with the water. Bring to a gentle simmer, cover, and cook for about 20 minutes, or until the lentils are soft.",
            "Drain the cooked lentils and place them in medium bowl. Add the salt, capers, and caper brine. Mix well and refrigerate for a minimum of 2 hours, and a maxi¬mum of 2 days.",
            "Make the vegan sauce: Mix the vegan mayonnaise with the Miso Mayo in a small bowl and refrigerate until needed.",
            "Make the blini: In a medium bowl, combine the flours and baking powder. Whisk the nondairy milk and melted butter into the flour until a batter forms. Allow the batter to rest a few minutes.",
            "Heat a large nonstick pan over medium heat. Add a small dab of butter to the pan or spray it with nonstick cooking spray. To form each blin, pour a little more than a tablespoon of batter into the pan. You can usually cook 4 to 6 blini at a time. Wait until the pancakes begin to show air bubbles all over the tops and the bottoms are brown. Flip the blini over and cook until golden brown.",
            "Using the back of a spoon, spread a small amount of the Vegan Sour \"Cream\" on each blin, add a teaspoon of the beluga lentil caviar, and top with a pinch of minced chives. Serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b0a4991cc76a014cfad7ab/6:4/w_274%2Ch_169/51105070_beluga-lentil-caviar-blini_1x1.jpg"
    }
}