{
    "recipe": {
        "title": "Bento Box Soup ",
        "ingredients": [
            "4 ounces soba noodles",
            "4 cups organic vegetable or chicken broth, homemade or store-bought",
            "1/2 teaspoon toasted sesame oil or hot pepper sesame oil",
            "1 (6-inch) strip of kombu",
            "3 green tea bags",
            "1 carrot, peeled and grated",
            "1/2 cup stemmed and sliced shiitake mushrooms",
            "4 ounces firm tofu, cut into 1/2-inch cubes",
            "2 tablespoons tamari",
            "1/4 cup white miso",
            "2 scallions, white and green parts, sliced diagonally",
            "1 tablespoon freshly squeezed lemon juice",
            "1 1/2 cups loosely packed baby spinach"
        ],
        "instructions": [
            "Fill a soup pot halfway with water and bring to a boil over high heat. Add a pinch of salt and the soba noodles and decrease the heat to medium. Cook, stirring gently on occasion, until just tender, about 5 minutes. Drain and rinse well under cold water to remove the starch. Immediately transfer to a bowl, drizzle with 1/4 teaspoon of the sesame oil and toss gently to coat. Put the broth in the same pot and bring to a boil over high heat. Decrease the heat to low, add the kombu and tea bags, and simmer for 4 minutes. Remove the kombu and tea bags with a slotted spoon. Add the carrot, mushrooms, tofu, tamari, cover, and simmer for 5 minutes. Put 1/4 cup of the hot broth in a small bowl, add the miso, and stir with a fork until the miso is dissolved. Stir the mixture back into the broth, then stir in the scallions, lemon juice, and remaining sesame oil. Distribute the soba noodles and spinach among six bowls and ladle in the soup.",
            "Fill a soup pot halfway with water and bring to a boil over high heat. Add a pinch of salt and the soba noodles and decrease the heat to medium. Cook, stirring gently on occasion, until just tender, about 5 minutes. Drain and rinse well under cold water to remove the starch. Immediately transfer to a bowl, drizzle with 1/4 teaspoon of the sesame oil and toss gently to coat.",
            "Put the broth in the same pot and bring to a boil over high heat. Decrease the heat to low, add the kombu and tea bags, and simmer for 4 minutes. Remove the kombu and tea bags with a slotted spoon. Add the carrot, mushrooms, tofu, tamari, cover, and simmer for 5 minutes.",
            "Put 1/4 cup of the hot broth in a small bowl, add the miso, and stir with a fork until the miso is dissolved. Stir the mixture back into the broth, then stir in the scallions, lemon juice, and remaining sesame oil.",
            "Distribute the soba noodles and spinach among six bowls and ladle in the soup."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b4036d2413537c0d4582af/6:4/w_274%2Ch_169/51151600_bento-box-soup_1x1.jpg"
    }
}