{
    "recipe": {
        "title": "Bibb Lettuce, Chicken, and Cherry Salad With Creamy Horseradish Dressing ",
        "ingredients": [
            "1/2 cup mayonnaise",
            "2 tablespoons fresh lime juice",
            "2 tablespoons prepared horseradish",
            "1/4 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "1 tablespoon extra virgin olive oil",
            "1/2 cup panko (Japanese breadcrumbs)",
            "1/4 teaspoon kosher salt",
            "1/8 teaspoon cayenne pepper",
            "2 cups shredded cooked chicken (about half of a 2 1/2-pound rotisserie chicken)",
            "8 cups Bibb or Boston lettuce leaves (from 1 large or 2 small heads)",
            "2 cups cherries (about 10 ounces), pitted, halved",
            "5 radishes, thinly sliced",
            "1/4 cup coarsely chopped fresh chives, divided"
        ],
        "instructions": [
            "Make the dressing: Purée mayonnaise, lime juice, horseradish, salt, and pepper in a blender until smooth. Set aside.",
            "Purée mayonnaise, lime juice, horseradish, salt, and pepper in a blender until smooth. Set aside.",
            "Make the salad: Heat oil in a small skillet over medium-high. Add panko and cook, stirring frequently, until golden brown, 4–5 minutes. Season with salt and cayenne and transfer to paper towels; let cool. Combine chicken, lettuce, cherries, radishes, half of the panko, and half of the chives in a large bowl. Drizzle with dressing and gently toss to coat. Sprinkle with remaining breadcrumbs and chives.",
            "Heat oil in a small skillet over medium-high. Add panko and cook, stirring frequently, until golden brown, 4–5 minutes. Season with salt and cayenne and transfer to paper towels; let cool.",
            "Combine chicken, lettuce, cherries, radishes, half of the panko, and half of the chives in a large bowl. Drizzle with dressing and gently toss to coat. Sprinkle with remaining breadcrumbs and chives.",
            "Do Ahead The dressing can be chilled for up to 2 days.",
            "The dressing can be chilled for up to 2 days."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5570960474cbe9ed7c207af0/6:4/w_274%2Ch_169/EP_06032015_Salads-chicken-6x4.jpg"
    }
}