{
    "recipe": {
        "title": "Big Easy Pumpkin Beignets ",
        "ingredients": [
            "1 package active dry yeast",
            "1/2 cup very hot water",
            "Pinch of kosher salt",
            "2 1/2 cups whole wheat flour",
            "3 large brown eggs",
            "1 tablespoon cooking oil (peanut, grapeseed, or coconut)",
            "1 cup canned pumpkin puree",
            "1/4 cup organic plain whole-milk kefir",
            "Vegetable oil, for deep-frying (I use a mix of grapeseed and peanut oil)",
            "1/2 cup powdered sugar"
        ],
        "instructions": [
            "Dissolve the yeast in the hot water with the kosher salt. Combine the dissolved yeast with 1 cup of the flour and mix until smooth. Form the yeast/flour mixture into a ball and place in a large bowl. Cover the bowl with a kitchen towel and set in a warm place until doubled in size, about 1 hour.",
            "Use a fork to beat the eggs until frothy. Add the remaining 1 1/2 cups flour and the cooking oil, mixing well with a wooden spoon or whisk. Once the yeast/flour mixture has doubled in size, combine it with the egg/flour mixture. Stir in the pumpkin puree and kefir and mix until completely smooth.",
            "Let stand for 1 hour. The dough should be elastic and spring back when stretched. Pour 1 1/2 inches vegetable oil into a deep, straight-sided frying pan and heat the oil to 360°F. (You can test the temperature by dropping in a small amount of the batter. If it immediately starts to bubble and float, the temperature is correct.) Using a soup spoon or a large tablespoon, drop spoonfuls of dough into the hot oil. Fry until golden brown, about 1 minute per side. Use the spoon to baste the cooking dough with a bit of oil as they fry. Drain the beignets on paper towels, then use a small sieve to dust them with powdered sugar."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5bd71dff88e7b22d548bc8ac/6:4/w_274%2Ch_169/big-easy-pumpkin-beignets-recipe-HC-102618.jpg"
    }
}