{
    "recipe": {
        "title": "Bison Burgers with Cabernet Onions and Wisconsin Cheddar ",
        "ingredients": [
            "2 tablespoons olive oil, divided",
            "3 cups sliced onions (about 2)",
            "3/4 cup Cabernet Sauvignon or other dry red wine",
            "1 pound ground bison (buffalo)",
            "2 tablespoons chopped shallots",
            "1/4 teaspoon coarse kosher salt",
            "1/4 teaspoon dried thyme",
            "4 organic hamburger buns",
            "6 ounces sliced Wisconsin white cheddar cheese",
            "Dijon mustard",
            "1 small head of escarole, leaves separated"
        ],
        "instructions": [
            "Heat 1 tablespoon oil in heavy medium skillet over medium- high heat. Add onions, sprinkle with salt, and sauté until tender and golden brown, stirring often, about 10 minutes. Reduce heat to medium and continue to sauté until very tender and well browned, about 15 minutes longer. Add wine and cook, stirring occasionally, until liquid is absorbed, about 5 minutes. DO AHEAD: Can be made 3 days ahead. Cool, cover, and chill. Preheat broiler. Gently mix meat and next 3 ingredients in large bowl. Shape into four 1/2-inch-thick patties. Heat remaining 1 tablespoon oil in heavy large skillet over high heat. Sprinkle burgers with salt and pepper; add to skillet. Cook until well browned, about 2 minutes per side for medium-rare. Open buns and arrange, cut side up, on rimmed baking sheet. Place cheese slices on bun tops. Broil until cheese melts and bottom halves are lightly toasted, about 1 minute. Spread bottom halves with mustard. Top each with a few escarole leaves, then burger. Spoon onions atop burgers, dividing equally. Cover with bun tops; press lightly.",
            "Heat 1 tablespoon oil in heavy medium skillet over medium- high heat. Add onions, sprinkle with salt, and sauté until tender and golden brown, stirring often, about 10 minutes. Reduce heat to medium and continue to sauté until very tender and well browned, about 15 minutes longer. Add wine and cook, stirring occasionally, until liquid is absorbed, about 5 minutes. DO AHEAD: Can be made 3 days ahead. Cool, cover, and chill.",
            "Preheat broiler. Gently mix meat and next 3 ingredients in large bowl. Shape into four 1/2-inch-thick patties. Heat remaining 1 tablespoon oil in heavy large skillet over high heat. Sprinkle burgers with salt and pepper; add to skillet. Cook until well browned, about 2 minutes per side for medium-rare.",
            "Open buns and arrange, cut side up, on rimmed baking sheet. Place cheese slices on bun tops. Broil until cheese melts and bottom halves are lightly toasted, about 1 minute. Spread bottom halves with mustard. Top each with a few escarole leaves, then burger. Spoon onions atop burgers, dividing equally. Cover with bun tops; press lightly."
        ],
        "picture_link": "https://assets.epicurious.com/photos/555622a1644d45515b7539b9/6:4/w_274%2Ch_169/0209-BA-FOD1-04-CP.jpg"
    }
}