{
    "recipe": {
        "title": "Bitter Orange Ice Cream ",
        "ingredients": [
            "2 large navel oranges, unpeeled, washed, and quartered lengthwise",
            "2 cups whole milk (480 grams), divided",
            "2 cups heavy cream (480 grams)",
            "3/4 cup sugar (150 grams), divided",
            "6 large egg yolks",
            "1/2 teaspoon kosher salt (2 grams)"
        ],
        "instructions": [
            "Preheat the oven to 450°F. Line a rimmed baking sheet with aluminum foil and set a rack on it. Set the oranges, cut side down, on the rack and roast until the skins are blackened and crisp, about 45 minutes, flipping the oranges halfway through the cooking time. Remove from the oven and cool. Fill a large bowl with ice water. Set a small bowl inside with a fine mesh sieve over it. Put the cooled orange pieces into a blender with 1 cup of the milk and purée until smooth, adding more milk if needed to liquefy it. Pour the mixture into a medium saucepan and add the remaining 1 cup milk, the cream, and 1/4 cup of the sugar. Heat the mixture over medium heat, stirring, for about 4 minutes, until very hot and steaming but not boiling. Meanwhile, in a medium bowl, whisk the egg yolks, remaining 1/2 cup sugar, and salt together until lightened. Gradually whisk in the orange-milk mixture; return mixture to the saucepan and cook over medium-low heat until custard thickens and coats the back of a spoon, about 5 minutes (do not boil). Pour into the fine mesh sieve set over the bowl in the ice bath. Press on the mixture in the strainer with a rubber spatula to remove the orange pulp. Discard the solids and freeze the custard in an ice cream maker according to the manufacturer's instructions, transfer it to an airtight container, and freeze for up to 2 weeks.",
            "Preheat the oven to 450°F. Line a rimmed baking sheet with aluminum foil and set a rack on it.",
            "Set the oranges, cut side down, on the rack and roast until the skins are blackened and crisp, about 45 minutes, flipping the oranges halfway through the cooking time. Remove from the oven and cool. Fill a large bowl with ice water. Set a small bowl inside with a fine mesh sieve over it.",
            "Put the cooled orange pieces into a blender with 1 cup of the milk and purée until smooth, adding more milk if needed to liquefy it. Pour the mixture into a medium saucepan and add the remaining 1 cup milk, the cream, and 1/4 cup of the sugar. Heat the mixture over medium heat, stirring, for about 4 minutes, until very hot and steaming but not boiling.",
            "Meanwhile, in a medium bowl, whisk the egg yolks, remaining 1/2 cup sugar, and salt together until lightened. Gradually whisk in the orange-milk mixture; return mixture to the saucepan and cook over medium-low heat until custard thickens and coats the back of a spoon, about 5 minutes (do not boil). Pour into the fine mesh sieve set over the bowl in the ice bath.",
            "Press on the mixture in the strainer with a rubber spatula to remove the orange pulp. Discard the solids and freeze the custard in an ice cream maker according to the manufacturer's instructions, transfer it to an airtight container, and freeze for up to 2 weeks."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ab44526529d92b2c0325f1/6:4/w_274%2Ch_169/51253840_bitter-orange-ice-cream_1x1.jpg"
    }
}