{
    "recipe": {
        "title": "Bittersweet Chocolate and Carob Ganache Tart with Malted Candy Brittle ",
        "ingredients": [
            "1 1/2 cups all purpose flour",
            "3 1/2 tablespoons sugar",
            "1 teaspoon coarse kosher salt",
            "3/4 cup (11/2 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
            "3 tablespoons chilled heavy whipping cream",
            "1 large egg yolk",
            "2/3 cup bittersweet chocolate chips (about 4 ounces)",
            "1/3 cup carob chips* (about 2 ounces)",
            "1 cup heavy whipping cream",
            "1 tablespoon butter, room temperature",
            "1/2 teaspoon vanilla extract",
            "Malted Candy Brittle"
        ],
        "instructions": [
            "For crust: Whisk flour, sugar, and 1 teaspoon coarse salt in large bowl to blend. Add butter and rub in with fingertips until coarse meal forms. Stir cream and egg yolk in small bowl until blended; drizzle over flour mixture. Stir until dough comes together in moist clumps. Gather dough into ball; flatten into disk. Wrap and chill at least 1 hour and up to 1 day. Roll out dough on floured surface to 12-inch round. Transfer to 9-inch tart pan with removable bottom. Cut off all but 1/2-inch overhang. Fold overhang in and press, forming double-thick sides. Pierce bottom of crust with fork; chill 30 minutes. Preheat oven to 350°F. Line crust with foil and fill with dried beans or pie weights. Bake until sides of crust are set, about 20 minutes. Remove foil with beans and bake until crust is golden brown, 12 to 15 minutes longer. Cool crust completely.",
            "Whisk flour, sugar, and 1 teaspoon coarse salt in large bowl to blend. Add butter and rub in with fingertips until coarse meal forms. Stir cream and egg yolk in small bowl until blended; drizzle over flour mixture. Stir until dough comes together in moist clumps. Gather dough into ball; flatten into disk. Wrap and chill at least 1 hour and up to 1 day.",
            "Roll out dough on floured surface to 12-inch round. Transfer to 9-inch tart pan with removable bottom. Cut off all but 1/2-inch overhang. Fold overhang in and press, forming double-thick sides. Pierce bottom of crust with fork; chill 30 minutes.",
            "Preheat oven to 350°F. Line crust with foil and fill with dried beans or pie weights. Bake until sides of crust are set, about 20 minutes. Remove foil with beans and bake until crust is golden brown, 12 to 15 minutes longer. Cool crust completely.",
            "For filling: Combine bittersweet chocolate and carob in medium bowl. Bring cream to simmer in heavy medium saucepan over medium heat. Pour cream over chips; let stand 1 minute. Stir until melted and smooth. Add butter and vanilla; stir to blend. Pour filling into cooled crust. Chill uncovered until firm, at least 4 hours. Chop brittle into rough 1/2-inch pieces. DO AHEAD: Can be made 1 day ahead. Cover brittle, cover tart, and keep chilled. Bring to room temperature before continuing. Remove tart from pan. Scatter brittle over tart and serve.",
            "Combine bittersweet chocolate and carob in medium bowl. Bring cream to simmer in heavy medium saucepan over medium heat. Pour cream over chips; let stand 1 minute. Stir until melted and smooth. Add butter and vanilla; stir to blend. Pour filling into cooled crust. Chill uncovered until firm, at least 4 hours. Chop brittle into rough 1/2-inch pieces. DO AHEAD: Can be made 1 day ahead. Cover brittle, cover tart, and keep chilled. Bring to room temperature before continuing.",
            "Remove tart from pan. Scatter brittle over tart and serve.",
            "Carob chips are similar to chocolate chips. They are available at some supermarkets and at specialty foods stores and natural foods stores.",
            "Carob chips are similar to chocolate chips. They are available at some supermarkets and at specialty foods stores and natural foods stores.",
            "Carob chips are similar to chocolate chips. They are available at some supermarkets and at specialty foods stores and natural foods stores."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55f1d913ad4e361c200f7c57/6:4/w_274%2Ch_169/351278_hires.jpg"
    }
}