{
    "recipe": {
        "title": "Bitter Green Salad with Roasted Pears ",
        "ingredients": [
            "8 firm-ripe Bosc pears (4 lb), peeled, cored, and each cut lengthwise into 8 wedges",
            "1 1/2 tablespoons extra-virgin olive oil",
            "1 small head chicory",
            "1 small head escarole",
            "1 small head radicchio",
            "1 bunch watercress, coarse stems discarded",
            "1 bunch mizuna, coarse stems discarded",
            "1 small head romaine",
            "1 tablespoon finely chopped shallot",
            "2 1/2 tablespoons cider vinegar",
            "1/2 teaspoon honey",
            "1/4 teaspoon salt",
            "1/8 teaspoon black pepper",
            "1/4 cup plus 1 tablespoon extra-virgin olive oil"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 425°F.",
            "Toss pears with oil and spread in 1 layer in a 17- by 12-inch shallow baking pan, then season with salt and pepper. Roast pears, stirring and turning over twice, until pears are tender and beginning to brown, 20 to 30 minutes, then cool about 15 minutes.",
            "While pears are roasting and cooling, tear enough tender chicory and escarole leaves (discard ribs) into bite-size pieces to measure 6 cups total. Tear enough radicchio, watercress, mizuna, and romaine into bite-size pieces to measure 10 cups total. Toss torn greens in a large bowl and reserve remaining greens for another use.",
            "Make dressing and toss salad: Whisk together shallot, vinegar, honey, salt, and pepper, then add oil in a slow stream, whisking until emulsified.",
            "Whisk together shallot, vinegar, honey, salt, and pepper, then add oil in a slow stream, whisking until emulsified.",
            "Just before serving, add roasted pears and dressing to greens and toss to combine well.",
            "Just before serving, add roasted pears and dressing to greens and toss to combine well."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd6db7b55306961bfa873/6:4/w_274%2Ch_169/233240.jpg",
        "color": 3076603
    }
}