{
    "recipe": {
        "title": "Bittersweet-Chocolate Truffles ",
        "ingredients": [
            "8 ounces bittersweet chocolate, chopped",
            "1/2 cup heavy cream",
            "2 tablespoons grappa, plus more for serving",
            "Pinch of kosher salt",
            "3/4 cup cocoa powder",
            "Clementines, amaro, bourbon, and/or dark rum (for serving)"
        ],
        "instructions": [
            "Place chocolate in a medium heatproof bowl. Bring cream, salt, and 2 Tbsp. grappa to a simmer in a small saucepan over medium-high heat. As soon as bubbles begin to form at edges of pan, remove from heat and pour over chocolate. Let sit 3 minutes to let chocolate melt. Whisk (or blend with an immersion blender if you have one) until emulsified and smooth. Scrape into a shallow bowl or pie plate. Let ganache cool; cover and chill until firm, at least 2 hours. Place cocoa in a medium bowl; set out on table with ganache and some spoons so guests can drag spoons across chocolate to make curls and toss in cocoa. Serve with clementines and amaro.",
            "Place chocolate in a medium heatproof bowl. Bring cream, salt, and 2 Tbsp. grappa to a simmer in a small saucepan over medium-high heat. As soon as bubbles begin to form at edges of pan, remove from heat and pour over chocolate. Let sit 3 minutes to let chocolate melt. Whisk (or blend with an immersion blender if you have one) until emulsified and smooth. Scrape into a shallow bowl or pie plate. Let ganache cool; cover and chill until firm, at least 2 hours.",
            "Place cocoa in a medium bowl; set out on table with ganache and some spoons so guests can drag spoons across chocolate to make curls and toss in cocoa. Serve with clementines and amaro.",
            "Do Ahead Ganache can be made 3 days ahead. Keep chilled.",
            "Ganache can be made 3 days ahead. Keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a3002b804072728dadcd31d/6:4/w_274%2Ch_169/bittersweet-chocolate-truffles-recipe-BA-121217.jpg"
    }
}