{
    "recipe": {
        "title": "Bittersweet Chocolate and Walnut Fudge ",
        "ingredients": [
            "1 pound bittersweet (not unsweetened) or semisweet chocolate, chopped",
            "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
            "2 ounces unsweetened chocolate, chopped",
            "2 teaspoons instant espresso powder",
            "3 cups sugar",
            "1 12-ounce can fat-free evaporated milk",
            "1 1/2 cups walnut pieces, toasted",
            "1 tablespoon vanilla extract"
        ],
        "instructions": [
            "Line 13x9x2-inch metal baking pan with foil, leaving overhang. Combine first 4 ingredients in large bowl. Stir sugar and evaporated milk in heavy large deep saucepan over medium heat until sugar dissolves and mixture comes to boil. Attach clip-on candy thermometer to side of pan. Boil until temperature registers 234°F, stirring constantly and adjusting heat to avoid boiling over, about 10 minutes. Immediately pour milk mixture over chocolate mixture. Whisk until chocolate and butter melt and fudge is smooth. Mix in nuts and vanilla. Spread fudge evenly in prepared pan. Refrigerate uncovered until cold and set, about 3 hours. Using foil as aid, lift fudge from pan. Cut crosswise into 7 strips, then lengthwise into 5 strips. Return to pan, cover, and chill. (Can be made 2 weeks ahead. Keep covered and chilled. Bring to room temperature before serving.)",
            "Line 13x9x2-inch metal baking pan with foil, leaving overhang. Combine first 4 ingredients in large bowl.",
            "Stir sugar and evaporated milk in heavy large deep saucepan over medium heat until sugar dissolves and mixture comes to boil. Attach clip-on candy thermometer to side of pan. Boil until temperature registers 234°F, stirring constantly and adjusting heat to avoid boiling over, about 10 minutes. Immediately pour milk mixture over chocolate mixture. Whisk until chocolate and butter melt and fudge is smooth. Mix in nuts and vanilla.",
            "Spread fudge evenly in prepared pan. Refrigerate uncovered until cold and set, about 3 hours. Using foil as aid, lift fudge from pan. Cut crosswise into 7 strips, then lengthwise into 5 strips. Return to pan, cover, and chill. (Can be made 2 weeks ahead. Keep covered and chilled. Bring to room temperature before serving.)"
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de53ef3a00aeb2f1d5370/6:4/w_274%2Ch_169/231749.jpg"
    }
}