{
    "recipe": {
        "title": "Black Cod with Miso ",
        "ingredients": [
            "saké",
            "3/4 cup (150 ml) mirin",
            "2 cups (450 g) white miso paste",
            "1 1/4 cups (225 g) granulated sugar",
            "4 black cod fillets, about 1/2 pound (230 g) each",
            "3 cups (800 g) Nobu-style Saikyo Miso",
            "1 stalk hajikami per serving"
        ],
        "instructions": [
            "Make Nobu-style Saikyo Miso: 1.Bring the saké and the mirin to a boil in a medium saucepan over high heat. Boil for 20 seconds to evaporate the alcohol. 2. Turn the heat down to low and add the miso paste, mixing with a wooden spoon. When the miso has dissolved completely, turn the heat up to high again and add the sugar, stirring constantly with the wooden spoon to ensure that the bottom of the pan doesn’t burn. Remove from heat once the sugar is fully dissolved. Cool to room temperature.",
            "1.Bring the saké and the mirin to a boil in a medium saucepan over high heat. Boil for 20 seconds to evaporate the alcohol.",
            "2. Turn the heat down to low and add the miso paste, mixing with a wooden spoon. When the miso has dissolved completely, turn the heat up to high again and add the sugar, stirring constantly with the wooden spoon to ensure that the bottom of the pan doesn’t burn. Remove from heat once the sugar is fully dissolved. Cool to room temperature.",
            "Yield: 3 cups (800 g).",
            "3 cups (800 g).",
            "Make cod: 1. Pat fillets thoroughly dry with paper towels. Slather the fish with Nobu-style Saikyo Miso and place in a non-reactive dish or bowl and cover tightly with plastic wrap. Leave to steep in refrigerator for 2 to 3 days. 2 Preheat oven to 400°F (200°C, gas 6). Preheat a grill or broiler. Lightly wipe off any excess miso clinging to the fillets but don't rinse it off. Place the fish on the grill, or in a broiler pan, and grill or broil until the surface of the fish turns brown. Then bake for 10 to 15 minutes. 3. Arrange the black cod fillets on individual plates and garnish with hajikami. Add a few extra drops of Nobu-style Saikyo Miso to each plate.",
            "1. Pat fillets thoroughly dry with paper towels. Slather the fish with Nobu-style Saikyo Miso and place in a non-reactive dish or bowl and cover tightly with plastic wrap. Leave to steep in refrigerator for 2 to 3 days.",
            "2 Preheat oven to 400°F (200°C, gas 6). Preheat a grill or broiler. Lightly wipe off any excess miso clinging to the fillets but don't rinse it off. Place the fish on the grill, or in a broiler pan, and grill or broil until the surface of the fish turns brown. Then bake for 10 to 15 minutes.",
            "3. Arrange the black cod fillets on individual plates and garnish with hajikami. Add a few extra drops of Nobu-style Saikyo Miso to each plate."
        ],
        "picture_link": null
    }
}