{
    "recipe": {
        "title": "Blackened Cabbage with Kelp Brown Butter ",
        "ingredients": [
            "1 tablespoon grapeseed oil",
            "1 medium green cabbage (about 1 1/2 pounds), halved",
            "4 tablespoons unsalted butter",
            "2 1\" pieces dried kombu",
            "10 basil leaves",
            "2 teaspoons apple cider vinegar",
            "Flaky sea salt"
        ],
        "instructions": [
            "Face Plant:",
            "Heat oil in a carbon-steel or castiron pan over medium-high, then add half of cabbage (save the other half for Monday's stir-fry), cut side down. Cook, undisturbed (yep, don't move it), until the underside is nearly blackened, 10–15 minutes. When you start worrying that it's completely burned and possibly ruined, you'll know you're doing it right.",
            "Butter Up: Reduce heat to medium-low and add butter (yes, half a stick, but relax—most of it will never make it onto the plate), shaking the pan to help it get in, around, and under the cabbage. When it foams, tilt the pan toward you and spoon the now-browning butter up and over the top of cabbage 30 seconds.",
            "Butter Up:",
            "Reduce heat to medium-low and add butter (yes, half a stick, but relax—most of it will never make it onto the plate), shaking the pan to help it get in, around, and under the cabbage. When it foams, tilt the pan toward you and spoon the now-browning butter up and over the top of cabbage 30 seconds.",
            "Work the Core: Continue cooking and basting every 3 or 4 minutes, making sure to hit the thick core end of the cabbage as well as the top. The butter will get very dark, and that's fine—add a knob or two more if needed to bring it back from the brink. Remember, most of it will stay in the pan.",
            "Work the Core:",
            "Continue cooking and basting every 3 or 4 minutes, making sure to hit the thick core end of the cabbage as well as the top. The butter will get very dark, and that's fine—add a knob or two more if needed to bring it back from the brink. Remember, most of it will stay in the pan.",
            "Seek Kelp: Meanwhile, grind kombu to a powder in a spice mill (or use a mortar and pestle). You're about to add another layer of flavor. After the cabbage has been cooking 10–12 minutes, add the kelp powder to the butter; baste the cabbage again.",
            "Seek Kelp:",
            "Meanwhile, grind kombu to a powder in a spice mill (or use a mortar and pestle). You're about to add another layer of flavor. After the cabbage has been cooking 10–12 minutes, add the kelp powder to the butter; baste the cabbage again.",
            "Testing, Testing... Cabbage is a dense, multilayered vegetable, so how do you know when it's ready? Take a tip from Puglisi and use a cake tester to check for doneness. If it slides through the layers easily, your cabbage is ready. No cake tester? A thin metal or bamboo skewer will do the trick.",
            "Testing, Testing...",
            "Cabbage is a dense, multilayered vegetable, so how do you know when it's ready? Take a tip from Puglisi and use a cake tester to check for doneness. If it slides through the layers easily, your cabbage is ready. No cake tester? A thin metal or bamboo skewer will do the trick.",
            "Halve Time: Cut the cabbage in half on a cutting board (you'll have two quarters in front of you at this point). Tuck basil between a few layers. Drizzle with vinegar and season with salt. Let cabbage sit a minute or two for the herbs to soften before serving. It will smell divine.",
            "Halve Time:",
            "Cut the cabbage in half on a cutting board (you'll have two quarters in front of you at this point). Tuck basil between a few layers. Drizzle with vinegar and season with salt. Let cabbage sit a minute or two for the herbs to soften before serving. It will smell divine."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5537e33da628db523848a860/6:4/w_274%2Ch_169/56389384_blackened-cabbage_1x1.jpg"
    }
}