{
    "recipe": {
        "title": "Black-Bottom Peanut Butter Mousse Pie ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "7 whole graham crackers, coarsely broken",
            "1/4 cup (1/2 stick) unsalted butter, melted",
            "4 tablespoons sugar, divided",
            "1 1/3 cups bittersweet or semisweet chocolate chips (about 8 ounces)",
            "2/3 cup plus 1 3/4 cups chilled whipping cream, divided",
            "2 tablespoons light corn syrup",
            "2 teaspoons vanilla extract, divided",
            "6 ounces (1 cup) peanut butter chips",
            "2 tablespoons creamy peanut butter (do not use old-fashioned style or freshly ground)"
        ],
        "instructions": [
            "Preheat oven to 350°F. Spray 9-inch-diameter glass pie dish with nonstick spray. Blend graham crackers, melted butter, and 2 tablespoons sugar in processor until moist clumps form. Press crumb mixture over bottom and up sides of prepared pie dish. Bake crust until lightly browned, about 15 minutes.",
            "Meanwhile, combine chocolate chips, 2/3 cup cream, corn syrup, and 1 teaspoon vanilla in microwave-safe bowl. Microwave on medium heat until chocolate softens, about 3 minutes. Whisk until melted and smooth. Spread chocolate mixture over bottom of crust. Freeze 10 minutes.",
            "Microwave peanut butter chips and 3/4 cup cream in large microwave-safe bowl on medium heat at 15-second intervals just until chips soften, stirring often. Whisk in peanut butter and 1 teaspoon vanilla. Cool to barely lukewarm. Beat remaining 1 cup cream and 2 tablespoons sugar in medium bowl until very thick but not yet holding peaks; fold into peanut butter mixture in 3 additions. Spoon mousse over chocolate layer. Chill at least 1 hour and up to 1 day."
        ],
        "picture_link": "https://assets.epicurious.com/photos/573b210a02b760eb4b9de8f2/6:4/w_274%2Ch_169/0806-BA-BSY1-01.jpg",
        "color": 16221280
    }
}