{
    "recipe": {
        "title": "Black Cod Fillets Poached in Five-Spice Broth with Baby Bok Choy and Udon ",
        "ingredients": [
            "Two 6-oz/170-g black cod fillets",
            "Salt and freshly ground black pepper",
            "1 3/4 cups/420 ml chicken broth",
            "1 tbsp dry sherry",
            "1 tsp soy sauce, plus more if needed",
            "1 tsp sugar",
            "1 tsp five-spice powder",
            "1 tsp toasted sesame oil",
            "1 tbsp vegetable oil",
            "3 heads baby bok choy, cored and thinly sliced on the diagonal (see \"It's that easy\"), leaves separated from stalks",
            "1 carrot, peeled and thinly sliced on the diagonal (see \"It's that easy\")",
            "1 tbsp peeled and minced fresh ginger",
            "3 oz/85 g udon noodles",
            "1 green onion, white and tender green parts, thinly sliced on the diagonal (see \"It's that easy\")",
            "2 tsp minced fresh cilantro",
            "1 tsp sesame seeds"
        ],
        "instructions": [
            "1. Pat the fillets dry and sprinkle all over with salt and pepper. 2. In a small bowl, whisk together the chicken broth, sherry, soy sauce, sugar, five-spice powder, and sesame oil. Set aside. 3. Heat a 12-in/30.5-cm skillet with a lid over medium-high heat and add the vegetable oil. When the oil shimmers, add the bok choy stems, carrot, and ginger and sauté until the bok choy turns bright green and the ginger is fragrant, about 2 minutes. Add the broth mixture and bring to a simmer. Add the noodles and give them a stir to keep them from sticking. When the broth returns to a simmer, top the noodles and veggies with the fish, bok choy leaves, and green onion. Cover, reduce the heat to low, and simmer until the noodles and fish are tender and cooked through, about 4 minutes. Taste and add more soy sauce or pepper if the mix needs it. 4. Divide the noodles and fish between two warmed shallow bowls and ladle the broth and vegetables over. Garnish with the cilantro and sesame seeds and serve hot.",
            "1. Pat the fillets dry and sprinkle all over with salt and pepper.",
            "2. In a small bowl, whisk together the chicken broth, sherry, soy sauce, sugar, five-spice powder, and sesame oil. Set aside.",
            "3. Heat a 12-in/30.5-cm skillet with a lid over medium-high heat and add the vegetable oil. When the oil shimmers, add the bok choy stems, carrot, and ginger and sauté until the bok choy turns bright green and the ginger is fragrant, about 2 minutes. Add the broth mixture and bring to a simmer. Add the noodles and give them a stir to keep them from sticking. When the broth returns to a simmer, top the noodles and veggies with the fish, bok choy leaves, and green onion. Cover, reduce the heat to low, and simmer until the noodles and fish are tender and cooked through, about 4 minutes. Taste and add more soy sauce or pepper if the mix needs it.",
            "4. Divide the noodles and fish between two warmed shallow bowls and ladle the broth and vegetables over. Garnish with the cilantro and sesame seeds and serve hot."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54afdb552edcf2b411439e9b/6:4/w_274%2Ch_169/51171420_black-cod_1x1.jpg"
    }
}