{
    "recipe": {
        "title": "Black Beans and Rice Your Way ",
        "ingredients": [
            "1 pound sweet potatoes, peeled and cut into 1/2-inch cubes",
            "2 tablespoons olive oil",
            "1/2 teaspoon salt",
            "2 1/4 cups water",
            "1 1/2 cups long-grain white rice",
            "3/4 teaspoon salt",
            "4 to 4 1/4 cups Kemp's black beans",
            "1 cup hulled (green) pumpkin seeds (also called pepitas; not toasted)",
            "2 teaspoons olive oil",
            "Accompaniments: cubes of avocado tossed with lime juice; tomatillo salsa; lime wedges; chopped white onion; fresh cilantro sprigs",
            "1 lime juice",
            "1 tomatillo salsa",
            "1 lime wedges",
            "1 white onion",
            "1 fresh cilantro sprigs"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 450°F.",
            "Toss sweet potatoes with oil and salt, then spread in 1 layer in a large shallow baking pan. Roast, stirring and turning over once or twice, until tender and browned, 35 to 40 minutes.",
            "Cook rice while sweet potatoes roast: Bring water, rice, and salt to a boil in a 2- to 3-quart heavy saucepan, then reduce heat and cook, tightly covered, until rice is tender and water is absorbed, about 15 minutes. Let stand, covered, off heat 5 minutes, then fluff with a fork.",
            "Bring water, rice, and salt to a boil in a 2- to 3-quart heavy saucepan, then reduce heat and cook, tightly covered, until rice is tender and water is absorbed, about 15 minutes. Let stand, covered, off heat 5 minutes, then fluff with a fork.",
            "Toast pumpkin seeds while rice is cooking: Toast pumpkin seeds in a dry 10- to 12-inch heavy skillet (not nonstick; preferably cast-iron) over moderate heat, stirring, until seeds are puffed and pale golden, 3 to 4 minutes. Transfer to a bowl and stir in oil and salt to taste.",
            "Toast pumpkin seeds in a dry 10- to 12-inch heavy skillet (not nonstick; preferably cast-iron) over moderate heat, stirring, until seeds are puffed and pale golden, 3 to 4 minutes. Transfer to a bowl and stir in oil and salt to taste.",
            "To serve: Reheat black beans, thinning with water if necessary, then serve along with rice, sweet potatoes, pumpkin seeds, and accompaniments, each in a separate bowl.",
            "Reheat black beans, thinning with water if necessary, then serve along with rice, sweet potatoes, pumpkin seeds, and accompaniments, each in a separate bowl."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9985f9a84192308a1a10/6:4/w_274%2Ch_169/238085.jpg"
    }
}