{
    "recipe": {
        "title": "Black Sesame-Pear Tea Cake ",
        "ingredients": [
            "1/2 cup (1 stick) unsalted butter, room temperature, plus more",
            "1 1/2 cups plus 2 tablespoons all-purpose flour",
            "1 cup almond flour or almond meal",
            "2 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "1/2 teaspoon kosher salt",
            "2 tablespoons plus 1/2 cup black sesame seeds",
            "1 1/3 cups plus 2 tablespoons sugar",
            "1 large egg",
            "1 large egg yolk",
            "3/4 cup buttermilk",
            "1 (medium) firm but ripe Bosc pear, peeled, cored, cut into 1/4\" cubes",
            "Ingredient info: Almond flour is sold at some supermarkets and at natural foods stores. Black sesame seeds are available at some supermarkets and at Asian markets."
        ],
        "instructions": [
            "Preheat oven to 325°F. Butter one 9x5x3\" loaf pan or six 4x2x2\" paper or metal loaf pans. Whisk 1 1/2 cups flour, next 4 ingredients, and 2 tablespoons sesame seeds in a medium bowl. Grind remaining 1/2 cup sesame seeds in spice mill to form a thick paste, about 2 minutes. Using an electric mixer, beat 1/2 cup butter and 1 1/3 cups sugar in a large bowl until well combined, 2-3 minutes. Add sesame paste and beat, occasionally scraping down sides of bowl, until blended, 1-2 minutes. Add egg and egg yolk. Beat until pale and fluffy, 3-4 minutes. On low speed, beat in flour mixture in 3 additions, alternating with buttermilk in 2 additions, beginning and ending with dry ingredients. Toss pear with remaining 2 tablespoons flour in a small bowl; fold into batter. Spoon batter into prepared pan; smooth top. Sprinkle with remaining 2 tablespoons sugar. Bake until a tester comes out clean when inserted into center, about 1 hour 40 minutes for large loaf and 45-55 minutes for small loaves. Let cool in pans on a wire rack.",
            "Preheat oven to 325°F. Butter one 9x5x3\" loaf pan or six 4x2x2\" paper or metal loaf pans. Whisk 1 1/2 cups flour, next 4 ingredients, and 2 tablespoons sesame seeds in a medium bowl. Grind remaining 1/2 cup sesame seeds in spice mill to form a thick paste, about 2 minutes.",
            "Using an electric mixer, beat 1/2 cup butter and 1 1/3 cups sugar in a large bowl until well combined, 2-3 minutes. Add sesame paste and beat, occasionally scraping down sides of bowl, until blended, 1-2 minutes. Add egg and egg yolk. Beat until pale and fluffy, 3-4 minutes. On low speed, beat in flour mixture in 3 additions, alternating with buttermilk in 2 additions, beginning and ending with dry ingredients. Toss pear with remaining 2 tablespoons flour in a small bowl; fold into batter.",
            "Spoon batter into prepared pan; smooth top. Sprinkle with remaining 2 tablespoons sugar.",
            "Bake until a tester comes out clean when inserted into center, about 1 hour 40 minutes for large loaf and 45-55 minutes for small loaves. Let cool in pans on a wire rack."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b1d93ca801766f773f474e/6:4/w_274%2Ch_169/394690_pear-tea-cake_1x1.jpg"
    }
}