{
    "recipe": {
        "title": "Black Bottom Brownie Cookies ",
        "ingredients": [
            "1 cup plus 2 Tbsp. (225 g) sugar",
            "3/4 cup plus 2 Tbsp. (80 g) unsweetened cocoa powder",
            "10 Tbsp. unsalted butter, cut into small pieces",
            "3/4 tsp. kosher salt",
            "1/2 tsp. vanilla extract",
            "2 cold large eggs",
            "1/2 cup (65 g) all-purpose flour",
            "3 Tbsp. (42 g) sugar",
            "1 1/2 tsp. (6 g) cornstarch",
            "1/4 tsp. kosher salt",
            "4 oz. cream cheese, room temperature",
            "1 1/4 oz. chopped bittersweet chocolate (about 1/4 cup)",
            "Flaky sea salt"
        ],
        "instructions": [
            "Heat sugar, cocoa, butter, and kosher salt in a medium heatproof bowl set over a medium pot of barely simmering water (do not let bowl touch water), stirring occasionally, until butter is melted and mixture is hot enough that you want to remove your finger fairly quickly after dipping it in to test, about 15 minutes. (Don’t worry if it looks gritty.) Let cool until mixture is warm, not hot, about 5 minutes.",
            "Stir in vanilla with a wooden spoon. Add eggs one at a time, stirring vigorously after each addition, until mixture looks thick and glossy. Add flour and mix until combined, then beat vigorously with wooden spoon or a rubber spatula until shiny and homogenous, about 1 minute.",
            "Cover bowl with plastic wrap and freeze at least 8 hours or up to overnight.",
            "Filling and Assembly Whisk sugar, cornstarch, and kosher salt to combine in a small bowl. Using an electric mixer on medium-high speed, beat cream cheese in a large bowl until smooth. Add sugar mixture and continue to beat until well combined. Fold in chocolate. Cover bowl with plastic wrap and freeze until very firm, at least 8 hours or up to overnight. Place racks in top and bottom thirds of oven; preheat to 350°F. Line two rimmed baking sheets with parchment paper or silicone mats. Let dough sit at room temperature 5–10 minutes. Using a spoon dipped in hot water, scoop 20 balls of dough (about 1 1/2 Tbsp. each) and roll into smooth balls with your hands. Using your thumb, make an imprint in center of ball, then fill each indent with about 1 tsp. cream cheese filling. Using your fingers, flatten edges of dough to about a 3\" circle with the filling in the middle (like you’re making a dumpling). Fold dough over filling to cover completely; pinch to seal. Arrange on prepared sheets, spacing at least 3\" apart. For best results, freeze dough 10 minutes. Bake cookies, rotating pans halfway through, until edges are set and firm (the centers may be a little shiny and wet-looking), 12–14 minutes. Sprinkle cookies with sea salt while still warm, then let cool on baking sheets until firm. Transfer to a wire rack and let cool completely. Do Ahead: Cookies can be baked 2 days ahead. Store in an airtight container and chill. Assembled unbaked cookies can be made 2 months ahead. Freeze on baking sheets, then transfer to freezer bags and keep frozen.",
            "Whisk sugar, cornstarch, and kosher salt to combine in a small bowl.",
            "Using an electric mixer on medium-high speed, beat cream cheese in a large bowl until smooth. Add sugar mixture and continue to beat until well combined. Fold in chocolate. Cover bowl with plastic wrap and freeze until very firm, at least 8 hours or up to overnight.",
            "Place racks in top and bottom thirds of oven; preheat to 350°F. Line two rimmed baking sheets with parchment paper or silicone mats. Let dough sit at room temperature 5–10 minutes.",
            "Using a spoon dipped in hot water, scoop 20 balls of dough (about 1 1/2 Tbsp. each) and roll into smooth balls with your hands. Using your thumb, make an imprint in center of ball, then fill each indent with about 1 tsp. cream cheese filling. Using your fingers, flatten edges of dough to about a 3\" circle with the filling in the middle (like you’re making a dumpling). Fold dough over filling to cover completely; pinch to seal. Arrange on prepared sheets, spacing at least 3\" apart. For best results, freeze dough 10 minutes.",
            "Bake cookies, rotating pans halfway through, until edges are set and firm (the centers may be a little shiny and wet-looking), 12–14 minutes. Sprinkle cookies with sea salt while still warm, then let cool on baking sheets until firm. Transfer to a wire rack and let cool completely.",
            "Do Ahead: Cookies can be baked 2 days ahead. Store in an airtight container and chill. Assembled unbaked cookies can be made 2 months ahead. Freeze on baking sheets, then transfer to freezer bags and keep frozen."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c745954f733b479539202b9/6:4/w_274%2Ch_169/How-Freezing-Makes-Better-Cookies-6x9-inset-21022019.jpg",
        "color": 721056
    }
}