{
    "recipe": {
        "title": "Blackened Salmon with Pineapple Salsa ",
        "ingredients": [
            "1 tablespoon ground paprika",
            "1 teaspoon garlic granules",
            "1 teaspoon dried thyme",
            "Pinch of ground cayenne",
            "1/4 teaspoon ground black pepper",
            "6 ounces salmon",
            "Coconut oil spray",
            "1/4 cup chopped fresh pineapple",
            "1/4 cup chopped bell pepper",
            "1 jalapeño, seeded and diced",
            "1/2 cup diced red onion",
            "Juice of 1 lime",
            "Pinch of salt"
        ],
        "instructions": [
            "Preheat the oven to 375°F. In a bowl, combine the blackening seasoning: the paprika, garlic granules, thyme, cayenne, and black pepper. Rub the seasoning onto all sides of the salmon. Coat a baking sheet with the coconut oil spray, then place the seasoned salmon on the sheet and bake it for 25 to 30 minutes, or until the salmon is firm but not dry. While the salmon is baking, prepare the salsa. Combine all the salsa ingredients in a bowl and let the flavors meld at room temperature until the salmon is ready. Top the cooked salmon with half the salsa, and reserve the other half in the fridge.",
            "Preheat the oven to 375°F.",
            "In a bowl, combine the blackening seasoning: the paprika, garlic granules, thyme, cayenne, and black pepper. Rub the seasoning onto all sides of the salmon.",
            "Coat a baking sheet with the coconut oil spray, then place the seasoned salmon on the sheet and bake it for 25 to 30 minutes, or until the salmon is firm but not dry.",
            "While the salmon is baking, prepare the salsa. Combine all the salsa ingredients in a bowl and let the flavors meld at room temperature until the salmon is ready. Top the cooked salmon with half the salsa, and reserve the other half in the fridge."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b05b469e1b9bf61f46933a5/6:4/w_274%2Ch_169/blackened-salmon-with-pineapple-salsa-recipe-HC-052218.jpg"
    }
}