{
    "recipe": {
        "title": "Blackberry Jam Cake with Penuche Frosting ",
        "ingredients": [
            "1 1/4 cups all-purpose flour",
            "1 teaspoon double-acting baking powder",
            "1 teaspoon salt",
            "1 teaspoon cinnamon",
            "1/2 teaspoon freshly grated nutmeg",
            "1/4 teaspoon ground cloves",
            "1 stick (1/2 cup) unsalted butter, softened",
            "1 cup firmly packed light brown sugar",
            "2 large eggs",
            "1 teaspoon vanilla",
            "1/2 cup buttermilk",
            "1/2 cup blackberry jam",
            "1/2 cup raisins",
            "3/4 cup chopped pecans",
            "1 cup firmly packed light brown sugar",
            "1/3 cup heavy cream",
            "3 tablespoons unsalted butter"
        ],
        "instructions": [
            "Preheat the oven to 350°F. and butter and flour a loaf pan, 9 by 5 by 3 inches. Into a bowl sift together the flour, the baking powder, the salt, the cinnamon, the nutmeg, and the cloves. In another bowl with an electric mixer cream the butter with the brown sugar until the mixture is light and fluffy, add the eggs, 1 at a time, beating well after each addition, and beat in the vanilla. Add the flour mixture to the butter mixture alternately in batches with the buttermilk, beginning and ending with the flour mixture and beating well after each addition, and stir in the jam, the raisins, and the pecans. Pour the batter into the pan and bake the cake in the middle of the oven for 55 minutes to 1 hour, or until a tester comes out clean. Let the cake cool in the pan on a rack for 5 minutes and turn it out onto the rack to cool completely.",
            "Make the frosting: In a saucepan combine the brown sugar, the cream, and the butter, cook the mixture over moderate heat, stirring, until the sugar is dissolved, and boil it, without stirring, washing down any sugar crystals clinging to the side of the pan with a brush dipped in cold water, until it registers 238°F. on a candy thermometer. Transfer the frosting to a bowl and beat it until it is just of spreading consistency. (The frosting will still be warm.)",
            "In a saucepan combine the brown sugar, the cream, and the butter, cook the mixture over moderate heat, stirring, until the sugar is dissolved, and boil it, without stirring, washing down any sugar crystals clinging to the side of the pan with a brush dipped in cold water, until it registers 238°F. on a candy thermometer. Transfer the frosting to a bowl and beat it until it is just of spreading consistency. (The frosting will still be warm.)",
            "Working quickly, spread the frosting over the top and sides of the cake.",
            "Working quickly, spread the frosting over the top and sides of the cake."
        ],
        "picture_link": null,
        "color": 7184016
    }
}