{
    "recipe": {
        "title": "Black Roasted Cod with Sea Beans and Oysters ",
        "ingredients": [
            "1/4 lb sea beans (2 cups)",
            "16 shucked small oysters (preferably Kumamoto or Prince Edward Island) with their liquor",
            "4 (6- to 7-oz) pieces skinless black cod fillet (1 3/4 inches thick)",
            "1/4 teaspoon salt",
            "1/8 teaspoon black pepper",
            "1 tablespoon olive oil",
            "1/4 cup finely chopped shallot",
            "1/2 stick (1/4 cup) unsalted butter",
            "4 teaspoons fresh lemon juice"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 450°F.",
            "Cook sea beans in a 2-quart saucepan of boiling (unsalted) water 1 minute, then drain in a colander. Quickly transfer to a bowl of ice and cold water to stop cooking. Drain, then pat dry with paper towels.",
            "Drain oysters in a sieve set over a bowl and reserve their liquor.",
            "Pat fish dry and sprinkle with salt and pepper.",
            "Heat oil in a 12-inch ovenproof heavy skillet over moderately high heat until hot but not smoking, then cook fish, skinned side up, until undersides are browned, 2 to 3 minutes. Turn fish over and transfer skillet to oven, then roast until fish is just cooked through, 9 to 11 minutes.",
            "While cod is roasting, cook shallot in 3 tablespoons butter, covered, in a 10-inch heavy skillet over low heat, stirring occasionally, until softened but not golden, 2 to 3 minutes. Add lemon juice and oyster liquor and bring to a simmer over moderate heat. Add oysters and season lightly with salt and pepper if desired, then cook at a bare simmer, covered, until just barely firm, 1 to 2 minutes. Remove from heat.",
            "Center pieces of cod on 4 large plates (reserve skillet) and arrange sea beans and oysters around fish. Discard fat from 12-inch skillet and add oyster cooking liquid. Bring to a boil over high heat and swirl in remaining tablespoon butter until incorporated. Spoon sauce over seafood and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df28ef3a00aeb2f1d5d4c/6:4/w_274%2Ch_169/230451.jpg",
        "color": 15299673
    }
}