{
    "recipe": {
        "title": "Blackberry Slump ",
        "ingredients": [
            "2 1/2 cups sugar",
            "2 1/2 cups all-purpose flour",
            "1 cup (2 sticks) unsalted butter, cut into 1/2-inch pieces",
            "2 1/2 cups all-purpose flour",
            "2 1/2 teaspoons baking powder",
            "1/2 teaspoon salt",
            "1 cup (2 sticks) unsalted butter, melted",
            "1 cup dry white wine, room temperature",
            "4 large eggs",
            "2 cups sugar",
            "1 teaspoon vanilla extract",
            "2 (16-ounce) bags frozen blackberries or 4 cups fresh blackberries, frozen on sheet pan for 1 hour",
            "Accompaniment: vanilla ice cream"
        ],
        "instructions": [
            "In food processor, pulse flour and sugar until combined. Add 4 pieces butter and pulse until incorporated. Continue adding several pieces butter and pulsing until all butter is incorporated and mixture resembles coarse meal with some small (roughly pea-size) butter lumps. Transfer to medium bowl and chill 30 minutes.",
            "Make cake: Preheat oven to 375°F. Butter and flour 9- by 13-inch glass baking dish. In medium bowl, whisk together flour, baking powder, and salt. In medium bowl, whisk together melted butter and wine. In bowl of electric mixer fitted with paddle attachment, beat together eggs, sugar, and vanilla on medium speed until light and fluffy, about 2 minutes. Reduce speed to low and beat in flour and butter mixtures alternately in batches, beginning and ending with flour mixture, for 5 batches total. Pour batter into prepared pan and top with blackberries, then cover with crumb topping, pressing down lightly to seal in blackberries. Bake slump until top is golden brown, about 1 1/2 hours. Transfer to rack and cool 20 minutes. While still slightly warm, spoon into individual bowls and top with vanilla ice cream.",
            "Preheat oven to 375°F. Butter and flour 9- by 13-inch glass baking dish.",
            "In medium bowl, whisk together flour, baking powder, and salt. In medium bowl, whisk together melted butter and wine.",
            "In bowl of electric mixer fitted with paddle attachment, beat together eggs, sugar, and vanilla on medium speed until light and fluffy, about 2 minutes. Reduce speed to low and beat in flour and butter mixtures alternately in batches, beginning and ending with flour mixture, for 5 batches total.",
            "Pour batter into prepared pan and top with blackberries, then cover with crumb topping, pressing down lightly to seal in blackberries. Bake slump until top is golden brown, about 1 1/2 hours. Transfer to rack and cool 20 minutes. While still slightly warm, spoon into individual bowls and top with vanilla ice cream."
        ],
        "picture_link": null
    }
}