{
    "recipe": {
        "title": "Blistered Green Beans With Tomato-Almond Pesto ",
        "ingredients": [
            "2 pints cherry tomatoes",
            "1/4 cup unsalted, roasted almonds",
            "1 garlic clove, grated",
            "2 tablespoons olive oil",
            "2 tablespoons Sherry vinegar or red wine vinegar",
            "1 teaspoon paprika",
            "Pinch of cayenne pepper",
            "Kosher salt, freshly ground pepper",
            "3 teaspoons vegetable oil",
            "2 pounds haricots verts or green beans, trimmed"
        ],
        "instructions": [
            "Preheat oven to 450°F. Roast tomatoes on a rimmed baking sheet, turning once, until blistered and lightly charred, 15-20 minutes. Let cool slightly. Finely chop almonds in a food processor. Add garlic, olive oil, vinegar, paprika, cayenne, and half of tomatoes; pulse to a coarse pesto consistency. Season with salt and pepper. Heat 1 1/2 tsp. vegetable oil in a large skillet over medium-high. Add half of beans; cook, undisturbed, until beginning to blister, about 2 minutes. Toss and continue to cook, tossing occasionally, until tender, 7–9 minutes; season with salt and pepper. Spread beans out on a platter; let cool. Repeat with remaining vegetable oil and beans. Toss beans with pesto; season with salt and pepper if needed. Add remaining tomatoes and transfer to a platter.",
            "Preheat oven to 450°F. Roast tomatoes on a rimmed baking sheet, turning once, until blistered and lightly charred, 15-20 minutes. Let cool slightly. Finely chop almonds in a food processor. Add garlic, olive oil, vinegar, paprika, cayenne, and half of tomatoes; pulse to a coarse pesto consistency. Season with salt and pepper.",
            "Heat 1 1/2 tsp. vegetable oil in a large skillet over medium-high. Add half of beans; cook, undisturbed, until beginning to blister, about 2 minutes. Toss and continue to cook, tossing occasionally, until tender, 7–9 minutes; season with salt and pepper. Spread beans out on a platter; let cool. Repeat with remaining vegetable oil and beans.",
            "Toss beans with pesto; season with salt and pepper if needed. Add remaining tomatoes and transfer to a platter.",
            "Do ahead Dish can be made 3 hours ahead. Store tightly wrapped at room temperature. Toss and adjust seasoning just before serving.",
            "Dish can be made 3 hours ahead. Store tightly wrapped at room temperature. Toss and adjust seasoning just before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/563a3c931829d212274c92fb/6:4/w_274%2Ch_169/blistered-green-beans-with-tomato-almond-pesto.jpg"
    }
}