{
    "recipe": {
        "title": "Blissed-Out Crispy Cheesy Broccoli Gratin ",
        "ingredients": [
            "1 1/4 pounds broccoli florets (I like leaving about 1 inch of the stem attached)",
            "2 tablespoons extra-virgin olive oil",
            "1 teaspoon kosher salt",
            "2 tablespoons unsalted butter",
            "2 garlic cloves, minced",
            "1/3 cup panko bread crumbs",
            "3/4 cup grated Cheddar cheese",
            "1/4 cup finely grated Parmigiano Reggiano cheese"
        ],
        "instructions": [
            "Adjust one oven rack to the upper-middle position and another rack to the position. Place a rimmed sheet pan on the middle rack and preheat the oven to 400°F.",
            "Toss the broccoli florets with the olive oil and salt in a medium-size bowl. Turn the broccoli out onto the hot sheet pan (it should sizzle!) and roast until the bottom of the florets are nicely browned, about 15 minutes.",
            "Meanwhile, combine the butter and garlic in a ramekin and place it in the oven until the butter melts, 5 minutes. (Alternatively, combine them in a microwave-safe bowl and microwave on high power in 15-second increments, swirling between each, until the butter melts, 45 seconds to 1 minute.)",
            "Place the bread crumbs in a medium-size bowl, add the butter-garlic mixture, and toss with a fork. Add the Cheddar and Parmigiano Reggiano cheeses and toss to combine.",
            "Remove the sheet pan from the oven and sprinkle the broccoli with the cheesy bread crumb mixture. Turn the broiler to high and place the sheet pan on the upper rack. Broil until the cheese is melted and browned, 1 to 2 minutes (watch the bread crumbs closely as broiler intensities vary and you don’t want them to burn). Remove from the oven, transfer to a platter—making sure to scrape up all of the crispy, crunchy cheesy bits—and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a12fa4167e9c1157186bf0a/6:4/w_274%2Ch_169/blissed-out-broccoli-gratin-recipe-112017.jpg"
    }
}