{
    "recipe": {
        "title": "Blood Orange and Poppy Polenta Shortbread Cookies ",
        "ingredients": [
            "1 cup (2 sticks) unsalted butter, room temperature, plus more for pan",
            "2/3 cup polenta (coarse cornmeal)",
            "1 teaspoon kosher salt",
            "1 1/2 cups all-purpose flour, plus more for hands",
            "1/2 cup granulated sugar",
            "Finely grated zest of 1 lemon",
            "Finely grated zest of 2 blood oranges",
            "2 teaspoons vanilla extract",
            "2 tablespoons poppy seeds, plus more for sprinkling",
            "1/2 cup blood orange juice",
            "1 cup powdered sugar"
        ],
        "instructions": [
            "Preheat oven to 350°F. Lightly butter an 8x8\" baking pan, preferably metal. Line with parchment paper, creating overhang on 2 sides. Lightly butter parchment. Whisk polenta, salt, and 1 1/2 cups flour in a medium bowl to combine. Place granulated sugar and blood orange and lemon zests in a large bowl and rub together with your fingers until mixture is very fragrant and sugar starts to look a little moist, about 1 minute. Add 1 cup butter and beat with an electric mixer on medium speed until light and fluffy, about 3 minutes. Add vanilla and beat just to combine. Reduce speed to low and gradually add dry ingredients, mixing just until combined. Fold dough with a rubber spatula a few times to incorporate any dry bits in the bottom of the bowl. The dough will be wet and a bit sticky.",
            "Using floured hands, gently press half of the dough into prepared pan in an even layer. Sprinkle 2 Tbsp. poppy seeds over dough; press gently to adhere. Scatter pieces of remaining dough over and press down into an even layer with floured hands. For a completely flat surface, use the bottom of a straight-sided measuring cup to smooth dough.",
            "Bake shortbread until edges are golden brown and center is light golden, 25–30 minutes. Let cool in pan.",
            "Meanwhile, simmer blood orange juice in a small saucepan over medium heat, swirling often, until reduced to 2 Tbsp., 10–12 minutes. Pour into a small bowl and let cool.",
            "Carefully slide a small knife or offset spatula along sides of pan not lined with parchment paper, then use edges of paper to lift out shortbread onto a cutting board. Using a serrated knife, slice into quarters in one direction, then into eighths in the other direction (for larger bars, just cut in half first). Puzzle shortbread bars back into pan the same way they came out; set aside.",
            "Add powdered sugar to bowl with reduced juice and whisk until smooth. The glaze should fall off the end of the whisk in a thick, glossy, smooth ribbon. If glaze is not pourable and gets stuck in the whisk, add in water a ½-teaspoonful at a time until you get the right consistency. Drizzle glaze over shortbread in pan and use an offset spatula to smooth all the way to the edges. Sprinkle with more poppy seeds and let shortbread sit until glaze is set, at least 1 hour.",
            "Just before serving, retrace cuts with a sharp knife and remove bars from pan.",
            "Do Ahead Shortbread can be baked 3 days ahead. Once glaze is set, cover tightly and store at room temperature.",
            "Shortbread can be baked 3 days ahead. Once glaze is set, cover tightly and store at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a3002b804847a34b821cb4d/6:4/w_274%2Ch_169/blood-orange-and-poppy-polenta-shortbread-cookies-recipe-BA-121217.jpg"
    }
}