{
    "recipe": {
        "title": "Blossom-Topped Cupcakes ",
        "ingredients": [
            "16 (2 1/2-inch) paper muffin-cup liners",
            "2 cups cake flour (not self-rising)",
            "1 teaspoon baking powder",
            "1/2 teaspoon salt",
            "2 sticks unsalted butter, softened",
            "1 1/2 cups granulated sugar",
            "4 large eggs",
            "1/4 cup whole milk",
            "1 teaspoon vanilla",
            "2 (8-ounce) packages cream cheese, softened",
            "1 cup confectioners sugar",
            "1 teaspoon fresh lemon juice",
            "1/4 teaspoon rosewater (optional)",
            "Garnish: nontoxic and organic (pesticide-free) small roses, pansies, and scented geranium leaves and blackberries dusted with confectioners sugar"
        ],
        "instructions": [
            "Make cupcakes: Preheat oven to 350°F and line 16 (1/3-cup) muffin cups with paper muffin-cup liners. Sift together flour, baking powder, and salt. Beat together butter and sugar in a large bowl with an electric mixer until light and fluffy. Add eggs 1 at a time, beating well after each addition, and with mixer on low speed beat in milk and vanilla until just combined (batter will separate). Add flour mixture in 3 batches, beating until just combined after each addition. Divide batter among muffin cups and bake in middle of oven until a tester comes out clean, about 20 minutes. Cool cupcakes in pan on a rack 5 minutes and remove from pan.",
            "Preheat oven to 350°F and line 16 (1/3-cup) muffin cups with paper muffin-cup liners.",
            "Sift together flour, baking powder, and salt. Beat together butter and sugar in a large bowl with an electric mixer until light and fluffy. Add eggs 1 at a time, beating well after each addition, and with mixer on low speed beat in milk and vanilla until just combined (batter will separate). Add flour mixture in 3 batches, beating until just combined after each addition.",
            "Divide batter among muffin cups and bake in middle of oven until a tester comes out clean, about 20 minutes. Cool cupcakes in pan on a rack 5 minutes and remove from pan.",
            "Make frosting: Beat cream cheese with an electric mixer until smooth. Add confectioners sugar and beat on low speed until incorporated. Add lemon juice and rosewater and beat until smooth. Frost cupcakes and garnish.",
            "Beat cream cheese with an electric mixer until smooth. Add confectioners sugar and beat on low speed until incorporated. Add lemon juice and rosewater and beat until smooth.",
            "Frost cupcakes and garnish."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5612e62bf35fab51707e7eea/6:4/w_274%2Ch_169/102286.jpg"
    }
}