{
    "recipe": {
        "title": "Blueberry Blossom Pancake ",
        "ingredients": [
            "3/4 cup pure maple syrup",
            "1/4 cup blueberries",
            "1/2 cup old-fashioned oats",
            "1/4 cup all-purpose flour",
            "2 tablespoons light brown sugar",
            "1/4 cup (1/2 stick) unsalted butter, melted",
            "1 cup all-purpose flour",
            "2 tablespoons sugar",
            "1 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "1/2 teaspoon kosher salt",
            "1 large egg",
            "1 1/2 cups buttermilk",
            "2 tablespoons unsalted butter, melted, slightly cooled",
            "Vegetable oil (for skillet)",
            "1 cup blueberries (about 5 ounces)"
        ],
        "instructions": [
            "Purée syrup and blueberries in a blender until smooth; set aside.",
            "For streusel: Preheat oven to 350°F. Combine oats, flour, and brown sugar on a small rimmed baking sheet; drizzle with butter and toss to coat. Bake, stirring occasionally, until golden brown, 15-20 minutes. Let cool. DO AHEAD: Streusel can be made 1 week ahead. Store airtight at room temperature.",
            "Preheat oven to 350°F. Combine oats, flour, and brown sugar on a small rimmed baking sheet; drizzle with butter and toss to coat. Bake, stirring occasionally, until golden brown, 15-20 minutes. Let cool.",
            "DO AHEAD: Streusel can be made 1 week ahead. Store airtight at room temperature.",
            "For pancakes: Whisk flour, sugar, baking powder, baking soda, and salt in a large bowl. Whisk egg, buttermilk, and butter in a medium bowl, then whisk into dry ingredients. Heat a large nonstick skillet over medium heat and lightly coat with oil. Working in batches, pour 1/4 cupfuls of batter into skillet and top each with 2 tablespoons berries. Cook pancakes until bottoms are golden brown and bubbles form on top, about 3 minutes. Flip and cook until golden brown and cooked through, about 2 minutes longer. Serve pancakes topped with syrup and streusel.",
            "Whisk flour, sugar, baking powder, baking soda, and salt in a large bowl. Whisk egg, buttermilk, and butter in a medium bowl, then whisk into dry ingredients.",
            "Heat a large nonstick skillet over medium heat and lightly coat with oil. Working in batches, pour 1/4 cupfuls of batter into skillet and top each with 2 tablespoons berries. Cook pancakes until bottoms are golden brown and bubbles form on top, about 3 minutes. Flip and cook until golden brown and cooked through, about 2 minutes longer. Serve pancakes topped with syrup and streusel."
        ],
        "picture_link": null
    }
}