{
    "recipe": {
        "title": "Blueberry-Pecan Galette ",
        "ingredients": [
            "1/2 cup pecans",
            "1 cup plus 2 tablespoons all-purpose flour",
            "2 teaspoons sugar",
            "1/2 teaspoon kosher salt",
            "1/4 teaspoon ground cinnamon",
            "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
            "12 ounces blueberries (about 2 cups)",
            "1 tablespoon cornstarch",
            "1 1/2 teaspoons fresh lemon juice",
            "1/4 cup sugar, plus more for sprinkling",
            "All-purpose flour (for surface)",
            "2 tablespoons milk, half-and-half, or heavy cream"
        ],
        "instructions": [
            "Dough: Preheat oven to 350°F. Toast pecans on a rimmed baking sheet, tossing once, until fragrant and slightly darkened, 10–15 minutes; let cool. Pulse pecans in a food processor until the consistency of coarse meal. Add flour, sugar, salt, and cinnamon and pulse just to combine. Add butter and pulse until mixture resembles coarse meal with a few pea-size pieces remaining. Transfer to a large bowl; drizzle with 4 tablespoons ice water and mix, adding another tablespoonful of water if needed, just until mixture comes together. Gently pat dough into a 6\"-diameter disk. Wrap in plastic and chill at least 1 hour.",
            "Preheat oven to 350°F. Toast pecans on a rimmed baking sheet, tossing once, until fragrant and slightly darkened, 10–15 minutes; let cool. Pulse pecans in a food processor until the consistency of coarse meal. Add flour, sugar, salt, and cinnamon and pulse just to combine. Add butter and pulse until mixture resembles coarse meal with a few pea-size pieces remaining.",
            "Transfer to a large bowl; drizzle with 4 tablespoons ice water and mix, adding another tablespoonful of water if needed, just until mixture comes together. Gently pat dough into a 6\"-diameter disk. Wrap in plastic and chill at least 1 hour.",
            "Do Ahead Dough can be made 2 days ahead. Keep chilled, or freeze up to 1 month.",
            "Dough can be made 2 days ahead. Keep chilled, or freeze up to 1 month.",
            "Filling and assembly: Preheat oven to 375°F. Toss blueberries, cornstarch, lemon juice, and 1/4 cup sugar in a large bowl. Roll out dough on a lightly floured surface to a 12\" round. Carefully transfer to a parchment-lined baking sheet. Mound blueberries in center of dough, leaving a 2\" border. Fold edges over, overlapping slightly. Brush dough with milk and sprinkle with sugar. Bake galette until crust is dark golden brown and filling is bubbling, 45–50 minutes. Let cool before serving.",
            "Preheat oven to 375°F. Toss blueberries, cornstarch, lemon juice, and 1/4 cup sugar in a large bowl.",
            "Roll out dough on a lightly floured surface to a 12\" round. Carefully transfer to a parchment-lined baking sheet. Mound blueberries in center of dough, leaving a 2\" border. Fold edges over, overlapping slightly. Brush dough with milk and sprinkle with sugar.",
            "Bake galette until crust is dark golden brown and filling is bubbling, 45–50 minutes. Let cool before serving.",
            "Do Ahead Galette can be baked 1 day ahead. Store tightly wrapped at room temperature.",
            "Galette can be baked 1 day ahead. Store tightly wrapped at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55afe2346284773353bf3a17/6:4/w_274%2Ch_169/56389720_blueberry-pecan-galette_1x1.jpg"
    }
}