{
    "recipe": {
        "title": "Blueberry Rhubarb Crisp with Pistachio Crust ",
        "ingredients": [
            "1/3 cup granulated sugar",
            "2 tablespoons all-purpose flour",
            "3/4 pound rhubarb",
            "2 cups blueberries (about 11 ounces)",
            "1/3 cup shelled natural pistachios",
            "3/4 cup unbleached all-purpose flour",
            "1/2 cup granulated sugar",
            "1/4 cup packed brown sugar",
            "6 tablespoons cold unsalted butter"
        ],
        "instructions": [
            "Preheat oven to 375°F. and butter a 2-quart shallow baking dish.",
            "In a bowl stir together sugar and flour. Trim rhubarb and cut enough of stalks into 1/2-inch pieces to measure 2 cups. Add rhubarb and blueberries to sugar mixture, tossing well, and spread mixture in baking dish.",
            "Make topping: Finely chop pistachios. In a bowl whisk together flour and sugars. Cut butter into 1/2-inch cubes and with your fingers or a pastry blender blend into flour mixture until mixture resembles coarse meal. Add pistachios and toss well. Squeeze a handful of topping together and coarsely crumble in chunks over filling. Squeeze and evenly crumble remaining topping over filling in same manner. Bake crisp in upper third of oven until filling is bubbling and topping is crisp and golden, about 50 minutes.",
            "Finely chop pistachios. In a bowl whisk together flour and sugars. Cut butter into 1/2-inch cubes and with your fingers or a pastry blender blend into flour mixture until mixture resembles coarse meal. Add pistachios and toss well.",
            "Squeeze a handful of topping together and coarsely crumble in chunks over filling. Squeeze and evenly crumble remaining topping over filling in same manner. Bake crisp in upper third of oven until filling is bubbling and topping is crisp and golden, about 50 minutes.",
            "Serve crisp warm or at room temperature.",
            "Serve crisp warm or at room temperature."
        ],
        "picture_link": null
    }
}