{
    "recipe": {
        "title": "Blueberry Hill Cupcakes ",
        "ingredients": [
            "3 1/4 cups all purpose flour",
            "1 1/4 cups sugar",
            "1 tablespoon baking powder",
            "1/2 teaspoon coarse kosher salt",
            "1/4 teaspoon baking soda",
            "6 tablespoons (3/4 stick) unsalted butter, melted",
            "1/4 cup canola oil",
            "2 large eggs",
            "1 cup buttermilk or low-fat yogurt",
            "1 cup whole milk",
            "1 teaspoon vanilla extract",
            "1 teaspoon grated lemon peel",
            "1 1/4 cups fresh blueberries, frozen for 4 hours",
            "2 1/4 cups powdered sugar",
            "10 tablespoons (1 1/4 sticks) unsalted butter, room temperature",
            "1/2 cup plus 2 tablespoons maple sugar",
            "1/2 teaspoon coarse kosher salt",
            "1 1/4 teaspoons vanilla extract",
            "4 teaspoons (or more) whole milk",
            "1 cup chilled fresh blueberries",
            "Fresh mint sprigs (optional)"
        ],
        "instructions": [
            "Preheat oven to 350°F. Line two 12-cup muffin pans with paper liners. Sift flour and next 4 ingredients into large bowl. Whisk melted butter and oil in medium bowl. Add eggs; whisk to blend. Whisk in buttermilk, milk, vanilla extract, and peel. Add buttermilk mixture to dry ingredients; whisk just to blend. Stir in frozen blueberries. Divide batter among liners.",
            "Bake cupcakes until tester inserted into center comes out clean, about 23 minutes. Transfer cupcakes to racks; cool.",
            "For frosting: Combine first 5 ingredients in medium bowl. Add 4 teaspoons milk. Using electric mixer, beat until well blended and fluffy, adding more milk by teaspoonfuls if dry (small granules of maple sugar will still remain), about 4 minutes. Spread frosting over top of cupcakes. Garnish cupcakes with chilled berries, and mint sprigs, if desired. (Can be made 4 hours ahead. Store in airtight container at room temperature.)",
            "Combine first 5 ingredients in medium bowl. Add 4 teaspoons milk. Using electric mixer, beat until well blended and fluffy, adding more milk by teaspoonfuls if dry (small granules of maple sugar will still remain), about 4 minutes. Spread frosting over top of cupcakes.",
            "Garnish cupcakes with chilled berries, and mint sprigs, if desired. (Can be made 4 hours ahead. Store in airtight container at room temperature.)"
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de5817b55306961bfd7d4/6:4/w_274%2Ch_169/232271.jpg"
    }
}