{
    "recipe": {
        "title": "Blueberry Crumb Bars ",
        "ingredients": [
            "2 cups all purpose flour",
            "1 cup old-fashioned oats",
            "1 cup (packed) golden brown sugar",
            "1/2 teaspoon salt",
            "1/4 teaspoon ground cinnamon",
            "1 cup (2 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
            "1/2 cup sliced almonds",
            "3 cups fresh blueberries (about 15 ounces) or one 12-ounce package frozen blueberries (do not thaw)",
            "1 cup blueberry preserves (10 to 11 ounces)",
            "1 tablespoon all purpose flour",
            "1 teaspoon finely grated lemon peel"
        ],
        "instructions": [
            "For crust: Preheat oven to 375°F. Butter bottom of 13x9x2-inch metal baking pan. Whisk flour, oats, sugar, salt, and cinnamon in large bowl. Add 1 cup butter; rub in with fingertips until mixture sticks together in small clumps. Transfer 2 cups to medium bowl; mix in almonds and reserve for topping. Press remaining crumb mixture evenly onto bottom of prepared pan. Bake crust until golden and just firm to touch, about 22 minutes. Cool 10 minutes.",
            "Preheat oven to 375°F. Butter bottom of 13x9x2-inch metal baking pan. Whisk flour, oats, sugar, salt, and cinnamon in large bowl. Add 1 cup butter; rub in with fingertips until mixture sticks together in small clumps.",
            "Transfer 2 cups to medium bowl; mix in almonds and reserve for topping.",
            "Press remaining crumb mixture evenly onto bottom of prepared pan. Bake crust until golden and just firm to touch, about 22 minutes. Cool 10 minutes.",
            "For filling: Mix all ingredients in medium bowl. Spread evenly over crust in pan, then sprinkle reserved topping over. Bake bars until filling bubbles thickly at edges and topping is golden brown, about 40 minutes; cool in pan on rack. Cut lengthwise into 4 strips, then cut each strip into 6 pieces, forming 24 bars.",
            "Mix all ingredients in medium bowl. Spread evenly over crust in pan, then sprinkle reserved topping over.",
            "Bake bars until filling bubbles thickly at edges and topping is golden brown, about 40 minutes; cool in pan on rack. Cut lengthwise into 4 strips, then cut each strip into 6 pieces, forming 24 bars."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a5ade0acd286555db8aa/6:4/w_274%2Ch_169/353822_hires.jpg"
    }
}