{
    "recipe": {
        "title": "Boca Negra Chocolate Chipotle Cakes ",
        "ingredients": [
            "1 1/2 sticks (3/4 cup) unsalted butter, cut into small pieces, plus additional for greasing ramekins",
            "1 cup sugar plus additional for dusting",
            "6 medium dried chipotle chiles* (1 ounce)",
            "6 tablespoons fresh orange juice",
            "10 oz Valrhona semisweet chocolate (56%) or fine-quality bittersweet chocolate, finely chopped",
            "4 large eggs",
            "4 teaspoons all-purpose flour",
            "1/8 teaspoon salt",
            "Special equipment: 8 (4-oz) ramekins",
            "Accompaniments: sweet tomatillo sauce ; vanilla custard sauce"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 325°F. Butter ramekins and dust with sugar, knocking out excess.",
            "Toast chiles in a dry heavy skillet over moderate heat, turning, until fragrant, 1 to 2 minutes. Discard stems, seeds, and ribs, then soak chiles in hot water to cover until softened, about 30 minutes. Drain, reserving soaking liquid. Purée chiles in a mini food processor or a blender, adding 2 to 3 tablespoons soaking liquid as needed to form a paste. Force paste through a fine-mesh sieve into a bowl and discard solids. Set aside 1 1/2 tablespoons chile paste and freeze remainder for another use.",
            "Bring juice and 1 cup sugar to a boil in a 1- to 1 1/2-quart saucepan, stirring until sugar is dissolved. Pour hot syrup over chocolate in a large bowl, stirring until chocolate is melted. Add butter and stir until melted.",
            "Add eggs 1 at a time, whisking after each addition, then stir in chile paste, flour, and salt. Divide among ramekins and bake in hot water bath , uncovered, until just firm and top is starting to crust, 50 to 60 minutes. Transfer ramekins with tongs to a work surface and let stand 2 minutes.",
            "Unmold warm cakes directly onto dessert plates (they will be difficult to move once they adhere).",
            "*Available at Mexican markets, many supermarkets, and Chile Today—Hot Tamale (800-468-7377).",
            "*Available at Mexican markets, many supermarkets, and Chile Today—Hot Tamale (800-468-7377)."
        ],
        "picture_link": null,
        "color": 13813535
    }
}