{
    "recipe": {
        "title": "Bon Ton-Style Fried Chicken ",
        "ingredients": [
            "1 qt water",
            "2 tablespoons salt",
            "2 teaspoons cayenne",
            "2 teaspoons garlic powder",
            "1 1/2 teaspoons white pepper",
            "1 tablespoon soy sauce",
            "2 teaspoons Worcestershire sauce",
            "4 chicken breast halves, 4 thighs, and 4 drumsticks (all with skin and bones; 4 to 4 1/2 pounds total)",
            "About 12 cups vegetable oil",
            "3 cups all-purpose flour",
            "1 tablespoon salt",
            "1 teaspoon garlic powder",
            "1 teaspoon cayenne",
            "1 teaspoon white pepper"
        ],
        "instructions": [
            "Whisk together all marinade ingredients in a large bowl.",
            "Add chicken, making sure it is covered with marinade. Chill, covered, stirring twice, about 24 hours.",
            "Dredge and fry chicken: Heat 2 inches oil in a wide 8- to 9 1/2-quart pot over moderately high heat until a deep-fat thermometer registers 365 to 375°F. (Our pot was 12 inches wide and 5 inches deep; if you don’t have that wide a pot, you can fry the chicken in two batches.) Meanwhile, whisk together all dredging ingredients in a large bowl. Drain chicken, discarding marinade. Dredge each piece of chicken in seasoned flour and put on a large baking sheet. Let stand about 10 minutes. Fry chicken, turning a few times, 20 to 25 minutes, or until golden brown, then drain on a rack.",
            "Heat 2 inches oil in a wide 8- to 9 1/2-quart pot over moderately high heat until a deep-fat thermometer registers 365 to 375°F. (Our pot was 12 inches wide and 5 inches deep; if you don’t have that wide a pot, you can fry the chicken in two batches.)",
            "Meanwhile, whisk together all dredging ingredients in a large bowl. Drain chicken, discarding marinade. Dredge each piece of chicken in seasoned flour and put on a large baking sheet. Let stand about 10 minutes.",
            "Fry chicken, turning a few times, 20 to 25 minutes, or until golden brown, then drain on a rack."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56102611f3a00aeb2f1d7ade/6:4/w_274%2Ch_169/103662.jpg",
        "color": 16774836
    }
}