{
    "recipe": {
        "title": "Boneless Buffalo Chicken \"Wings\" ",
        "ingredients": [
            "2 cups buttermilk",
            "2 tablespoons hot sauce (preferably Frank's)",
            "2 tablespoons kosher salt, divided, plus more",
            "2 pounds boneless, skinless chicken breasts, cut crosswise into 1\" strips",
            "3 cups all-purpose flour",
            "2 tablespoons garlic powder",
            "1 tablespoon paprika",
            "1/2 teaspoon cayenne pepper",
            "2 teaspoons freshly ground black pepper",
            "5 tablespoons unsalted butter",
            "1/2 cup hot sauce (preferably Frank's)",
            "2 tablespoons pure maple syrup",
            "1/2 cup sour cream",
            "1/4 cup buttermilk",
            "1/4 cup crumbled blue cheese",
            "1/2 teaspoon freshly ground black pepper",
            "1/4 teaspoon kosher salt",
            "2 tablespoons chopped chives, divided",
            "Vegetable oil (for frying)",
            "4 celery stalks, cut crosswise into 4–5\" pieces",
            "A deep-fry thermometer"
        ],
        "instructions": [
            "Prep the chicken: Stir buttermilk, hot sauce, and 1 Tbsp. salt in a wide, shallow bowl. Add chicken and toss to coat. Mix flour, garlic powder, paprika, cayenne, black pepper, and remaining 1 Tbsp. salt in a large bowl. Working in batches, transfer chicken to bowl with flour mixture. Toss to coat, then transfer to a rimmed baking sheet or large platter. Working in batches again, dip in buttermilk mixture, allow excess to drip off, then dip again in flour mixture. Transfer back to baking sheet and chill at least 15 minutes and up to 2 hours.",
            "Stir buttermilk, hot sauce, and 1 Tbsp. salt in a wide, shallow bowl. Add chicken and toss to coat.",
            "Mix flour, garlic powder, paprika, cayenne, black pepper, and remaining 1 Tbsp. salt in a large bowl.",
            "Working in batches, transfer chicken to bowl with flour mixture. Toss to coat, then transfer to a rimmed baking sheet or large platter. Working in batches again, dip in buttermilk mixture, allow excess to drip off, then dip again in flour mixture. Transfer back to baking sheet and chill at least 15 minutes and up to 2 hours.",
            "For the hot sauce: Meanwhile, cook butter, hot sauce, and maple syrup in a small saucepan over medium heat, stirring, until butter is melted and mixture is smooth.",
            "Meanwhile, cook butter, hot sauce, and maple syrup in a small saucepan over medium heat, stirring, until butter is melted and mixture is smooth.",
            "For the blue cheese dip: Whisk sour cream, buttermilk, blue cheese, pepper, salt, and 1 Tbsp. plus 2 tsp. chives in a small bowl. Top with remaining 1 tsp. chives.",
            "Whisk sour cream, buttermilk, blue cheese, pepper, salt, and 1 Tbsp. plus 2 tsp. chives in a small bowl. Top with remaining 1 tsp. chives.",
            "Fry the chicken: Preheat oven to 250°F. Set a wire rack over another rimmed baking sheet. Pour oil into a large heavy pot fitted with thermometer to a depth of 2\". Heat over medium-high until thermometer registers 350°F. Working in batches, fry chicken, turning occasionally, until crispy and golden brown and an instant-read thermometer registers 165°F, 4–6 minutes per batch. Transfer chicken to prepared wire rack, season with salt, and keep warm in oven. Right before serving, transfer fried chicken to a large bowl. Pour hot sauce mixture over and gently turn with tongs until coated. Serve with blue cheese dip and celery sticks alongside.",
            "Preheat oven to 250°F. Set a wire rack over another rimmed baking sheet.",
            "Pour oil into a large heavy pot fitted with thermometer to a depth of 2\". Heat over medium-high until thermometer registers 350°F. Working in batches, fry chicken, turning occasionally, until crispy and golden brown and an instant-read thermometer registers 165°F, 4–6 minutes per batch. Transfer chicken to prepared wire rack, season with salt, and keep warm in oven.",
            "Right before serving, transfer fried chicken to a large bowl. Pour hot sauce mixture over and gently turn with tongs until coated. Serve with blue cheese dip and celery sticks alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/596d14096c42213eb20a2b65/6:4/w_274%2Ch_169/How-To-Make-Boneless-Buffalo-Chicken-Wings-071220172005.jpg"
    }
}