{
    "recipe": {
        "title": "Bourbon-Brown Butter Pecan Pie ",
        "ingredients": [
            "1/2 teaspoon kosher salt",
            "1 1/2 cups all-purpose flour, plus more",
            "3/4 cup vegetable shortening",
            "1/2 cup (1 stick) unsalted butter",
            "3 large eggs",
            "1 cup (packed) light brown sugar",
            "1/2 cup honey",
            "1/2 cup pure cane syrup (such as Steen's) or dark corn syrup",
            "2 tablespoons bourbon",
            "2 tablespoons vanilla extract",
            "Pinch of freshly grated nutmeg",
            "Pinch of ground cinnamon",
            "2 cups pecans, chopped"
        ],
        "instructions": [
            "Crust: Whisk salt and 1 1/2 cups flour in a medium bowl. Using a fork, work in shortening until mixture is crumbly. Mix in 2 tablespoons cold water and knead until dough just comes together. Roll out dough on a lightly floured surface until about 1/4\" thick. Fold in half, then in half again (so that it's folded into quarters); roll out to a 12\" round. Transfer to a 9\" pie dish. Lift up edges and let dough slump down into dish. Trim, leaving about 1\" overhang. Fold edges under and crimp. Freeze while you make the filling.",
            "Whisk salt and 1 1/2 cups flour in a medium bowl. Using a fork, work in shortening until mixture is crumbly. Mix in 2 tablespoons cold water and knead until dough just comes together.",
            "Roll out dough on a lightly floured surface until about 1/4\" thick. Fold in half, then in half again (so that it's folded into quarters); roll out to a 12\" round. Transfer to a 9\" pie dish. Lift up edges and let dough slump down into dish. Trim, leaving about 1\" overhang. Fold edges under and crimp. Freeze while you make the filling.",
            "Assembly: Place a rack in lower third of oven; preheat oven to 425°F. Cook butter in a small saucepan over medium heat, stirring often, until it foams, then browns, 5-8 minutes. Transfer to a large bowl; let cool slightly. Whisk in eggs, brown sugar, honey, cane syrup, bourbon, vanilla, nutmeg, and cinnamon until smooth; fold in pecans. Scrape filling into pie crust. Bake pie 10 minutes. Reduce oven temperature to 375°F and continue to bake until crust is golden brown and filling jiggles only slightly in the center, 40-45 minutes. Transfer to a wire rack; let Chill until firm, at least 4 hours.",
            "Place a rack in lower third of oven; preheat oven to 425°F. Cook butter in a small saucepan over medium heat, stirring often, until it foams, then browns, 5-8 minutes. Transfer to a large bowl; let cool slightly. Whisk in eggs, brown sugar, honey, cane syrup, bourbon, vanilla, nutmeg, and cinnamon until smooth; fold in pecans. Scrape filling into pie crust.",
            "Bake pie 10 minutes. Reduce oven temperature to 375°F and continue to bake until crust is golden brown and filling jiggles only slightly in the center, 40-45 minutes. Transfer to a wire rack; let",
            "Chill until firm, at least 4 hours."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ab4a776529d92b2c033034/6:4/w_274%2Ch_169/51252550_pecan-pie_1x1.jpg"
    }
}