{
    "recipe": {
        "title": "Braised Lamb Shanks with Winter Squash and Red Chard ",
        "ingredients": [
            "4 3/4- to 1-pound lamb shanks",
            "2 tablespoons vegetable oil",
            "4 tablespoons (1/2 stick) butter",
            "1 1/2cups chopped onion",
            "1 cup chopped carrots",
            "1 cup chopped parsnips",
            "4 fresh large thyme sprigs",
            "2 whole garlic heads, unpeeled, cut horizontally in half",
            "1 cup dry red wine",
            "5 cups chicken stock or canned low-salt chicken broth",
            "1 large orange, peel and pith cut away, orange quartered",
            "2 whole cinnamon sticks",
            "2 teaspoons fennel seeds, crushed",
            "1 1 3/4-pound butternut squash, quartered lengthwise, seeded",
            "1/2teaspoon (scant) ground nutmeg",
            "1 fresh medium fennel bulb, trimmed, sliced (about 2 cups)",
            "2 teaspoons grated orange peel",
            "2 bunches red Swiss chard",
            "2 tablespoons (1/4 stick) butter"
        ],
        "instructions": [
            "Preheat oven to 375°F. Sprinkle lamb on all sides with salt and pepper. Heat oil in heavy large pot over high heat. Add lamb; cook until brown, turning occasionally, about 10 minutes. Transfer to plate. Add 1 tablespoon butter to drippings in pot. Add onion, carrots, parsnips, thyme and garlic. Sauté until vegetables soften and begin to brown, about 8 minutes. Add wine; boil until reduced almost to glaze, about 4 minutes. Return lamb to pot, arranging in single layer. Add stock, orange, cinnamon and 1 teaspoon fennel seeds; bring to boil. Place pot in oven. Braise lamb uncovered until tender, turning and basting often, about 2 hours 15 minutes.",
            "Meanwhile, rub cut sides of squash with 1 tablespoon butter; sprinkle with salt and pepper. Arrange squash, skin side down, on baking sheet. Roast on sheet alongside lamb until tender, about 1 hour 15 minutes. Scrape squash from skins into bowl; add nutmeg and 2 tablespoons butter. Mash with fork until almost smooth; season with salt and pepper. Transfer lamb to plate. Strain braising liquid into bowl; spoon off fat, if desired. Return liquid to pot. Add fresh fennel, orange peel and 1 teaspoon fennel seeds. Simmer until fennel is tender and sauce is thick enough to coat spoon, about 15 minutes. Return lamb to sauce.",
            "Rewarm lamb shanks, covered, over medium-low heat, about 15 minutes. Rewarm squash in saucepan over low heat, stirring often, about 10 minutes.",
            "Chard and final preparation: While lamb and squash heat, cut out center stem from chard leaves; discard stems. Coarsely tear leaves. Melt butter in heavy large skillet over high heat. Add chard and toss until chard wilts, about 4 minutes. Season with salt and pepper. Divide squash and chard among 4 plates. Arrange lamb atop vegetables; spoon sauce with fennel over.",
            "While lamb and squash heat, cut out center stem from chard leaves; discard stems. Coarsely tear leaves. Melt butter in heavy large skillet over high heat. Add chard and toss until chard wilts, about 4 minutes. Season with salt and pepper.",
            "Divide squash and chard among 4 plates. Arrange lamb atop vegetables; spoon sauce with fennel over."
        ],
        "picture_link": null
    }
}