{
    "recipe": {
        "title": "Braised Short Ribs with Potatoes and Apples \"Risotto Style\" ",
        "ingredients": [
            "6 (10-ounce) bone-in beef short ribs",
            "1 teaspoon fine sea salt",
            "1/2 cup olive oil",
            "3 medium onions, cut into large dice",
            "1 head garlic, peeled and cloves left whole",
            "3 medium carrots, peeled and cut into large dice",
            "3 medium celery stalks, cut into large dice",
            "2 medium Granny Smith apples, peeled, cored, and cut into large dice",
            "2 cups dry red wine",
            "8 ounces strained tomato purée",
            "10 cups chicken stock or low-sodium chicken broth",
            "1/4 teaspoon freshly ground black pepper",
            "4 whole dried bay leaves",
            "2 large Yukon Gold potatoes, peeled and cut into small dice",
            "2 large Granny Smith apples, peeled, cored, and cut into small dice",
            "2 tablespoons unsalted butter",
            "1 medium onion, cut into small dice",
            "4 cloves garlic, minced",
            "1/2 cup crisp, dry white wine",
            "1/2 cup chicken stock or low-sodium chicken broth",
            "2 ounces Parmesan cheese, finely grated (about 1/2 cup)",
            "Juice of 1/2 lemon",
            "1/2 teaspoon fine sea salt",
            "1/4 teaspoon freshly ground black pepper"
        ],
        "instructions": [
            "Pat the short ribs dry and place in a large bowl. Sprinkle with 1/2 teaspoon salt. Cover and refrigerate 24 hours.",
            "Position a rack in the middle of the oven and preheat to 325°F.",
            "In a heavy, large ovenproof pot over moderately high heat, heat 1/4 cup olive oil until smoking. Working in 2 batches (wipe the pan clean and add remaining 1/4 cup oil between batches), sear the ribs, turning with tongs, until golden brown on all sides, about 8 minutes per batch. Transfer the ribs to a large bowl. Do not clean the skillet. Add the onions, garlic, carrots, celery, and apples to the pot. Over moderately high heat, sauté until the vegetables and apples start to soften, about 15 minutes. Add the wine and bring to a boil, scraping up any browned bits. Add the tomato purée and chicken stock then return the ribs, along with any accumulated juices, to the pot. Make sure the ribs are completely covered with liquid; add water or additional stock if necessary. Sprinkle with the remaining 1/2 teaspoon salt and the pepper and stir in the bay leaves. Cover the pot, transfer it to the oven, and braise the ribs for 2 hours.",
            "Uncover the ribs and continue braising until the meat is tender and starting to fall off the bone, about 45 minutes. Gently remove the ribs from the pot and transfer to a large bowl.",
            "When the ribs are cool enough to handle, trim any excess fat and, if desired, remove meat from the bones.",
            "Pour braising liquid through a fine-mesh sieve into a clean large pot, pressing on any solids. Discard the solids and skim any fat from the braising liquid. Place the braising liquid over high heat, cover, and bring to a boil. Lower the heat and simmer, uncovered, until slightly reduced, about 20 minutes. Return the ribs, along with any accumulated juices, to the pot and simmer until heated through, about 5 minutes. DO AHEAD: The short ribs can be prepared ahead and refrigerated, in the braising liquid, up to 2 days. Reheat the short ribs in their braising liquid in a large, heavy pot over moderately high heat.",
            "Make the potatoes and apples: Line a baking sheet with 2 layers of paper towels. In a medium saucepan over high heat, bring salted water to a boil (use about 1 tablespoon salt for every 4 quarts water). Add the potatoes and apples and boil, uncovered, until just starting to get tender, about 3 minutes. Drain the potatoes and apples and transfer to the paper-towel-lined baking sheet to cool. In a small, heavy saucepan over moderate heat, heat 1 tablespoon butter until melted. Add the onion and garlic and sauté until soft, about 5 minutes. Add the wine and cook until evaporated, about 2 minutes. Add the potatoes, apples, and chicken stock and simmer, stirring constantly, until the liquid is absorbed and the mixture is creamy and slightly thickened, about 12 minutes. Remove the pot from the heat and stir in the cheese, the remaining tablespoon of butter, and lemon juice. Sprinkle with salt and pepper.",
            "Line a baking sheet with 2 layers of paper towels.",
            "In a medium saucepan over high heat, bring salted water to a boil (use about 1 tablespoon salt for every 4 quarts water). Add the potatoes and apples and boil, uncovered, until just starting to get tender, about 3 minutes. Drain the potatoes and apples and transfer to the paper-towel-lined baking sheet to cool.",
            "In a small, heavy saucepan over moderate heat, heat 1 tablespoon butter until melted. Add the onion and garlic and sauté until soft, about 5 minutes. Add the wine and cook until evaporated, about 2 minutes. Add the potatoes, apples, and chicken stock and simmer, stirring constantly, until the liquid is absorbed and the mixture is creamy and slightly thickened, about 12 minutes. Remove the pot from the heat and stir in the cheese, the remaining tablespoon of butter, and lemon juice. Sprinkle with salt and pepper.",
            "To serve: Divide the apples and potatoes among 6 plates. Arrange 1 short rib on each plate then drizzle with braising liquid and serve immediately.",
            "Divide the apples and potatoes among 6 plates. Arrange 1 short rib on each plate then drizzle with braising liquid and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b273e4a801766f773f575f/6:4/w_274%2Ch_169/363549_braised-short-ribs_1x1.jpg"
    }
}