{
    "recipe": {
        "title": "Braised Trout in Chilli Bean Sauce (Dou Ban Yu) ",
        "ingredients": [
            "1 rainbow trout (about 3/4 lb/350g), scaled and cleaned, but with head and tail intact",
            "Salt",
            "1 tbsp Shaoxing wine",
            "1/2 cup (100ml) cooking oil, plus 2-3 tbsp more",
            "2 1/2 tbsp Sichuan chilli bean paste",
            "2 tsp finely chopped ginger",
            "4 tsp finely chopped garlic",
            "3/4 cup (200ml) chicken stock",
            "1 tsp light soy sauce, to taste",
            "2 tsp potato flour dissolved in 1 1/2 tbsp cold water",
            "3-4 tbsp finely sliced spring onion greens",
            "1 tsp sesame oil"
        ],
        "instructions": [
            "Make three even, diagonal cuts into the thickest part of each side of the fish, to allow the sauce to penetrate. Rub it inside and out with a little salt, then rub the Shaoxing wine into its belly cavity. Set aside for 10-15 minutes, then drain off any liquid and pat it dry. Rub a little more salt into the skin on both sides (to prevent sticking).",
            "Add the 1/2 cup (100ml) oil to a seasoned wok over a high flame. When it is hot, slide in the fish and fry on both sides until it is a little golden (it won't be cooked through). You need to turn the fish carefully and tilt it so the oil comes into contact with all the skin. Pour off the oil into a heatproof container and slide the fish on to a plate.",
            "Clean the wok if necessary, then reheat it over a high flame. Add the 2-3 tbsp oil and reduce the heat to medium. Add the chilli bean paste and stir-fry until the oil is red and smells delicious. Add the ginger and garlic and stir-fry until you can smell them. Pour in the stock and bring to a boil. Slide in the fish and cook for five minutes or so, seasoning with soy sauce to taste. Keep spooning the sauce over the fish and tipping the wok so the whole fish is cooked. (If you are using a larger fish, turn it halfway.) Using a wok scoop and fish slice, carefully lift the fish from the sauce and lay it on a serving dish.",
            "Increase the heat, stir the potato flour mixture and add just enough to thicken the sauce to a rich, clingy consistency (do this in stages to avoid over-thickening). Stir in the spring onion, then switch off the heat. Stir in the sesame oil and ladle the sauce over the waiting fish."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56005d4ebd6b8b837d72d3ed/6:4/w_274%2Ch_169/51147400_braised-trout-in-chilli.jpg"
    }
}