{
    "recipe": {
        "title": "Braised Beef Cheeks ",
        "ingredients": [
            "4 tablespoons extra-virgin olive oil",
            "4 (12-oz) beef cheeks, trimmed of excess fat",
            "1 medium onion, finely chopped",
            "1 medium carrot, finely chopped",
            "1/2 celery rib, finely chopped",
            "1/2 teaspoon unsweetened cocoa powder",
            "2 cups red wine (preferably a dry Lambrusco or Chianti)",
            "1 (28- to 32-oz) can whole tomatoes including juice, chopped (3 cups)",
            "1 1/2 teaspoons salt",
            "1 teaspoon black pepper"
        ],
        "instructions": [
            "Heat 2 tablespoons oil in an ovenproof 6-quart wide heavy pot over moderately high heat until hot but not smoking. While oil is heating, pat beef cheeks dry and season with salt and pepper. Brown beef, without crowding, on all sides, about 20 minutes total, and transfer with tongs to a bowl. Pour off fat from pot, then add remaining 2 tablespoons oil and cook onion, carrot, and celery over moderately low heat, stirring occasionally, until softened, about 10 minutes. Preheat oven to 325°F. Stir cocoa powder into vegetable mixture, then add wine and scrape up any brown bits. Increase heat to high and boil until liquid is reduced by half, about 10 minutes. Return cheeks (with any juices) to pot and add tomatoes with juice, salt, and pepper. Bring to a simmer, then braise, covered, in middle of oven until very tender, about 3 hours.",
            "Heat 2 tablespoons oil in an ovenproof 6-quart wide heavy pot over moderately high heat until hot but not smoking. While oil is heating, pat beef cheeks dry and season with salt and pepper. Brown beef, without crowding, on all sides, about 20 minutes total, and transfer with tongs to a bowl. Pour off fat from pot, then add remaining 2 tablespoons oil and cook onion, carrot, and celery over moderately low heat, stirring occasionally, until softened, about 10 minutes.",
            "Preheat oven to 325°F.",
            "Stir cocoa powder into vegetable mixture, then add wine and scrape up any brown bits. Increase heat to high and boil until liquid is reduced by half, about 10 minutes.",
            "Return cheeks (with any juices) to pot and add tomatoes with juice, salt, and pepper. Bring to a simmer, then braise, covered, in middle of oven until very tender, about 3 hours."
        ],
        "picture_link": "https://assets.epicurious.com/photos/579fa0ea437fcffe02f72346/6:4/w_274%2Ch_169/braised-beef-cheeks.jpg"
    }
}