{
    "recipe": {
        "title": "Braised Turnips with Poppy-Seed Bread Crumbs ",
        "ingredients": [
            "3 tablespoons unsalted butter",
            "2 pounds medium turnips (not Japanese), peeled and cut into 1-inch-thick wedges",
            "1 1/2 cups water",
            "1 tablespoon fresh lemon juice",
            "2 tablespoons extra-virgin olive oil",
            "1 garlic clove, minced",
            "1 cup fine fresh bread crumbs from a baguette",
            "1 tablespoon poppy seeds",
            "1 tablespoon chopped flat-leaf parsley"
        ],
        "instructions": [
            "Braise turnips: Melt butter in a 12-inch heavy skillet over medium heat, then add turnips, water, lemon juice, and 1/2 teaspoon salt and bring to a boil. Reduce heat to low and simmer, covered, 30 minutes. Increase heat to medium and stir turnips, then briskly simmer, uncovered, until all of liquid has evaporated and turnips are glazed and just tender, 20 to 35 minutes (they should be cooked through but still retain their shape).",
            "Melt butter in a 12-inch heavy skillet over medium heat, then add turnips, water, lemon juice, and 1/2 teaspoon salt and bring to a boil. Reduce heat to low and simmer, covered, 30 minutes. Increase heat to medium and stir turnips, then briskly simmer, uncovered, until all of liquid has evaporated and turnips are glazed and just tender, 20 to 35 minutes (they should be cooked through but still retain their shape).",
            "Make bread crumbs while turnips cook: Heat oil in a large heavy skillet over medium heat until it shimmers, then cook garlic, stirring, until pale golden, about 1 minute. Add bread crumbs and poppy seeds and cook, stirring frequently, until golden, 4 to 5 minutes. Stir in parsley and salt to taste. Just before serving, sprinkle bread crumbs over turnips.",
            "Heat oil in a large heavy skillet over medium heat until it shimmers, then cook garlic, stirring, until pale golden, about 1 minute. Add bread crumbs and poppy seeds and cook, stirring frequently, until golden, 4 to 5 minutes. Stir in parsley and salt to taste. Just before serving, sprinkle bread crumbs over turnips.",
            "What to drink: Chateau Reynella McLaren Vale Grenache '04",
            "Chateau Reynella McLaren Vale Grenache '04"
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d77ebf3a00aeb2f1cb424/6:4/w_274%2Ch_169/241507_hires.jpg"
    }
}