{
    "recipe": {
        "title": "Braised Veal Shanks ",
        "ingredients": [
            "8 (12- to 14-oz) meaty cross-cut veal shanks (also known as ossobuco; each about 13/4 inches thick)",
            "3/4 cup all-purpose flour",
            "3 1/2 teaspoons salt",
            "1 1/4 teaspoons black pepper",
            "6 tablespoons extra-virgin olive oil",
            "1 large onion, chopped (2 cups)",
            "4 large garlic cloves, finely chopped",
            "5 anchovy fillets, rinsed, patted dry, and finely chopped",
            "2 Turkish bay leaves or 1 California",
            "1 cup dry white wine",
            "1 (28-oz) can whole tomatoes in juice, pulsed (including juice) in food processor until chopped",
            "1 cup water",
            "2 (4- by 1-inch) strips fresh lemon zest",
            "2 (4- by 1-inch) strips fresh orange zest",
            "1/4 cup finely chopped fresh flat-leaf parsley",
            "1 teaspoon finely grated fresh lemon zest",
            "1 teaspoon finely grated fresh orange zest",
            "1 large garlic clove, minced"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 350°F.",
            "Pat shanks dry. Stir together flour, 2 teaspoons salt, and 1 teaspoon pepper on a sheet of wax paper. Heat 2 tablespoons oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking. While oil heats, dredge 4 shanks in flour mixture, shaking off excess. Brown shanks in oil on all sides, turning with tongs, about 8 to 10 minutes. Transfer to a large (17- by 12- by 2-inch) roasting pan. Add 2 tablespoons oil to skillet and repeat with remaining 4 shanks. Discard remaining flour mixture.",
            "Add remaining 2 tablespoons oil to skillet and cook onion, garlic, anchovies, bay leaves, 1/2 teaspoon salt, and remaining 1/4 teaspoon pepper over moderate heat, stirring occasionally, until onion is softened, 6 to 8 minutes. Add wine and boil, scraping up any brown bits, until reduced by half, about 2 minutes. Stir in tomatoes, water, zest strips, and remaining teaspoon salt and bring to a boil, then pour mixture over shanks. Tightly cover pan with foil and braise in oven 1 hour. Turn shanks over, cover, and continue to braise until meat is very tender, about 1 1/2 hours more.",
            "Remove from oven and skim fat from surface of sauce, then transfer shanks and sauce to a large platter. Discard bay leaves.",
            "Make gremolata: Stir together parsley, grated zests, and garlic and sprinkle over shanks.",
            "Stir together parsley, grated zests, and garlic and sprinkle over shanks."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de5c9f3a00aeb2f1d5514/6:4/w_274%2Ch_169/232803.jpg"
    }
}