{
    "recipe": {
        "title": "Braised Chicken with Tomatoes and Olives (Poulet Provencal) ",
        "ingredients": [
            "1 pound tomatoes (3 to 4 medium), cut into wedges",
            "1 large onion, cut into wedges, leaving root ends intact",
            "1/2 cup drained brine-cured black olives, pitted if desired",
            "4 large garlic cloves, sliced, plus 1 teaspoon minced",
            "3 tablespoons olive oil, divided",
            "2 teaspoons herbes de Provence, divided",
            "1/2 teaspoon fennel seeds",
            "1 whole chicken (about 3 1/2 pounds)",
            "Equipment: kitchen string",
            "Accompaniment: crusty bread",
            "Garnish: chopped flat-leaf parsley"
        ],
        "instructions": [
            "Preheat convection oven to 400°F or regular oven to 425°F with rack in middle. Toss together tomatoes, onion, olives, sliced garlic, 2 tablespoons oil, 1 teaspoon herbes de Provence, fennel seeds, 1/2 teaspoon salt, and 1/4 teaspoon pepper in a 13- by 9-inch or other 3-quart shallow baking dish. Push vegetables to sides of dish to make room for chicken. Stir together minced garlic, 1 teaspoon salt, 1/2 teaspoon pepper, remaining teaspoon herbes de Provence, and remaining tablespoon olive oil. Remove excess fat from chicken and pat dry, then rub inside and out with seasoning mixture. Tie legs together with string, then put chicken in baking dish. Roast until an instant-read thermometer inserted into thickest part of a thigh (do not touch bone) registers 170°F, about 1 hour in convection oven; 1 to 1 1/4 hours in regular oven. Let chicken stand 10 minutes before carving. Serve with vegetables and pan juices.",
            "Preheat convection oven to 400°F or regular oven to 425°F with rack in middle.",
            "Toss together tomatoes, onion, olives, sliced garlic, 2 tablespoons oil, 1 teaspoon herbes de Provence, fennel seeds, 1/2 teaspoon salt, and 1/4 teaspoon pepper in a 13- by 9-inch or other 3-quart shallow baking dish. Push vegetables to sides of dish to make room for chicken.",
            "Stir together minced garlic, 1 teaspoon salt, 1/2 teaspoon pepper, remaining teaspoon herbes de Provence, and remaining tablespoon olive oil.",
            "Remove excess fat from chicken and pat dry, then rub inside and out with seasoning mixture. Tie legs together with string, then put chicken in baking dish.",
            "Roast until an instant-read thermometer inserted into thickest part of a thigh (do not touch bone) registers 170°F, about 1 hour in convection oven; 1 to 1 1/4 hours in regular oven.",
            "Let chicken stand 10 minutes before carving. Serve with vegetables and pan juices."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d781c7b55306961bf331c/6:4/w_274%2Ch_169/241766_hires.jpg"
    }
}