{
    "recipe": {
        "title": "Bratwurst in Beer ",
        "ingredients": [
            "1/4 cup butter",
            "2 medium onions, sliced into thin rings",
            "4 garlic cloves, finely chopped (optional)",
            "3 to 4 (12-ounce) cans cheap beer (Wisconsin fans insist on Pabst Blue Ribbon)",
            "8 bratwurst links",
            "8 small, crusty hoagie rolls<",
            "Whole-grain mustard",
            "Dill pickle spears"
        ],
        "instructions": [
            "1. Prepare the grill for a medium-hot fire 2. Place the butter in a medium disposable foil roasting pan. Place the pan on the grill rack and cook until the butter melts. Add the onions and garlic (if using); cook until softened, three to five minutes. Add the beer and bring to a simmer. Place the pan on the low heat zone and keep the onion mixture warm. 3. Place the bratwurst on the grill rack. Grill, turning occasionally, until evenly charred, four to five minutes. Transfer the bratwurst to the onion mixture and let stand until ready to serve. 4. With tongs, place the bratwurst in the rolls. Serve with the onions, mustard, and pickle spears.",
            "1. Prepare the grill for a medium-hot fire",
            "2. Place the butter in a medium disposable foil roasting pan. Place the pan on the grill rack and cook until the butter melts. Add the onions and garlic (if using); cook until softened, three to five minutes. Add the beer and bring to a simmer. Place the pan on the low heat zone and keep the onion mixture warm.",
            "3. Place the bratwurst on the grill rack. Grill, turning occasionally, until evenly charred, four to five minutes. Transfer the bratwurst to the onion mixture and let stand until ready to serve.",
            "4. With tongs, place the bratwurst in the rolls. Serve with the onions, mustard, and pickle spears."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5747a760d058cce045e11d9d/6:4/w_274%2Ch_169/shutterstock_308134997.jpg"
    }
}