{
    "recipe": {
        "title": "Breakfast Pizza with Sausage, Eggs, Spinach, and Cream ",
        "ingredients": [
            "1 ball of homemade or store-bought pizza dough (about 1-pound/304 g)",
            "3 ounces (85 g) fresh mozzarella, pinched into small chunks",
            "2 cups (220 g) shredded low-moisture mozzarella",
            "2 or 3 handfuls baby spinach",
            "1 large clove garlic, chopped or very thinly sliced",
            "1/2 cup (70 g) fresh sausage",
            "1/2 cup (120 ml) heavy cream",
            "Fine sea salt",
            "2 large eggs",
            "Freshly ground black pepper",
            "2 tablespoons chopped fresh chives",
            "Crushed red pepper flakes",
            "Extra-virgin olive oil",
            "3 tablespoons grated hard cheese"
        ],
        "instructions": [
            "Place your stone on the lowest shelf of your oven, then turn your oven to its highest temperature. Most ovens go to 500°F (260°C) and some to 550°F (287°C). Heat your stone for at least one hour before baking.",
            "If you’re taking your dough out of the fridge, give it about 15 minutes or so to warm up a bit so it will be easier to work with. It should have doubled in size in the fridge. If it hasn’t, let it sit at room temperature, covered with a slightly damp towel, until it does.",
            "Lightly flour your counter and your hands. Flip the dough into the flour bowl so the top side of the dough ball gets dusted first. Flip it once more, making sure that the dough is completely coated. Press the dough down into the flour, then pick it up and place it on the floured countertop.",
            "Pressing your fingers firmly into the dough, start by flattening the center and work your way out toward the edge to make it wider, until it’s about 7 to 9 inches (17 to 23 cm) wide. Pushing down on the dough will release some of the gas and actually begin opening up the dough. Be careful not to disturb the outermost lip. This will eventually become your crust.",
            "The next step is a bit tricky. Your goal is to take this disc of dough and carefully stretch it to about 14 to 16 inches (35.5 to 40.5 cm) without tearing it or creating a hole. I pick it up with floured hands and begin to gently stretch it over my fists, letting gravity do most of the work.",
            "Once you’ve stretched it enough, put the dough back on the counter, making sure there is a generous dusting of flour underneath. Take a few generous pinches of semolina flour and dust your pizza peel. Make sure it’s coated evenly. Gently lift and transfer your dough to the peel. Make sure both your hands and the peel are well-floured. You are now ready to dress your pie.",
            "Start by adding both mozzarellas to the dough, followed by the spinach and garlic. Add the sausage. Top with the cream and season with salt. Transfer to the oven. Bake for 3 minutes, then open the oven, pull out the rack with the baking stone, crack the eggs into the center of the pizza, and season them with salt and pepper. Push the rack back into the oven, close the door, and finish baking.",
            "The crust will rise significantly. Then change the oven setting from bake to broil, cooking the pizza from the top down until the crust begins to blister. The residual heat of the stone will continue to cook the bottom. (If your broiler is at the bottom of your oven, skip this step and continue to bake the pizza as described.) I cook all my pizzas until they’re well done, which could take up to 10 minutes total (sometimes less). Just keep checking so you don’t burn it. Look for the cheese to color and the crust to turn deep brown. It may blacken in spots, and that’s okay.",
            "When the pizza is done, remove it from the oven and finish with the chives, a pinch or two of crushed red pepper flakes, a drizzle of olive oil, and the grated hard cheese."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59760e15c432e55b145b3e11/6:4/w_274%2Ch_169/breakfast-pizza-with-sausage-eggs-and-spinach-072417.jpg",
        "color": 15838260
    }
}