{
    "recipe": {
        "title": "Brioche Dough ",
        "ingredients": [
            "1 teaspoon sugar",
            "1/4 cup warm milk or water (105°F)",
            "1 (1/4-ounce) package active dry yeast (2 1/2 teaspoons)",
            "1/2 cup sifted all-purpose flour (sift before measuring)",
            "1/4 teaspoon salt",
            "3 tablespoons sugar",
            "1 tablespoon hot milk or water",
            "3 large eggs",
            "1 1/2 cups sifted all-purpose flour (sift before measuring)",
            "1 1/2 sticks (3/4 cup) unsalted butter, cut into 1/2-inch slices and well softened",
            "a standing electric mixer with whisk and dough-hook attachments"
        ],
        "instructions": [
            "Make starter: Stir together sugar and milk in a small bowl. Sprinkle yeast over mixture and let stand until foamy, about 10 minutes. Stir flour into yeast mixture, forming a soft dough, and cut a deep X across top. Let starter rise, covered with plastic wrap, at room temperature, 1 hour.",
            "Stir together sugar and milk in a small bowl. Sprinkle yeast over mixture and let stand until foamy, about 10 minutes. Stir flour into yeast mixture, forming a soft dough, and cut a deep X across top.",
            "Let starter rise, covered with plastic wrap, at room temperature, 1 hour.",
            "Make dough: Combine salt, sugar, and hot milk in a small bowl and stir until salt and sugar are dissolved. Fit mixer with whisk attachment, then beat 2 eggs at medium-low speed until fluffy. Add sugar mixture and beat until combined well. With motor running, add in order, beating after each addition: 1/2 cup flour, remaining egg, 1/2 cup flour, about one fourth of butter, and remaining 1/2 cup flour. Beat mixture 1 minute. Remove bowl from mixer and fit mixer with dough-hook attachment. Spread starter onto dough with a rubber spatula and return bowl to mixer. Beat dough at medium-high speed 6 minutes, or until dough is smooth and elastic. Add remaining butter and beat 1 minute, or until butter is incorporated. Lightly butter a large bowl and scrape dough into bowl with rubber spatula. Lightly dust dough with flour to prevent a crust from forming. Cover bowl with plastic wrap and let dough rise at room temperature until more than doubled in bulk, 2 to 3 hours. Punch down dough and lightly dust with flour. Cover bowl with plastic wrap and chill dough, punching down after first hour, at least 12 hours.",
            "Combine salt, sugar, and hot milk in a small bowl and stir until salt and sugar are dissolved.",
            "Fit mixer with whisk attachment, then beat 2 eggs at medium-low speed until fluffy. Add sugar mixture and beat until combined well. With motor running, add in order, beating after each addition: 1/2 cup flour, remaining egg, 1/2 cup flour, about one fourth of butter, and remaining 1/2 cup flour. Beat mixture 1 minute.",
            "Remove bowl from mixer and fit mixer with dough-hook attachment. Spread starter onto dough with a rubber spatula and return bowl to mixer. Beat dough at medium-high speed 6 minutes, or until dough is smooth and elastic. Add remaining butter and beat 1 minute, or until butter is incorporated.",
            "Lightly butter a large bowl and scrape dough into bowl with rubber spatula. Lightly dust dough with flour to prevent a crust from forming.",
            "Cover bowl with plastic wrap and let dough rise at room temperature until more than doubled in bulk, 2 to 3 hours.",
            "Punch down dough and lightly dust with flour.",
            "Cover bowl with plastic wrap and chill dough, punching down after first hour, at least 12 hours."
        ],
        "picture_link": null
    }
}