{
    "recipe": {
        "title": "Broccoli Caesar ",
        "ingredients": [
            "2 oil-packed anchovy fillets (optional)",
            "1 garlic clove, thinly sliced",
            "1/4 cup fresh lemon juice",
            "2 tsp. Dijon mustard",
            "Kosher salt",
            "1 large egg yolk or 2 Tbsp. mayonnaise",
            "1/2 cup extra-virgin olive oil",
            "3 Tbsp. grated Parmesan, plus more shaved for serving",
            "2 medium heads of broccoli (about 1 1/2 lb.)",
            "1/4 head of savoy or Napa cabbage",
            "Finely grated lemon zest (for serving)",
            "Freshly cracked black pepper"
        ],
        "instructions": [
            "Using the side of a chef’s knife, mash anchovies, if using, and garlic on a cutting board until a smooth paste forms. Transfer paste to a large bowl and whisk in lemon juice, mustard, and a big pinch of salt. Add egg yolk (or mayonnaise) and whisk until smooth. Gradually add oil, whisking constantly until emulsified. Whisk in 3 Tbsp. grated Parmesan.",
            "Trim woody ends from broccoli stems, preserving as much stem as possible. Peel any thick stems to expose tender inner cores. Cut off florets as close to the dark green flowers as possible and break into bite-size pieces. Add to bowl with dressing. Starting at the floret ends of the stems, slice very thinly crosswise and add to bowl. Thinly slice cabbage crosswise (you should have about 2 cups) and add to bowl with broccoli. Toss until broccoli and cabbage are combined and evenly coated with dressing; season with salt. Let sit 10 minutes.",
            "Top salad with shaved Parmesan, some lemon zest, and a few healthy grinds of pepper.",
            "Do Ahead Dressing can be made 2 days ahead. Cover and chill.",
            "Dressing can be made 2 days ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5be07fbaa54ae06c159f85e0/6:4/w_274%2Ch_169/broccoli-caesar-recipe-BA-110518.jpg",
        "color": 16467803
    }
}