{
    "recipe": {
        "title": "Broccoli Cauliflower Casserole ",
        "ingredients": [
            "1 cauliflower head",
            "1 large broccoli head",
            "1/2 cup (1 stick) butter",
            "1 medium onion, diced",
            "2 garlic cloves, minced",
            "1/4 cup all-purpose flour",
            "2 1/2 cups low-sodium chicken broth",
            "4 ounces cream cheese, at room temperature",
            "1/4 teaspoon seasoned salt, more to taste",
            "Kosher salt and black pepper to taste",
            "1/4 teaspoon paprika, plus more for sprinkling",
            "1/3 cup seasoned breadcrumbs",
            "1 1/2 cups grated Monterey Jack cheese"
        ],
        "instructions": [
            "1. Preheat the oven to 375°F.",
            "2. Using your hands, break the cauliflower and broccoli into very small florets. Place them in a steamer and steam them over simmering water until slightly tender, 3 to 4 minutes. Set them aside.",
            "3. Melt 6 tablespoons of the butter in a large skillet over medium heat, then add the onion and garlic and cook until the onion is translucent, 3 to 4 minutes. Sprinkle in the flour, stirring it into the onion mixture and cook it for a minute or so. Pour in the broth, stirring continuously, and cook the sauce, stirring occasionally, until it begins to thicken, about 3 minutes.",
            "4. Add the cream cheese and stir until it melts completely. Then stir in the seasoned salt, kosher salt, pepper, and paprika. Turn off the heat and set the sauce aside.",
            "5. In a small bowl, combine the breadcrumbs and the remaining 2 tablespoons melted butter and blend with a fork.",
            "6. To assemble, butter a small (2-quart) casserole and add half the broccoli-cauliflower mixture. Pour on half the sauce, top with half the cheese, and sprinkle on a little paprika. Repeat another round of the veggies, sauce, cheese, and paprika...then top the casserole with the buttery breadcrumbs.",
            "7. Bake the casserole for 25 to 30 minutes, or until the breadcrumbs are golden and the casserole is bubbly around the edges. Serve it nice and piping hot!",
            "Make ahead: The casserole can be assembled and stored in the fridge, unbaked, for up to 24 hours. Allow 10 minutes extra cooking time if baking straight out of the fridge.",
            "The casserole can be assembled and stored in the fridge, unbaked, for up to 24 hours. Allow 10 minutes extra cooking time if baking straight out of the fridge."
        ],
        "picture_link": "https://assets.epicurious.com/photos/562e854e0f8ed31b2ff0d83e/6:4/w_274%2Ch_169/Broccoli-and-Cauilfower-Casserole_2000.jpg",
        "color": 11876346
    }
}