{
    "recipe": {
        "title": "Broiled Red Snapper with Za'atar Salsa Verde ",
        "ingredients": [
            "2 tablespoons pine nuts",
            "4 (6-ounce) skin-on, boneless red snapper fillets, patted dry",
            "Kosher salt, freshly ground pepper",
            "1/2 teaspoon ground coriander",
            "4 tablespoons plus 1/2 cup olive oil",
            "1/3 cup finely chopped cilantro",
            "1/3 cup finely chopped parsley",
            "1 small garlic clove, finely grated",
            "1 1/2 teaspoons za’atar",
            "1/4 teaspoon crushed red pepper flakes",
            "1 tablespoon fresh lemon juice",
            "2 tablespoons finely chopped pickled banana peppers"
        ],
        "instructions": [
            "Toast pine nuts in a dry small skillet over medium-low heat, tossing often, until golden and fragrant, about 3 minutes. Transfer to a cutting board. Let cool, then coarsely chop. Heat broiler. Season flesh side of snapper fillets with salt and pepper, then sprinkle with coriander. Drizzle 2 Tbsp. oil onto a small rimmed baking sheet and place fish, flesh side down, on top. Drizzle skin side with 2 Tbsp. oil; season with salt and pepper. Broil until skin is crisp and browned and flesh is cooked through, 8–10 minutes. Remove fish from broiler and let rest 5 minutes. Meanwhile, mix together cilantro, parsley, garlic, za’atar, red pepper flakes, and remaining ½ cup oil in a small bowl; season salsa verde with salt and pepper. Transfer fish to a platter, placing skin side up. Stir lemon juice, banana peppers, and pine nuts into salsa verde and spoon over fish.",
            "Toast pine nuts in a dry small skillet over medium-low heat, tossing often, until golden and fragrant, about 3 minutes. Transfer to a cutting board. Let cool, then coarsely chop.",
            "Heat broiler. Season flesh side of snapper fillets with salt and pepper, then sprinkle with coriander. Drizzle 2 Tbsp. oil onto a small rimmed baking sheet and place fish, flesh side down, on top. Drizzle skin side with 2 Tbsp. oil; season with salt and pepper. Broil until skin is crisp and browned and flesh is cooked through, 8–10 minutes. Remove fish from broiler and let rest 5 minutes.",
            "Meanwhile, mix together cilantro, parsley, garlic, za’atar, red pepper flakes, and remaining ½ cup oil in a small bowl; season salsa verde with salt and pepper.",
            "Transfer fish to a platter, placing skin side up. Stir lemon juice, banana peppers, and pine nuts into salsa verde and spoon over fish."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59233d79bb553a5f5751b90c/6:4/w_274%2Ch_169/broiled-red-snapper-with-zaatar-salsa-verde-BA-052217.jpg"
    }
}