{
    "recipe": {
        "title": "Brothy Poached Chicken with Mushrooms and Fresh Chile ",
        "ingredients": [
            "1 1/2 pounds boneless, skinless chicken breasts (about 3 large)",
            "1 head garlic, halved crosswise",
            "2 bay leaves",
            "4 whole allspice",
            "1 1/2 teaspoon kosher salt, plus more",
            "8 ounces maitake or shiitake mushrooms, torn into bite-size pieces",
            "1 fresh red chile (such as Fresno), thinly sliced",
            "1 (1-inch) piece ginger, peeled, finely chopped",
            "1 tablespoon distilled white vinegar",
            "1 tablespoon soy sauce",
            "Freshly ground black pepper",
            "Sliced scallions and cilantro sprigs (for serving)"
        ],
        "instructions": [
            "Place chicken, garlic, bay leaves, allspice, and 1 1/2 teaspoon salt in a medium pot. Cover with 6 cups water and bring to a bare simmer over high heat. Immediately reduce heat to medium-low, cover pot, and cook 8 minutes. Remove chicken from liquid and let cool slightly, then shred into bite-size pieces.",
            "Strain stock through a fine-mesh sieve into a clean pot; discard solids. Add mushrooms, chile, ginger, vinegar, and soy sauce to stock. Bring to a boil; reduce heat and simmer, stirring occasionally, until broth tastes rich and flavorful, 8–10 minutes. Season with salt and pepper, then add shredded chicken and simmer just until meat is warmed through.",
            "Divide soup among bowls and serve topped with scallions and cilantro.",
            "Do Ahead Chicken can be poached 2 days ahead. Let chicken and broth cool separately. Wrap up chicken and transfer broth to an airtight container; chill.",
            "Chicken can be poached 2 days ahead. Let chicken and broth cool separately. Wrap up chicken and transfer broth to an airtight container; chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b71d9a2722874e516a1ac4/6:4/w_274%2Ch_169/51260240_poached-chicken-mushrooms_1x1.jpg"
    }
}