{
    "recipe": {
        "title": "Brothy Beans and Farro with Eggs and Mushrooms ",
        "ingredients": [
            "1 small onion, unpeeled, halved",
            "1 medium carrot, peeled",
            "4 garlic cloves, 1 smashed, 3 finely chopped",
            "1 1/2 cups dried gigante, runner, or lima beans, soaked overnight, drained",
            "1 cup farro or spelt, soaked overnight, drained",
            "Kosher salt",
            "2 red Fresno chiles, seeds removed, finely chopped",
            "1/3 cup plus 3 tablespoons extra-virgin olive oil",
            "2 tablespoons finely chopped rosemary",
            "8 ounces maitake or shiitake mushrooms, torn into bite-size pieces",
            "2 teaspoons Sherry vinegar or red wine vinegar",
            "Freshly ground black pepper",
            "4 large egg yolks, room temperature"
        ],
        "instructions": [
            "Bring onion, carrot, smashed garlic, beans, and 14 cups water to a boil in a medium pot, reduce heat, and simmer, stirring occasionally, until beans are creamy but still intact, 70–90 minutes (time will vary depending on size and age of beans). Using a slotted spoon, transfer beans to a medium bowl; discard onion, carrot, and garlic.",
            "Return broth in pot to a boil and add farro. Reduce heat and simmer, stirring occasionally, until grains are tender, 25–30 minutes. Remove from heat and return beans to pot; season generously with salt. Let sit 15 minutes to infuse beans and grains with flavor. (If you have the time, cook the beans and the grains a day ahead so they can really soak up the broth. If not, no worries—just keep going.)",
            "Cook chopped garlic, chiles, and 1/3 cup oil in a medium skillet over medium heat, stirring often, until garlic is golden, about 4 minutes. Remove from heat and mix in rosemary. Transfer chile-garlic oil to a small bowl; season with salt.",
            "Wipe out skillet and heat remaining 3 Tbsp. oil over medium-high. Cook mushrooms, undisturbed, until browned underneath, about 2 minutes. Toss and continue to cook, tossing every so often, until mushrooms are browned and crisp in most spots, another 6–8 minutes. Splash vinegar over mushrooms, season with salt and pepper, and give skillet a few shakes to combine.",
            "Ladle stew into bowls and top each with some crisped mushrooms and an egg yolk (if using); drizzle with chile-garlic oil.",
            "Break egg yolk and stir into soup just before eating to give it a more silky consistency.",
            "Do Ahead Stew (without mushrooms, egg yolks, and chile-garlic oil) can be made 3 days ahead. Let cool; cover and chill.",
            "Stew (without mushrooms, egg yolks, and chile-garlic oil) can be made 3 days ahead. Let cool; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a5fc85670fa5e5f63525bec/6:4/w_274%2Ch_169/brothy-beans-and-farro-with-eggs-and-mushrooms-recipe-BA-011718.jpg",
        "color": 15112542
    }
}