{
    "recipe": {
        "title": "Brown Sugar-Pecan Cupcakes with Caramel Frosting ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "1 cup all purpose flour",
            "1/2 cup cake flour",
            "1/2 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "1/2 teaspoon fine sea salt",
            "1 1/4 cups coarsely chopped toasted pecans",
            "1/2 cup (1 stick) unsalted butter, room temperature",
            "1 cup (packed) golden brown sugar",
            "2 large eggs, room temperature",
            "1/3 cup sour cream",
            "1 teaspoon vanilla extract",
            "1 cup sugar",
            "1/4 cup water",
            "1/2 cup heavy whipping cream",
            "2 large egg yolks",
            "1/2 cup (1 stick) unsalted butter, room temperature",
            "1/8 teaspoon fine sea salt",
            "1 cup powdered sugar, sifted",
            "1 cup coarsely chopped toasted pecans",
            "12 paper muffin cup liners"
        ],
        "instructions": [
            "For cupcakes: Put rack in bottom third of oven; preheat to 350°F. Spray 12-cup muffin pan with nonstick spray; line with muffin cups. Whisk both flours, baking powder, baking soda, and sea salt in medium bowl. Stir in chopped pecans. Beat butter in large bowl until smooth. Add brown sugar; beat until light and fluffy, about 2 minutes. Add eggs 1 at a time, beating to blend between additions. Beat in sour cream and vanilla. Add dry ingredients; beat on low speed just to blend. Divide batter among muffin cups. Bake cupcakes until tester inserted into center comes out clean, about 23 minutes. Cool in pan on rack 15 minutes. Transfer to rack; cool. DO AHEAD: Can be made 8 hours ahead. Cover; store at room temperature.",
            "Put rack in bottom third of oven; preheat to 350°F. Spray 12-cup muffin pan with nonstick spray; line with muffin cups.",
            "Whisk both flours, baking powder, baking soda, and sea salt in medium bowl. Stir in chopped pecans. Beat butter in large bowl until smooth. Add brown sugar; beat until light and fluffy, about 2 minutes. Add eggs 1 at a time, beating to blend between additions. Beat in sour cream and vanilla. Add dry ingredients; beat on low speed just to blend. Divide batter among muffin cups.",
            "Bake cupcakes until tester inserted into center comes out clean, about 23 minutes. Cool in pan on rack 15 minutes. Transfer to rack; cool. DO AHEAD: Can be made 8 hours ahead. Cover; store at room temperature.",
            "For frosting: Stir sugar and 1/4 cup water in medium saucepan over medium-low heat until sugar dissolves. Increase heat to medium-high; boil until syrup turns deep amber, swirling pan and brushing down sides with wet pastry brush, 6 to 7 minutes. Remove from heat; add cream (mixture will bubble up). Stir over low heat until caramel bits dissolve. Whisk egg yolks in medium bowl. Very gradually whisk hot caramel into yolks. Cool to room temperature. Using electric mixer, beat butter and salt in large bowl until smooth. Beat in caramel. Add powdered sugar and beat until smooth. Let stand at room temperature until thick enough to spread, about 1 hour. Spread frosting over cupcakes. Place pecans on plate. Roll edges of cupcakes in nuts. DO AHEAD: Can be made 8 hours ahead. Store airtight at room temperature.",
            "Stir sugar and 1/4 cup water in medium saucepan over medium-low heat until sugar dissolves. Increase heat to medium-high; boil until syrup turns deep amber, swirling pan and brushing down sides with wet pastry brush, 6 to 7 minutes. Remove from heat; add cream (mixture will bubble up). Stir over low heat until caramel bits dissolve. Whisk egg yolks in medium bowl. Very gradually whisk hot caramel into yolks. Cool to room temperature.",
            "Using electric mixer, beat butter and salt in large bowl until smooth. Beat in caramel. Add powdered sugar and beat until smooth. Let stand at room temperature until thick enough to spread, about 1 hour.",
            "Spread frosting over cupcakes. Place pecans on plate. Roll edges of cupcakes in nuts. DO AHEAD: Can be made 8 hours ahead. Store airtight at room temperature."
        ],
        "picture_link": null
    }
}