{
    "recipe": {
        "title": "Brown Sugar and Bourbon Ribs ",
        "ingredients": [
            "1/2 cup (packed) golden brown sugar",
            "1/2 cup apple butter",
            "1/4 cup bourbon whiskey",
            "1/4 cup apple cider vinegar",
            "3 tablespoons apple cider",
            "2 tablespoons Dijon mustard",
            "1 tablespoon coarse kosher salt",
            "1 tablespoon (packed) golden brown sugar",
            "1 1/2 teaspoons dry mustard",
            "1 1/2 teaspoons dried thyme",
            "1 teaspoon ground ginger",
            "1/2 teaspoon ground cinnamon",
            "1/2 teaspoon cayenne pepper",
            "2 2- to 2 1/4-pound racks baby back pork ribs",
            "1 large onion, sliced",
            "1 cinnamon stick, broken in half",
            "6 thin rounds peeled fresh ginger",
            "1 1/4 cups apple cider"
        ],
        "instructions": [
            "For basting sauce: Whisk all ingredients in medium bowl to blend.",
            "Whisk all ingredients in medium bowl to blend.",
            "For ribs: Mix first 7 ingredients in small bowl. Using small sharp knife, loosen membrane from underside of each rib rack and pull off (or score membrane). Rub 1 tablespoon seasoning mix into each side of each rib rack. Place ribs in large roasting pan. Cover and chill at least 6 hours and up to 1 day. Preheat oven to 325°F. Lift ribs from pan. Scatter onion, cinnamon stick, and ginger in pan. Pour in cider. Return ribs, meat side down, to pan; cover pan with foil. Roast ribs until meat is tender and begins to pull away from bones, about 2 hours. Uncover; cool at least 30 minutes and up to 2 hours. Prepare barbecue (medium-high heat). Grill ribs until heated through and slightly charred, about 5 minutes per side. Brush generously on all sides with basting sauce. Grill until sauce becomes sticky glaze, about 3 minutes longer per side. Transfer rib racks to cutting board. Cut racks between bones into individual ribs. Arrange on platter and serve, passing remaining sauce separately.",
            "Mix first 7 ingredients in small bowl. Using small sharp knife, loosen membrane from underside of each rib rack and pull off (or score membrane). Rub 1 tablespoon seasoning mix into each side of each rib rack. Place ribs in large roasting pan. Cover and chill at least 6 hours and up to 1 day.",
            "Preheat oven to 325°F. Lift ribs from pan. Scatter onion, cinnamon stick, and ginger in pan. Pour in cider. Return ribs, meat side down, to pan; cover pan with foil. Roast ribs until meat is tender and begins to pull away from bones, about 2 hours. Uncover; cool at least 30 minutes and up to 2 hours.",
            "Prepare barbecue (medium-high heat). Grill ribs until heated through and slightly charred, about 5 minutes per side. Brush generously on all sides with basting sauce. Grill until sauce becomes sticky glaze, about 3 minutes longer per side. Transfer rib racks to cutting board. Cut racks between bones into individual ribs. Arrange on platter and serve, passing remaining sauce separately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de594f9a84192308a7bf1/6:4/w_274%2Ch_169/232380.jpg"
    }
}