{
    "recipe": {
        "title": "Brown Sugar and Chocolate Chip Pound Cake with Maple-Espresso Glaze ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "1 12-ounce package semisweet chocolate chips",
            "3 cups all purpose flour, divided",
            "2 teaspoons baking soda",
            "1 teaspoon baking powder",
            "3/4 teaspoon salt",
            "1 cup (2 sticks) unsalted butter, room temperature",
            "1 1/2 cups (packed) golden brown sugar",
            "2 1/2 teaspoons vanilla extract",
            "1 teaspoon maple extract",
            "4 large eggs",
            "1 cup buttermilk",
            "1 cup powdered sugar",
            "2 tablespoons pure maple syrup",
            "2 tablespoons (or more) whipping cream",
            "1 1/2 teaspoons instant espresso powder"
        ],
        "instructions": [
            "For cake: Preheat oven to 325°F. Butter 12-cup Bundt pan. Spray pan generously with nonstick spray. Dust pan lightly with flour. Mix chocolate chips and 2 tablespoons flour in medium bowl. Sift remaining flour with baking soda, baking powder, and salt into another medium bowl. Using electric mixer, beat butter and brown sugar in large bowl until fluffy, about 3 minutes. Beat in vanilla extract and maple extract. Add eggs, 1 at a time, beating well after each addition. Mix in flour mixture in 3 additions alternately with buttermilk in 2 additions, beginning and ending with flour mixture. Fold in chocolate chip mixture. Transfer batter to prepared pan, spreading evenly. Bake cake until tester inserted near center comes out clean and cake begins to pull away from sides of pan, about 1 hour. Cool cake in pan on rack 30 minutes. Invert cake onto rack and cool completely.",
            "Preheat oven to 325°F. Butter 12-cup Bundt pan. Spray pan generously with nonstick spray. Dust pan lightly with flour. Mix chocolate chips and 2 tablespoons flour in medium bowl. Sift remaining flour with baking soda, baking powder, and salt into another medium bowl. Using electric mixer, beat butter and brown sugar in large bowl until fluffy, about 3 minutes. Beat in vanilla extract and maple extract. Add eggs, 1 at a time, beating well after each addition. Mix in flour mixture in 3 additions alternately with buttermilk in 2 additions, beginning and ending with flour mixture. Fold in chocolate chip mixture. Transfer batter to prepared pan, spreading evenly.",
            "Bake cake until tester inserted near center comes out clean and cake begins to pull away from sides of pan, about 1 hour. Cool cake in pan on rack 30 minutes. Invert cake onto rack and cool completely.",
            "GOOD TO KNOW: Mixing the chocolate chips with a little flour before adding them to the batter helps the chips stay evenly suspended in the batter and evenly distributed throughout the baked cake (otherwise, they may sink to the bottom).",
            "Mixing the chocolate chips with a little flour before adding them to the batter helps the chips stay evenly suspended in the batter and evenly distributed throughout the baked cake (otherwise, they may sink to the bottom).",
            "For glaze: Combine powdered sugar, maple syrup, 2 tablespoons cream, and espresso powder in medium bowl. Whisk until smooth, adding more cream by 1/2 teaspoonfuls if glaze is too thick to drizzle. Spoon glaze decoratively over top of cake; let stand at room temperature until glaze is firm, about 1 hour. DO AHEAD: Can be made 1 day ahead. Cover with cake dome and let stand at room temperature.",
            "Combine powdered sugar, maple syrup, 2 tablespoons cream, and espresso powder in medium bowl. Whisk until smooth, adding more cream by 1/2 teaspoonfuls if glaze is too thick to drizzle. Spoon glaze decoratively over top of cake; let stand at room temperature until glaze is firm, about 1 hour. DO AHEAD: Can be made 1 day ahead. Cover with cake dome and let stand at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/554a76954e0bde621a928522/6:4/w_274%2Ch_169/pound-cake-2-CP.jpg"
    }
}