{
    "recipe": {
        "title": "Brown Soda Bread ",
        "ingredients": [
            "175g (6oz) plain flour",
            "1 teaspoon salt",
            "1 1/2 heaped teaspoons bicarbonate of soda",
            "450g (1lb) wholemeal flour, plus a little extra for dusting",
            "1 egg",
            "400ml (3/4 pint) buttermilk",
            "20cm (8in) round cake tin or Swissroll tin"
        ],
        "instructions": [
            "1. Preheat oven to 220°C/425°F/Gas 7. Dust selected tin generously with flour (we always used a Swiss roll tin for this bread). 2. Sieve the plain flour, salt and soda into a large mixing bowl. Add the wholemeal flour and mix well, lifting the dry ingredients just above the bowl's rim in order to circulate air and produce a lighter bread. 3. Beat the egg in a small bowl and beat in the buttermilk. Make a well in the dry ingredients, add the liquid and mix to a soft dough with a wooden spoon or by hand. 4. Bring dough together with flour-dusted fingers and turn out on a lightly floured surface. Knead lightly into the smooth desired shape. If the dough is sticky, dust over a little more flour and knead it in to make it more manageable. Transfer to prepared tin, dust with wholemeal and cut a cross on top with a sharp knife to allow to rise evenly. 5. Bake in preheated oven for 30–40 minutes. Remove from tin and tap the base of the bread. If it sounds hollow it us cooked, if not return to the oven for a few more minutes. Cool on a wire rack before serving with country butter and home-made jam for the full experience.",
            "1. Preheat oven to 220°C/425°F/Gas 7. Dust selected tin generously with flour (we always used a Swiss roll tin for this bread).",
            "2. Sieve the plain flour, salt and soda into a large mixing bowl. Add the wholemeal flour and mix well, lifting the dry ingredients just above the bowl's rim in order to circulate air and produce a lighter bread.",
            "3. Beat the egg in a small bowl and beat in the buttermilk. Make a well in the dry ingredients, add the liquid and mix to a soft dough with a wooden spoon or by hand.",
            "4. Bring dough together with flour-dusted fingers and turn out on a lightly floured surface. Knead lightly into the smooth desired shape. If the dough is sticky, dust over a little more flour and knead it in to make it more manageable. Transfer to prepared tin, dust with wholemeal and cut a cross on top with a sharp knife to allow to rise evenly.",
            "5. Bake in preheated oven for 30–40 minutes. Remove from tin and tap the base of the bread. If it sounds hollow it us cooked, if not return to the oven for a few more minutes. Cool on a wire rack before serving with country butter and home-made jam for the full experience."
        ],
        "picture_link": null
    }
}