{
    "recipe": {
        "title": "Brown Butter Steel-Cut Oatmeal ",
        "ingredients": [
            "2 tablespoons unsalted butter",
            "1 1/2 cups steel-cut oats",
            "4 1/2 cups water",
            "1/2 teaspoon kosher salt",
            "Brown sugar, for serving",
            "Heavy cream, for serving"
        ],
        "instructions": [
            "Select Sauté on the Instant Pot and melt the butter. Add the oats and sauté, stirring often, for about 5 minutes, until aromatic and lightly toasted. Add the water and salt and stir to combine, making sure all of the oats are submerged in the liquid.",
            "Secure the lid and set the Pressure Release to Sealing. Press the Cancel button to reset the cooking program, then select the Porridge settingand set the cooking time for 12 minutes at high pressure.",
            "Let the pressure release naturally for at least 10 minutes, then move the Pressure Release to Venting to release any remaining steam. Open the pot and stir the oatmeal to incorporate any extra liquid.",
            "Ladle the oatmeal into bowls and serve with brown sugar and cream.",
            "Variations Apple cinnamon: Stir in 1 apple, chopped, and 1/2 teaspoon cinnamon with the water. Pumpkin spice: Stir in 1 cup pumpkin puree, 1/4 cup maple syrup, and ¾ teaspoon pumpkin pie spice with the water. Peanut butter–banana: Stir 1/4 cup creamy peanut butter into the finished oatmeal. Top each serving with banana slices. Blueberry almond/pecan: Top each serving with a handful of fresh blueberries, a scattering of toasted sliced almonds or pecans, and a drizzle of honey. Savory sesame soy: Omit the salt. Stir in 2 tablespoons soy sauce and add 1/2 teaspoon toasted sesame oil with the water. Serve topped with a fried egg.",
            "Apple cinnamon: Stir in 1 apple, chopped, and 1/2 teaspoon cinnamon with the water.",
            "Pumpkin spice: Stir in 1 cup pumpkin puree, 1/4 cup maple syrup, and ¾ teaspoon pumpkin pie spice with the water.",
            "Peanut butter–banana: Stir 1/4 cup creamy peanut butter into the finished oatmeal. Top each serving with banana slices.",
            "Blueberry almond/pecan: Top each serving with a handful of fresh blueberries, a scattering of toasted sliced almonds or pecans, and a drizzle of honey.",
            "Savory sesame soy: Omit the salt. Stir in 2 tablespoons soy sauce and add 1/2 teaspoon toasted sesame oil with the water. Serve topped with a fried egg."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b2bac225801361eefb17471/6:4/w_274%2Ch_169/Brown%20Butter%20Steel%20Cut%20Oatmeal.jpg",
        "color": 10422721
    }
}