{
    "recipe": {
        "title": "Brown-Sugar Pudding ",
        "ingredients": [
            "2 cups half-and-half",
            "3/4 cup packed dark brown sugar",
            "2 tablespoons cornstarch",
            "2 large egg yolks",
            "1/4 teaspoon salt",
            "1 tablespoon unsalted butter",
            "1/2 teaspoon vanilla",
            "1/2 cup chilled heavy cream",
            "1/4 cup chilled sour cream"
        ],
        "instructions": [
            "Stir together half-and-half, brown sugar, and cornstarch in a 2- to 3-quart heavy saucepan and heat over moderate heat, stirring occasionally, until sugar is dissolved and mixture is heated through (do not let boil). Whisk together yolks and salt in a medium bowl until smooth, then add hot half-and-half mixture in a slow stream, whisking. Return mixture to saucepan and cook over moderate heat, whisking, until mixture just reaches a boil, then boil, whisking, 1 minute (mixture will thicken). Immediately pour through a fine-mesh sieve into a clean bowl and stir in butter and vanilla until butter is incorporated. Set bowl in a larger bowl of ice and cold water and chill, stirring frequently, until pudding is cool, about 10 minutes. Beat heavy cream with sour cream in a bowl with a whisk until mixture just holds stiff peaks. Divide pudding among 6 small bowls, then top each serving with a generous dollop of cream.",
            "Stir together half-and-half, brown sugar, and cornstarch in a 2- to 3-quart heavy saucepan and heat over moderate heat, stirring occasionally, until sugar is dissolved and mixture is heated through (do not let boil).",
            "Whisk together yolks and salt in a medium bowl until smooth, then add hot half-and-half mixture in a slow stream, whisking. Return mixture to saucepan and cook over moderate heat, whisking, until mixture just reaches a boil, then boil, whisking, 1 minute (mixture will thicken). Immediately pour through a fine-mesh sieve into a clean bowl and stir in butter and vanilla until butter is incorporated. Set bowl in a larger bowl of ice and cold water and chill, stirring frequently, until pudding is cool, about 10 minutes.",
            "Beat heavy cream with sour cream in a bowl with a whisk until mixture just holds stiff peaks.",
            "Divide pudding among 6 small bowls, then top each serving with a generous dollop of cream."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd7d1f3a00aeb2f1d28e6/6:4/w_274%2Ch_169/236433.jpg"
    }
}