{
    "recipe": {
        "title": "Brown Sugar Berry Cobbler ",
        "ingredients": [
            "3/4 to 1 cup plus 1 teaspoon packed dark brown sugar (depending on sweetness of berries), divided",
            "2 1/2 tablespoons cornstarch",
            "2 3/4 pound mixed berries (strawberries trimmed and halved if using)",
            "2 cups all-purpose flour",
            "2 teaspoons baking powder",
            "Rounded 1/2 teaspoon salt",
            "1 1/2 sticks cold unsalted butter, cut into pieces",
            "3/4 cup whole milk",
            "1 teaspoon granulated sugar"
        ],
        "instructions": [
            "Preheat oven to 425°F with rack in middle. Stir together 3/4 to 1 cup brown sugar and cornstarch in a large bowl. Add berries and toss to coat. Transfer mixture to a shallow 3-quart baking dish and bake until mixture is hot, about 12 minutes. Meanwhile, whisk together flour, baking powder, and salt in a medium bowl. Add butter and blend with your fingertips or a pastry blender until mixture resembles coarse meal with some roughly pea-size butter lumps. Add milk and stir until dough just comes together. Remove baking dish from oven and drop 12 mounds of dough onto hot berries. Stir together remaining teaspoon brown sugar and granulated sugar and sprinkle over dough. Bake cobbler until topping is golden, 25 to 30 minutes. Cool to warm, about 30 minutes.",
            "Preheat oven to 425°F with rack in middle.",
            "Stir together 3/4 to 1 cup brown sugar and cornstarch in a large bowl. Add berries and toss to coat. Transfer mixture to a shallow 3-quart baking dish and bake until mixture is hot, about 12 minutes.",
            "Meanwhile, whisk together flour, baking powder, and salt in a medium bowl. Add butter and blend with your fingertips or a pastry blender until mixture resembles coarse meal with some roughly pea-size butter lumps. Add milk and stir until dough just comes together.",
            "Remove baking dish from oven and drop 12 mounds of dough onto hot berries. Stir together remaining teaspoon brown sugar and granulated sugar and sprinkle over dough. Bake cobbler until topping is golden, 25 to 30 minutes. Cool to warm, about 30 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3233621388ef838b04ab4/6:4/w_274%2Ch_169/358050_brown-sugar-berry-cobbler_1x1.jpg"
    }
}