{
    "recipe": {
        "title": "Brown-Butter Pecan Pie with Rum and Espresso ",
        "ingredients": [
            "1 1/4 cups all-purpose flour, plus more for rolling",
            "2 1/4 teaspoons granulated sugar",
            "1/2 teaspoon kosher salt",
            "4 tablespoons (1/2 stick) unsalted butter, cut into pieces and frozen for 15 minutes",
            "1/4 cup solid vegetable shortening, cut into pieces and refrigerated for 15 minutes",
            "3 cups pecans, lightly toasted, divided",
            "6 tablespoons butter",
            "1 cup light brown sugar",
            "1 cup cane syrup (such as Steen's) plus 2 tablespoons, divided",
            "1/2 teaspoon salt",
            "2 teaspoons vanilla extract",
            "2 tablespoons dark rum",
            "1 tablespoon instant espresso powder",
            "3 large eggs, at room temperature, beaten",
            "9-inch pie pan"
        ],
        "instructions": [
            "Preheat the oven to 375°F with one rack on the bottom rung and one rack in the center of oven. Place a rimmed baking sheet on the bottom rack to preheat.",
            "Preheat the oven to 375°F with one rack on the bottom rung and one rack in the center of oven. Place a rimmed baking sheet on the bottom rack to preheat.",
            "Make the pie dough: In the bowl of a food processor, pulse 1 1/4 cups flour, sugar, and salt. Add butter and shortening and pulse until coarse, pea-sized crumbs form, about 10 seconds. With the machine running, add 2 tablespoons ice water and process until the dough just holds together, about 30 seconds. Squeeze a small amount of dough between your fingers: If it is very crumbly, add pulse in more ice water, 1 tablespoon at a time (2 tablespoons maximum). Do not over process. Turn dough out onto a lightly floured surface and push together into a rough ball. Knead a few times to combine, then flatten into a disc with smooth edges (no cracks), cover with plastic wrap, and refrigerate at least 1 hour or overnight. Roll out the dough into a 13-inch round on a lightly floured surface. Roll the dough loosely around the rolling pin then unfurl it into the 9-inch pie pan. Lightly press it into the pan. Leave 1 inch of dough hanging over the edge, trimming any excess dough. Tuck the dough under itself, and then crimp the edge as desired. Chill at least 30 minutes.",
            "In the bowl of a food processor, pulse 1 1/4 cups flour, sugar, and salt. Add butter and shortening and pulse until coarse, pea-sized crumbs form, about 10 seconds. With the machine running, add 2 tablespoons ice water and process until the dough just holds together, about 30 seconds. Squeeze a small amount of dough between your fingers: If it is very crumbly, add pulse in more ice water, 1 tablespoon at a time (2 tablespoons maximum). Do not over process.",
            "Turn dough out onto a lightly floured surface and push together into a rough ball. Knead a few times to combine, then flatten into a disc with smooth edges (no cracks), cover with plastic wrap, and refrigerate at least 1 hour or overnight.",
            "Roll out the dough into a 13-inch round on a lightly floured surface. Roll the dough loosely around the rolling pin then unfurl it into the 9-inch pie pan. Lightly press it into the pan. Leave 1 inch of dough hanging over the edge, trimming any excess dough. Tuck the dough under itself, and then crimp the edge as desired. Chill at least 30 minutes.",
            "Make the filling: Meanwhile, reserve 1 cup whole pecans to decorate top of pie; chop remaining 2 cups. In a small skillet over medium heat, melt butter and cook until foam has subsided and butter is toasty-brown in color and releases a nutty aroma. Pour butter into a large bowl. Whisk in sugar, syrup, salt, vanilla, rum, and espresso powder until all ingredients are well incorporated. Whisk in eggs, then fold in chopped pecans. Pour filling into pie shell (do not overfill). Toss whole pecans with remaining 2 tablespoons cane syrup and arrange on top of pie. Place on preheated rimmed baking sheet on bottom rack of oven. After 20 minutes, rotate baking sheet and move to center rack of oven. Bake until crust is golden brown and filling is almost set with a slight jiggle in center of pie, 20 to 25 minutes more. (Cover the crust edge with foil or a pie shield if it starts to brown too much.) Transfer pie to a wire rack and cool completely before slicing, about 3 hours. Pie will keep up to 2 days, loosely covered with foil, at room temperature. DO AHEAD: The pie dough can be made up to 3 days in advance and chilled, or frozen for up to 3 months; thaw before using. The filling can be made up to 1 day ahead; bring to room temperature before baking.",
            "Meanwhile, reserve 1 cup whole pecans to decorate top of pie; chop remaining 2 cups.",
            "In a small skillet over medium heat, melt butter and cook until foam has subsided and butter is toasty-brown in color and releases a nutty aroma.",
            "Pour butter into a large bowl. Whisk in sugar, syrup, salt, vanilla, rum, and espresso powder until all ingredients are well incorporated. Whisk in eggs, then fold in chopped pecans.",
            "Pour filling into pie shell (do not overfill). Toss whole pecans with remaining 2 tablespoons cane syrup and arrange on top of pie. Place on preheated rimmed baking sheet on bottom rack of oven. After 20 minutes, rotate baking sheet and move to center rack of oven. Bake until crust is golden brown and filling is almost set with a slight jiggle in center of pie, 20 to 25 minutes more. (Cover the crust edge with foil or a pie shield if it starts to brown too much.) Transfer pie to a wire rack and cool completely before slicing, about 3 hours. Pie will keep up to 2 days, loosely covered with foil, at room temperature.",
            "DO AHEAD: The pie dough can be made up to 3 days in advance and chilled, or frozen for up to 3 months; thaw before using. The filling can be made up to 1 day ahead; bring to room temperature before baking."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b87acf7cbba01c0db7f79f/6:4/w_274%2Ch_169/51257300_pecan-pie-2_1x1.jpg"
    }
}