{
    "recipe": {
        "title": "Brown Sugar Ice Cream with Cayenne-Spiced Walnuts ",
        "ingredients": [
            "1 1/2 cups whole milk",
            "1 1/2 cups whipping cream",
            "1 cup (packed) golden brown sugar",
            "6 large egg yolks",
            "Pinch of salt",
            "1 cup walnut pieces (about 4 ounces)",
            "1 tablespoon vegetable oil",
            "1/2 teaspoon cayenne pepper",
            "1/2 teaspoon ground black pepper"
        ],
        "instructions": [
            "Preheat oven to 375°F. Bring milk and cream to simmer in medium saucepan over medium heat. Whisk sugar, egg yolks, and salt in medium bowl until blended; gradually whisk in hot milk mixture. Return to saucepan. Stir over medium heat until custard coats spoon and temperature registers 170°F, about 4 minutes (do not boil). Transfer to wide shallow bowl and freeze to chill quickly, stirring occasionally, about 40 minutes. Meanwhile, toss walnuts, oil, cayenne, and black pepper in medium bowl. Spread nuts on rimmed baking sheet. Toast nuts in oven until golden brown, stirring often, about 6 minutes. Process custard in ice cream maker according to manufacturer's instructions, adding walnuts during last 5 minutes. Transfer to container; cover and freeze up to 3 days.",
            "Preheat oven to 375°F. Bring milk and cream to simmer in medium saucepan over medium heat. Whisk sugar, egg yolks, and salt in medium bowl until blended; gradually whisk in hot milk mixture. Return to saucepan. Stir over medium heat until custard coats spoon and temperature registers 170°F, about 4 minutes (do not boil). Transfer to wide shallow bowl and freeze to chill quickly, stirring occasionally, about 40 minutes.",
            "Meanwhile, toss walnuts, oil, cayenne, and black pepper in medium bowl. Spread nuts on rimmed baking sheet. Toast nuts in oven until golden brown, stirring often, about 6 minutes.",
            "Process custard in ice cream maker according to manufacturer's instructions, adding walnuts during last 5 minutes. Transfer to container; cover and freeze up to 3 days."
        ],
        "picture_link": null
    }
}