{
    "recipe": {
        "title": "Brown Sugar Banana Parfaits With Maple-Glazed Pecans ",
        "ingredients": [
            "1 cup pecan halves",
            "1/4 cup pure maple syrup",
            "Pinch of kosher salt",
            "3/4 cup rye whiskey",
            "1/2 cup (packed) light brown sugar",
            "3 tablespoons sugar",
            "3 tablespoons unsalted butter",
            "6 bananas, peeled, cut on a diagonal into 1/4\" slices",
            "1 pint vanilla ice cream"
        ],
        "instructions": [
            "Preheat oven to 350°F. Toss pecans, maple syrup, and salt on a parchment paper-lined rimmed baking sheet; spread out in a single layer. Bake until maple syrup is caramelized and pecans are toasted, 10-15 minutes. Let cool completely on baking sheet. Coarsely chop nuts; set aside. Meanwhile, bring whiskey, both sugars, and butter to a boil in a large skillet (do not move pan or mixture may ignite). Turn off heat; stir mixture to dissolve sugar completely. Return to medium heat and simmer until sauce is thickened and glossy, about 2 minutes. Add bananas and cook, swirling skillet occasionally, until bananas are just softened, about 2 minutes. Remove from heat and let mixture cool completely in skillet. Layer bananas and sauce, pecans, and ice cream in small mason jars or glasses. DO AHEAD: Parfaits can be made 8 hours ahead. Cover and freeze. Let stand at room temperature for 10 minutes to soften slightly before serving.",
            "Preheat oven to 350°F. Toss pecans, maple syrup, and salt on a parchment paper-lined rimmed baking sheet; spread out in a single layer. Bake until maple syrup is caramelized and pecans are toasted, 10-15 minutes. Let cool completely on baking sheet. Coarsely chop nuts; set aside.",
            "Meanwhile, bring whiskey, both sugars, and butter to a boil in a large skillet (do not move pan or mixture may ignite). Turn off heat; stir mixture to dissolve sugar completely.",
            "Return to medium heat and simmer until sauce is thickened and glossy, about 2 minutes. Add bananas and cook, swirling skillet occasionally, until bananas are just softened, about 2 minutes. Remove from heat and let mixture cool completely in skillet.",
            "Layer bananas and sauce, pecans, and ice cream in small mason jars or glasses. DO AHEAD: Parfaits can be made 8 hours ahead. Cover and freeze. Let stand at room temperature for 10 minutes to soften slightly before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b02ea3766062b2034488cc/6:4/w_274%2Ch_169/51149260_banana-parfaits_1x1.jpg"
    }
}