{
    "recipe": {
        "title": "Brown Sugar Fudge ",
        "ingredients": [
            "1/2 cup plus 2 tablespoons evaporated milk",
            "2 cups packed light brown sugar (14 ounces)",
            "1 1/2 sticks (12 tablespoons) unsalted butter, cut into tablespoons",
            "1/4 teaspoon salt",
            "1/2 teaspoon vanilla extract",
            "1 3/4 cups confectioners' sugar",
            "Special equipment: a candy thermometer"
        ],
        "instructions": [
            "Combine milk, brown sugar, butter, and salt in a 3-quart heavy saucepan and bring just to a boil over moderate heat, stirring until sugar is dissolved. Reduce heat to low and simmer, stirring frequently, until mixture registers 238°F on thermometer and a teaspoon of mixture dropped into a small bowl of cold water holds a soft ball when pressed between your fingers (this will take about 30 minutes). Transfer to a heatproof bowl. Beat in vanilla with an electric mixer at medium speed, then add confectioners' sugar a little at a time, beating until fudge is thick and smooth, about 5 minutes. Spread evenly in an ungreased 8-inch square baking pan. Refrigerate, uncovered, until firm enough to cut, about 30 minutes. Cut fudge into 64 squares with a sharp paring knife.",
            "Combine milk, brown sugar, butter, and salt in a 3-quart heavy saucepan and bring just to a boil over moderate heat, stirring until sugar is dissolved. Reduce heat to low and simmer, stirring frequently, until mixture registers 238°F on thermometer and a teaspoon of mixture dropped into a small bowl of cold water holds a soft ball when pressed between your fingers (this will take about 30 minutes).",
            "Transfer to a heatproof bowl. Beat in vanilla with an electric mixer at medium speed, then add confectioners' sugar a little at a time, beating until fudge is thick and smooth, about 5 minutes.",
            "Spread evenly in an ungreased 8-inch square baking pan. Refrigerate, uncovered, until firm enough to cut, about 30 minutes.",
            "Cut fudge into 64 squares with a sharp paring knife."
        ],
        "picture_link": null
    }
}