{
    "recipe": {
        "title": "Brussels Sprouts With Bacon Jam ",
        "ingredients": [
            "1 pound thick-cut bacon, cut into 1/4-inch strips",
            "1 large onion, finely chopped",
            "1 garlic clove, finely chopped",
            "3/4 cup granulated sugar",
            "1/2 cup (packed) dried apricots (4 ounces), roughly chopped",
            "1/4 cup sherry vinegar",
            "1 sprig thyme",
            "3 sprigs rosemary",
            "1 bay leaf",
            "Kosher salt",
            "Freshly ground black pepper",
            "Kosher salt",
            "16 medium Brussels sprouts (12 ounces), trimmed and halved",
            "2 tablespoons olive oil",
            "2 garlic cloves, smashed",
            "4 sprigs thyme",
            "32 small skewers or toothpicks"
        ],
        "instructions": [
            "Cook bacon in a large skillet over medium-low, stirring occasionally, until brown and crisp, about 15 minutes. Add onion and cook until lightly browned, about 5 minutes, stirring frequently. Add garlic and cook, stirring, 1 minute more. Add sugar, apricots, vinegar, and 1/4 cup water and bring to a boil, stirring. Add thyme, rosemary, and bay leaf and simmer until liquid is syrupy, 8–10 minutes. Remove herb sprigs and let bacon mixture cool. Transfer to food processor and pulse to a chunky purée. Season with salt and pepper.",
            "For the Brussels sprouts: Bring a small pot of salted water to a boil and prep a bowl of ice water. Add Brussels sprouts and cook until bright green, 1 minute. Drain and transfer to ice water to cool. Drain well and pat dry with paper towels. Heat oil in a large skillet. Add Brussels sprouts, garlic, and thyme and cook over high heat, stirring occasionally, until crisp-tender and browned in spots, about 5 minutes. Discard garlic and thyme. Arrange Brussels sprouts cut-side up on a serving tray and spoon about 1 tsp. bacon jam onto each. Spear each Brussels sprout half with a toothpick and serve.",
            "Bring a small pot of salted water to a boil and prep a bowl of ice water. Add Brussels sprouts and cook until bright green, 1 minute. Drain and transfer to ice water to cool. Drain well and pat dry with paper towels.",
            "Heat oil in a large skillet. Add Brussels sprouts, garlic, and thyme and cook over high heat, stirring occasionally, until crisp-tender and browned in spots, about 5 minutes. Discard garlic and thyme.",
            "Arrange Brussels sprouts cut-side up on a serving tray and spoon about 1 tsp. bacon jam onto each. Spear each Brussels sprout half with a toothpick and serve.",
            "Do ahead Bacon jam can be made up to 5 days ahead. Refrigerate in an airtight container and return to room temperature before serving.",
            "Bacon jam can be made up to 5 days ahead. Refrigerate in an airtight container and return to room temperature before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56685f449a4b892c0f6b9180/6:4/w_274%2Ch_169/EP_12012015_dannymeyers_NYE_brusselsprout.jpg"
    }
}