{
    "recipe": {
        "title": "Brussels Sprout Tacos with Spicy Peanut Butter ",
        "ingredients": [
            "3 Tbsp. fish sauce",
            "1 cup unseasoned rice vinegar",
            "1/4 cup sliced scallions",
            "1 1/2\" piece ginger, peeled, finely grated",
            "Kosher salt",
            "2 Tbsp. Aleppo-style pepper or 1 Tbsp. crushed red pepper flakes",
            "3/4 cup unsalted, roasted peanuts plus 1/4 cup crushed",
            "Kosher salt",
            "1 lb. brussels sprouts, preferably small ones, trimmed, divided",
            "1 cup vegetable oil",
            "8 (6\") corn tortillas",
            "1/4 cup finely chopped white onion",
            "Sliced avocado, sliced serrano chiles, cilantro leaves with tender stems, flaky sea salt, and lime wedges (for serving)"
        ],
        "instructions": [
            "Heat a small saucepan over medium. When hot, pour in 1 Tbsp. fish sauce. It should bubble up vigorously and then get thicker and slightly darker, about 30 seconds. Repeat with remaining fish sauce, incorporating 1 Tbsp. at a time. Carefully add vinegar (it may spatter), then transfer mixture to a small bowl; let cool. Stir in scallions and ginger. Taste and season with salt.",
            "Tacos: Purée red pepper and 3/4 cup whole peanuts in a food processor until a smooth butter forms, about 2 minutes. Season with kosher salt and scrape into a small bowl. Very thinly slice one-fourth of brussels sprouts; transfer to a medium bowl. Cut remaining brussels sprouts in half. Heat oil in a medium skillet over medium-high. Shallow-fry halved brussels sprouts in batches, being careful not to overcrowd the pan, until browned and crisp, about 5 minutes per batch. Transfer to paper towels to drain, then add to sliced brussels sprouts. Drizzle with vinaigrette and toss to coat; season with kosher salt. To serve, heat a medium skillet over medium-high. Working one at a time, cook tortillas just until warmed through; transfer to plates. Spread tortillas with some spicy peanut butter; spoon brussels sprouts over. Top with onion, avocado, chiles, cilantro, and 1/4 cup crushed peanuts; sprinkle with sea salt. Serve with lime wedges.",
            "Purée red pepper and 3/4 cup whole peanuts in a food processor until a smooth butter forms, about 2 minutes. Season with kosher salt and scrape into a small bowl.",
            "Very thinly slice one-fourth of brussels sprouts; transfer to a medium bowl. Cut remaining brussels sprouts in half. Heat oil in a medium skillet over medium-high. Shallow-fry halved brussels sprouts in batches, being careful not to overcrowd the pan, until browned and crisp, about 5 minutes per batch. Transfer to paper towels to drain, then add to sliced brussels sprouts. Drizzle with vinaigrette and toss to coat; season with kosher salt.",
            "To serve, heat a medium skillet over medium-high. Working one at a time, cook tortillas just until warmed through; transfer to plates. Spread tortillas with some spicy peanut butter; spoon brussels sprouts over. Top with onion, avocado, chiles, cilantro, and 1/4 cup crushed peanuts; sprinkle with sea salt. Serve with lime wedges.",
            "Do Ahead Vinaigrette can be made 1 week ahead. Cover and chill.",
            "Vinaigrette can be made 1 week ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c6442e11408a33c4d5353a8/6:4/w_274%2Ch_169/brussels-sprout-tacos-with-spicy-peanut-sauce-recipe-BA-010819.jpg",
        "color": 7466106
    }
}