{
    "recipe": {
        "title": "Bucatini with Butter-Roasted Tomato Sauce ",
        "ingredients": [
            "1 (28-ounce) can whole peeled tomatoes",
            "8 garlic cloves, peeled, crushed",
            "2 anchovy fillets packed in oil",
            "1/4 cup (1/2 stick) unsalted butter, cut into small pieces",
            "1/2 teaspoon crushed red pepper flakes plus more for serving",
            "Kosher salt, freshly ground pepper",
            "12 ounces bucatini or spaghetti",
            "Finely grated Parmesan (for serving)"
        ],
        "instructions": [
            "Preheat oven to 425°F. Combine tomatoes (crushing them with your hands), garlic, anchovies, butter, and 1/2 teaspoon red pepper flakes in a 13x9\" baking dish; season with salt and black pepper. Roast, tossing halfway through, until garlic is very soft and mixture is jammy, 35–40 minutes. Using a potato masher or fork, mash to break up garlic and tomatoes. Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1/2 cup pasta cooking liquid. Return pasta to pot and add tomato sauce and pasta cooking liquid. Cook over medium-high heat, tossing until sauce coats pasta, about 3 minutes. Serve topped with Parmesan and more red pepper flakes.",
            "Preheat oven to 425°F. Combine tomatoes (crushing them with your hands), garlic, anchovies, butter, and 1/2 teaspoon red pepper flakes in a 13x9\" baking dish; season with salt and black pepper. Roast, tossing halfway through, until garlic is very soft and mixture is jammy, 35–40 minutes. Using a potato masher or fork, mash to break up garlic and tomatoes.",
            "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1/2 cup pasta cooking liquid.",
            "Return pasta to pot and add tomato sauce and pasta cooking liquid. Cook over medium-high heat, tossing until sauce coats pasta, about 3 minutes. Serve topped with Parmesan and more red pepper flakes.",
            "Do Ahead Tomato sauce can be made 4 days ahead. Let cool; cover and chill. Reheat before mixing with pasta.",
            "Tomato sauce can be made 4 days ahead. Let cool; cover and chill. Reheat before mixing with pasta.",
            "3 More Ideas for Roasted Tomato Sauce: You may never stir again once you've given this low-maintenance tomato sauce a try. Roasting coaxes depth from canned tomatoes, instilling a long-cooked flavor. A generous amount of garlic and anchovies adds even more character. Here are other ways to use the wonderful sauce beyond pasta: Tomato Soup: Purée with vegetable or chicken stock and a splash of cream for a warming bowl. Omelet: Fold a spoonful inside an omelet along with pieces of smoked mozzarella. Pizza: It is tomato sauce, after all. Spread it on pizza dough and shower with Parmesan. Bake and top with more anchovies, parsley, and lemon zest.",
            "You may never stir again once you've given this low-maintenance tomato sauce a try. Roasting coaxes depth from canned tomatoes, instilling a long-cooked flavor. A generous amount of garlic and anchovies adds even more character. Here are other ways to use the wonderful sauce beyond pasta:",
            "Tomato Soup: Purée with vegetable or chicken stock and a splash of cream for a warming bowl.",
            "Omelet: Fold a spoonful inside an omelet along with pieces of smoked mozzarella.",
            "Pizza: It is tomato sauce, after all. Spread it on pizza dough and shower with Parmesan. Bake and top with more anchovies, parsley, and lemon zest."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55fc6d45cb84959337fd4742/6:4/w_274%2Ch_169/51198650_hires.jpg"
    }
}