{
    "recipe": {
        "title": "Buckwheat-Rye Pancakes ",
        "ingredients": [
            "2 cups all-purpose flour",
            "1/2 cup buckwheat flour or whole wheat flour",
            "1/2 cup rye flour or whole wheat flour",
            "1/4 cup sugar",
            "1 tablespoon baking powder",
            "1 1/2 teaspoons kosher salt",
            "1 teaspoon baking soda",
            "4 large eggs",
            "3 cups buttermilk",
            "Unsalted butter (for griddle)",
            "Pure maple syrup (for serving)"
        ],
        "instructions": [
            "Whisk all-purpose flour, buckwheat flour, rye flour, sugar, baking powder, salt, and baking soda in a large bowl; transfer to a large jar.",
            "Do ahead Mix can be made 1 month ahead. Store airtight at room temperature.",
            "Mix can be made 1 month ahead. Store airtight at room temperature.",
            "Assembly: Place pancake mix in a large bowl. Whisk eggs and buttermilk in a medium bowl, then stir into dry ingredients just to combine (some small lumps are okay). Heat a griddle or a large skillet over medium; lightly coat with butter. Working in batches, scoop batter onto griddle. Cook pancakes until bottoms are golden brown and bubbles form on top, about 3 minutes. Flip and cook until cooked through and other side of pancakes are golden brown, about 2 minutes longer. Serve pancakes with maple syrup.",
            "Place pancake mix in a large bowl. Whisk eggs and buttermilk in a medium bowl, then stir into dry ingredients just to combine (some small lumps are okay).",
            "Heat a griddle or a large skillet over medium; lightly coat with butter. Working in batches, scoop batter onto griddle. Cook pancakes until bottoms are golden brown and bubbles form on top, about 3 minutes. Flip and cook until cooked through and other side of pancakes are golden brown, about 2 minutes longer. Serve pancakes with maple syrup."
        ],
        "picture_link": null
    }
}