{
    "recipe": {
        "title": "Buckwheat Linzer Cookies ",
        "ingredients": [
            "1/4 cup plus 2 tablespoons (55 grams) white rice flour",
            "1/2 cup plus 2 tablespoons (70 grams) buckwheat flour",
            "2/3 cup (65 grams) oat flour",
            "1/4 teaspoon salt",
            "1/8 teaspoon baking soda",
            "1/2 cup (100 grams) sugar",
            "1/4 cup (60 grams) cream cheese, cut into chunks",
            "12 tablespoons (1 1/2 sticks/170 grams) unsalted butter, cut into chunks and softened",
            "1 tablespoon water",
            "Buckwheat sablés dough, shaped into logs and chilled as directed",
            "1/2 cup blackberry (or other) preserves",
            "Powdered sugar for dusting",
            "Baking sheets, lined with parchment paper",
            "7/8-inch round cookie cutter (or bottle cap to improvise)",
            "Sifter or medium-fine mesh strainer"
        ],
        "instructions": [
            "To make the dough by hand, put the rice flour, buckwheat flour, oat flour, salt, baking soda, and sugar in a large bowl and whisk until thoroughly blended. Add the cream cheese, butter, and water. Use a fork or the back of a large spoon to mash and mix the ingredients together until all are blended into a smooth, soft dough.",
            "To make the dough in a food processor, combine the rice flour, buckwheat flour, oat flour, salt, baking soda, and sugar. Pulse to mix thoroughly. Add the cream cheese, butter, and water. Process just until the mixture forms a ball of smooth, soft dough. Scrape the bowl and blend in any stray flour at the bottom with your fingers.",
            "Scrape the dough onto a sheet of wax paper and form it into two 8-inch logs about 1 1/2 inches in diameter. Wrap tightly in the wax paper and refrigerate for at least 2 hours, but preferably longer or overnight.",
            "Position racks in the upper and lower thirds of the oven and preheat the oven to 325°F.",
            "Use a sharp knife to cut the cold logs of dough into 1/4-inch slices. Place the cookies at least 1 1/2 inches apart on the prepared baking sheets. Bake for 20 to 25 minutes, rotating the sheets from front to back and top to bottom about halfway through the baking time, until the cookies are slightly darker brown at the edges and well browned on the bottom.",
            "Set the pans or just the liners on racks to cool. Cool completely before stacking or storing. Cookies may be stored in an airtight container for at least 2 weeks.",
            "For the linzer cookies: Position racks in the upper and lower thirds of the oven and preheat the oven to 325°F. Slice the chilled logs less than 1/4 inch thick and place the slices 1 1/2 inches apart on the prepared baking sheets, dividing the total number equally between them. Bake for about 12 minutes. Remove the upper sheet of cookies and place it on the counter or stovetop. Press the cookie cutter gently into each cookie. If the centers lift out, fine; otherwise you can remove them later. Switch and rotate sheets, placing the first on the lower rack in place of the second. Bake for 10 to 15 minutes, or until the cookies are slightly darker at the edges and well browned on the bottom. Set the pans or just the liners on racks to cool. Cool completely. Remove the cutouts. Unfilled cookies may be stored in an airtight container for at least 2 weeks. Shortly before serving, spread 1/2 teaspoon of preserves on the cookies without holes. Sieve a little powdered sugar over the cookies with holes and place one on top of each jam-topped cookie.",
            "Position racks in the upper and lower thirds of the oven and preheat the oven to 325°F.",
            "Slice the chilled logs less than 1/4 inch thick and place the slices 1 1/2 inches apart on the prepared baking sheets, dividing the total number equally between them. Bake for about 12 minutes. Remove the upper sheet of cookies and place it on the counter or stovetop. Press the cookie cutter gently into each cookie. If the centers lift out, fine; otherwise you can remove them later. Switch and rotate sheets, placing the first on the lower rack in place of the second. Bake for 10 to 15 minutes, or until the cookies are slightly darker at the edges and well browned on the bottom.",
            "Set the pans or just the liners on racks to cool. Cool completely. Remove the cutouts. Unfilled cookies may be stored in an airtight container for at least 2 weeks.",
            "Shortly before serving, spread 1/2 teaspoon of preserves on the cookies without holes. Sieve a little powdered sugar over the cookies with holes and place one on top of each jam-topped cookie."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b873034bf78b800d899235/6:4/w_274%2Ch_169/51257390_buckwheat-linzer-cookies_1x1.jpg",
        "color": 8039535
    }
}