{
    "recipe": {
        "title": "Buckwheat Pancakes with Smoked Salmon ",
        "ingredients": [
            "1/2 cup all-purpose flour",
            "1/4 cup buckwheat flour*",
            "1 teaspoon sugar",
            "1/4 teaspoon baking soda",
            "1/4 teaspoon salt",
            "2 large eggs, separated",
            "1/2 cup milk",
            "1/2 stick (1/4 cup) unsalted butter, melted",
            "1/2 cup sour cream",
            "1/8 teaspoon salt",
            "1/8 teaspoon black pepper",
            "1 teaspoon chopped fresh dill or chives",
            "8 oz thinly sliced smoked salmon, cut into small pieces",
            "Garnish: chopped fresh dill or chives"
        ],
        "instructions": [
            "Make pancakes: Whisk together dry ingredients in a large bowl. Whisk together yolks and milk in a small bowl, then whisk into dry ingredients. Beat egg whites in another large bowl with an electric mixer until they hold soft peaks, then fold into flour mixture. Add 3 tablespoons butter and fold until batter is smooth. Lightly brush a 10- to 12-inch nonstick skillet with some of remaining butter, then heat over moderate heat until hot but not smoking. Working in batches of 4, spoon about 1 1/2 tablespoons batter per pancake into skillet and cook until surface of pancakes bubbles, 1 to 2 minutes, then flip and cook 1 minute more. Transfer to a plate and keep warm, covered. Brush skillet with butter between batches.",
            "Whisk together dry ingredients in a large bowl. Whisk together yolks and milk in a small bowl, then whisk into dry ingredients. Beat egg whites in another large bowl with an electric mixer until they hold soft peaks, then fold into flour mixture. Add 3 tablespoons butter and fold until batter is smooth.",
            "Lightly brush a 10- to 12-inch nonstick skillet with some of remaining butter, then heat over moderate heat until hot but not smoking. Working in batches of 4, spoon about 1 1/2 tablespoons batter per pancake into skillet and cook until surface of pancakes bubbles, 1 to 2 minutes, then flip and cook 1 minute more. Transfer to a plate and keep warm, covered. Brush skillet with butter between batches.",
            "Make topping: Stir together all topping ingredients except salmon until combined, then dollop on pancakes and top with salmon.",
            "Stir together all topping ingredients except salmon until combined, then dollop on pancakes and top with salmon.",
            "*Available at natural foods stores.",
            "*Available at natural foods stores."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df1fef9a84192308a84b6/6:4/w_274%2Ch_169/109200.jpg"
    }
}