{
    "recipe": {
        "title": "Buddha Bowl with Roasted Sweet Potatoes, Spiced Chickpeas, and Chard ",
        "ingredients": [
            "1 1/2 cups roughly chopped poblano pepper",
            "1 clove garlic, quartered",
            "1/3 cup tahini (sesame paste)",
            "3 tablespoons fresh lemon juice",
            "1 tablespoon extra-virgin olive oil",
            "Sea salt",
            "Freshly ground black pepper",
            "1 cup quinoa, rice, or farro (or any grain of your choice)",
            "2 large sweet potatoes (1 1/2 to 2 pounds), peeled and cut into 1-inch cubes",
            "1 1/2 tablespoons coconut oil, melted",
            "2 teaspoons pure maple syrup",
            "1 teaspoon orange zest",
            "Sea salt",
            "1 (15-ounce) can chickpeas, drained, rinsed, and patted dry or 1 1/2 cups cooked chickpeas",
            "1 tablespoon plus 2 teaspoons extra-virgin olive oil",
            "1/2 teaspoon paprika",
            "1/8 teaspoon ground cumin",
            "1/8 teaspoon cayenne pepper",
            "Freshly ground black pepper",
            "4 cloves garlic, peeled",
            "1/8 teaspoon crushed red pepper flakes",
            "1 bunch Swiss chard, red, green, or rainbow, stemmed, leaves cut into 1-inch strips"
        ],
        "instructions": [
            "In a blender or food processor, combine the poblano, garlic, tahini, lemon juice, olive oil, and 1/4 cup water and blend until smooth. (If the sauce is too thick, add water as needed to reach the desired consistency.) Season with 1/2 teaspoon salt and 1/8 teaspoon pepper. Set aside. (The dressing can be made ahead and stored in an airtight container in the refrigerator for up to 1 week.)",
            "For the Buddha bowls: Preheat the oven to 425°F. In a medium saucepan, cook the quinoa, rice, or farro according to the directions on the package. In a medium bowl, combine the sweet potatoes, melted coconut oil, maple syrup, orange zest, and 1/4 teaspoon salt. Mix well until the potatoes are evenly coated. Spread the sweet potatoes on a rimmed baking sheet and roast for 20 minutes. Flip them with a spatula and roast until the potatoes are tender and beginning to brown, an additional 10 to 15 minutes. Meanwhile, in a small bowl, combine the chickpeas, 2 teaspoons of the olive oil, the paprika, cumin, cayenne, 1/4 teaspoon salt, and 1/8 teaspoon pepper. Mix well until the chickpeas are thoroughly coated. Spread the chickpeas on a rimmed baking sheet and roast with the sweet potatoes until golden brown, 15 to 20 minutes, stirring them once halfway through. In a large skillet over medium-high heat, heat the remaining 1 tablespoon of the olive oil until shimmering. Add the garlic and red pepper flakes. Cook until the garlic is fragrant, 3 to 4 minutes. Add the chard, cover, and cook, stirring occasionally, until the chard begins to wilt, 2 to 3 minutes. Uncover, add 1/4 teaspoon salt and 1/8 teaspoon pepper, and cook, stirring frequently, until the chard is completely wilted and cooked through, an additional 1 to 2 minutes. Discard the garlic cloves. Put 1/2 cup of the cooked grain in the bottom of each of four serving bowls. Top each bowl with equal portions of the roasted sweet potatoes, roasted chickpeas, and sautéed chard. Drizzle with the poblano tahini sauce and serve with extra sauce passed separately.",
            "Preheat the oven to 425°F.",
            "In a medium saucepan, cook the quinoa, rice, or farro according to the directions on the package.",
            "In a medium bowl, combine the sweet potatoes, melted coconut oil, maple syrup, orange zest, and 1/4 teaspoon salt. Mix well until the potatoes are evenly coated.",
            "Spread the sweet potatoes on a rimmed baking sheet and roast for 20 minutes. Flip them with a spatula and roast until the potatoes are tender and beginning to brown, an additional 10 to 15 minutes.",
            "Meanwhile, in a small bowl, combine the chickpeas, 2 teaspoons of the olive oil, the paprika, cumin, cayenne, 1/4 teaspoon salt, and 1/8 teaspoon pepper. Mix well until the chickpeas are thoroughly coated.",
            "Spread the chickpeas on a rimmed baking sheet and roast with the sweet potatoes until golden brown, 15 to 20 minutes, stirring them once halfway through.",
            "In a large skillet over medium-high heat, heat the remaining 1 tablespoon of the olive oil until shimmering. Add the garlic and red pepper flakes. Cook until the garlic is fragrant, 3 to 4 minutes. Add the chard, cover, and cook, stirring occasionally, until the chard begins to wilt, 2 to 3 minutes. Uncover, add 1/4 teaspoon salt and 1/8 teaspoon pepper, and cook, stirring frequently, until the chard is completely wilted and cooked through, an additional 1 to 2 minutes. Discard the garlic cloves.",
            "Put 1/2 cup of the cooked grain in the bottom of each of four serving bowls. Top each bowl with equal portions of the roasted sweet potatoes, roasted chickpeas, and sautéed chard. Drizzle with the poblano tahini sauce and serve with extra sauce passed separately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c7561657416767cdfe7fb47/6:4/w_274%2Ch_169/buddha-bowl-sweet-potato-chickpea-recipe-HC-022619.jpg",
        "color": 6599918
    }
}