{
    "recipe": {
        "title": "Buddha's Delight ",
        "ingredients": [
            "12 large dried black mushrooms (3 oz)",
            "5 cups boiling-hot water plus additional for soaking bean curd skins",
            "2 dried bean curd skins (2 oz total)",
            "1/2 lb fresh or thawed frozen large bamboo shoots",
            "2 to 3 oz very thin bean thread noodles (2 small skeins; also known as cellophane, glass, or mung bean noodles)",
            "1 (1/2-lb) firm fresh tofu cake, or 1/2 cake from a 14- to 16-oz package, rinsed and drained",
            "2 tablespoons peanut or vegetable oil",
            "1 (1/2-inch) piece fresh ginger, peeled and very thinly sliced 2 garlic cloves, chopped",
            "1/2 cup peeled shelled fresh or frozen ginkgo nuts",
            "1/3 cup vegetarian oyster sauce",
            "1/4 cup light soy sauce (preferably Pearl River Bridge brand)",
            "1/4 cup Chinese rice wine (preferably Shaoxing) or medium-dry Sherry",
            "3/4 teaspoon sugar",
            "2 cups fresh soybean sprouts (1/4 lb)",
            "2 romaine hearts, trimmed and quartered lengthwise, then cut into 2-inch pieces (6 cups)"
        ],
        "instructions": [
            "Soak mushrooms in 5 cups boiling-hot water in a bowl, keeping them submerged with a small plate and turning mushrooms over occasionally, until softened and cool enough to handle, about 30 minutes. Squeeze excess liquid from caps back into bowl and reserve liquid, then cut out and discard stems from mushrooms. Cut caps into 1-inch wedges.",
            "While mushrooms soak, carefully break bean curd skins in half crosswise, then halve each portion crosswise again. Transfer to a bowl, then add enough boiling-hot water to cover and soak, turning occasionally, until softened, about 30 minutes.",
            "If using fresh bamboo, trim bottoms of shoots, then halve shoots lengthwise with a sharp heavy knife. Pull off and discard leaves from shoots, then remove any blemishes with a sharp paring knife (don't worry about natural dotted pattern along base of shoots).",
            "Cover fresh or frozen bamboo with cold water by 1 inch in a 2-quart saucepan and bring to a boil. Boil 2 minutes, then drain in a colander and rinse under cold water. Repeat boiling and rinsing, then arrange bamboo halves, cut sides down, on a cutting board and cut bamboo lengthwise into 1/4-inch-thick slices.",
            "Soak noodles in cold water to cover until softened, about 5 minutes, then drain in colander and transfer to a bowl.",
            "Drain bean curd skins in colander. When cool enough to handle, squeeze dry and cut crosswise into 1-inch pieces.",
            "Halve tofu lengthwise, then cut each half crosswise into 1/2-inch-thick slices.",
            "Heat oil in a 5- to 6-quart wide heavy pot over moderate heat until hot but not smoking. Add ginger and garlic and cook, stirring, 30 seconds. Add mushrooms, bean curd skins, bamboo, and ginkgo nuts and cook, stirring, 2 minutes. Stir in oyster sauce, soy sauce, rice wine, and sugar and simmer 1 minute. Add reserved mushroom-soaking liquid and bring to a boil. Gently stir in tofu and soybean sprouts, then reduce heat to low and simmer, covered, 15 minutes. Gently stir in noodles and simmer, covered, 5 minutes. Add romaine hearts (pot will be full) and turn to coat, then simmer, covered, until romaine is tender, about 5 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd6f7f3a00aeb2f1d265a/6:4/w_274%2Ch_169/233790.jpg"
    }
}