{
    "recipe": {
        "title": "Buffalo Cauliflower ",
        "ingredients": [
            "1 head cauliflower, leaves removed",
            "2 tablespoons plus 1 teaspoon canola oil",
            "Kosher salt and freshly ground black pepper",
            "1/2 cup hot sauce, such as Frank's Red Hot sauce",
            "1/2 cup Sriracha (Asian chile sauce)",
            "1/2 cup (1 stick) unsalted butter, cut into small pieces",
            "1 tablespoon crumbled blue cheese or more to taste",
            "Equipment: 1 large rimmed baking sheet"
        ],
        "instructions": [
            "Arrange a rack in the middle of the oven and preheat to 375°F. Cut the stalk end off the cauliflower so that the head sits flat and place it on a large baking sheet. Rub 2 tablespoons of the canola oil all over the cauliflower, season to taste with salt and pepper, and roast until the outside starts to brown, about 30 minutes. Transfer the cauliflower to a cutting board and let cool. Once the cauliflower is cool enough to handle, cut or break it into small florets. DO AHEAD: The cauliflower can be roasted, cooled, and cut into florets several hours in advance. Cover the florets and keep them in the refrigerator until ready to use. You may need to sauté them slightly longer if refrigerated. In a medium saucepan over moderate heat, bring the hot sauce and Sriracha to a boil. Reduce the heat to a simmer then slowly whisk in the butter until fully incorporated, about 5 minutes. Remove from the heat and let cool. DO AHEAD: The Buffalo sauce can be prepared, cooled, and kept in an airtight container in the refrigerator, up to 3 days. In a large, deep sauté pan over moderate heat, warm the remaining 1 teaspoon canola oil. Add the cauliflower florets, season to taste with salt and pepper, and sauté until heated through, about 5 minutes. Add enough Buffalo sauce to coat the cauliflower and continue sautéing until both the cauliflower and the sauce are hot, about 5 minutes. Transfer the cauliflower to a platter and garnish with the crumbled blue cheese.",
            "Arrange a rack in the middle of the oven and preheat to 375°F.",
            "Cut the stalk end off the cauliflower so that the head sits flat and place it on a large baking sheet. Rub 2 tablespoons of the canola oil all over the cauliflower, season to taste with salt and pepper, and roast until the outside starts to brown, about 30 minutes.",
            "Transfer the cauliflower to a cutting board and let cool. Once the cauliflower is cool enough to handle, cut or break it into small florets. DO AHEAD: The cauliflower can be roasted, cooled, and cut into florets several hours in advance. Cover the florets and keep them in the refrigerator until ready to use. You may need to sauté them slightly longer if refrigerated.",
            "In a medium saucepan over moderate heat, bring the hot sauce and Sriracha to a boil. Reduce the heat to a simmer then slowly whisk in the butter until fully incorporated, about 5 minutes. Remove from the heat and let cool. DO AHEAD: The Buffalo sauce can be prepared, cooled, and kept in an airtight container in the refrigerator, up to 3 days.",
            "In a large, deep sauté pan over moderate heat, warm the remaining 1 teaspoon canola oil. Add the cauliflower florets, season to taste with salt and pepper, and sauté until heated through, about 5 minutes. Add enough Buffalo sauce to coat the cauliflower and continue sautéing until both the cauliflower and the sauce are hot, about 5 minutes. Transfer the cauliflower to a platter and garnish with the crumbled blue cheese."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54aca3ff19925f464b3adf13/6:4/w_274%2Ch_169/51218220_buffalo-cauliflower_1x1.jpg"
    }
}