{
    "recipe": {
        "title": "Buffalo Meatloaf with Spinach and Roasted Baby Potatoes ",
        "ingredients": [
            "1 pound baby Yukon Gold or Dutch yellow potatoes",
            "5 tablespoons olive oil, divided",
            "1 1/2 cups chopped crimini (baby bella) mushrooms",
            "1 cup chopped red onion",
            "1 tablespoon chopped fresh sage",
            "1 tablespoon chopped fresh thyme",
            "1 pound ground buffalo meat",
            "1 large egg",
            "3/4 cup tomato sauce, divided",
            "1/2 cup panko (Japanese breadcrumbs)*",
            "1/2 teaspoon salt",
            "1/2 teaspoon cracked black pepper",
            "1/4 teaspoon dried crushed red pepper",
            "1 garlic clove, pressed",
            "2 5-ounce bags fresh spinach"
        ],
        "instructions": [
            "Preheat oven to 375°F. Toss potatoes with 1 tablespoon oil in medium bowl. Place on 13x9-inch rimmed baking sheet or roasting pan. Sprinkle with salt. Roast 20 minutes. Meanwhile, heat 2 tablespoons oil in medium skillet over medium heat. Add mushrooms and onion; sauté until mushrooms are beginning to brown and onion is translucent, about 4 minutes. Remove from heat; mix in sage and thyme. Cool slightly. Mix buffalo, mushroom mixture, egg, 1/2 cup tomato sauce, panko, salt, and pepper in large bowl. Push potatoes to sides of baking sheet; shape buffalo mixture into 6x3-inch loaf in center of sheet. Roast 30 minutes. Combine 1/4 cup tomato sauce and red pepper in small bowl. Pour over top of meatloaf. Roast 20 minutes longer. Remove from oven; let rest while preparing spinach. Heat remaining 2 tablespoons oil and garlic in large pot over medium-high heat. Add spinach, and toss until wilted, about 3 minutes. Season to taste with salt. Slice meatloaf; serve potatoes and spinach alongside.",
            "Preheat oven to 375°F. Toss potatoes with 1 tablespoon oil in medium bowl. Place on 13x9-inch rimmed baking sheet or roasting pan. Sprinkle with salt. Roast 20 minutes.",
            "Meanwhile, heat 2 tablespoons oil in medium skillet over medium heat. Add mushrooms and onion; sauté until mushrooms are beginning to brown and onion is translucent, about 4 minutes. Remove from heat; mix in sage and thyme. Cool slightly.",
            "Mix buffalo, mushroom mixture, egg, 1/2 cup tomato sauce, panko, salt, and pepper in large bowl. Push potatoes to sides of baking sheet; shape buffalo mixture into 6x3-inch loaf in center of sheet. Roast 30 minutes. Combine 1/4 cup tomato sauce and red pepper in small bowl. Pour over top of meatloaf. Roast 20 minutes longer. Remove from oven; let rest while preparing spinach.",
            "Heat remaining 2 tablespoons oil and garlic in large pot over medium-high heat. Add spinach, and toss until wilted, about 3 minutes. Season to taste with salt. Slice meatloaf; serve potatoes and spinach alongside.",
            "*Available in the Asian foods section of some supermarkets and at Asian markets.",
            "*Available in the Asian foods section of some supermarkets and at Asian markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a0e7b55306961bf77d1/6:4/w_274%2Ch_169/239814.jpg"
    }
}