{
    "recipe": {
        "title": "Bulgur Stuffing with Brussels Sprouts and Dried Mushrooms ",
        "ingredients": [
            "2 1/2 cups boiling water",
            "2 ounces dried porcini mushrooms (about 2 cups)",
            "1 ounce dried morel mushrooms (about 1 cup)",
            "1 cup finely chopped onion",
            "1 stick (1/2 cup) unsalted butter",
            "5 cups chicken broth",
            "2 1/2 cups bulgur (preferably coarse)",
            "1 1/2 pounds Brussels sprouts",
            "1 cup packed fresh flat-leafed parsley leaves"
        ],
        "instructions": [
            "In a bowl pour boiling water over mushrooms and soak 30 minutes. In a 4-quart saucepan sauté onion in 2 tablespoons butter over moderately high heat, stirring, until softened. Add broth and bring to a simmer. Stir in bulgur and simmer, uncovered, stirring occasionally, 8 minutes.",
            "Trim and quarter Brussels sprouts. In a large non-stick skillet heat remaining 6 tablespoons butter over moderately high heat until foam subsides and sauté Brussels sprouts, stirring occasionally, until tender, about 10 minutes.",
            "Remove mushrooms from water, squeezing out excess liquid, and reserve soaking liquid. Rinse mushrooms to remove any grit and coarsely chop. Line a sieve set over a bowl with a dampened paper towel or coffee filter and strain reserved soaking liquid into bowl. Chop parsley.",
            "In a large bowl toss together bulgur mixture, Brussels sprouts, mushrooms, 1/2 cup strained soaking liquid, parsley, and salt and pepper to taste and cool completely. Stuffing may be made up to this point 1 day ahead and chilled, covered. Bring stuffing to room temperature before proceeding.",
            "For cooking stuffing inside poultry: Any frozen poultry destined for stuffing should be completely thawed, and the stuffing itself brought to room temperature before it's put into the turkey. Do not stuff your bird the night before you cook it; such a seeming time-saver can have dangerous results. Instead, it is best to loosely fill the bird's neck and body cavities immediately before roasting. And always use a meat or instant-read thermometer: The meat is done when the temperature of the thickest part of the thigh (be careful not to touch the bones) reaches 180°F.; the stuffing baked inside the bird is done at 160°F.-165°F. After roasting, let your stuffed poultry stand 15 to 20 minutes, a double assurance that the requisite temperatures for food safety have been reached.",
            "Any frozen poultry destined for stuffing should be completely thawed, and the stuffing itself brought to room temperature before it's put into the turkey. Do not stuff your bird the night before you cook it; such a seeming time-saver can have dangerous results. Instead, it is best to loosely fill the bird's neck and body cavities immediately before roasting. And always use a meat or instant-read thermometer: The meat is done when the temperature of the thickest part of the thigh (be careful not to touch the bones) reaches 180°F.; the stuffing baked inside the bird is done at 160°F.-165°F. After roasting, let your stuffed poultry stand 15 to 20 minutes, a double assurance that the requisite temperatures for food safety have been reached.",
            "For cooking all or part of stuffing outside poultry: In a shallow baking dish bake stuffing, covered, in a 325° F. oven 40 minutes (do not uncover during baking).",
            "In a shallow baking dish bake stuffing, covered, in a 325° F. oven 40 minutes (do not uncover during baking)."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56133113f35fab51707e9601/6:4/w_274%2Ch_169/14451.jpg"
    }
}