{
    "recipe": {
        "title": "Butternut Squash Soup with Green Chili Coriander Chutney ",
        "ingredients": [
            "1/4 cup sliced blanched almonds",
            "1/4 cup sweetened flaked coconut",
            "2 jalapeño chilies, (wear rubber gloves)",
            "2 cups loosely packed coriander",
            "2 cups chopped onion",
            "2 tablespoons butter",
            "2 tablespoons vegetable oil",
            "a 3- to 3 1/2-pound butternut squash, peeled, halved, the seeds and strings discarded, and the flesh cut into 1/2-inch pieces",
            "6 cups chicken broth",
            "two 4-inch strips of orange zest",
            "1 1/2 cups freshly squeezed orange juice",
            "8 coriander sprigs for garnish"
        ],
        "instructions": [
            "In a blender or food processor blend the almonds, the coconut, the jalapeño, a pinch of salt, and 1/3 cup water until the mixture is ground fine. Add the coriander and blend the mixture until it is ground fine. (This recipe makes what is known as a dry chutney, which has a slightly grainy texture.) The chutney may be made 8 hours in advance and kept covered and chilled. Makes about 1 cup.",
            "Make the soup: In a kettle cook the onion in the butter and the oil over moderately low heat, stirring, until it is softened, add the squash and 1/2 cup water, and cook the mixture, covered, over moderately low heat for 20 to 30 minutes, or until the squash is tender. Add the broth, the zest, and the juice and simmer the mixture, uncovered, for 15 minutes. In a blender or food processor purée the mixture in batches and strain it through a sieve into a large bowl. The soup may be made 1 day in advance and kept covered and chilled.",
            "In a kettle cook the onion in the butter and the oil over moderately low heat, stirring, until it is softened, add the squash and 1/2 cup water, and cook the mixture, covered, over moderately low heat for 20 to 30 minutes, or until the squash is tender. Add the broth, the zest, and the juice and simmer the mixture, uncovered, for 15 minutes. In a blender or food processor purée the mixture in batches and strain it through a sieve into a large bowl. The soup may be made 1 day in advance and kept covered and chilled.",
            "Ladle the soup into 8 bowls and garnish each serving with about a tablespoon of the chutney, to be stirred into the soup, and a coriander sprig.",
            "Ladle the soup into 8 bowls and garnish each serving with about a tablespoon of the chutney, to be stirred into the soup, and a coriander sprig."
        ],
        "picture_link": null
    }
}