{
    "recipe": {
        "title": "Butterflied Turkey a la Parrilla with Chanterelles and Grilled Chicory ",
        "ingredients": [
            "One 10- to 12-pound turkey, giblets and neck reserved for another use, left at room temperature for 1 hour",
            "Kosher salt",
            "freshly ground black pepper",
            "Vegetable oil, for grill grates",
            "2 bunches young chicory such as escarole or frisée, trimmed and cut in half lengthwise",
            "4 tablespoons unsalted butter, divided",
            "2 tablespoons extra-virgin olive oil, divided",
            "1 large shallot, finely chopped",
            "1 large garlic clove, minced",
            "1 pound chanterelles or other mushrooms, cleaned and trimmed, left whole if small and cut in half or into thirds if larger",
            "1/4 cup chopped fresh flat-leaf parsley",
            "Gas or charcoal grill"
        ],
        "instructions": [
            "With kitchen shears or a sharp knife, split the turkey through the breastbone (leaving the backbone intact) and press it out flat. Pat it dry on both sides with paper towels. Sprinkle with salt and pepper.",
            "Heat an outdoor grill over medium heat. Brush the grate generously with oil. When the oil starts to smoke, add the turkey, bone-side down and grill, covered, until it browns and crisps on the first side, about 15 minutes. Turn the turkey skin-side-down, cover, and grill on the other side until the skin is dark golden brown, about 15 minutes more. Turn the turkey again, cover, and grill until a meat thermometer inserted into the thickest part of the thigh without touching bone registers 165°F, 10 to 15 minutes more. Transfer to a platter and let rest.",
            "Meanwhile, prepare the mushrooms. In a large skillet over medium heat, heat 2 tablespoons butter and 1 tablespoon olive oil. Add the shallot, season lightly with salt, and sauté, stirring occasionally, until it softens, about 8 minutes. Add the garlic and sauté until the shallots are translucent, about 2 minutes, adjusting the heat as necessary so the garlic does not burn. Add the mushrooms, a pinch each of salt and pepper, and the remaining 2 tablespoons butter and 1 tablespoon oil and sauté until the mushrooms have released their liquid and it reduces into a light glaze, about 7 minutes. Stir in the parsley and season to taste with salt and pepper. Keep warm over low heat, stirring occasionally.",
            "While the turkey rests, drizzle the chicory with a little oil, place it on the hottest part of the grill, and cook, turning once, until lightly charred, about 5 minutes. Cut the chicory into serving pieces and season to taste with salt and pepper.",
            "Cut the turkey into serving pieces and serve with the mushrooms and chicory."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b873797cbba01c0db7d616/6:4/w_274%2Ch_169/51258230_butterflied-turkey_1x1.jpg"
    }
}