{
    "recipe": {
        "title": "Butter Lettuce, Chicken, and Cherry Salad ",
        "ingredients": [
            "1/4 cup fresh lemon juice",
            "3 tablespoons Dijon mustard",
            "3 tablespoons chopped fresh dill",
            "2 tablespoons honey",
            "1 garlic clove, minced",
            "1/4 cup extra-virgin olive oil",
            "Kosher salt and freshly ground black pepper",
            "4 Perfect Pan-Roasted Chicken Thighs , fat from pan reserved",
            "4 thick slices rustic bread, crusts removed, torn into 3/4\" pieces",
            "1 pound fresh cherries, stemmed, pitted, and lightly crushed",
            "3 heads butter lettuce, cored and torn into pieces",
            "4 radishes, thinly sliced",
            "1 tablespoon chopped chives"
        ],
        "instructions": [
            "Whisk first 5 ingredients in a small bowl. Gradually whisk in oil. Season to taste with salt and pepper. Stir; set aside. Remove crispy chicken skin and tear into pieces. Pull chicken meat from bones and tear into pieces; discard bones. Reserve skin and meat. Heat chicken fat in a large skillet over medium heat. Add bread to skillet and toast, turning frequently, until golden and crisp, about 2 minutes. Remove with a slotted spoon and drain on paper towels. Season with salt and pepper while still hot. Place chicken meat in a large bowl. Add cherries, butter lettuce, radishes, and chives and drizzle with vinaigrette; toss to coat. Divide salad among plates and garnish with croutons and chicken skin.",
            "Whisk first 5 ingredients in a small bowl. Gradually whisk in oil. Season to taste with salt and pepper. Stir; set aside. Remove crispy chicken skin and tear into pieces. Pull chicken meat from bones and tear into pieces; discard bones. Reserve skin and meat.",
            "Heat chicken fat in a large skillet over medium heat. Add bread to skillet and toast, turning frequently, until golden and crisp, about 2 minutes. Remove with a slotted spoon and drain on paper towels. Season with salt and pepper while still hot.",
            "Place chicken meat in a large bowl. Add cherries, butter lettuce, radishes, and chives and drizzle with vinaigrette; toss to coat. Divide salad among plates and garnish with croutons and chicken skin."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56043a457c9cb37c518d5be6/6:4/w_274%2Ch_169/365669_hires.jpg"
    }
}