{
    "recipe": {
        "title": "Buttermilk Oven \"Fried\" Chicken ",
        "ingredients": [
            "8 chicken drumsticks (about 3 1/2 ounces each), skinned",
            "1/2 teaspoon kosher salt",
            "1/2 teaspoon sweet paprika",
            "1/2 teaspoon poultry seasoning",
            "1/4 teaspoon garlic powder",
            "1/8 teaspoon freshly ground black pepper",
            "1 cup buttermilk",
            "Juice of 1/2 lemon",
            "Cooking spray or oil mister coating",
            "2/3 cup panko bread crumbs",
            "1/2 cup crushed cornflake crumbs",
            "2 tablespoons grated Parmesan cheese",
            "1 1/2 teaspoons kosher salt",
            "1 teaspoon dried parsley flakes",
            "1 1/2 teaspoons sweet paprika",
            "1/2 teaspoon onion powder",
            "1/2 teaspoon garlic powder",
            "1/4 teaspoon chili powder"
        ],
        "instructions": [
            "In a medium bowl, season the chicken with the salt, paprika, poultry seasoning, garlic powder, and black pepper. Pour the buttermilk and lemon juice over the chicken and refrigerate for 6 to 8 hours, preferably overnight.",
            "Preheat the oven to 400°F. Place a rack on a baking sheet and lightly spray with oil.",
            "For the coating: In a shallow bowl, combine the panko, cornflake crumbs, Parmesan, salt, parsley, paprika, onion powder, garlic powder, and chili powder. Remove the chicken from the buttermilk, dredge each piece in the crumb mixture, and put the pieces onto the prepared baking sheet. Spray the tops of the chicken with oil. Bake until golden brown and cooked through, 40 to 45 minutes.",
            "In a shallow bowl, combine the panko, cornflake crumbs, Parmesan, salt, parsley, paprika, onion powder, garlic powder, and chili powder.",
            "Remove the chicken from the buttermilk, dredge each piece in the crumb mixture, and put the pieces onto the prepared baking sheet. Spray the tops of the chicken with oil.",
            "Bake until golden brown and cooked through, 40 to 45 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/555a0e3b100d9bda6d81cbda/6:4/w_274%2Ch_169/51252460_buttermilk-oven-fried-chicken_1x1.jpg"
    }
}