{
    "recipe": {
        "title": "Butternut Squash Steaks with Brown Butter–Sage Sauce ",
        "ingredients": [
            "1 large butternut squash (about 3 lb.), preferably one with a long thick neck",
            "1 Tbsp. extra-virgin olive oil",
            "2 Tbsp. unsalted butter, cut into pieces",
            "6 sage leaves",
            "2 garlic cloves, crushed",
            "1 Tbsp. fresh lemon juice",
            "Kosher salt, freshly ground pepper"
        ],
        "instructions": [
            "Cut the neck off of squash; reserve base for another use. Trim the stem off the neck then peel. Resting neck on cut base, cut in half lengthwise, creating two lobes. Trim off outer rounded side of each piece to create two 3/4\"-thick steaks (about 6 oz. per steak); reserve trimmed off sides for another use. Heat oil in a large heavy skillet over medium. Cook squash steaks, turning every 3 minutes, until deeply browned on both sides and fork-tender, about 15 minutes. Add butter, sage, and garlic to skillet, tilt pan toward you so that butter pools on one side, and use a large spoon to continually baste steaks with butter. Cook, basting, until butter is no longer bubbling, smells nutty, and is beginning to brown, about 1 minute. Remove from heat and stir in lemon juice; season with salt and pepper. Transfer squash steaks to plates and spoon sauce over.",
            "Cut the neck off of squash; reserve base for another use. Trim the stem off the neck then peel. Resting neck on cut base, cut in half lengthwise, creating two lobes. Trim off outer rounded side of each piece to create two 3/4\"-thick steaks (about 6 oz. per steak); reserve trimmed off sides for another use.",
            "Heat oil in a large heavy skillet over medium. Cook squash steaks, turning every 3 minutes, until deeply browned on both sides and fork-tender, about 15 minutes. Add butter, sage, and garlic to skillet, tilt pan toward you so that butter pools on one side, and use a large spoon to continually baste steaks with butter. Cook, basting, until butter is no longer bubbling, smells nutty, and is beginning to brown, about 1 minute. Remove from heat and stir in lemon juice; season with salt and pepper.",
            "Transfer squash steaks to plates and spoon sauce over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5bc4da24cf10732db9a8c43f/6:4/w_274%2Ch_169/butternut-squash-steaks-with-brown-butter-sage-sauce-recipe-BA-101518.jpg"
    }
}