{
    "recipe": {
        "title": "Butternut Pumpkin Pie ",
        "ingredients": [
            "1 medium butternut squash (about 7 inches long and 4 inches across at the base; at least 24 ounces)",
            "1 recipe (2 cups/19 ounces) Quick Condensed Milk, at room temperature",
            "1/2 cup packed (4 ounces) light brown sugar",
            "1 tablespoon vanilla extract or bourbon",
            "1 1/2 teaspoons ground ginger",
            "1 1/2 teaspoons ground cinnamon",
            "1/4 teaspoon grated nutmeg, plus more to garnish if desired",
            "1/4 teaspoon Diamond Crystal kosher salt (half as much if iodized)",
            "1/8 teaspoon ground cloves",
            "2 tablespoons (1 ounce) unsalted butter, melted",
            "3 large eggs, straight from the fridge",
            "1 fully baked No-Stress All-Butter Pastry Crust",
            "1/2 recipe (2 cups/8 ounces) Make-Ahead Whipped Cream, or any variation (optional)",
            "1 cup (5 ounces) crushed Heath® Toffee Bits (optional)"
        ],
        "instructions": [
            "Adjust oven rack to lower-middle position and preheat to 400°F. Split the squash lengthways, scoop out the seeds, and place cut side down on a foil-lined aluminum baking sheet. Roast until fork-tender, about 45 minutes.",
            "When the squash is cool enough to handle, use a large spoon to scrape out the pulp. Pulse in a food processor until smooth, or rub through a double-mesh sieve. Measure out 14 ounces (1 3/4 cups) squash purée. Use warm, or refrigerate in an airtight container for up to 1 week.",
            "Make the pie: Adjust oven rack to lower-middle position and preheat to 375°F. In a medium bowl, whisk the squash purée, Quick Condensed Milk, brown sugar, vanilla, ginger, cinnamon, nutmeg, salt, cloves, butter, and eggs until smooth. Pour into the baked crust, place on an aluminum baking sheet, and bake until the custard has puffed into a gentle dome, about 25 minutes. Reduce oven temperature to 350°F and continue baking until the custard is firm around the edges but still wobbly in the very center, about 25 minutes more (200°F; 210°F if the probe touches the crust). Let cool at room temperature until the custard is set, about 2 hours. Cut the pie with a chef's knife. If you like, serve with dollops of whipped cream and a sprinkling of crushed toffee. Wrapped in plastic, leftovers will keep for up to 4 days at room temperature.",
            "Adjust oven rack to lower-middle position and preheat to 375°F. In a medium bowl, whisk the squash purée, Quick Condensed Milk, brown sugar, vanilla, ginger, cinnamon, nutmeg, salt, cloves, butter, and eggs until smooth. Pour into the baked crust, place on an aluminum baking sheet, and bake until the custard has puffed into a gentle dome, about 25 minutes. Reduce oven temperature to 350°F and continue baking until the custard is firm around the edges but still wobbly in the very center, about 25 minutes more (200°F; 210°F if the probe touches the crust). Let cool at room temperature until the custard is set, about 2 hours.",
            "Cut the pie with a chef's knife. If you like, serve with dollops of whipped cream and a sprinkling of crushed toffee. Wrapped in plastic, leftovers will keep for up to 4 days at room temperature.",
            "Make Ahead From the No-Stress All-Butter Pastry Crust, which can be rolled, shaped, and frozen months in advance, to the Quick Condensed Milk and squash purée, every element of this recipe can be made well ahead, so don't feel as if you need to tackle it all at once. Leftover squash purée can be refrigerated for up to 1 week.",
            "From the No-Stress All-Butter Pastry Crust, which can be rolled, shaped, and frozen months in advance, to the Quick Condensed Milk and squash purée, every element of this recipe can be made well ahead, so don't feel as if you need to tackle it all at once.",
            "Leftover squash purée can be refrigerated for up to 1 week."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59f1f75839cfd2389da0f54a/6:4/w_274%2Ch_169/butternut-pumpkin-squash-pie-stella-parks-recipe-102617.jpg"
    }
}