{
    "recipe": {
        "title": "Buttermilk Pancakes with Roasted Strawberries ",
        "ingredients": [
            "1 pound strawberries (about 4 cups), hulled, halved, quartered if large",
            "1/4 cup sugar",
            "Pinch of kosher salt",
            "1 vanilla bean, split lengthwise",
            "1 1/2 cups all-purpose flour",
            "3 tablespoons sugar",
            "1 teaspoon kosher salt",
            "1 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "2 large eggs",
            "1 3/4 cups buttermilk",
            "3/4 teaspoon vanilla extract",
            "3 tablespoons melted unsalted butter, plus more for pan and serving",
            "1/4 cup toasted sliced almonds (optional)"
        ],
        "instructions": [
            "Roast the strawberries: Preheat oven to 425°F. Place strawberries, sugar, and salt in a glass baking dish. Scrape in vanilla seeds, add pod, and stir to combine. Roast, stirring occasionally, until juices are bubbling, 15–18 minutes. Let cool slightly and discard pod.",
            "Preheat oven to 425°F. Place strawberries, sugar, and salt in a glass baking dish. Scrape in vanilla seeds, add pod, and stir to combine. Roast, stirring occasionally, until juices are bubbling, 15–18 minutes. Let cool slightly and discard pod.",
            "Make the pancakes: Whisk flour, sugar, salt, baking powder, and baking soda in a large bowl. Beat eggs, buttermilk, vanilla, and 3 Tbsp. melted butter in a medium bowl with a fork to incorporate eggs. Add egg mixture to dry ingredients and whisk to combine. Batter will be slightly lumpy. Heat a large griddle or 2 cast-iron or nonstick skillets over medium; brush with butter. Drop batter by 1/4 cupfuls onto griddle. Cook until bubbles form on the surface and pop, and the underside is golden brown, 2 1/2–3 minutes. Flip and cook until lightly browned on the bottom, 2 1/2–3 minutes more. Transfer pancakes to plates or a platter and brush tops with butter. Repeat with remaining batter, brushing griddle with butter as needed. Serve pancakes topped with roasted strawberries and sprinkled with almonds, if desired.",
            "Whisk flour, sugar, salt, baking powder, and baking soda in a large bowl. Beat eggs, buttermilk, vanilla, and 3 Tbsp. melted butter in a medium bowl with a fork to incorporate eggs. Add egg mixture to dry ingredients and whisk to combine. Batter will be slightly lumpy.",
            "Heat a large griddle or 2 cast-iron or nonstick skillets over medium; brush with butter. Drop batter by 1/4 cupfuls onto griddle. Cook until bubbles form on the surface and pop, and the underside is golden brown, 2 1/2–3 minutes. Flip and cook until lightly browned on the bottom, 2 1/2–3 minutes more. Transfer pancakes to plates or a platter and brush tops with butter. Repeat with remaining batter, brushing griddle with butter as needed.",
            "Serve pancakes topped with roasted strawberries and sprinkled with almonds, if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5548f7fe6997a6ba1fd2b2d8/6:4/w_274%2Ch_169/EP-05042015-strawberrypancakes-recipe-6x4.jpg"
    }
}