{
    "recipe": {
        "title": "Buttered-Pecan French Toast with Bourbon Maple Syrup ",
        "ingredients": [
            "1 heaping cup pecan halves, coarsely chopped",
            "3 tablespoons unsalted butter",
            "1 teaspoon sugar",
            "1/2 teaspoon salt",
            "5 large eggs",
            "1 cup whole milk",
            "1/2 cup heavy cream",
            "3 tablespoons lightly packed light brown sugar",
            "1/2 teaspoon ground cinnamon",
            "1/4 teaspoon salt",
            "2 teaspoons pure vanilla extract",
            "8 thick slices brioche",
            "4 tablespoons clarified butter, for the pan",
            "1 cup pure maple syrup",
            "2 tablespoons bourbon",
            "Dash of pure vanilla extract",
            "Confectioners’ sugar, for serving"
        ],
        "instructions": [
            "For the buttered pecans: Place a rack in the upper third of the oven and preheat to 350°F. Place the pecan pieces on a rimmed baking sheet and toast for 10 to 14 minutes, until fragrant and golden brown. Remove from the oven and reduce the oven temperature to 200°F. In a medium sauté pan set over medium heat, melt the butter. Stir in the sugar and salt. Add the pecans and cook, stirring, for 3 to 4 minutes, until the butter is lightly browned. Remove the pan from the heat.",
            "Place a rack in the upper third of the oven and preheat to 350°F.",
            "Place the pecan pieces on a rimmed baking sheet and toast for 10 to 14 minutes, until fragrant and golden brown. Remove from the oven and reduce the oven temperature to 200°F.",
            "In a medium sauté pan set over medium heat, melt the butter. Stir in the sugar and salt. Add the pecans and cook, stirring, for 3 to 4 minutes, until the butter is lightly browned. Remove the pan from the heat.",
            "For the french toast: In a medium bowl, whisk together the eggs and milk. In a small saucepan set over medium heat, warm the heavy cream for about 3 minutes, until just steaming and remove from the heat. In a small bowl, combine the brown sugar, cinnamon, and salt. Add the sugar mixture to the cream and stir just until the sugar is dissolved. Add the cream mixture to the egg and milk mixture. Stir in the vanilla. Working with one slice of bread at a time, put a slice into the egg mixture and let it soak for about 15 seconds on each side. Place on a rimmed baking sheet to rest while all the bread is dipped and the pan is heated. In a medium nonstick skillet or griddle pan set over medium heat, melt the clarified butter. Place 2 or 3 bread slices into the pan and cook for about 2 minutes per side, until golden brown on each side. Add a bit more butter to the pan after you flip the bread, if needed. Transfer to a heatproof plate or rimmed baking sheet with a wire cooling rack set inside. Cover with a kitchen towel and keep warm in the oven while you cook the rest of the toast. Repeat the cooking process with the remaining bread.",
            "In a medium bowl, whisk together the eggs and milk.",
            "In a small saucepan set over medium heat, warm the heavy cream for about 3 minutes, until just steaming and remove from the heat.",
            "In a small bowl, combine the brown sugar, cinnamon, and salt. Add the sugar mixture to the cream and stir just until the sugar is dissolved. Add the cream mixture to the egg and milk mixture. Stir in the vanilla.",
            "Working with one slice of bread at a time, put a slice into the egg mixture and let it soak for about 15 seconds on each side. Place on a rimmed baking sheet to rest while all the bread is dipped and the pan is heated.",
            "In a medium nonstick skillet or griddle pan set over medium heat, melt the clarified butter. Place 2 or 3 bread slices into the pan and cook for about 2 minutes per side, until golden brown on each side. Add a bit more butter to the pan after you flip the bread, if needed. Transfer to a heatproof plate or rimmed baking sheet with a wire cooling rack set inside. Cover with a kitchen towel and keep warm in the oven while you cook the rest of the toast. Repeat the cooking process with the remaining bread.",
            "For the bourbon maple syrup: In a small saucepan set over low heat, gently stir together the maple syrup, bourbon, and vanilla until just warmed and well combined. To serve, place 2 slices of French toast on each plate. Generously sprinkle with buttered pecans, drizzle with syrup, and dust with confectioners’ sugar. Serve immediately.",
            "In a small saucepan set over low heat, gently stir together the maple syrup, bourbon, and vanilla until just warmed and well combined.",
            "To serve, place 2 slices of French toast on each plate. Generously sprinkle with buttered pecans, drizzle with syrup, and dust with confectioners’ sugar. Serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/591324f218603d3835001906/6:4/w_274%2Ch_169/bourbon-pecan-french-toast-051017.jpg"
    }
}