{
    "recipe": {
        "title": "Buttermilk Pudding Cake with Maple Raspberries ",
        "ingredients": [
            "1/4 cup all-purpose flour",
            "1/4 teaspoon salt",
            "1 1/3 cups well-shaken buttermilk",
            "1/2 stick butter, melted and cooled",
            "3 large eggs, separated",
            "2/3 cup sugar, divided",
            "2 half-pints raspberries (1/2 pound)",
            "1/3 cup pure maple syrup"
        ],
        "instructions": [
            "Preheat oven to 350°F with rack in middle. Butter a 1 1/2-quart shallow baking dish. Whisk together flour and salt in a large bowl. Whisk together buttermilk, butter, yolks, and 1/3 cup sugar in a separate bowl, then stir into flour mixture. Beat egg whites with an electric mixer at medium speed until frothy. Increase speed to medium-high and add remaining 1/3 cup sugar, 1 tablespoon at a time, beating until whites just hold stiff peaks. Stir about one third of whites into batter to lighten, then fold in remaining whites gently but thoroughly. Pour batter into baking dish and bake in a water bath until puffed and golden-brown, 40 to 50 minutes. Cool slightly, 10 to 15 minutes. Toss raspberries with maple syrup and serve with warm pudding cake.",
            "Preheat oven to 350°F with rack in middle. Butter a 1 1/2-quart shallow baking dish.",
            "Whisk together flour and salt in a large bowl. Whisk together buttermilk, butter, yolks, and 1/3 cup sugar in a separate bowl, then stir into flour mixture.",
            "Beat egg whites with an electric mixer at medium speed until frothy. Increase speed to medium-high and add remaining 1/3 cup sugar, 1 tablespoon at a time, beating until whites just hold stiff peaks.",
            "Stir about one third of whites into batter to lighten, then fold in remaining whites gently but thoroughly. Pour batter into baking dish and bake in a water bath until puffed and golden-brown, 40 to 50 minutes. Cool slightly, 10 to 15 minutes.",
            "Toss raspberries with maple syrup and serve with warm pudding cake."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b31a0b460b4423363eb756/6:4/w_274%2Ch_169/358032_pudding-cake_1x1.jpg"
    }
}