{
    "recipe": {
        "title": "Butter Cookies with Dulce de Leche ",
        "ingredients": [
            "3/4 stick (6 tablespoons) unsalted butter, softened",
            "1/3 cup cornstarch",
            "3/4 to 1 cup all-purpose flour",
            "1/4 teaspoon baking powder",
            "1/8 teaspoon salt",
            "1/4 cup granulated sugar",
            "2 large egg yolks",
            "1 tablespoon Pisco or regular brandy",
            "1/4 teaspoon vanilla",
            "About 1/4 cup dulce de leche*",
            "Confectioners sugar for dusting",
            "a 1 1/2-inch round cookie cutter"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 350°F. Butter a large baking sheet. Whisk together cornstarch, 3/4 cup flour, baking powder, and salt in a small bowl. Beat together butter and sugar in a large bowl with an electric mixer until light and fluffy, then beat in egg yolks, Pisco, and vanilla. Stir in flour mixture until combined, adding 1 to 2 tablespoons flour if dough is sticky. (Dough should be soft.) Form dough into a disk and roll out into an 11-inch round (1/8 inch thick) on a lightly floured surface with a lightly floured rolling pin. Cut out 32 rounds with cutter (reroll scraps if necessary) and transfer to sheet, arranging rounds 1/2 inch apart. Bake until firm and pale golden around edges, 12 to 15 minutes. Transfer to a rack and cool 10 minutes. Sandwich cookies with about 1/2 teaspoon dulce de leche. Dust with confectioners sugar.",
            "Put oven rack in middle position and preheat oven to 350°F. Butter a large baking sheet.",
            "Whisk together cornstarch, 3/4 cup flour, baking powder, and salt in a small bowl.",
            "Beat together butter and sugar in a large bowl with an electric mixer until light and fluffy, then beat in egg yolks, Pisco, and vanilla. Stir in flour mixture until combined, adding 1 to 2 tablespoons flour if dough is sticky. (Dough should be soft.)",
            "Form dough into a disk and roll out into an 11-inch round (1/8 inch thick) on a lightly floured surface with a lightly floured rolling pin. Cut out 32 rounds with cutter (reroll scraps if necessary) and transfer to sheet, arranging rounds 1/2 inch apart.",
            "Bake until firm and pale golden around edges, 12 to 15 minutes. Transfer to a rack and cool 10 minutes.",
            "Sandwich cookies with about 1/2 teaspoon dulce de leche. Dust with confectioners sugar."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de5607b55306961bfd768/6:4/w_274%2Ch_169/232016.jpg"
    }
}