{
    "recipe": {
        "title": "Buttery Pull-Apart Dinner Rolls ",
        "ingredients": [
            "10 tablespoons unsalted butter, cut into pieces, divided",
            "1 large or 2 small garlic cloves, finely grated",
            "3/4 cup whole milk, divided",
            "3 tablespoons plus 2 1/4 cups bread flour",
            "1 (1/4-ounce) envelope active dry yeast (about 2 1/4 teaspoons)",
            "2 tablespoons sugar",
            "2 large eggs",
            "2 teaspoons kosher salt",
            "Vegetable oil (for bowl)",
            "Flaky sea salt"
        ],
        "instructions": [
            "Place 5 Tbsp. butter in a medium bowl. Cook remaining 5 Tbsp. butter in a small saucepan over medium heat, swirling often, until butter foams, then turns golden brown, about 5 minutes. Remove from heat and stir in garlic; scrape butter mixture and all those toasty milk solids at the bottom of the pan into bowl with butter pieces. Reserve saucepan. Stir until all the butter is melted and mixture is smooth. Let sit, stirring occasionally, until butter is room temperature and solidified, 15–20 minutes. Meanwhile, whisk 1/4 cup milk, 3 Tbsp. flour, and 1/4 cup water in reserved saucepan until smooth, then set over medium heat and cook, whisking constantly, until it becomes a very stiff paste resembling mashed potatoes, about 2 minutes. Scrape into the bowl of a stand mixer; reserve saucepan. Gently heat remaining 1/2 cup milk in reserved saucepan over low (it should be warm to the touch but not steaming hot). Remove from heat and let sit 1 minute. Add yeast and whisk until dissolved. Let mixture sit until foamy, about 5 minutes. Meanwhile, brush bottom and sides of a 13x9\" baking dish with 2 Tbsp. garlic butter; set aside. Set aside another 2 Tbsp. garlic butter in a small bowl for brushing over baked rolls. Add yeast mixture, sugar, 1 egg, and remaining 2 1/4 cups flour to paste in mixer bowl. Using the dough hook, mix on low speed until a shaggy dough forms. Add kosher salt, increase speed to medium, and continue mixing until dough forms a smooth single mass, about 3 minutes. Reduce speed to low again and add remaining garlic butter a tablespoonful at a time, waiting until incorporated before adding more. Once all of the garlic butter has been added, increase mixer speed back to medium and mix dough until very soft, smooth, and supple, another 8–10 minutes. Lightly oil a large bowl; form dough into a ball and place in bowl. Cover with plastic wrap and let rise in a warm draft-free spot until doubled in size, 45–60 minutes. Punch down dough and knead several times to deflate, then turn out onto a clean work surface. To form the rolls, divide dough into 15 equal pieces (about 1 1/2 oz. each). Working one at a time and keeping other pieces covered in plastic, fold edges of dough underneath, pinching bottom to seal. Turn 90° and fold and pinch again. Repeat process until you have created a smooth sphere with no seams except at the bottom. Place ball on work surface and rest the side of your hand next to it so your palm and fingers are cupped around it. Drag the ball toward you, using friction against the work surface to create tension and stretch the surface of the dough into a smooth, taut dome. This shaping method tightens the gluten over the surface so the rolls rise evenly upward and outward instead of slumping into amorphous blobs. Repeat with remaining balls of dough and place in prepared pan in a 5x3 grid, spacing evenly apart. Loosely cover pan with plastic wrap and let rolls rise in a warm draft-free spot until doubled in size and touching, 35–45 minutes (to test, poke one with an oiled finger; dough should spring back but leave a slight indentation). Place a rack in middle of oven; preheat to 375°F. Beat remaining egg in another small bowl until yolks and whites are incorporated and no streaks remain. Gently brush tops of rolls with egg, then sprinkle with sea salt. Bake rolls until they are deep golden brown, 20–25 minutes. Transfer pan to a wire rack and brush warm rolls with reserved 2 Tbsp. garlic butter; let cool in pan 10 minutes. Slide an offset spatula around sides and underneath rolls to loosen, then invert onto rack and turn right side up. Let cool at least another 15 minutes before serving.",
            "Place 5 Tbsp. butter in a medium bowl. Cook remaining 5 Tbsp. butter in a small saucepan over medium heat, swirling often, until butter foams, then turns golden brown, about 5 minutes. Remove from heat and stir in garlic; scrape butter mixture and all those toasty milk solids at the bottom of the pan into bowl with butter pieces. Reserve saucepan. Stir until all the butter is melted and mixture is smooth. Let sit, stirring occasionally, until butter is room temperature and solidified, 15–20 minutes.",
            "Meanwhile, whisk 1/4 cup milk, 3 Tbsp. flour, and 1/4 cup water in reserved saucepan until smooth, then set over medium heat and cook, whisking constantly, until it becomes a very stiff paste resembling mashed potatoes, about 2 minutes. Scrape into the bowl of a stand mixer; reserve saucepan.",
            "Gently heat remaining 1/2 cup milk in reserved saucepan over low (it should be warm to the touch but not steaming hot). Remove from heat and let sit 1 minute. Add yeast and whisk until dissolved. Let mixture sit until foamy, about 5 minutes.",
            "Meanwhile, brush bottom and sides of a 13x9\" baking dish with 2 Tbsp. garlic butter; set aside. Set aside another 2 Tbsp. garlic butter in a small bowl for brushing over baked rolls.",
            "Add yeast mixture, sugar, 1 egg, and remaining 2 1/4 cups flour to paste in mixer bowl. Using the dough hook, mix on low speed until a shaggy dough forms. Add kosher salt, increase speed to medium, and continue mixing until dough forms a smooth single mass, about 3 minutes. Reduce speed to low again and add remaining garlic butter a tablespoonful at a time, waiting until incorporated before adding more. Once all of the garlic butter has been added, increase mixer speed back to medium and mix dough until very soft, smooth, and supple, another 8–10 minutes. Lightly oil a large bowl; form dough into a ball and place in bowl. Cover with plastic wrap and let rise in a warm draft-free spot until doubled in size, 45–60 minutes.",
            "Punch down dough and knead several times to deflate, then turn out onto a clean work surface. To form the rolls, divide dough into 15 equal pieces (about 1 1/2 oz. each). Working one at a time and keeping other pieces covered in plastic, fold edges of dough underneath, pinching bottom to seal. Turn 90° and fold and pinch again. Repeat process until you have created a smooth sphere with no seams except at the bottom.",
            "Place ball on work surface and rest the side of your hand next to it so your palm and fingers are cupped around it. Drag the ball toward you, using friction against the work surface to create tension and stretch the surface of the dough into a smooth, taut dome. This shaping method tightens the gluten over the surface so the rolls rise evenly upward and outward instead of slumping into amorphous blobs. Repeat with remaining balls of dough and place in prepared pan in a 5x3 grid, spacing evenly apart.",
            "Loosely cover pan with plastic wrap and let rolls rise in a warm draft-free spot until doubled in size and touching, 35–45 minutes (to test, poke one with an oiled finger; dough should spring back but leave a slight indentation).",
            "Place a rack in middle of oven; preheat to 375°F. Beat remaining egg in another small bowl until yolks and whites are incorporated and no streaks remain. Gently brush tops of rolls with egg, then sprinkle with sea salt.",
            "Bake rolls until they are deep golden brown, 20–25 minutes. Transfer pan to a wire rack and brush warm rolls with reserved 2 Tbsp. garlic butter; let cool in pan 10 minutes.",
            "Slide an offset spatula around sides and underneath rolls to loosen, then invert onto rack and turn right side up. Let cool at least another 15 minutes before serving.",
            "Do Ahead Dough can be formed into rolls (do not let rise) 1 day ahead; cover and chill. Let rise before baking; this may take around 3 hours.",
            "Dough can be formed into rolls (do not let rise) 1 day ahead; cover and chill. Let rise before baking; this may take around 3 hours."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a05db14543d902dfd5e062e/6:4/w_274%2Ch_169/buttery-pull-apart-dinner-rolls-recipe-BA-111017.jpg"
    }
}