{
    "recipe": {
        "title": "Buttermilk Fried Chicken Fingers ",
        "ingredients": [
            "3 1/2 cups buttermilk",
            "3 1/2 cups whole milk",
            "1 small Spanish onion, cut into 1/2-inch thick slices",
            "2 medium jalapeños, sliced",
            "1 tablespoon kosher salt",
            "1 tablespoon Tabasco pepper sauce",
            "2 pounds skinless, boneless chicken thighs, cut into 2x4-inch strips",
            "3 1/2 cups all-purpose flour",
            "2 tablespoons granulated garlic",
            "2 tablespoons onion powder",
            "1 tablespoon plus 1 teaspoon dried thyme",
            "2 teaspoons ground sage",
            "1 tablespoon smoked paprika",
            "1/2 teaspoon cayenne pepper",
            "1 tablespoon plus 1 teaspoon kosher salt",
            "1 tablespoon plus 1 teaspoon coarse ground black pepper",
            "Canola oil, for frying",
            "Homemade or store bought ranch dressing, for serving",
            "deep fry/candy thermometer, two 13x18-inch rimmed baking sheets, 2 wire cooling racks"
        ],
        "instructions": [
            "In a wide, shallow bowl, combine buttermilk, milk, onion, jalapeño, salt, and Tabasco. Add chicken, cover, and refrigerate for 24 hours. Preheat oven to 250°F. Set cooling racks over rimmed baking sheets. In a large bowl, combine the flour, granulated garlic, onion powder, thyme, sage, paprika, cayenne, salt, and pepper. In a large pot, pour in enough oil to come up to 2 inches. Set over medium-high heat until oil registers 350°F on a deep-fry thermometer. Working in batches of 4 to 5 pieces, remove chicken from marinade, shaking to remove any vegetables and excess liquid, and dredge in the seasoned flour. Fry chicken pieces, turning once, until golden and cooked through, 6 to 7 minutes total per batch. Transfer chicken to wire racks and warm in oven while frying remaining batches. Serve chicken fingers with ranch dressing, if desired.",
            "In a wide, shallow bowl, combine buttermilk, milk, onion, jalapeño, salt, and Tabasco. Add chicken, cover, and refrigerate for 24 hours.",
            "Preheat oven to 250°F. Set cooling racks over rimmed baking sheets. In a large bowl, combine the flour, granulated garlic, onion powder, thyme, sage, paprika, cayenne, salt, and pepper.",
            "In a large pot, pour in enough oil to come up to 2 inches. Set over medium-high heat until oil registers 350°F on a deep-fry thermometer. Working in batches of 4 to 5 pieces, remove chicken from marinade, shaking to remove any vegetables and excess liquid, and dredge in the seasoned flour. Fry chicken pieces, turning once, until golden and cooked through, 6 to 7 minutes total per batch. Transfer chicken to wire racks and warm in oven while frying remaining batches.",
            "Serve chicken fingers with ranch dressing, if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54c7f4c9c252103035d33f16/6:4/w_274%2Ch_169/51258420_fried-chicken-fingers_6x4-hpr.jpg"
    }
}