{
    "recipe": {
        "title": "Butternut Squash Ravioli in Cider Broth ",
        "ingredients": [
            "1 1/2 pounds butternut squash, halved lengthwise, seeded",
            "2 tablespoons brown sugar",
            "1/8 teaspoon ground cinnamon",
            "1/4 cup pure maple syrup",
            "3 tablespoons butter",
            "1/2 cup water",
            "1 cup ricotta cheese",
            "1/4 cup grated Parmesan cheese",
            "3 tablespoons chopped fresh parsley",
            "1/2 teaspoon chopped fresh thyme",
            "32 (about) gyoza (potsticker) wrappers*",
            "1/3 cup chopped shallots (about 2)",
            "1 1/2 cups chicken stock or canned broth",
            "1/2 cup apple cider",
            "Shaved Parmesan cheese",
            "*Available at Asian markets, gyoza wrappers can also be found in the refrigerated section of many supermarkets. If unavailable, substitute wonton wrappers and cut into 3 1/2-inch rounds."
        ],
        "instructions": [
            "Preheat oven to 350°F. Place squash, cut side up, in baking pan. Sprinkle with brown sugar and cinnamon; season with salt and pepper. Drizzle with syrup; dot with 1 tablespoon butter. Pour 1/2 cup water into bottom of pan. Bake until squash is tender, about 1 hour. Cool completely.",
            "Scoop out squash into bowl. Mash. Transfer 3/4 cup squash to medium bowl (reserve remaining squash for another use). Mix in ricotta, 1/4 cup grated Parmesan, 2 tablespoons parsley and thyme. Season with salt and pepper.",
            "Place wrappers on work surface. Place 1 level tablespoon filling in center of each. Brush edges with water; fold each in half, pressing edges to seal. (Ravioli can be made 4 hours ahead. Arrange in single layer on foil-lined baking sheets dusted with flour. Cover and refrigerate.)",
            "Melt 2 tablespoons butter in large pan over medium heat. Add shallots; sauté 1 minute. Add stock and cider; simmer 8 minutes. Add 1 tablespoon parsley. Season with salt and pepper.",
            "Working in batches, cook ravioli in pot of boiling salted water until just tender, about 1 minute. Using slotted spoon, divide ravioli among shallow soup bowls. Bring cider broth to simmer; ladle over ravioli. Top with shaved Parmesan."
        ],
        "picture_link": "https://assets.epicurious.com/photos/561026d17b55306961c00047/6:4/w_274%2Ch_169/104456.jpg"
    }
}