{
    "recipe": {
        "title": "Butterscotch–Potato Chip Balls ",
        "ingredients": [
            "2 1/3 cups [325 g] all-purpose flour",
            "1 tsp baking soda",
            "1 tsp table salt",
            "1 cup [180 g] butterscotch chips",
            "1 cup [220 g] unsalted butter, melted",
            "1 cup [200 g] packed light brown sugar",
            "1/2 cup [100 g] granulated sugar",
            "1 egg",
            "1 egg yolk",
            "2 tsp pure vanilla extract",
            "5 cups [175 g] kettle-style potato chips",
            "Flaky sea salt for sprinkling"
        ],
        "instructions": [
            "Preheat the oven to 350°F [180°C]. Line a rimmed baking sheet with parchment paper. In a medium bowl, combine the flour, baking soda, and salt and whisk together. Add the butterscotch chips and set aside. In the bowl of a stand mixer fitted with the paddle attachment, cream the melted butter and sugars on medium-high speed until thick, light, and glossy, 3 to 5 minutes, scraping the bowl with a rubber spatula as needed. Decrease the mixer speed to medium-low and add the egg and yolk, one at a time, beating well and scraping the bowl after each addition with a rubber spatula. Add the vanilla and mix to combine. Add the dry ingredients all at once, mixing just to combine. Remove the bowl from the stand mixer and add 3 cups [105 g] of the potato chips to the dough, combining and crushing the chips with a rubber spatula. In a small bowl, crush the remaining 2 cups [70 g] potato chips. Scoop the dough into 1 1/2-tablespoon balls with a cookie scoop or measuring spoon, rolling each ball in the leftover crushed chips, and evenly place 12 on the prepared baking sheet. Sprinkle each cookie with flaky sea salt, and bake for 8 to 10 minutes, rotating at the halfway point, until lightly browned. Remove from the oven and press down on each cookie with a spatula to slightly flatten. Repeat with the remaining cookie dough. Let cool briefly and serve warm, because who doesn't love a cookie warm from the oven? The cookies will keep in an airtight container on the counter for up to 3 days.",
            "Preheat the oven to 350°F [180°C]. Line a rimmed baking sheet with parchment paper.",
            "In a medium bowl, combine the flour, baking soda, and salt and whisk together. Add the butterscotch chips and set aside. In the bowl of a stand mixer fitted with the paddle attachment, cream the melted butter and sugars on medium-high speed until thick, light, and glossy, 3 to 5 minutes, scraping the bowl with a rubber spatula as needed.",
            "Decrease the mixer speed to medium-low and add the egg and yolk, one at a time, beating well and scraping the bowl after each addition with a rubber spatula. Add the vanilla and mix to combine. Add the dry ingredients all at once, mixing just to combine. Remove the bowl from the stand mixer and add 3 cups [105 g] of the potato chips to the dough, combining and crushing the chips with a rubber spatula.",
            "In a small bowl, crush the remaining 2 cups [70 g] potato chips. Scoop the dough into 1 1/2-tablespoon balls with a cookie scoop or measuring spoon, rolling each ball in the leftover crushed chips, and evenly place 12 on the prepared baking sheet.",
            "Sprinkle each cookie with flaky sea salt, and bake for 8 to 10 minutes, rotating at the halfway point, until lightly browned. Remove from the oven and press down on each cookie with a spatula to slightly flatten.",
            "Repeat with the remaining cookie dough.",
            "Let cool briefly and serve warm, because who doesn't love a cookie warm from the oven? The cookies will keep in an airtight container on the counter for up to 3 days."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ae0eaef9f41e5405c5afc3c/6:4/w_274%2Ch_169/peanut-butter-potato-chip-cookies-recipe-042518.jpg"
    }
}