{
    "recipe": {
        "title": "Butternut Squash Sandwich with Cheddar Cheese and Pickled Red Onion ",
        "ingredients": [
            "1 medium butternut squash (about 2 pounds)",
            "1/4 cup extra-virgin olive oil",
            "8 sprigs thyme",
            "2 garlic cloves, smashed",
            "1 3/4 teaspoons kosher salt, divided",
            "1/2 teaspoon freshly ground black pepper",
            "1/4 cup red wine vinegar",
            "1 1/2 teaspoons sugar",
            "1/2 medium red onion, thinly sliced",
            "1/4 cup mayonnaise",
            "2 tablespoons Dijon mustard",
            "4 ciabatta rolls",
            "4 slices white cheddar",
            "1 cup arugula",
            "Chips (for serving; optional)"
        ],
        "instructions": [
            "Arrange racks in middle and upper thirds of oven; preheat to 450°F. Cut squash in half crosswise where the neck and body meet. Peel and seed. Slice neck lengthwise into 1/4\"-thick planks (about 2 1/2\" long). Slice body into 1/4\" pieces. Divide squash, oil, thyme, garlic, 1 tsp. salt, and 1/2 tsp. pepper between 2 rimmed baking sheets. Toss to combine, then arrange in a single layer. Bake, tossing once halfway through and rotating trays, until squash is tender, 18–20 minutes. Meanwhile, bring vinegar, sugar, remaining 3/4 tsp. salt, and 1/2 cup water to a boil in a small saucepan. Remove from heat, then stir in onion. Let cool. Whisk mayonnaise and mustard in a small bowl. Remove thyme leaves from stems, then finely chop leaves and garlic. Stir into mayonnaise mixture. Slice rolls in half and toast in oven 5 minutes. Spread 2 Tbsp. mayonnaise mixture on bottom halves. Top each with squash, cheese, 1 1/2 Tbsp. pickled red onion, and arugula. Serve with chips alongside, if using.",
            "Arrange racks in middle and upper thirds of oven; preheat to 450°F. Cut squash in half crosswise where the neck and body meet. Peel and seed. Slice neck lengthwise into 1/4\"-thick planks (about 2 1/2\" long). Slice body into 1/4\" pieces.",
            "Divide squash, oil, thyme, garlic, 1 tsp. salt, and 1/2 tsp. pepper between 2 rimmed baking sheets. Toss to combine, then arrange in a single layer. Bake, tossing once halfway through and rotating trays, until squash is tender, 18–20 minutes.",
            "Meanwhile, bring vinegar, sugar, remaining 3/4 tsp. salt, and 1/2 cup water to a boil in a small saucepan. Remove from heat, then stir in onion. Let cool.",
            "Whisk mayonnaise and mustard in a small bowl. Remove thyme leaves from stems, then finely chop leaves and garlic. Stir into mayonnaise mixture.",
            "Slice rolls in half and toast in oven 5 minutes. Spread 2 Tbsp. mayonnaise mixture on bottom halves. Top each with squash, cheese, 1 1/2 Tbsp. pickled red onion, and arugula. Serve with chips alongside, if using.",
            "Do Ahead Squash can be roasted 3 days ahead; cover and chill. Onions can be made 1 month ahead; cover and chill.",
            "Squash can be roasted 3 days ahead; cover and chill. Onions can be made 1 month ahead; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59d3f82882f7c76a95803fdb/6:4/w_274%2Ch_169/Butternut-Squash-Sandwich-Cheddar-Cheese-and-Pickled-Red-Onion-28092017.jpg"
    }
}