{
    "recipe": {
        "title": "Butter-Sugar Crepes ",
        "ingredients": [
            "7 tablespoons unsalted butter, melted and cooled, divided",
            "1 cup whole milk",
            "1 cup all-purpose flour",
            "2 large eggs",
            "6 tablespoons sugar, divided"
        ],
        "instructions": [
            "Reserve 1 tablespoon melted butter for brushing skillet. Blend milk, flour, eggs, 2 tablespoons sugar, 2 tablespoons butter, and 1/4 teaspoon salt in a blender until smooth, then chill, covered, 30 minutes. Lightly brush a 10-inch nonstick skillet with some of reserved butter and heat over medium heat until hot. Pour in 1/4 cup batter, immediately tilting and rotating skillet to coat bottom, and cook crêpe, turning once, until just set and golden, about 1 minute total. Transfer to a plate. Make 7 more crêpes, stacking them. Brush each crêpe with 1 teaspoon butter and sprinkle with 1 teaspoon sugar, then fold twice to form a triangle. Heat 2 teaspoons each of butter and sugar with a pinch of salt in skillet until sugar has dissolved, then cook 4 crêpes, turning once, until golden brown. Repeat with remaining butter, sugar, and crêpes.",
            "Reserve 1 tablespoon melted butter for brushing skillet.",
            "Blend milk, flour, eggs, 2 tablespoons sugar, 2 tablespoons butter, and 1/4 teaspoon salt in a blender until smooth, then chill, covered, 30 minutes.",
            "Lightly brush a 10-inch nonstick skillet with some of reserved butter and heat over medium heat until hot. Pour in 1/4 cup batter, immediately tilting and rotating skillet to coat bottom, and cook crêpe, turning once, until just set and golden, about 1 minute total. Transfer to a plate. Make 7 more crêpes, stacking them.",
            "Brush each crêpe with 1 teaspoon butter and sprinkle with 1 teaspoon sugar, then fold twice to form a triangle.",
            "Heat 2 teaspoons each of butter and sugar with a pinch of salt in skillet until sugar has dissolved, then cook 4 crêpes, turning once, until golden brown. Repeat with remaining butter, sugar, and crêpes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/557079c90f59eef70ea80c25/6:4/w_274%2Ch_169/6x4-3.jpg"
    }
}