{
    "recipe": {
        "title": "Cabbage Rolls with Meat Stuffing and Wild Mushroom Sauce ",
        "ingredients": [
            "2 large heads savoy cabbage",
            "5 tbsp/70 g unsalted butter",
            "1/4 cup/40 g coarsely chopped onion",
            "4 cups/630 g cooked white rice",
            "1 lb/455 g coarsely chopped boneless pork or chicken (thigh meat will be juicier, but white meat works as well)",
            "Salt and freshly ground pepper",
            "2 cups/480 ml chicken broth or stock",
            "One 1-oz/30-g package dried mixed wild mushrooms or porcini",
            "2 cups/480 ml boiling water",
            "2 tbsp unsalted butter",
            "2 tbsp minced onion",
            "1 lb/455 g mixed fresh wild mushrooms, cleaned, trimmed, and coarsely chopped (Go for an exotic mix, but if your market offers only portobello, cremini, and shiitake, these will work as well.)",
            "1 tbsp all-purpose flour",
            "Salt and freshly ground pepper",
            "1/4 cup/60 ml white wine, preferably dry vermouth",
            "1/4 cup/60 ml heavy cream",
            "Juice of 1/2 lemon"
        ],
        "instructions": [
            "Preheat the oven to 350°F/180°C/gas 4.",
            "To make the cabbage rolls: Fill a large pot—one in which you can submerse a whole head of cabbage—with water and bring to a boil. (It is helpful to use a pot with a strainer insert, such as a pasta pot, so you can pick up the insert to remove the cooked cabbage, rather than struggle with spoons or tongs.) Add the first head of cabbage and parboil for about 10 minutes. Remove and let it drain in a colander in the sink until just cool enough to handle. Meanwhile, cook the second head of cabbage, drain, and cool. Gently pull the outer leaves off each cabbage. (Some of these might be soggy or torn.) Set these aside to line the baking dish. It helps to cut off some of the coarse stem at the beginning and while peeling off the leaves. Your goal is to have 12 to 16 perfect medium to large leaves in which to roll the stuffing. Set aside the small leaves for lining the baking dish as well. If you can get more than 16 leaves to stuff, do so—you can never have too many little doves. Pat each leaf dry and set aside on a kitchen or paper towel. In a small frying pan, melt 2 tbsp of the butter over medium heat, add the onion, and cook until lightly browned. Remove from the heat and put the onion, rice, and chopped meat into a food processor; season with salt and pepper; and whirl until well mixed. You want to be careful not to overprocess the filling—it should have the consistency of raw meatballs, and not be mushy. Lay out the \"choice\" cabbage leaves on a work surface and divide the filling among the leaves: The exact portion size for each one will depend on the size of the leaf. (I dollop the filling on with a tablespoon, placing it near the bottom of the leaf). If any stem remaining on the leaf seems especially tough or thick, you can pare it down with a vegetable peeler. Roll the leaves up, folding in the sides and ends so the stuffing is enclosed. Line the bottom of a 9-x-12-in/23-x-30.5-cm baking dish with any leftover cabbage leaves. (If, after lining the dish, you find you still have a lot of leftover leaves, store them in the refrigerator and eventually chop them, cook in butter, and season with salt and pepper to serve as a side dish for another meal!). Rest the rolls on top, seam-side down; they can be crowded together, just so long as they don't overlap. If you run out of room in one baking dish, start a smaller, second one, lining it the same way. Pour in the chicken broth (it should come about a third of the way up the sides of the rolls, and not submerge them). Dot the tops of the rolls with the remaining 3 tbsp butter. Bake for 40 minutes to 1 hour, or until the tops are golden and slightly crispy. Remove the cabbage rolls to a platter and keep warm (you can tent them with foil and keep them in the turned-off oven). Discard the leaves lining the baking dish, but reserve the broth, which will be added to the mushroom sauce.",
            "Fill a large pot—one in which you can submerse a whole head of cabbage—with water and bring to a boil. (It is helpful to use a pot with a strainer insert, such as a pasta pot, so you can pick up the insert to remove the cooked cabbage, rather than struggle with spoons or tongs.) Add the first head of cabbage and parboil for about 10 minutes. Remove and let it drain in a colander in the sink until just cool enough to handle. Meanwhile, cook the second head of cabbage, drain, and cool.",
            "Gently pull the outer leaves off each cabbage. (Some of these might be soggy or torn.) Set these aside to line the baking dish. It helps to cut off some of the coarse stem at the beginning and while peeling off the leaves. Your goal is to have 12 to 16 perfect medium to large leaves in which to roll the stuffing. Set aside the small leaves for lining the baking dish as well. If you can get more than 16 leaves to stuff, do so—you can never have too many little doves. Pat each leaf dry and set aside on a kitchen or paper towel.",
            "In a small frying pan, melt 2 tbsp of the butter over medium heat, add the onion, and cook until lightly browned. Remove from the heat and put the onion, rice, and chopped meat into a food processor; season with salt and pepper; and whirl until well mixed. You want to be careful not to overprocess the filling—it should have the consistency of raw meatballs, and not be mushy.",
            "Lay out the \"choice\" cabbage leaves on a work surface and divide the filling among the leaves: The exact portion size for each one will depend on the size of the leaf. (I dollop the filling on with a tablespoon, placing it near the bottom of the leaf). If any stem remaining on the leaf seems especially tough or thick, you can pare it down with a vegetable peeler. Roll the leaves up, folding in the sides and ends so the stuffing is enclosed.",
            "Line the bottom of a 9-x-12-in/23-x-30.5-cm baking dish with any leftover cabbage leaves. (If, after lining the dish, you find you still have a lot of leftover leaves, store them in the refrigerator and eventually chop them, cook in butter, and season with salt and pepper to serve as a side dish for another meal!). Rest the rolls on top, seam-side down; they can be crowded together, just so long as they don't overlap. If you run out of room in one baking dish, start a smaller, second one, lining it the same way.",
            "Pour in the chicken broth (it should come about a third of the way up the sides of the rolls, and not submerge them). Dot the tops of the rolls with the remaining 3 tbsp butter. Bake for 40 minutes to 1 hour, or until the tops are golden and slightly crispy.",
            "Remove the cabbage rolls to a platter and keep warm (you can tent them with foil and keep them in the turned-off oven). Discard the leaves lining the baking dish, but reserve the broth, which will be added to the mushroom sauce.",
            "To make the wild mushroom sauce: Soak the dried mushrooms in the boiling water for at least 30 minutes, until softened. Strain the soaking liquid through a fine-mesh strainer lined with a paper towel or cheesecloth, placed over a bowl. Squeeze the mushrooms until the juices are all extracted. Set the liquid aside. Rinse the mushrooms with cold water, pat dry, and coarsely chop. In a large frying pan, melt the butter over medium heat and cook the onion until translucent. Add the chopped fresh mushrooms and soaked dried mushrooms, and cook, stirring often, until all the mushrooms are soft and golden. Sprinkle the mushrooms with the flour, season with salt and pepper, and stir constantly until the mushrooms are well coated. Slowly add the reserved mushroom soaking liquid, continuing to stir until all the liquid is blended in and has thickened. Add the wine, cream, and any broth remaining in the pan in which the cabbage rolls were cooked, adding each one separately, stirring constantly, and allowing the sauce to thicken before adding the next. Add the lemon juice and lower the heat. Simmer the sauce for a good 15 minutes or so, until thick and rich. If the sauce is still too thin after 15 minutes, raise the heat and cook at a gentle boil, stirring, until reduced further. When ready to serve, pour the mushroom sauce over the cabbage rolls, and serve immediately.",
            "Soak the dried mushrooms in the boiling water for at least 30 minutes, until softened. Strain the soaking liquid through a fine-mesh strainer lined with a paper towel or cheesecloth, placed over a bowl. Squeeze the mushrooms until the juices are all extracted. Set the liquid aside. Rinse the mushrooms with cold water, pat dry, and coarsely chop.",
            "In a large frying pan, melt the butter over medium heat and cook the onion until translucent. Add the chopped fresh mushrooms and soaked dried mushrooms, and cook, stirring often, until all the mushrooms are soft and golden.",
            "Sprinkle the mushrooms with the flour, season with salt and pepper, and stir constantly until the mushrooms are well coated. Slowly add the reserved mushroom soaking liquid, continuing to stir until all the liquid is blended in and has thickened. Add the wine, cream, and any broth remaining in the pan in which the cabbage rolls were cooked, adding each one separately, stirring constantly, and allowing the sauce to thicken before adding the next. Add the lemon juice and lower the heat. Simmer the sauce for a good 15 minutes or so, until thick and rich. If the sauce is still too thin after 15 minutes, raise the heat and cook at a gentle boil, stirring, until reduced further.",
            "When ready to serve, pour the mushroom sauce over the cabbage rolls, and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b0106ac418ca0f1657d970/6:4/w_274%2Ch_169/51165200_cabbage-rolls_1x1.jpg"
    }
}