{
    "recipe": {
        "title": "Cacio e Pepe Pie ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "8 oz. coarsely grated Fontina cheese (about 2 cups)",
            "1 1/2 cups half-and-half",
            "4 oz. finely grated Parmesan and/or Pecorino Romano (about 1 cup), plus more for serving",
            "1 Tbsp. freshly ground black pepper, plus more",
            "1/2 cup plus 1 1/2 tsp. kosher salt",
            "12 oz. bucatini or spaghetti",
            "8 oz. ricotta",
            "3 large eggs",
            "2 Tbsp. extra-virgin olive oil, plus more for drizzling"
        ],
        "instructions": [
            "Preheat oven to 375°F. Lightly spray an 8\" springform pan with nonstick spray. Wrap bottom tightly in foil to prevent any leaks and place on a rimmed baking sheet.",
            "Mix Fontina, half-and-half, 4 oz. Parmesan, 1 Tbsp. pepper, and 1 1/2 tsp. salt in a large bowl that can rest on rim of pasta pot without falling in.",
            "Fill pasta pot with 5 quarts water and add remaining 1/2 cup salt. Bring to a boil and cook pasta 4 minutes shy of package directions. Drain.",
            "While pasta is cooking, place bowl with cheese mixture over pot and whisk constantly until cheese is melted, 3–4 minutes. Remove from heat. Whisk in ricotta, then eggs and 2 Tbsp. oil. Add drained pasta to bowl and toss to coat.",
            "Transfer pasta to prepared pan, pressing down to compact lightly. Pour any leftover cheese mixture evenly over. Using tongs or a fork, pull up a few strands of pasta so they form loops just above surface of pie (these will get browned and give texture to the top).",
            "Bake pasta until cheese is bubbling and pie is golden brown on edges and sides, 35–45 minutes. Let cool 10–15 minutes before removing sides of pan. Slide a thin spatula underneath and around pie to help release it from pan, then transfer to a platter or cutting board. Top with Parmesan, a drizzle of oil, and a few cranks of pepper. Slice into wedges and serve warm."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5bce56a7bc651a34e12e7eae/6:4/w_274%2Ch_169/Cacio-e-Pepe-Spaghetti-Pie-17102018.jpg"
    }
}