{
    "recipe": {
        "title": "Cajun Shrimp Stew ",
        "ingredients": [
            "2 tablespoons vegetable oil",
            "1/4 cup all-purpose flour",
            "1 medium onion, chopped",
            "1 small celery rib, finely chopped",
            "1/2 cup finely chopped green bell pepper",
            "1 cup bottled clam juice (8 fluid ounces)",
            "3/4 cup water",
            "1/4 teaspoon salt",
            "1/4 teaspoon cayenne",
            "1 1/4 pound peeled and deveined large shrimp (21 to 25 per pound)",
            "1/3 cup thinly sliced scallion greens",
            "Accompaniment: white rice"
        ],
        "instructions": [
            "Stir together oil and flour in a 10-inch heavy skillet (preferably cast-iron) with a metal or wooden spatula, then cook over moderate heat, scraping back and forth constantly, until roux is the color of light milk chocolate, 10 to 12 minutes. Add onion, celery, and bell pepper and cook, scraping back and forth occasionally, until bell pepper is softened, about 8 minutes. Stir in clam juice, water, salt, and cayenne and simmer, stirring occasionally, until liquid is thickened, 8 to 10 minutes. Stir in shrimp and simmer, stirring occasionally, until shrimp is just cooked through, 3 to 4 minutes. Stir in scallion greens and salt to taste.",
            "Stir together oil and flour in a 10-inch heavy skillet (preferably cast-iron) with a metal or wooden spatula, then cook over moderate heat, scraping back and forth constantly, until roux is the color of light milk chocolate, 10 to 12 minutes.",
            "Add onion, celery, and bell pepper and cook, scraping back and forth occasionally, until bell pepper is softened, about 8 minutes. Stir in clam juice, water, salt, and cayenne and simmer, stirring occasionally, until liquid is thickened, 8 to 10 minutes. Stir in shrimp and simmer, stirring occasionally, until shrimp is just cooked through, 3 to 4 minutes. Stir in scallion greens and salt to taste."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd7ec7b55306961bfab7f/6:4/w_274%2Ch_169/236681.jpg"
    }
}