{
    "recipe": {
        "title": "Calabaza, Corn, and Coconut Soup ",
        "ingredients": [
            "2 tablespoons olive oil",
            "1 medium onion, coarsely chopped",
            "1/4 cup finely chopped fresh cilantro stems",
            "2 garlic cloves, coarsely chopped",
            "1 (2 1/4-pound) piece calabaza squash or 1 (2 1/2-pound) whole kabocha squash, peeled, seeded, and cut into 1/2-inch pieces (6 cups)",
            "4 cups water",
            "1 1/4 cups well-stirred canned unsweetened coconut milk (12 ounces)",
            "3 ears of corn (fresh or thawed frozen), kernels cut off and reserved for relish (below) and cobs halved crosswise",
            "2 teaspoons salt",
            "1/4 teaspoon cayenne",
            "4 1/2 teaspoons fresh lime juice",
            "1/4 teaspoon salt",
            "Pinch of sugar",
            "2 tablespoons olive oil",
            "2 cups corn kernels (see above)",
            "2 tablespoons coarsely chopped fresh cilantro",
            "1 tablespoon finely chopped shallot"
        ],
        "instructions": [
            "Make soup: Heat oil in a 4- to 5-quart heavy pot over moderately high heat until hot but not smoking, then sauté onion, stirring occasionally, until beginning to soften and edges are browned, about 4 minutes. Add cilantro stems and garlic and cook, stirring occasionally, 3 minutes. Add squash pieces and cook, stirring frequently, 3 minutes. Stir in water, coconut milk, corn cobs, salt, and cayenne and simmer, uncovered, stirring occasionally, until squash is very tender, about 15 minutes.",
            "Heat oil in a 4- to 5-quart heavy pot over moderately high heat until hot but not smoking, then sauté onion, stirring occasionally, until beginning to soften and edges are browned, about 4 minutes. Add cilantro stems and garlic and cook, stirring occasionally, 3 minutes. Add squash pieces and cook, stirring frequently, 3 minutes. Stir in water, coconut milk, corn cobs, salt, and cayenne and simmer, uncovered, stirring occasionally, until squash is very tender, about 15 minutes.",
            "Prepare corn relish while soup simmers: Whisk together lime juice, salt, and sugar in a bowl, then add oil and whisk until combined. Cook corn kernels in a saucepan of boiling salted water until just tender, 2 to 3 minutes. Drain in a sieve, then rinse under cold water to stop cooking. Drain well, then transfer to dressing along with cilantro and shallot and toss well to coat.",
            "Whisk together lime juice, salt, and sugar in a bowl, then add oil and whisk until combined.",
            "Cook corn kernels in a saucepan of boiling salted water until just tender, 2 to 3 minutes. Drain in a sieve, then rinse under cold water to stop cooking. Drain well, then transfer to dressing along with cilantro and shallot and toss well to coat.",
            "Finish soup: Discard corn cobs, then purée soup in batches in a blender (use caution when blending hot liquids) until smooth, transferring to a 2-quart measure. Divide soup among bowls and gently stir 1/4 cup corn relish into each.",
            "Discard corn cobs, then purée soup in batches in a blender (use caution when blending hot liquids) until smooth, transferring to a 2-quart measure.",
            "Divide soup among bowls and gently stir 1/4 cup corn relish into each."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de51cf9a84192308a7a95/6:4/w_274%2Ch_169/231483.jpg"
    }
}