{
    "recipe": {
        "title": "Calf's Liver with Bacon and Onions ",
        "ingredients": [
            "1 lb calf's liver (1/2 inch thick), cut into 4 pieces",
            "1 cup whole milk",
            "8 bacon slices, halved crosswise",
            "3 medium onions, halved lengthwise, then cut lengthwise into 1/4-inch slices",
            "1/2 cup all-purpose flour",
            "1 teaspoon salt",
            "1/2 teaspoon black pepper"
        ],
        "instructions": [
            "Soak liver in milk in a bowl 20 minutes. While liver is soaking, cook bacon in a 12-inch nonstick skillet over moderate heat, turning over occasionally, until crisp. Transfer bacon to paper towels to drain and reserve 2 1/2 tablespoons fat in skillet, transferring remaining fat to a small bowl. Cook onions with salt and pepper to taste in fat in skillet over moderate heat, stirring frequently, until golden brown, 12 to 15 minutes. Transfer onions to a bowl and add bacon. Keep warm, covered. Pat liver dry and discard milk. Stir together flour, salt, and pepper on a sheet of wax paper and dredge liver in flour mixture, shaking off excess. Add 1 1/2 tablespoons reserved bacon fat to skillet and heat over moderately high heat until hot but not smoking, then sauté liver, turning over once, until browned but still pink inside, about 4 minutes total. Serve liver topped with onions and bacon.",
            "Soak liver in milk in a bowl 20 minutes.",
            "While liver is soaking, cook bacon in a 12-inch nonstick skillet over moderate heat, turning over occasionally, until crisp. Transfer bacon to paper towels to drain and reserve 2 1/2 tablespoons fat in skillet, transferring remaining fat to a small bowl.",
            "Cook onions with salt and pepper to taste in fat in skillet over moderate heat, stirring frequently, until golden brown, 12 to 15 minutes. Transfer onions to a bowl and add bacon. Keep warm, covered.",
            "Pat liver dry and discard milk. Stir together flour, salt, and pepper on a sheet of wax paper and dredge liver in flour mixture, shaking off excess.",
            "Add 1 1/2 tablespoons reserved bacon fat to skillet and heat over moderately high heat until hot but not smoking, then sauté liver, turning over once, until browned but still pink inside, about 4 minutes total. Serve liver topped with onions and bacon."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57d03966322465d63774ae06/6:4/w_274%2Ch_169/calfs-liver-with-bacon-and-onions.jpg"
    }
}