{
    "recipe": {
        "title": "California Veggie Sandwich ",
        "ingredients": [
            "2 cups apple cider vinegar",
            "1/2 cup (packed) light brown sugar",
            "1/4 cup kosher salt",
            "4 cups any combination shredded carrots, sliced cucumbers, sliced red onions, and/or sliced mild fresh chiles",
            "1/4 cup buttermilk",
            "1/4 cup plain whole-milk Greek yogurt",
            "1 tablespoon fresh lemon juice",
            "6 tablespoons olive oil, divided",
            "Kosher salt, freshly ground pepper",
            "2 ripe avocados, halved",
            "6 ounces fresh goat cheese",
            "6 cups mixed lettuce leaves, ribs removed if thick",
            "8 slices multigrain bread, toasted",
            "1/2 English hothouse cucumber, thinly sliced on a diagonal",
            "2 cups sprouts",
            "2 heatproof 1-qt. glass jars"
        ],
        "instructions": [
            "Bring vinegar, brown sugar, salt, and 2 cups water to a boil in a large saucepan. Meanwhile, pack vegetables into jars. Pour brine over vegetables. Cover and chill until cool.",
            "Make the dressing and assemble: Whisk buttermilk, yogurt, lemon juice, and 3 Tbsp. oil in a large bowl until smooth; season dressing with salt and pepper. Scoop avocados into a small bowl; add 1 Tbsp. oil and lightly mash. Season with salt and pepper. Mash goat cheese with remaining 2 Tbsp. oil in another small bowl until softened and spreadable; season with salt and pepper. Add lettuce to dressing and toss to coat; season with salt and pepper. Spread avocado mixture over 4 slices of bread. Arrange lettuce over and top with cucumber, sprouts, and some drained pickles. Spread remaining 4 slices of bread with goat cheese and close sandwiches.",
            "Whisk buttermilk, yogurt, lemon juice, and 3 Tbsp. oil in a large bowl until smooth; season dressing with salt and pepper.",
            "Scoop avocados into a small bowl; add 1 Tbsp. oil and lightly mash. Season with salt and pepper. Mash goat cheese with remaining 2 Tbsp. oil in another small bowl until softened and spreadable; season with salt and pepper.",
            "Add lettuce to dressing and toss to coat; season with salt and pepper. Spread avocado mixture over 4 slices of bread. Arrange lettuce over and top with cucumber, sprouts, and some drained pickles. Spread remaining 4 slices of bread with goat cheese and close sandwiches.",
            "Do Ahead Pickles can be made 2 weeks ahead. Keep chilled.",
            "Pickles can be made 2 weeks ahead. Keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57ab9c1034bdab443b9af0d3/6:4/w_274%2Ch_169/california-veggie-sandwich-ba-081016.jpg",
        "color": 16632097
    }
}