{
    "recipe": {
        "title": "Cal-Italia Pizza with Prosciutto and Figs ",
        "ingredients": [
            "1 (13-ounce/370-gram) ball Master Dough , preferably with starter made with Poolish",
            "1 cup (255 grams) balsamic vinegar",
            "3 parts flour mixed with 1 part semolina, for dusting",
            "2-ounce (55-gram) piece Asiago cheese, cold, for shaving",
            "6 ounces (170 grams) whole-milk mozzarella cheese, shredded (1-1/2 cups)",
            "1-1/2 ounces (45 grams) Gorgonzola cheese, broken into small pieces",
            "2 to 3 tablespoons (40-60 grams) fig jam, preferably Dalmatia brand",
            "3 ounces (85 grams) thinly sliced prosciutto (about 6 slices)",
            "2 pizza baking stones or steels, pizza peel"
        ],
        "instructions": [
            "Remove the dough ball from the refrigerator and leave wrapped at room temperature until the dough warms to 60°F to 65°F. Meanwhile, set up the oven with two pizza stones or baking steels and preheat to 500°F for 1 hour.",
            "Meanwhile, put the vinegar in a small, heavy saucepan over medium heat. Once steam is rising from the surface, reduce the heat to the lowest setting to keep the vinegar below a simmer. No bubbles should break through the surface. If the lowest setting is still too hot, place the pan over a diffuser. Once the vinegar has reduced by three-fourths, remove it from the heat. The glaze can be stored in a covered container at room temperature for several months.",
            "Dust the work surface with the dusting mixture, then move the dough to the surface and dust the top.",
            "Sprinkle a wooden peel with the dusting mixture.",
            "Roll out the dough into a round 15 inches in diameter. Using a pizza wheel, trim the dough to a 13-inch round, flatten the edge, then dock the surface of the dough.",
            "Move the dough to the peel. As you work, shake the peel forward and backward to ensure the dough isn't sticking.",
            "Using a vegetable peeler, shave the Asiago over the surface of the dough, leaving a 3/4-inch border. Mound the mozzarella in the center of the pizza and use your fingertips to spread it out evenly over the Asiago.",
            "Slide the pizza onto the top stone.",
            "Bake for 7 minutes. Lift the pizza onto the peel and distribute the Gorgonzola pieces evenly over the top. Rotate the pizza 180 degrees, transfer it to the bottom stone, and bake for 3 to 4 minutes, until the bottom is browned and crisp and the top is golden brown.",
            "Transfer the pizza to a cutting board and cut into 6 wedges. Spoon small dollops of fig jam (about 1/4 teaspoon each) around the pizza. Tear the prosciutto slices lengthwise into 2 or 3 strips and drape the pieces over the pizza slices. To finish, squeeze a thin spiral of balsamic glaze onto the pizza."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54aaec9d6529d92b2c02f917/6:4/w_274%2Ch_169/51255840_cal-italia-pizza_1x1.jpg",
        "color": 7322031
    }
}