{
    "recipe": {
        "title": "Campfire Potatoes ",
        "ingredients": [
            "16 medium Yukon Gold potatoes (about 2 inches in diameter), halved",
            "3 tablespoons coarse kosher salt",
            "2 tablespoons extra-virgin olive oil",
            "4 unpeeled large garlic cloves, smashed",
            "1 teaspoon chopped fresh thyme",
            "1/2 teaspoon finely chopped fresh rosemary leaves"
        ],
        "instructions": [
            "Place potatoes in medium saucepan. Add enough cold water to cover by 1 inch. Sprinkle with 3 tablespoons coarse salt. Bring to boil, then reduce to simmer. Cook potatoes until tender, about 10 minutes. Drain. Return to saucepan. Add remaining ingredients to potatoes; toss to coat. Cool. Arrange four 12-inch squares aluminum foil on work surface. Divide potato mixture among foil squares and place 1 garlic clove atop potatoes on each square. Crimp to seal. Store packets at room temperature up to 2 hours or in refrigerator up to 2 days. Prepare barbecue (medium-high heat). Place potato packets on grill and cook until heated through and sizzling, turning occasionally, about 15 minutes. Transfer packets to serving plate and pierce foil with grill fork to release steam. Open packets carefully (hot steam will be released).",
            "Place potatoes in medium saucepan. Add enough cold water to cover by 1 inch. Sprinkle with 3 tablespoons coarse salt. Bring to boil, then reduce to simmer. Cook potatoes until tender, about 10 minutes. Drain. Return to saucepan. Add remaining ingredients to potatoes; toss to coat. Cool.",
            "Arrange four 12-inch squares aluminum foil on work surface. Divide potato mixture among foil squares and place 1 garlic clove atop potatoes on each square. Crimp to seal. Store packets at room temperature up to 2 hours or in refrigerator up to 2 days.",
            "Prepare barbecue (medium-high heat). Place potato packets on grill and cook until heated through and sizzling, turning occasionally, about 15 minutes. Transfer packets to serving plate and pierce foil with grill fork to release steam. Open packets carefully (hot steam will be released)."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a5e062fa7a9917c259b4/6:4/w_274%2Ch_169/354312_hires.jpg"
    }
}