{
    "recipe": {
        "title": "Campechana Extra (Mexican Seafood Cocktail) ",
        "ingredients": [
            "2 medium New Mexico (also called Anaheim), poblano, or Hatch chiles (about 6 ounces)",
            "1/2 pound medium shrimp (preferably wild), peeled, deveined, tails removed",
            "Kosher salt",
            "1 small tomato, seeded, finely chopped (about 3/4 cup)",
            "1–2 jalapeños, stems, ribs, and seeds removed, finely chopped",
            "1/2 cup tomato–clam cocktail, such as Clamato juice",
            "1/4 cup plus 2 tablespoons ketchup",
            "3 tablespoons chopped pitted green olives",
            "2 tablespoons chopped cilantro",
            "2 tablespoons finely chopped white onion",
            "1 1/2 teaspoons finely chopped oregano",
            "1/2 teaspoon finely chopped garlic",
            "3 tablespoons fresh lime juice",
            "3 tablespoons olive oil",
            "1/2 pound crabmeat (preferably jumbo lump), picked over",
            "1 avocado, pitted, cubed",
            "1 fresh bay leaf (optional)",
            "Tortilla chips (for serving)"
        ],
        "instructions": [
            "Prepare a grill for medium-high heat or preheat broiler. If broiling, place chiles on a rimmed baking sheet. Grill, broil, or roast chiles directly over flame on stovetop, turning occasionally, until very tender and blackened all over, 10–12 minutes. Poblanos might take a little longer, so test doneness with a paring knife. Transfer chiles to a large bowl. Cover with plastic wrap and let steam 15 minutes. Peel chiles. Halve lengthwise, discard seeds, and chop into 1/4\" pieces. Meanwhile, bring a medium pot of generously salted water to a boil. Cook shrimp until just opaque and pink, 2–3 minutes. Using a slotted spoon, transfer to an ice bath and let sit until cool, about 3 minutes. Drain and pat dry. Mix chiles, tomato, jalapeños, Clamato juice, ketchup, olives, cilantro, onion, oregano, garlic, lime juice, oil, and 1/4 tsp. salt in a large bowl. Carefully fold in shrimp, crab, and avocado. Transfer to a serving bowl or tall sundae glass and top with bay leaf, if using. Serve with tortilla chips alongside.",
            "Prepare a grill for medium-high heat or preheat broiler. If broiling, place chiles on a rimmed baking sheet. Grill, broil, or roast chiles directly over flame on stovetop, turning occasionally, until very tender and blackened all over, 10–12 minutes. Poblanos might take a little longer, so test doneness with a paring knife.",
            "Transfer chiles to a large bowl. Cover with plastic wrap and let steam 15 minutes. Peel chiles. Halve lengthwise, discard seeds, and chop into 1/4\" pieces.",
            "Meanwhile, bring a medium pot of generously salted water to a boil. Cook shrimp until just opaque and pink, 2–3 minutes. Using a slotted spoon, transfer to an ice bath and let sit until cool, about 3 minutes. Drain and pat dry.",
            "Mix chiles, tomato, jalapeños, Clamato juice, ketchup, olives, cilantro, onion, oregano, garlic, lime juice, oil, and 1/4 tsp. salt in a large bowl. Carefully fold in shrimp, crab, and avocado.",
            "Transfer to a serving bowl or tall sundae glass and top with bay leaf, if using. Serve with tortilla chips alongside.",
            "Do Ahead Salsa base (without seafood and avocado) can be made 1 day ahead. Transfer to a resealable container and chill.",
            "Salsa base (without seafood and avocado) can be made 1 day ahead. Transfer to a resealable container and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/595669378cf7472c06d22f3a/6:4/w_274%2Ch_169/Campechana-Mexican-Seafood-Cocktail--29062017.jpg"
    }
}