{
    "recipe": {
        "title": "Candy Cane Cookies ",
        "ingredients": [
            "2 cups all-purpose flour",
            "1/2 teaspoon baking powder",
            "1/8 teaspoon kosher salt",
            "1/3 cup unsalted butter",
            "1/3 cup vegetable shortening",
            "1 large egg",
            "3/4 cup granulated sugar",
            "1 1/2 teaspoons pure vanilla extract",
            "About 16 drops red food coloring"
        ],
        "instructions": [
            "1. In a medium bowl, combine the flour, baking powder and salt; set aside. 2. In the bowl of a stand mixer, beat the butter and shortening together at medium-high speed. Add the egg, sugar, and vanilla extract and beat to incorporate on medium speed. Add the flour mixture and mix on low speed until just incorporated. 3. Divide the dough evenly into two balls. Wrap one in plastic wrap. Place the other in a medium bowl and add the red food coloring a few drops at a time, mixing and squishing the dough with your hands to help the coloring incorporate. (Warning: You will have pink fingers!) When all the food coloring is worked in, wrap the dough in plastic wrap; refrigerate both doughs until slightly firm, about 1 hour. 4. Position a rack in the center of the oven, preheat the oven to 375°F, and line 2 large baking sheets with parchment paper. 5. Grab a small chunk of one of the doughs (about 1 tablespoon) and roll it on a clean work surface into a thin tube (about 1/4- to 1/2-inch-thick). Trim to about 4 inches in length. Repeat with the other color of dough. When you have two tubes in two different colors, lay them side by side on the work surface and roll them together gently to stick. Twist them to form a spiral of color, then shape one end into a hook shape to form a candy cane. Transfer to the prepared baking sheets. Repeat with the remaining dough. 6. Bake until the cookies are just set but not yet browned, 8 to 10 minutes. Remove and let cool on the baking sheet for 3 to 5 minutes; then transfer carefully to racks to cool completely.",
            "1. In a medium bowl, combine the flour, baking powder and salt; set aside.",
            "2. In the bowl of a stand mixer, beat the butter and shortening together at medium-high speed. Add the egg, sugar, and vanilla extract and beat to incorporate on medium speed. Add the flour mixture and mix on low speed until just incorporated.",
            "3. Divide the dough evenly into two balls. Wrap one in plastic wrap. Place the other in a medium bowl and add the red food coloring a few drops at a time, mixing and squishing the dough with your hands to help the coloring incorporate. (Warning: You will have pink fingers!) When all the food coloring is worked in, wrap the dough in plastic wrap; refrigerate both doughs until slightly firm, about 1 hour.",
            "4. Position a rack in the center of the oven, preheat the oven to 375°F, and line 2 large baking sheets with parchment paper.",
            "5. Grab a small chunk of one of the doughs (about 1 tablespoon) and roll it on a clean work surface into a thin tube (about 1/4- to 1/2-inch-thick). Trim to about 4 inches in length. Repeat with the other color of dough. When you have two tubes in two different colors, lay them side by side on the work surface and roll them together gently to stick. Twist them to form a spiral of color, then shape one end into a hook shape to form a candy cane. Transfer to the prepared baking sheets. Repeat with the remaining dough.",
            "6. Bake until the cookies are just set but not yet browned, 8 to 10 minutes. Remove and let cool on the baking sheet for 3 to 5 minutes; then transfer carefully to racks to cool completely."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad39ac19925f464b3b13d9/6:4/w_274%2Ch_169/51205810_candy-cane-cookies_1x1.jpg"
    }
}