{
    "recipe": {
        "title": "Candy Pork ",
        "ingredients": [
            "8 ounces palm sugar, finely chopped (dark brown sugar can be substituted)",
            "3/4 cup fish sauce",
            "3 tablespoons canola oil",
            "4 pounds boneless pork shoulder, cut into 2-inch-by-3-inch chunks",
            "Kosher salt and freshly ground black pepper",
            "1 cup thinly sliced shallots",
            "1 (2-inch-by-1-inch) piece fresh ginger, peeled and julienned",
            "2 cloves garlic, peeled and crushed",
            "2 to 3 Thai chilies (substitute 1 serrano chile), stemmed and crushed",
            "3 cups coconut water"
        ],
        "instructions": [
            "Put the palm sugar in a medium heavy-bottomed saucepan over medium-low heat. Cook until the sugar melts, about 8 to 10 minutes, stirring frequently so the sugar doesn’t scorch. When the sugar is smooth and completely melted, remove the pan from the heat and slowly stir in the fish sauce. The mixture may seize; if it does, return it to low heat and continue stirring until smooth.",
            "Preheat the oven to 300°F. In a large Dutch oven over high heat, heat the canola oil. Season the pork pieces on all sides with salt and pepper. When the oil is hot, add some of the pieces of pork and sear until well browned on all sides, about 8 minutes. Transfer to a rimmed baking sheet and repeat with the remaining pork. When all the pork has been browned, reduce the heat to medium and add the shallots. Cook, stirring, until the shallots are softened, about 2 minutes, then add the ginger, garlic, and chilies and cook 1 minute more. Return the pork and any accumulated juices to the pot and add the caramel sauce and coconut water. The pieces of meat should poke up above the level of the liquid; if they’re completely submerged, transfer the meat and liquid to a different pot. Bring to a boil, then reduce the heat so the liquid is simmering. Cover the pot and transfer to the oven.",
            "After 15 minutes of cooking, uncover the pot; the liquid should be simmering gently. If it’s bubbling too vigorously, reduce the oven temperature to 275°F. Cook for 70 minutes—the meat should be tender but not falling apart. Uncover the pot and continue cooking for 30 minutes more, until the exposed bits of pork are caramelized and the meat is tender. Remove from the oven and serve with steamed rice."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ae87e6e43d4bc0a5b3f3e39/6:4/w_274%2Ch_169/candy-pork-recipe-050118.jpg",
        "color": 12951884
    }
}