{
    "recipe": {
        "title": "Candied Rose Petal and Chocolate Cookies ",
        "ingredients": [
            "12 tablespoons (1 1/2 sticks) unsalted butter",
            "1 cup sugar",
            "1/2 cup light brown sugar",
            "1 large egg",
            "1 egg yolk",
            "2 tablespoons heavy cream",
            "1/2 cup rose spread",
            "2 1/4 cups all-purpose flour",
            "1 teaspoon baking soda",
            "1/2 teaspoon salt",
            "2 cups finely chopped semisweet chocolate"
        ],
        "instructions": [
            "1. Preheat the oven to 350°F. Line a cookie sheet with parchment paper. In a large microwave-safe bowl, melt butter, sugar, and brown sugar together in a microwave for 15 to 30 seconds on low power. Let the butter-sugar mixture cool just a bit then blend in the egg and egg yolk. Add the heavy cream and rose spread. Stir until just combined and set aside. Do not overmix. 2. In a medium bowl, sift together the flour, baking soda, and salt and carefully fold into the wet mixture. Gently add the chocolate, mixing it well. Freeze the dough just until cold and firm, about 5 minutes. 3. Using a 2-ounce ice cream scoop, drop the dough 3 inches apart onto prepared cookie sheet. Bake for 10 to 12 minutes, or until the edges of the cookies begin to brown. Transfer the cookies to a rack to cool.",
            "1. Preheat the oven to 350°F. Line a cookie sheet with parchment paper. In a large microwave-safe bowl, melt butter, sugar, and brown sugar together in a microwave for 15 to 30 seconds on low power. Let the butter-sugar mixture cool just a bit then blend in the egg and egg yolk. Add the heavy cream and rose spread. Stir until just combined and set aside. Do not overmix.",
            "2. In a medium bowl, sift together the flour, baking soda, and salt and carefully fold into the wet mixture. Gently add the chocolate, mixing it well. Freeze the dough just until cold and firm, about 5 minutes.",
            "3. Using a 2-ounce ice cream scoop, drop the dough 3 inches apart onto prepared cookie sheet. Bake for 10 to 12 minutes, or until the edges of the cookies begin to brown. Transfer the cookies to a rack to cool."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b2a2fc3edeef84363b1253/6:4/w_274%2Ch_169/367069_rose-petal-chocolate-cookies_1x1.jpg"
    }
}