{
    "recipe": {
        "title": "Cannellini Beans with Sweet Paprika and Garlic ",
        "ingredients": [
            "2 1/2 cups dried cannellini beans",
            "1 teaspoon kosher salt, plus more to taste",
            "Any or all of the following, cut into large chunks if necessary: 1/2 peeled onion, 1 small peeled carrot, 1 celery rib, a garlic clove, a bay leaf, a small tomato, a thyme sprig or two, parsley stems",
            "1/4 cup extra-virgin olive oil",
            "1 onion, diced",
            "1/2 teaspoon kosher salt",
            "2 tablespoons sweet paprika",
            "2 garlic cloves, finely chopped",
            "Freshly ground black pepper"
        ],
        "instructions": [
            "Look over the beans and pick out any small rocks or dirt clods that may be lurking among them. Rinse the beans in a colander and then put them in a large bowl, cover with plenty of cold water, and leave them overnight on the counter (or in the fridge if the weather is hot).",
            "Cook the beans: The next day, drain the beans and rinse them off a little, then transfer to a large saucepan, cover them by a couple of inches with fresh water and put them on high heat. Add 1 teaspoon salt to the beans (some don't; I do. The simple reason: Beans cooked with salt taste better than beans cooked without salt. Flavor trumps.) Add your desired aromatics (the more of these aromatics you add, the more delicious the beans, and their cooking liquid, will be). Bring the pot of beans to a boil, lower the heat to a simmer, and skim off any foam with a ladle. Taste the water for salt, add more if needed, and cook, stirring infrequently but checking more often and adding water as needed, until beans are very tender but not, hopefully, falling apart. This will take anywhere from 1 to 2 hours, depending on the beans. Taste five or six beans to be sure that they are all really cooked and not at all chalky. Remove and discard any large vegetables or aromatics from the pot, leaving the beans in their liquid.",
            "The next day, drain the beans and rinse them off a little, then transfer to a large saucepan, cover them by a couple of inches with fresh water and put them on high heat.",
            "Add 1 teaspoon salt to the beans (some don't; I do. The simple reason: Beans cooked with salt taste better than beans cooked without salt. Flavor trumps.) Add your desired aromatics (the more of these aromatics you add, the more delicious the beans, and their cooking liquid, will be).",
            "Bring the pot of beans to a boil, lower the heat to a simmer, and skim off any foam with a ladle. Taste the water for salt, add more if needed, and cook, stirring infrequently but checking more often and adding water as needed, until beans are very tender but not, hopefully, falling apart. This will take anywhere from 1 to 2 hours, depending on the beans. Taste five or six beans to be sure that they are all really cooked and not at all chalky.",
            "Remove and discard any large vegetables or aromatics from the pot, leaving the beans in their liquid.",
            "To finish: In a large skillet over medium-low heat, heat oil and sauté diced onion with 1/2 teaspoon salt. Cook, stirring occasionally, until onion is very tender and just slightly colored, about 15 minutes. Add paprika and garli; cook, stirring, until garlic turns fragrant but doesn't color at all, about 30 seconds. If the beans are underwater, pour off excess liquid into a separate container (save it for soup) so that beans are only partially covered. Stir the onion mixture into the beans, and season with salt. Serve topped with ground pepper.",
            "In a large skillet over medium-low heat, heat oil and sauté diced onion with 1/2 teaspoon salt. Cook, stirring occasionally, until onion is very tender and just slightly colored, about 15 minutes. Add paprika and garli; cook, stirring, until garlic turns fragrant but doesn't color at all, about 30 seconds.",
            "If the beans are underwater, pour off excess liquid into a separate container (save it for soup) so that beans are only partially covered. Stir the onion mixture into the beans, and season with salt. Serve topped with ground pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54c949bec252103035d35eaa/6:4/w_274%2Ch_169/51262900_cannellini-beans_1x1.jpg"
    }
}