{
    "recipe": {
        "title": "Caramelized Pear Tarts with Cardamom Cream ",
        "ingredients": [
            "1 frozen puff pastry sheet (from a 17 1/4-oz package), thawed",
            "2 firm-ripe Bosc pears, peeled, halved lengthwise, and cored",
            "1 tablespoon fresh lemon juice",
            "1/2 cup plus 1 tablespoon granulated sugar",
            "2 tablespoons unsalted butter",
            "1/2 cup chilled heavy cream",
            "1/8 teaspoon ground cardamom",
            "Confectioners sugar for dusting (optional)"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat to 425°F. Line a baking sheet with parchment or wax paper. Roll out pastry into a 12-inch square on a lightly floured surface with a floured rolling pin. Brush off excess flour and cut out 4 (5-inch) rounds by tracing around an inverted plate or bowl with tip of a small sharp knife. Prick pastry rounds all over with a fork and transfer to baking sheet. Bake until rounds are puffed and golden, 12 to 15 minutes, then cool on baking sheet on a rack. While pastry bakes, toss pear halves with lemon juice in a bowl. Cook 1/2 cup granulated sugar and a pinch of salt in a dry 10-inch heavy skillet over moderate heat, swirling skillet (to help sugar melt evenly), until caramel is deep golden, about 4 minutes. Remove from heat and stir in butter with a wooden spoon (mixture will bubble vigorously). When bubbling begins to subside, immediately add pear halves, cut sides down, and cook over moderately low heat, covered, turning over once, until pears are tender when pierced with a small sharp knife, about 13 minutes total. Remove from heat. Beat cream, cardamom, and remaining tablespoon granulated sugar in a bowl with a whisk or an electric mixer until it just holds soft peaks. Put each pastry round on a small plate and dust lightly with confectioners sugar if desired. Spoon some of caramel sauce onto center of each round and top with a pear half, cut side down. Serve with cardamom cream on the side.",
            "Put oven rack in middle position and preheat to 425°F. Line a baking sheet with parchment or wax paper.",
            "Roll out pastry into a 12-inch square on a lightly floured surface with a floured rolling pin. Brush off excess flour and cut out 4 (5-inch) rounds by tracing around an inverted plate or bowl with tip of a small sharp knife. Prick pastry rounds all over with a fork and transfer to baking sheet. Bake until rounds are puffed and golden, 12 to 15 minutes, then cool on baking sheet on a rack.",
            "While pastry bakes, toss pear halves with lemon juice in a bowl. Cook 1/2 cup granulated sugar and a pinch of salt in a dry 10-inch heavy skillet over moderate heat, swirling skillet (to help sugar melt evenly), until caramel is deep golden, about 4 minutes. Remove from heat and stir in butter with a wooden spoon (mixture will bubble vigorously). When bubbling begins to subside, immediately add pear halves, cut sides down, and cook over moderately low heat, covered, turning over once, until pears are tender when pierced with a small sharp knife, about 13 minutes total. Remove from heat.",
            "Beat cream, cardamom, and remaining tablespoon granulated sugar in a bowl with a whisk or an electric mixer until it just holds soft peaks.",
            "Put each pastry round on a small plate and dust lightly with confectioners sugar if desired. Spoon some of caramel sauce onto center of each round and top with a pear half, cut side down. Serve with cardamom cream on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df8fb7b55306961bfe881/6:4/w_274%2Ch_169/108520.jpg"
    }
}