{
    "recipe": {
        "title": "Caramel Apple Drip Cake with Candied Walnuts ",
        "ingredients": [
            "1 cup raw walnuts",
            "Nonstick vegetable oil spray",
            "2 1/2 cups all-purpose flour",
            "2 teaspoons baking powder",
            "1 1/2 teaspoons kosher salt",
            "1 1/4 teaspoons ground cinnamon",
            "3/4 teaspoon baking soda",
            "1/2 teaspoon ground nutmeg",
            "3 medium apples (such as Gala, Honeycrisp, or Pink Lady), peeled, coarsely grated",
            "1 cup buttermilk, room temperature",
            "4 large eggs, room temperature",
            "1 cup granulated sugar",
            "3/4 cup (packed) dark brown sugar",
            "2 teaspoons vanilla extract",
            "3/4 cup vegetable oil",
            "1 cup granulated sugar, divided",
            "2 cups raw walnut halves",
            "2/3 cup granulated sugar",
            "1 tablespoon light corn syrup",
            "1/2 cup heavy cream",
            "1 tablespoon unsalted butter",
            "1/2 teaspoon vanilla extract",
            "Pinch of kosher salt",
            "Classic Cream Cheese Frosting",
            "2 (8\") round cake pans"
        ],
        "instructions": [
            "Position a rack in center of oven; preheat to 350°F. Spread walnuts in a single layer on a rimmed baking sheet and toast until golden brown and aromatic, 5–8 minutes. Let cool 5 minutes.",
            "Meanwhile, lightly coat cake pans with nonstick spray. Line bottom of pans with parchment paper; lightly coat parchment with nonstick spray. Whisk flour, baking powder, salt, cinnamon, baking soda, and nutmeg in a medium bowl.",
            "Pulse walnuts and 1/2 cup dry ingredients in a food processor until walnuts are chopped into a fine flour. Transfer chopped walnuts to bowl with remaining dry ingredients. Mix apples and buttermilk in another medium bowl.",
            "Using an electric mixer on high speed, beat eggs, granulated sugar, brown sugar, and vanilla in a large bowl until pale and thick, about 4 minutes. Reduce mixer speed to medium-low and gradually stream in oil. Add dry ingredients in 3 additions, alternating with apple mixture in 2 additions, beginning and ending with dry ingredients; beat until smooth. Divide batter between prepared pans; smooth top.",
            "Bake cakes, rotating pans halfway through, until a tester inserted into the center comes out clean, 40–45 minutes. Transfer pans to a wire rack and let cakes cool 10 minutes. Run a knife around sides of cakes and invert onto wire rack; remove parchment. Let cool completely.",
            "Make the candied walnuts: Spread granulated sugar in a thin layer in the center of a large dry skillet. Cook over medium heat, mostly undisturbed (it's okay to swirl pan gently to get sugar to melt evenly), until sugar is melted, about 10 minutes. Quickly stir in walnuts and cook, stirring, until coated and melted sugar is chestnut brown, about 1 minute more. Scrape onto a parchment-lined rimmed baking sheet and spread out to cool, separating walnut halves into individual pieces. Transfer half of nuts to a food processor and coarsely chop.",
            "Spread granulated sugar in a thin layer in the center of a large dry skillet. Cook over medium heat, mostly undisturbed (it's okay to swirl pan gently to get sugar to melt evenly), until sugar is melted, about 10 minutes. Quickly stir in walnuts and cook, stirring, until coated and melted sugar is chestnut brown, about 1 minute more. Scrape onto a parchment-lined rimmed baking sheet and spread out to cool, separating walnut halves into individual pieces. Transfer half of nuts to a food processor and coarsely chop.",
            "Make the caramel sauce: Bring granulated sugar, corn syrup, and 2 Tbsp. water to a boil in a medium saucepan over high heat. Continue to cook, without stirring, until medium amber in color, about 6 minutes. Meanwhile, bring cream to a simmer in a small saucepan over medium heat or warm in microwave 45 seconds. Remove saucepan with sugar from heat and carefully whisk in cream, stirring from the center outward, until well combined. Stir in butter. Add vanilla and salt and stir to combine. Transfer caramel to a heatproof container and let cool until thickened.",
            "Bring granulated sugar, corn syrup, and 2 Tbsp. water to a boil in a medium saucepan over high heat. Continue to cook, without stirring, until medium amber in color, about 6 minutes.",
            "Meanwhile, bring cream to a simmer in a small saucepan over medium heat or warm in microwave 45 seconds.",
            "Remove saucepan with sugar from heat and carefully whisk in cream, stirring from the center outward, until well combined. Stir in butter. Add vanilla and salt and stir to combine. Transfer caramel to a heatproof container and let cool until thickened.",
            "Assemble cake: Spread 1 Tbsp. frosting in the center of a platter. Place 1 cake, domed side down, on platter. Spread 1 1/4 cups frosting evenly over top. Top with 1 cup chopped candied walnuts, reserving whole candied walnuts. Place remaining cake, domed side down, on top. Spread top and sides with 2 cups frosting. Chill 30 minutes to let frosting set. Spread remaining frosting over top and sides of cake. Chill at least 30 minutes or up to overnight to let frosting set. Place a spoonful of caramel sauce on top of cake near one edge. Using the bottom of the spoon, spread it out, then very gently press a little sauce over the edge. Move spoon around perimeter of cake slightly and repeat to create additional drips, rotating cake as you work and spreading excess sauce across top of cake. When entire cake is covered in drips, add remaining sauce to fully cover top. Chill at least 30 minutes to let glaze set. Decorate top and sides of cake with remaining whole walnuts and serve.",
            "Spread 1 Tbsp. frosting in the center of a platter. Place 1 cake, domed side down, on platter. Spread 1 1/4 cups frosting evenly over top. Top with 1 cup chopped candied walnuts, reserving whole candied walnuts. Place remaining cake, domed side down, on top. Spread top and sides with 2 cups frosting. Chill 30 minutes to let frosting set.",
            "Spread remaining frosting over top and sides of cake. Chill at least 30 minutes or up to overnight to let frosting set.",
            "Place a spoonful of caramel sauce on top of cake near one edge. Using the bottom of the spoon, spread it out, then very gently press a little sauce over the edge. Move spoon around perimeter of cake slightly and repeat to create additional drips, rotating cake as you work and spreading excess sauce across top of cake. When entire cake is covered in drips, add remaining sauce to fully cover top.",
            "Chill at least 30 minutes to let glaze set. Decorate top and sides of cake with remaining whole walnuts and serve.",
            "Do Ahead Cake can be made 3 days ahead; wrap tightly in plastic and chill, or freeze up to 2 weeks. Caramel can be made up to 2 weeks ahead; cover and chill.",
            "Cake can be made 3 days ahead; wrap tightly in plastic and chill, or freeze up to 2 weeks. Caramel can be made up to 2 weeks ahead; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59db972b0d97e316dc3f3bea/6:4/w_274%2Ch_169/Spiced-Apple-Cake-with-Caramel-Glaze-1989-28092017.jpg",
        "color": 961154
    }
}