{
    "recipe": {
        "title": "Caramel Pumpkin Pie ",
        "ingredients": [
            "1 1/2 cups all-purpose flour",
            "1 1/4 sticks (10 tablespoons) cold unsalted butter, cut into 1/2-inch cubes",
            "1/4 teaspoon salt",
            "4 to 5 tablespoons ice water",
            "1 cup sugar",
            "1/3 cup water",
            "2 cups heavy cream",
            "1 (15-oz) can solid-pack pumpkin (not pie filling; a scant 2 cups)",
            "1 1/4 teaspoons ground ginger",
            "1 1/4 teaspoons ground cinnamon",
            "1/4 teaspoon freshly grated nutmeg",
            "Pinch of ground cloves",
            "Scant 1/2 teaspoon salt",
            "4 large eggs, lightly beaten",
            "Accompaniment: lightly sweetened whipped cream",
            "A pastry or bench scraper; a 10-inch fluted metal quiche pan (2 inches deep) with a removable bottom; pie weights or raw rice"
        ],
        "instructions": [
            "Blend together flour, butter, and salt in a bowl with your fingertips or a pastry blender (or pulse in a food processor) until most of mixture resembles coarse meal with some small (roughly pea-size) butter lumps. Drizzle evenly with 4 tablespoons ice water and gently stir with a fork (or pulse in processor) until incorporated.",
            "Squeeze a small handful of dough: If it doesn't hold together, add more ice water, 1/2 tablespoon at a time, stirring (or pulsing) until incorporated, then test again. (Do not overwork dough or pastry will be tough.)",
            "Turn mixture out onto a lightly floured surface and divide into 4 portions. With heel of your hand, smear each portion once or twice in a forward motion to help distribute fat. Gather all of dough together with scraper and press into a ball, then flatten into a 5-inch disk. Chill dough, wrapped tightly in plastic wrap, until firm, at least 1 hour.",
            "Put oven rack in middle position and preheat oven to 375°F.",
            "Roll out dough on a lightly floured surface with a lightly floured rolling pin into a 14-inch round, then fit into quiche pan and trim excess dough flush with rim of pan. Chill until firm, about 30 minutes.",
            "Bake pie shell: Lightly prick bottom of shell all over with a fork, then line with foil and fill with pie weights. Put quiche pan on a baking sheet and bake pie shell until side is set and edge is pale golden, 18 to 20 minutes. Carefully remove weights and foil and bake shell until bottom is golden, about 10 minutes more. Cool completely in pan on a rack, about 30 minutes.",
            "Lightly prick bottom of shell all over with a fork, then line with foil and fill with pie weights. Put quiche pan on a baking sheet and bake pie shell until side is set and edge is pale golden, 18 to 20 minutes. Carefully remove weights and foil and bake shell until bottom is golden, about 10 minutes more. Cool completely in pan on a rack, about 30 minutes.",
            "Make filling while shell cools: Bring sugar and water to a boil in a 3- to 3 1/2-quart heavy saucepan, stirring until sugar is dissolved. Boil syrup, washing down side of pan occasionally with a pastry brush dipped in cold water and gently swirling pan (do not stir), until mixture is a deep golden caramel, about 10 minutes. Reduce heat to moderate and carefully add 1 cup cream (mixture will bubble vigorously), stirring until caramel is dissolved. Stir in remaining cup cream and bring just to a simmer. Whisk together pumpkin purée, spices, and salt in a large bowl. Whisk in hot cream mixture, then add eggs, whisking until combined well. Pour filling into cooled crust and bake until puffed 1 1/2 inches from edge and center is just set, 55 to 60 minutes. Cool in pan on a rack, about 2 hours. (Pie will continue to set as it cools.) Remove side of pan before serving.",
            "Bring sugar and water to a boil in a 3- to 3 1/2-quart heavy saucepan, stirring until sugar is dissolved. Boil syrup, washing down side of pan occasionally with a pastry brush dipped in cold water and gently swirling pan (do not stir), until mixture is a deep golden caramel, about 10 minutes.",
            "Reduce heat to moderate and carefully add 1 cup cream (mixture will bubble vigorously), stirring until caramel is dissolved. Stir in remaining cup cream and bring just to a simmer.",
            "Whisk together pumpkin purée, spices, and salt in a large bowl. Whisk in hot cream mixture, then add eggs, whisking until combined well. Pour filling into cooled crust and bake until puffed 1 1/2 inches from edge and center is just set, 55 to 60 minutes. Cool in pan on a rack, about 2 hours. (Pie will continue to set as it cools.) Remove side of pan before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5812483a818f8c7f339cb316/6:4/w_274%2Ch_169/caramel-pumpkin-pie-102716.jpg"
    }
}