{
    "recipe": {
        "title": "Caramel-Apple Caramels ",
        "ingredients": [
            "Vegetable-oil cooking spray or neutral vegetable oil, for greasing",
            "1/3 cup heavy cream",
            "1/4 cup apple butter",
            "1 teaspoon pure vanilla extract",
            "1/2 teaspoon fine sea salt",
            "1/4 teaspoon ground cinnamon",
            "1/4 teaspoon freshly grated nutmeg",
            "1/8 teaspoon ground allspice",
            "2/3 cup light corn syrup",
            "2 cups sugar",
            "6 tablespoons unsalted butter, cut into small pieces, room temperature",
            "pastry brush, candy thermometer, 5-inch-square cellophane candy wrappers"
        ],
        "instructions": [
            "Lightly oil a 9- by 13-inch rimmed baking pan. Line with parchment with a 2-inch overhang on 2 sides, and oil the parchment. Place a small bowl of warm water and a pastry brush near the cooktop.",
            "In a small saucepan, combine the cream, apple butter, vanilla, salt, cinnamon, nutmeg, and allspice. Heat over low heat until warm, stirring to combine. Keep warm over low heat.",
            "Meanwhile, in a large, heavy saucepan over medium-high heat, bring the corn syrup to a boil, swirling the pan to evenly heat, about 45 seconds. Add one third of the sugar and poke it into the bubbling syrup with a heatproof spatula to remove all the lumps and evenly moisten. There should be no visible clumps of sugar visible. Repeat with two more additions, then stop poking. Cook, swirling the pan occasionally, until the mixture is very dark amber and registers 320° F on a candy thermometer, about 8 minutes total. If the sugar crystallizes on the sides of the pan, dip the pastry brush in cold water and brush away the crystals.",
            "When the sugar mixture is ready, remove from the heat and carefully add the warm cream mixture, then the butter. The mixture will bubble up and steam. Immediately whisk until very smooth and emulsified. At this point, the caramel should register 245° F on a candy thermometer.",
            "Carefully pour the caramel into the prepared pan. If necessary, tilt the pan to form an even layer. Let stand at room temperature until cool and firm, at least 2 hours and up to overnight.",
            "Lift the caramel out of the pan with the parchment paper and place on a cutting board. Work quickly to cut the caramel into 1-inch x 1/2-inch rectangles and wrap in candy wrappers.",
            "DO AHEAD: The wrapped caramels can be kept at cool room temperature for up to 1 month."
        ],
        "picture_link": "https://assets.epicurious.com/photos/555a14ea644d45515b756200/6:4/w_274%2Ch_169/51254490_caramels_1x1.jpg"
    }
}