{
    "recipe": {
        "title": "Caramelized Tomato Salad with San Simón Cheese ",
        "ingredients": [
            "2 cups olive oil",
            "1 3/4 pounds cherry tomatoes, divided",
            "1/2 cup sugar",
            "2 large fresh thyme sprigs",
            "1/3 cup Sherry wine vinegar",
            "8 ounces San Simón cheese,* cut into 1/3-inch cubes",
            "8 green onions, thinly sliced",
            "Fresh chervil sprigs (for garnish)",
            "16 toasted baguette slices"
        ],
        "instructions": [
            "Preheat oven to 275°F. Place oil, 3/4 pound tomatoes, sugar, and thyme in 8 x 8 x 2-inch metal baking dish. Roast until tomatoes are very tender, about 2 1/2 hours. Cool caramelized tomatoes in oil. DO AHEAD: Can be made 2 days ahead; cover and chill. Bring to room temperature before continuing. Using slotted spoon, transfer tomatoes to large bowl. Transfer 1 cup oil from tomatoes to medium bowl (reserve any remaining oil for another use). Add vinegar to oil in medium bowl; whisk to blend. Season dressing with salt and pepper. Add 1 pound fresh tomatoes, cheese, and dressing to bowl with caramelized tomatoes; toss gently. Top with green onions and chervil. Serve with toasts.",
            "Preheat oven to 275°F. Place oil, 3/4 pound tomatoes, sugar, and thyme in 8 x 8 x 2-inch metal baking dish. Roast until tomatoes are very tender, about 2 1/2 hours. Cool caramelized tomatoes in oil. DO AHEAD: Can be made 2 days ahead; cover and chill. Bring to room temperature before continuing.",
            "Using slotted spoon, transfer tomatoes to large bowl. Transfer 1 cup oil from tomatoes to medium bowl (reserve any remaining oil for another use). Add vinegar to oil in medium bowl; whisk to blend. Season dressing with salt and pepper.",
            "Add 1 pound fresh tomatoes, cheese, and dressing to bowl with caramelized tomatoes; toss gently. Top with green onions and chervil. Serve with toasts.",
            "San Simón_cheese, a smoked cheese shaped like a bell, is sold at natural foods stores, specialty foods stores, and latienda. com. Smoked Gouda can be substituted._",
            "San Simón_cheese, a smoked cheese shaped like a bell, is sold at natural foods stores, specialty foods stores, and latienda. com. Smoked Gouda can be substituted._",
            "San Simón_cheese, a smoked cheese shaped like a bell, is sold at natural foods stores, specialty foods stores, and latienda. com. Smoked Gouda can be substituted._"
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b314e9460b4423363e9ec8/6:4/w_274%2Ch_169/358590_caramelized-tomato-salad_1x1.jpg"
    }
}