{
    "recipe": {
        "title": "Caramel-Banana Bread Puddings ",
        "ingredients": [
            "1 1/2 cups purchased caramel sauce",
            "1/4 teaspoon plus 1/8 teaspoon fine sea salt",
            "8 5x3 1/2-inch slices white sandwich bread (such as buttermilk or potato bread), very lightly toasted",
            "3 medium bananas, peeled, thinly sliced on diagonal into 1 1/2-inch ovals",
            "4 large eggs",
            "1 1/2 cups half and half",
            "1/3 cup whole milk",
            "2 1/2 tablespoons sugar, divided",
            "1 teaspoon vanilla extract",
            "2 tablespoons unsalted butter, melted"
        ],
        "instructions": [
            "Preheat broiler. Butter eight 3/4-cup ramekins. Mix caramel sauce and 1/4 teaspoon sea salt in small bowl. Spoon 1 generous tablespoon caramel into each ramekin. Place bread on rimmed baking sheet. Spread 1 generous tablespoon caramel over each bread slice. Broil until caramel is bubbling and slightly darker, watching to avoid burning, 1 to 2 minutes. Cool.",
            "Cut each bread slice into 6 squares, for 48 pieces total. Set 1 banana slice on each bread square. Arrange 6 banana-topped bread squares standing on edge, side by side in each prepared ramekin, fitting snugly. Whisk eggs, half and half, milk, 1 1/2 tablespoons sugar, vanilla, and 1/8 teaspoon sea salt in medium bowl. Pour enough custard into each ramekin to reach top. Let stand until bread absorbs some of custard, about 30 minutes. Reserve any remaining custard.",
            "Meanwhile, position rack in bottom third of oven and preheat to 400°F. Pour remaining custard into ramekins. Brush exposed bread pieces with melted butter. Sprinkle with 1 tablespoon sugar. Set ramekins in large roasting pan. Pour enough hot water into pan to come halfway up sides of ramekins. Bake puddings until set and knife inserted into custard comes out clean, about 45 minutes. Remove from pan; cool. DO AHEAD: Can be made 8 hours ahead. Cover and refrigerate.",
            "Serve bread puddings warm or at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/566749db00de9d2a3815fb83/6:4/w_274%2Ch_169/0108-BA-DES1-03.jpg",
        "color": 8774527
    }
}