{
    "recipe": {
        "title": "Caramel-Hazelnut Mini Tartlets ",
        "ingredients": [
            "1 1/2 cups all purpose flour",
            "2 tablespoons sugar",
            "1/4 teaspoon salt",
            "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
            "5 tablespoons (or more) chilled whipping cream",
            "1 teaspoon vanilla extract",
            "1 cup (about) hazelnuts, toasted, husked (about 5 ounces)",
            "1 1/3 cups (packed) golden brown sugar",
            "7 tablespoons unsalted butter",
            "6 tablespoons light corn syrup",
            "2 tablespoons water",
            "1/2 teaspoon salt",
            "6 tablespoons whipping cream",
            "3 ounces bittersweet or semisweet chocolate, chopped"
        ],
        "instructions": [
            "For crusts: Butter 30 metal or silicone mini muffin cups (1- to 1 1/2- tablespoon capacity). Blend flour, sugar, and salt in processor. Add butter and blend, using on/off turns, until mixture resembles coarse crumbs. Add 5 tablespoons cream and vanilla and blend, using on/off turns, just until mixture begins to clump together, adding more cream by teaspoonfuls if dough is dry. Press 2 teaspoonfuls dough evenly onto bottom and up sides of each prepared mini muffin cup. Pierce tartlet crusts all over with fork. DO AHEAD: Can be made 1 day ahead. Cover and refrigerate. Preheat oven to 350°F. Freeze crusts 30 minutes before baking. Bake frozen crusts until golden and baked through, about 25 minutes. Transfer to rack and cool crusts in muffin cups 10 minutes. Carefully loosen crusts from muffin cups. Transfer crusts to rimmed baking sheet and cool completely. Place 2 to 3 hazelnuts in each crust.",
            "Butter 30 metal or silicone mini muffin cups (1- to 1 1/2- tablespoon capacity). Blend flour, sugar, and salt in processor. Add butter and blend, using on/off turns, until mixture resembles coarse crumbs. Add 5 tablespoons cream and vanilla and blend, using on/off turns, just until mixture begins to clump together, adding more cream by teaspoonfuls if dough is dry. Press 2 teaspoonfuls dough evenly onto bottom and up sides of each prepared mini muffin cup. Pierce tartlet crusts all over with fork. DO AHEAD: Can be made 1 day ahead. Cover and refrigerate.",
            "Preheat oven to 350°F. Freeze crusts 30 minutes before baking. Bake frozen crusts until golden and baked through, about 25 minutes. Transfer to rack and cool crusts in muffin cups 10 minutes. Carefully loosen crusts from muffin cups. Transfer crusts to rimmed baking sheet and cool completely. Place 2 to 3 hazelnuts in each crust.",
            "For caramel filling: Combine brown sugar, butter, corn syrup, 2 tablespoons water, and salt in heavy medium saucepan. Stir over medium heat until sugar dissolves. Bring mixture to boil, then boil 2 minutes without stirring (mixture will bubble up and thicken slightly). Remove pan from heat. Add cream (mixture will bubble vigorously); stir until smooth. Pour caramel into 2-cup measuring cup; cool 10 minutes. Spoon caramel over hazelnuts in crusts, filling crusts almost to top. Refrigerate until caramel begins to firm up slightly, about 1 hour.",
            "Combine brown sugar, butter, corn syrup, 2 tablespoons water, and salt in heavy medium saucepan. Stir over medium heat until sugar dissolves. Bring mixture to boil, then boil 2 minutes without stirring (mixture will bubble up and thicken slightly). Remove pan from heat. Add cream (mixture will bubble vigorously); stir until smooth. Pour caramel into 2-cup measuring cup; cool 10 minutes. Spoon caramel over hazelnuts in crusts, filling crusts almost to top. Refrigerate until caramel begins to firm up slightly, about 1 hour.",
            "Stir chocolate in top of double boiler set over simmering water until melted and smooth. Drizzle melted chocolate over top of tartlets. Chill until chocolate is set, about 30 minutes. DO AHEAD: Mini tartlets can be made 1 day ahead. Keep refrigerated. Let tartlets stand at room temperature 1 hour before serving.",
            "Stir chocolate in top of double boiler set over simmering water until melted and smooth. Drizzle melted chocolate over top of tartlets. Chill until chocolate is set, about 30 minutes. DO AHEAD: Mini tartlets can be made 1 day ahead. Keep refrigerated. Let tartlets stand at room temperature 1 hour before serving.",
            "GOOD TO KNOW: Freezing the tartlet crusts before baking reduces buckling and helps them hold their shape while they bake.",
            "Freezing the tartlet crusts before baking reduces buckling and helps them hold their shape while they bake."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56016c67bd6b8b837d72d4af/6:4/w_274%2Ch_169/1007-BA-DES1-03.jpg"
    }
}