{
    "recipe": {
        "title": "Caramel-Layered Dark Chocolate Brownies ",
        "ingredients": [
            "Nonstick baking spray",
            "5 ounces unsweetened chocolate, finely chopped",
            "2 ounces bittersweet chocolate, finely chopped",
            "12 tablespoons (6 ounces, 1 1/2 sticks) unsalted butter, cut into small pieces",
            "2 large eggs, room temperature",
            "1 large egg yolk, room temperature",
            "3/4 cup (5 ounces) superfine sugar",
            "3/4 cup (4 1/2 ounces) firmly packed light brown sugar",
            "1 teaspoon pure vanilla extract",
            "3/4 cup (3 1/4 ounces) all-purpose flour",
            "3 tablespoons natural cocoa powder",
            "1/4 teaspoon kosher or fine-grained sea salt",
            "1 recipe Classic Caramel Sauce , chilled",
            "4 ounces bittersweet chocolate (64 to 72% cacao content), finely chopped",
            "1/2 cup heavy whipping cream",
            "1 (8-inch) square baking pan"
        ],
        "instructions": [
            "Brownies: Position a rack in the center of the oven and preheat to 350 degrees F. Line the baking pan with aluminum foil, letting it hang about two inches over the sides. Coat the inside of the foil with nonstick baking spray.",
            "Place both chocolates and the butter together in the top of a double boiler over low heat. Stir often with a rubber spatula to help melt evenly. Remove the top pan of the double boiler and wipe the bottom and sides dry. Or place the chocolates and butter in a microwave-safe bowl and melt on low power for 30-second bursts. Stir with a rubber spatula after each burst to make sure it's melting. Let the mixture cool while mixing the rest of the brownie batter. Stir with a rubber spatula occasionally to prevent a skin from forming on top.",
            "Whip the eggs and egg yolk in the bowl of an electric stand mixer using the wire whip attachment, or in a large bowl using a hand-held mixer, until frothy, about 1 minute.",
            "Add the sugars to the eggs and whip together until the mixture is very thick and pale colored and holds a slowly dissolving ribbon as the beater is lifted, about 5 minutes. Add the vanilla and stir to blend well.",
            "Add the chocolate mixture to the egg mixture and blend completely on low speed. Stop and scrape down the sides and bottom of the bowl with the rubber spatula. The mixture will be smooth and dark chocolate colored.",
            "In a medium bowl, sift the flour and cocoa powder together. Add the salt and stir to combine.",
            "In 3 stages, add the dry ingredients to the chocolate mixture, blending well after each addition. Stop and scrape down the sides and bottom of the bowl with a rubber spatula to help mix evenly.",
            "Pour the batter into the prepared pan and use a rubber spatula to spread it evenly. Bake for 35 minutes, or until a cake tester inserted in the center comes out with slightly moist crumbs clinging to it. Remove the pan from the oven and cool completely on a rack.",
            "Caramel: Stir the caramel sauce until it is smooth. Pour it onto the top of the cooled brownies and spread evenly into the corners using a small offset spatula. Chill in the freezer for 30 minutes to set the caramel.",
            "Stir the caramel sauce until it is smooth. Pour it onto the top of the cooled brownies and spread evenly into the corners using a small offset spatula. Chill in the freezer for 30 minutes to set the caramel.",
            "Bittersweet Chocolate Ganache Topping: Place the chocolate in a medium bowl. Heat the cream in a small saucepan until bubbles for around the edges. Pour the cream over the chocolate and let stand for 30 seconds. Stir the cream and chocolate together with a heat-resistant spatula until completely melted and smooth. Remove the pan of brownies from the freezer. Pour the ganache over the caramel layer and spread it out evenly into the corners using a small offset spatula. Chill the brownies in the refrigerator for about 20 minutes to set the ganache. Lift the brownies from the pan using the edges of the aluminum foil then peel away from the brownies. Use a large knife to cut the brownies into 5 rows in each direction. Dip the knife in hot water and dry between cuts. Gently separate the brownies and serve at room temperature.",
            "Place the chocolate in a medium bowl. Heat the cream in a small saucepan until bubbles for around the edges. Pour the cream over the chocolate and let stand for 30 seconds. Stir the cream and chocolate together with a heat-resistant spatula until completely melted and smooth.",
            "Remove the pan of brownies from the freezer. Pour the ganache over the caramel layer and spread it out evenly into the corners using a small offset spatula. Chill the brownies in the refrigerator for about 20 minutes to set the ganache.",
            "Lift the brownies from the pan using the edges of the aluminum foil then peel away from the brownies. Use a large knife to cut the brownies into 5 rows in each direction. Dip the knife in hot water and dry between cuts. Gently separate the brownies and serve at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad352919925f464b3b04ee/6:4/w_274%2Ch_169/51203870_chocolate-brownies_1x1.jpg"
    }
}