{
    "recipe": {
        "title": "Caramel Sauce and Glaze ",
        "ingredients": [
            "28 grams or 2 tablespoons unsalted butter",
            "87 grams or 1/4 cup plus 2 tablespoons (89 ml) heavy cream",
            "200 grams or 1 cup sugar, preferably superfine",
            "41 grams or 2 tablespoons (30 ml) corn syrup",
            "3/8 teaspoon cream of tartar (optional)",
            "59 grams or 1/4 cup (59 ml) water",
            "2 teaspoons (10 ml) pure vanilla extract"
        ],
        "instructions": [
            "Mise en place: About 30 minutes ahead, cut the butter into a few pieces and set it on the counter at room temperature (65º to 75ºF/19º to 24ºC). Into a 1 cup glass measure with a spout, weigh or measure the cream. Heat in the microwave until hot, then cover it. Have ready a 2 cup glass measure with a spout, lightly coated with nonstick cooking spray, near the cooktop.",
            "About 30 minutes ahead, cut the butter into a few pieces and set it on the counter at room temperature (65º to 75ºF/19º to 24ºC).",
            "Into a 1 cup glass measure with a spout, weigh or measure the cream. Heat in the microwave until hot, then cover it.",
            "Have ready a 2 cup glass measure with a spout, lightly coated with nonstick cooking spray, near the cooktop.",
            "Make the sauce: In a heavy 6 cup saucepan, preferably nonstick, stir together the sugar, corn syrup, cream of tartar, if using, and water until all the sugar is moistened. Heat, stirring constantly with a silicone spatula, until the sugar dissolves and the syrup is bubbling. Stop stirring and let it boil undisturbed until it turns a deep amber and the temperature reaches 370ºF/188ºC or a few degrees below, as the temperature will continue to rise. Remove it from the heat as soon as it reaches temperature. Slowly and carefully pour the hot cream into the caramel. It will bubble up furiously. Use a silicone spatula or wooden spoon to stir the mixture gently, scraping the thicker part that settles on the bottom. Return it to a very low heat, continuing to stir gently for 1 minute, until the mixture is uniform in color and the caramel is fully dissolved. Remove the caramel from the heat and gently stir in the butter until incorporated. The mixture will be a little streaky but will become uniform once cooled and stirred. Pour the caramel into the prepared glass measure and let it cool for 3 minutes. Gently stir in the vanilla and let it to cool until room temperature and thickened, stirring it gently once or twice.",
            "In a heavy 6 cup saucepan, preferably nonstick, stir together the sugar, corn syrup, cream of tartar, if using, and water until all the sugar is moistened.",
            "Heat, stirring constantly with a silicone spatula, until the sugar dissolves and the syrup is bubbling. Stop stirring and let it boil undisturbed until it turns a deep amber and the temperature reaches 370ºF/188ºC or a few degrees below, as the temperature will continue to rise. Remove it from the heat as soon as it reaches temperature.",
            "Slowly and carefully pour the hot cream into the caramel. It will bubble up furiously.",
            "Use a silicone spatula or wooden spoon to stir the mixture gently, scraping the thicker part that settles on the bottom. Return it to a very low heat, continuing to stir gently for 1 minute, until the mixture is uniform in color and the caramel is fully dissolved.",
            "Remove the caramel from the heat and gently stir in the butter until incorporated. The mixture will be a little streaky but will become uniform once cooled and stirred.",
            "Pour the caramel into the prepared glass measure and let it cool for 3 minutes. Gently stir in the vanilla and let it to cool until room temperature and thickened, stirring it gently once or twice.",
            "Store Airtight Room temperature, 3 days; refrigerated, 1 month.",
            "Room temperature, 3 days; refrigerated, 1 month."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b8856ac1c53e84aa2655f54/6:4/w_274%2Ch_169/caramel-sauce-and-glaze-recipe-083018.jpg"
    }
}