{
    "recipe": {
        "title": "Caramel Corn with Smoked Almonds and Fleur de Sel ",
        "ingredients": [
            "Nonstick vegetable-oil spray",
            "1 cup popcorn kernels",
            "1 tablespoon canola oil",
            "2 teaspoons coarse kosher salt",
            "1/2 cup light corn syrup",
            "2 3/4 cups sugar",
            "1/2 tablespoon baking soda",
            "8 tablespoons (1 stick) unsalted butter, cut into small pieces",
            "2 cups (about 8 ounces) smoked or regular Marcona almonds, coarsely chopped*",
            "1 1/2 tablespoons fleur de sel",
            "*Marcona almonds are tender Spanish nuts that are usually roasted and salted. They're available at specialty foods stores and some supermarkets.",
            "1 large baking sheet; parchment paper or aluminum foil"
        ],
        "instructions": [
            "Line a large baking sheet with parchment paper or aluminum foil and grease generously with nonstick vegetable-oil spray. Generously spray a large bowl and all but the handle part of a large spoon or rubber spatula. In a large deep pot with a lid, combine the popcorn kernels, oil, and salt and stir to coat the kernels in oil. Place the pot over moderately high heat, cover with a lid, and cook, shaking the pot frequently to redistribute the kernels, until all the kernels have popped, 6 to 8 minutes. Transfer the popped popcorn to the large prepared bowl, discarding any unpopped kernels. DO AHEAD: The popcorn can be popped in advance and stored, in an airtight container at room temperature, up to 3 days. In a large deep pot over moderately high heat, combine the corn syrup, sugar, and 1/4 cup water and stir to combine. Cook, undisturbed, until the mixture develops a light amber color, about 10 minutes. Remove the pot from the heat, add the baking soda and butter, and stir continuously to melt the butter and combine the ingredients, about 20 seconds. (The mixture will be very hot and will foam up at this point—continuous stirring will help the foaming subside.) Working quickly, pour the caramel over the popcorn and add the almonds, then use the prepared spoon or rubber spatula to stir everything together, trying to evenly coat the popcorn and nuts in caramel. Transfer to the prepared baking sheet, spreading out the caramel corn as much as possible. Sprinkle with fleur de sel and let cool and harden for about 20 minutes. Break the caramel corn into smaller, bite-size pieces and serve. DO AHEAD: Caramel corn can be prepared in advance and stored, in an airtight container at room temperature, up to 3 days.",
            "Line a large baking sheet with parchment paper or aluminum foil and grease generously with nonstick vegetable-oil spray. Generously spray a large bowl and all but the handle part of a large spoon or rubber spatula.",
            "In a large deep pot with a lid, combine the popcorn kernels, oil, and salt and stir to coat the kernels in oil. Place the pot over moderately high heat, cover with a lid, and cook, shaking the pot frequently to redistribute the kernels, until all the kernels have popped, 6 to 8 minutes. Transfer the popped popcorn to the large prepared bowl, discarding any unpopped kernels. DO AHEAD: The popcorn can be popped in advance and stored, in an airtight container at room temperature, up to 3 days.",
            "In a large deep pot over moderately high heat, combine the corn syrup, sugar, and 1/4 cup water and stir to combine. Cook, undisturbed, until the mixture develops a light amber color, about 10 minutes. Remove the pot from the heat, add the baking soda and butter, and stir continuously to melt the butter and combine the ingredients, about 20 seconds. (The mixture will be very hot and will foam up at this point—continuous stirring will help the foaming subside.) Working quickly, pour the caramel over the popcorn and add the almonds, then use the prepared spoon or rubber spatula to stir everything together, trying to evenly coat the popcorn and nuts in caramel. Transfer to the prepared baking sheet, spreading out the caramel corn as much as possible. Sprinkle with fleur de sel and let cool and harden for about 20 minutes. Break the caramel corn into smaller, bite-size pieces and serve. DO AHEAD: Caramel corn can be prepared in advance and stored, in an airtight container at room temperature, up to 3 days."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b2854a9a93d64c380b12e3/6:4/w_274%2Ch_169/368716_caramel-corn_1x1.jpg"
    }
}