{
    "recipe": {
        "title": "Caramel Rice Pudding ",
        "ingredients": [
            "200 g (7 oz/1 cup) short-grain pudding rice",
            "1 vanilla pod",
            "900 ml (30 fl oz/33/4 cups) milk",
            "75 g (21/2 oz/3/4cups) caster (superfine) sugar",
            "pinch of salt",
            "3 egg yolks",
            "50 g (2 oz/1/4 cup) butter",
            "150 g (5 oz/3/4 cup) light soft brown sugar",
            "200 ml (7 fl oz/scant 1 cup) double (heavy) cream"
        ],
        "instructions": [
            "Bring a small saucepan of water to the boil, add the rice and cook it for 2 minutes. Strain and set aside. Split the vanilla pod in half lengthways and scrape out the seeds. Place the pod and seeds in a large saucepan with the milk, sugar and salt and heat to a gentle simmer. Pour in the rice and stir well. Cover and simmer for 30–40 minutes, stirring occasionally to make sure the rice doesn't stick to the bottom of the pan. Remove from the heat when all the liquid is absorbed and the rice is tender. Remove the vanilla pod. Add the egg yolks, return to the hob and heat gently for a few more minutes, stirring occasionally. Remove from the heat, stir in the butter and leave to cool. To make the caramel sauce, heat the sugar in a saucepan over a medium heat. Keep an eye on it and stir frequently to ensure the sugar doesn't burn. When the sugar has melted remove the pan from the heat, leave to cool for about a minute, then slowly pour in the cream and stir until you have a smooth sauce. Pour the rice pudding into individual small serving dishes. Serve the caramel sauce on the side for guests to add their own.",
            "Bring a small saucepan of water to the boil, add the rice and cook it for 2 minutes. Strain and set aside.",
            "Split the vanilla pod in half lengthways and scrape out the seeds. Place the pod and seeds in a large saucepan with the milk, sugar and salt and heat to a gentle simmer. Pour in the rice and stir well. Cover and simmer for 30–40 minutes, stirring occasionally to make sure the rice doesn't stick to the bottom of the pan. Remove from the heat when all the liquid is absorbed and the rice is tender.",
            "Remove the vanilla pod. Add the egg yolks, return to the hob and heat gently for a few more minutes, stirring occasionally. Remove from the heat, stir in the butter and leave to cool.",
            "To make the caramel sauce, heat the sugar in a saucepan over a medium heat. Keep an eye on it and stir frequently to ensure the sugar doesn't burn. When the sugar has melted remove the pan from the heat, leave to cool for about a minute, then slowly pour in the cream and stir until you have a smooth sauce.",
            "Pour the rice pudding into individual small serving dishes. Serve the caramel sauce on the side for guests to add their own."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad51526529d92b2c0444ca/6:4/w_274%2Ch_169/51202420_caramel-rice-pudding_1x1.jpg"
    }
}