{
    "recipe": {
        "title": "Carbonara (Guanciale, Egg, and Pecorino Romano) ",
        "ingredients": [
            "4 ounces (115 grams) guanciale, cut into 1/4-inch (1/2-centimeter) dice",
            "2 generous tablespoons extra virgin olive oil, preferably lightly fruity",
            "3 large eggs, at room temperature",
            "10 rounded tablespoons (100 grams) freshly grated pecorino romano, or half pecorino romano and half parmigiano-reggiano",
            "freshly ground black pepper",
            "1 pound (450 grams) pasta (see note below)"
        ],
        "instructions": [
            "Put the guanciale and oil in a large skillet. Sauté over medium heat until the edges of the guanciale pieces are just turning brown, about 2 minutes. Don't let it get too crisp. Set the pan and its contents aside but keep warm. Bring 5 quarts (5 liters) of water to a boil in an 8-quart (8-liter) pot over high heat. When the water boils, add 3 tablespoons kosher salt, then add the pasta and cook, stirring occasionally, until al dente. While the pasta is cooking, break the eggs into a small bowl and add all the cheese and a generous grinding of pepper. Whisk gently until the mixture is smooth. Drain the pasta (reserving and keeping warm a cup of its water) and put it in the skillet with the guanciale over low heat. Toss quickly to mix well. Holding the skillet slightly above but not touching the burner, pour the egg and cheese mixture in a stream into the pasta. Now, if you have the skill, toss the pasta with a deft movement of the wrist to blend all the contents of the pan. If you don't, remove the pan from the heat and mix quickly with two wooden spoons. If you have a warm spot, such as a food warmer or even over a pilot light, rest the pan there while you work. Whatever you do, work fast or the pasta will get cold and the eggs will stay raw and runny. Ideally the heat of the pasta will cook the egg just enough, and the sauce should be creamy. You can mix in a tiny bit of the reserved water to smooth things out, but you probably won't need to. Transfer to individual heated bowls or plates and serve instantaneously.",
            "Put the guanciale and oil in a large skillet. Sauté over medium heat until the edges of the guanciale pieces are just turning brown, about 2 minutes. Don't let it get too crisp. Set the pan and its contents aside but keep warm.",
            "Bring 5 quarts (5 liters) of water to a boil in an 8-quart (8-liter) pot over high heat. When the water boils, add 3 tablespoons kosher salt, then add the pasta and cook, stirring occasionally, until al dente.",
            "While the pasta is cooking, break the eggs into a small bowl and add all the cheese and a generous grinding of pepper. Whisk gently until the mixture is smooth.",
            "Drain the pasta (reserving and keeping warm a cup of its water) and put it in the skillet with the guanciale over low heat. Toss quickly to mix well.",
            "Holding the skillet slightly above but not touching the burner, pour the egg and cheese mixture in a stream into the pasta. Now, if you have the skill, toss the pasta with a deft movement of the wrist to blend all the contents of the pan. If you don't, remove the pan from the heat and mix quickly with two wooden spoons. If you have a warm spot, such as a food warmer or even over a pilot light, rest the pan there while you work.",
            "Whatever you do, work fast or the pasta will get cold and the eggs will stay raw and runny. Ideally the heat of the pasta will cook the egg just enough, and the sauce should be creamy. You can mix in a tiny bit of the reserved water to smooth things out, but you probably won't need to.",
            "Transfer to individual heated bowls or plates and serve instantaneously."
        ],
        "picture_link": "https://assets.epicurious.com/photos/555cf3d4100d9bda6d82176e/6:4/w_274%2Ch_169/51221420_carbonara-em-guanciale-egg_6x4.jpg"
    }
}