{
    "recipe": {
        "title": "Cardamom-Yogurt Mousse with Apricots ",
        "ingredients": [
            "2 teaspoons powdered gelatin",
            "1/3 cup (75 ml) honey",
            "2 large egg whites",
            "3/4 cup (180 ml) cream",
            "1 1/2 cups (360 ml) plain Greek or strained yogurt (low-fat or full-fat)",
            "1/2 teaspoon cardamom powder",
            "Pinch salt",
            "6 to 8 ripe apricots, to serve"
        ],
        "instructions": [
            "Pour 1/4 cup (60 ml) water into a small saucepan and sprinkle the gelatin over it. Set aside for 5 minutes to allow the gelatin to soften. Set the pan over medium heat and whisk until the gelatin dissolves. Whisk in the honey and continue warming until the honey has thinned. In the bowl of a stand mixer (or in a large bowl, using a hand mixer), whip the egg whites until stiff. Scrape out into a separate bowl. Wipe out the mixing bowl and beat the cream until stiff peaks form. Add the yogurt and whip until combined. Beat in the cardamom and salt, then slowly pour in the warmed honey and gelatin and whip. Use a spatula to gently fold in the egg whites. Spread the mousse in six separate cups or in a 1-quart (1-L) dish and refrigerate for 1 to 2 hours, until softly set. Serve with slices of fresh apricot, or remove the pits from apricot halves and pipe in dollops of mousse.",
            "Pour 1/4 cup (60 ml) water into a small saucepan and sprinkle the gelatin over it. Set aside for 5 minutes to allow the gelatin to soften. Set the pan over medium heat and whisk until the gelatin dissolves. Whisk in the honey and continue warming until the honey has thinned.",
            "In the bowl of a stand mixer (or in a large bowl, using a hand mixer), whip the egg whites until stiff. Scrape out into a separate bowl. Wipe out the mixing bowl and beat the cream until stiff peaks form. Add the yogurt and whip until combined. Beat in the cardamom and salt, then slowly pour in the warmed honey and gelatin and whip. Use a spatula to gently fold in the egg whites.",
            "Spread the mousse in six separate cups or in a 1-quart (1-L) dish and refrigerate for 1 to 2 hours, until softly set. Serve with slices of fresh apricot, or remove the pits from apricot halves and pipe in dollops of mousse."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54af4e4b4074bdfd06839716/6:4/w_274%2Ch_169/51176600_cardamom-yogurt-mousse_1x1.jpg"
    }
}