{
    "recipe": {
        "title": "Cardamom Biscuits ",
        "ingredients": [
            "3 cups all purpose flour",
            "1/2 cup (packed) golden brown sugar",
            "3 3/4 teaspoons baking powder",
            "2 1/4 teaspoons ground cardamom",
            "3/4 teaspoon baking soda",
            "1/4 teaspoon (generous) salt",
            "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/2-inch pieces",
            "3 large eggs",
            "1/2 cup (about) chilled buttermilk",
            "1 1/2 teaspoon vanilla extract",
            "1 1/2 tablespoons melted buter",
            "Sugar"
        ],
        "instructions": [
            "Preheat oven to 425°F. Combine first 6 ingredients in processor and mix. Add chilled butter and cut in using on/off turns until mixture resembles coarse meal. Transfer to large bowl. Beat eggs to blend in glass measuring cup. Add enough buttermilk to beaten eggs to measure 9 ounces (1 cup plus 2 tablespoons). Add vanilla. Using fork, mix buttermilk mixture into dry ingredients just until dough binds together. Gently knead dough on floured surface until it just hold together, about 10 turns. Divide dough into 3 equal pieces. Form one dough piece into ball and flatten to 1-inch-thick round. Cut into 4 wedges. Transfer to ungreased baking sheet, spacing evenly. Repeat forming and cutting with remaining 2 dough pieces. Brush biscuits with melted butter; sprinkle with sugar. Bake until just firm to touch and beginning to brown, about 15 minutes. Transfer biscuits to rack. (Can be prepred 8 hours ahead. Cool comletely. Wrap tightly in foil and store at room temperature. Before serving, rewarm in 350°F. oven about 5 minutes.)",
            "Preheat oven to 425°F. Combine first 6 ingredients in processor and mix. Add chilled butter and cut in using on/off turns until mixture resembles coarse meal. Transfer to large bowl. Beat eggs to blend in glass measuring cup. Add enough buttermilk to beaten eggs to measure 9 ounces (1 cup plus 2 tablespoons). Add vanilla. Using fork, mix buttermilk mixture into dry ingredients just until dough binds together.",
            "Gently knead dough on floured surface until it just hold together, about 10 turns. Divide dough into 3 equal pieces. Form one dough piece into ball and flatten to 1-inch-thick round. Cut into 4 wedges. Transfer to ungreased baking sheet, spacing evenly. Repeat forming and cutting with remaining 2 dough pieces.",
            "Brush biscuits with melted butter; sprinkle with sugar. Bake until just firm to touch and beginning to brown, about 15 minutes. Transfer biscuits to rack. (Can be prepred 8 hours ahead. Cool comletely. Wrap tightly in foil and store at room temperature. Before serving, rewarm in 350°F. oven about 5 minutes.)"
        ],
        "picture_link": null
    }
}