{
    "recipe": {
        "title": "Cardamom Knots ",
        "ingredients": [
            "50g (3 1/2 Tbsp) butter, cubed",
            "250ml (1 cup) whole milk",
            "500g (1 lb) white bread flour, plus extra for dusting",
            "1 (7g) packet fast-acting dried yeast",
            "1 tsp fine salt",
            "50g (1/4 cup) granulated sugar",
            "1 tsp ground cardamom",
            "Oil, for greasing",
            "150g (10 1/2 Tbsp) butter, softened",
            "100g (1/2 cup packed) soft dark brown sugar",
            "2 tsp ground cardamom",
            "50g (1/4 cup) granulated sugar",
            "1/2 tsp ground cardamom",
            "Pearl sugar, to decorate (optional)"
        ],
        "instructions": [
            "Start by making the dough. Place the cubed butter in a small saucepan with the milk. Heat over a low heat until the cubes of butter have completely melted, then remove from the heat and set to one side to allow the mixture to cool for a few minutes.",
            "Place the flour in a large bowl, or the bowl of a stand mixer fitted with the dough-hook attachment, and add the yeast to one side of the bowl and the salt, sugar and cardamom to the other. If you put the salt directly on the yeast it may kill it, which will stop your dough from rising.",
            "Gradually pour the warm butter and milk into the bowl with the flour,mixing all the time, using your hands or the dough-hook attachment, until a sticky dough forms. You may not need to add all the milk mixture, or you might need to add a little more milk – you want to add just enough to make a sticky but not wet dough.",
            "Dust your worktop lightly with flour, tip the dough out on to it and knead it for 5–10 minutes (or knead using the dough hook on the stand mixer) until the dough is no longer sticky and has become smooth and elastic. Grease the bowl in which you mixed the dough with oil, place the dough back in the bowl, cover with a tea towel or cling film and leave to rise at room temperature for 1–3 hours or until doubled in size. You can leave the dough to prove in the fridge overnight if you want these for breakfast!",
            "While the dough is rising, combine the filling ingredients in a small bowl to make a thick paste. Line 2 baking trays with baking parchment.",
            "Tip the risen dough out of the bowl on to a worktop lightly dusted with flour and fold it in on itself a couple of times to knock out any large air pockets.",
            "Roll out the dough thinly to make a very large rectangle measuring roughly 50 x 30cm. Spread the cardamom filling mixture all over the dough, making sure it goes right to the edges.",
            "Fold one of the short ends over two-thirds of the dough, then fold the remaining third over – as if you are folding a letter or making puff pastry. You should have one neat rectangle consisting of three layers of dough, and all the filling should be enclosed inside.",
            "Use a sharp knife to cut the dough into 12 even strips. Taking one of the strips, stretch out and twist it a few times. Tie it into a loose knot, tucking the edges in. Place the knot on a lined baking tray and repeat with the remaining strips, arranging them on the tray and leaving a few centimeters between each. Leave for 45 minutes at room temperature to rise again.",
            "While the knots are proving, preheat the oven to 400°F/200°C/180°C fan/gas 6. Make the cardamom syrup by bringing the sugar, ground cardamom and 50ml of water to the boil in a small saucepan and letting it bubble for a few minutes, stirring occasionally, until the sugar has dissolved. Remove from the heat.",
            "Bake the buns for 15–20 minutes or until golden brown, then brush with the cardamom syrup as soon as they come out of the oven. Sprinkle with pearl sugar, if you wish, and serve warm."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b882cc6e0a1020c87b31e3c/6:4/w_274%2Ch_169/cardamom-pastry-knots-recipe-HC-083018.jpg"
    }
}