{
    "recipe": {
        "title": "Carpaccio, Arugula, and Parmesan Stacks ",
        "ingredients": [
            "Mayonnaise: 1/4 cup",
            "Lemon Juice: 2 tablespoons",
            "Dijon Mustard: 2 tablespoons",
            "Salt: 1/2 teaspoon",
            "Cracked black pepper: 1/2 teaspoon",
            "Carpaccio (paper-thin slices of beef tenderloin): 16 slices",
            "Arugula: 1 bunch, washed, dried, and roughly chopped",
            "Parmesan cheese: 1/4 pound, shaved"
        ],
        "instructions": [
            "1. Make the mayonnaise sauce by mixing the mayonnaise, lemon juice, and mustard with a whisk.",
            "2. Season with salt and pepper and set aside.",
            "3. Lay in a slice of carpaccio, using a 2-inch length of 3-inch pipe as a mold, folding in the sides to fit in the mold.",
            "Place a mound of chopped arugula on top of the carpaccio and then place another piece of carpaccio on top, folding over to fit the pipe.",
            "Pull off the pipe and top the stack with shaved Parmesan and fresh cracked pepper.",
            "Drizzle with mayonnaise sauce.",
            "Hints & Clues · Carpaccio is thinly sliced beef tenderloin, but you can also have a carpaccio of any type of meat that is safe to eat raw or cured (such as bison, boar, or duck) or high-quality fish. · Ask your butcher to prepare the carpaccio for you if you are interested. · Arugula has a peppery flavor that goes well with the salty Parmesan and tangy taste of lemon, mustard, and mayonnaise. · Use a flat vegetable peeler to shave Parmesan cheese. Use the peeler like you're a peeling a carrot, or cucumber to make thin shaved strips. · It is common to coat carpaccio with lemon juice and olive oil before serving it. They not only help to bring out the taste, but help with freshness and color.",
            "· Carpaccio is thinly sliced beef tenderloin, but you can also have a carpaccio of any type of meat that is safe to eat raw or cured (such as bison, boar, or duck) or high-quality fish.",
            "· Ask your butcher to prepare the carpaccio for you if you are interested.",
            "· Arugula has a peppery flavor that goes well with the salty Parmesan and tangy taste of lemon, mustard, and mayonnaise.",
            "· Use a flat vegetable peeler to shave Parmesan cheese. Use the peeler like you're a peeling a carrot, or cucumber to make thin shaved strips.",
            "· It is common to coat carpaccio with lemon juice and olive oil before serving it. They not only help to bring out the taste, but help with freshness and color."
        ],
        "picture_link": null
    }
}