{
    "recipe": {
        "title": "Carrot-Ginger Soup with Chile Butter and Roasted Peanuts ",
        "ingredients": [
            "1/4 cup (1/2 stick) unsalted butter, room temperature",
            "2 tablespoons finely chopped green onions (white and green parts only)",
            "1/4 teaspoon dried crushed red pepper",
            "2 tablespoons (1/4 stick) butter",
            "1 1/2 pounds carrots, peeled, cut into 1/4-inch-thick rounds",
            "1 1/4 cups chopped onion",
            "1 5-ounce white-skinned potato, peeled, chopped",
            "2 1/2 tablespoons minced peeled fresh ginger",
            "5 cups (or more) vegetable broth or chicken broth",
            "6 tablespoons unsalted roasted peanuts, finely chopped"
        ],
        "instructions": [
            "For chile butter: Mix all ingredients in small bowl. Cover and chill. Bring to room temperature before using.",
            "Mix all ingredients in small bowl. Cover and chill. Bring to room temperature before using.",
            "For soup: Melt 2 tablespoons butter in large pot over medium-high heat. Add carrots, onion, potato, and ginger; sprinkle with salt and sauté until vegetables are slightly softened but not brown, stirring often, about 10 minutes. Add 5 cups broth; bring to boil. Reduce heat and simmer until vegetables are soft, about 20 minutes. Cool slightly, then puree in batches in blender until smooth. Return soup to same pot; if desired, add more broth by 1/4 cupfuls to thin soup. Bring to simmer. Season with salt and black pepper. Ladle soup into bowls. Top with small spoonful of chile butter; sprinkle with nuts.",
            "Melt 2 tablespoons butter in large pot over medium-high heat. Add carrots, onion, potato, and ginger; sprinkle with salt and sauté until vegetables are slightly softened but not brown, stirring often, about 10 minutes. Add 5 cups broth; bring to boil. Reduce heat and simmer until vegetables are soft, about 20 minutes. Cool slightly, then puree in batches in blender until smooth. Return soup to same pot; if desired, add more broth by 1/4 cupfuls to thin soup. Bring to simmer. Season with salt and black pepper.",
            "Ladle soup into bowls. Top with small spoonful of chile butter; sprinkle with nuts."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b307aa3edeef84363b8226/6:4/w_274%2Ch_169/358493_carrot-ginger-soup_1x1.jpg"
    }
}