{
    "recipe": {
        "title": "Carrot Pizza with Fontina and Red Onion ",
        "ingredients": [
            "2 tablespoons olive oil",
            "1/2 medium onion, chopped",
            "1/2 pound carrots (about 3-4 medium carrots), peeled and thinly sliced",
            "1/2 cup white wine",
            "1/2 teaspoon kosher salt",
            "1/4 cup mascarpone",
            "1/8 teaspoon cayenne pepper",
            "1/2 pound prepared pizza dough, room temperature",
            "All-purpose flour (for surface)",
            "Olive oil (for brushing)",
            "8 ounces Fontina cheese, grated (about 2 cups)",
            "1/2 medium red onion, root intact and thinly sliced lengthwise into wedges",
            "1 cup (loosely packed) carrot fronds or baby arugula"
        ],
        "instructions": [
            "For the carrot purée: Heat oil in a large skillet over medium-high until shimmering. Add onions and cook, stirring often, until translucent, about 2 minutes. Add carrots and cook, stirring occasionally, until beginning to brown, about 5 minutes, then add wine and cook, stirring often, until reduced by half, about 2 minutes. Reduce heat to medium-low, add salt and 1 cup water, and stir to combine. Cover and simmer until carrots are tender and most of the liquid has evaporated, about 15 minutes. Transfer mixture to a blender. Add mascarpone, cayenne, and 1/4 cup water. Remove stopper from lid or leave lid slightly ajar, cover with a towel (hot liquids can splatter), and purée until smooth.",
            "Heat oil in a large skillet over medium-high until shimmering. Add onions and cook, stirring often, until translucent, about 2 minutes. Add carrots and cook, stirring occasionally, until beginning to brown, about 5 minutes, then add wine and cook, stirring often, until reduced by half, about 2 minutes.",
            "Reduce heat to medium-low, add salt and 1 cup water, and stir to combine. Cover and simmer until carrots are tender and most of the liquid has evaporated, about 15 minutes.",
            "Transfer mixture to a blender. Add mascarpone, cayenne, and 1/4 cup water. Remove stopper from lid or leave lid slightly ajar, cover with a towel (hot liquids can splatter), and purée until smooth.",
            "For the pizza: Place 2 overturned rimmed baking sheets in the upper and lower thirds of oven and preheat to 450°F. Divide dough in half on a lightly floured surface and form into 2 balls. Roll out balls into ovals about 6x10 inches in size (make sure they fit on baking sheets). Remove preheated sheets from oven and brush bottoms with oil. Carefully place dough on sheets and brush with more oil. Return to oven and bake until dough is beginning to brown, about 5 minutes. Spread reserved carrot purée evenly on pizzas, then sprinkle with cheese and onion. Return to oven and bake pizzas, rotating the sheets and swapping their positions on the oven racks halfway through, until cheese is melted and bubbling, 10–12 minutes. Transfer pizzas to cutting boards, top with carrot fronds, and slice.",
            "Place 2 overturned rimmed baking sheets in the upper and lower thirds of oven and preheat to 450°F.",
            "Divide dough in half on a lightly floured surface and form into 2 balls. Roll out balls into ovals about 6x10 inches in size (make sure they fit on baking sheets). Remove preheated sheets from oven and brush bottoms with oil. Carefully place dough on sheets and brush with more oil. Return to oven and bake until dough is beginning to brown, about 5 minutes.",
            "Spread reserved carrot purée evenly on pizzas, then sprinkle with cheese and onion. Return to oven and bake pizzas, rotating the sheets and swapping their positions on the oven racks halfway through, until cheese is melted and bubbling, 10–12 minutes. Transfer pizzas to cutting boards, top with carrot fronds, and slice."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5525789ab329bd276d93d367/6:4/w_274%2Ch_169/56389448_carrot-pizza_6x4.jpg"
    }
}