{
    "recipe": {
        "title": "Carrot Salad with Yogurt and Coriander ",
        "ingredients": [
            "1 cup walnut halves",
            "1 tablespoon grapeseed or vegetable oil",
            "2 teaspoons sugar",
            "Kosher salt Freshly ground black pepper",
            "1/2 cup whole or 2% Greek yogurt",
            "2 tablespoons Sherry vinegar",
            "1 teaspoon honey",
            "1/4 teaspoon ground coriander",
            "1 pound small carrots, assorted colors if desired, scrubbed, very thinly sliced lengthwise on a mandoline",
            "6 medium radishes, cut into thin wedges",
            "2 scallions, thinly sliced on a sharp diagonal"
        ],
        "instructions": [
            "Preheat oven to 375°. Toss walnuts and oil on a rimmed baking sheet. Bake until walnuts are lightly toasted and fragrant, 6-8 minutes. Immediately sprinkle with sugar and season with salt and pepper; toss to coat. Let cool. DO AHEAD: Walnuts can be toasted 1 day ahead. Store airtight at room temperature. Whisk yogurt, vinegar, honey, and coriander in a small bowl. Season with salt and pepper. DO AHEAD: Dressing can be made 1 day ahead. Cover and chill. Place carrots in a colander set in a bowl of ice water. Let sit until carrots start to curl, about 2 minutes. Lift colander from water and drain carrots well; pat dry. Combine carrots, radishes, scallions, and dressing in a large bowl and toss to coat. Divide among plates; sprinkle with walnuts.",
            "Preheat oven to 375°. Toss walnuts and oil on a rimmed baking sheet. Bake until walnuts are lightly toasted and fragrant, 6-8 minutes. Immediately sprinkle with sugar and season with salt and pepper; toss to coat. Let cool.",
            "DO AHEAD: Walnuts can be toasted 1 day ahead. Store airtight at room temperature.",
            "Whisk yogurt, vinegar, honey, and coriander in a small bowl. Season with salt and pepper.",
            "DO AHEAD: Dressing can be made 1 day ahead. Cover and chill.",
            "Place carrots in a colander set in a bowl of ice water. Let sit until carrots start to curl, about 2 minutes. Lift colander from water and drain carrots well; pat dry.",
            "Combine carrots, radishes, scallions, and dressing in a large bowl and toss to coat. Divide among plates; sprinkle with walnuts."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac170c19925f464b3a7ec7/6:4/w_274%2Ch_169/51238480_carrot-salad_1x1.jpg"
    }
}