{
    "recipe": {
        "title": "Cashew and Coconut Shrimp ",
        "ingredients": [
            "1/2 cup mango peach jam",
            "2 tablespoons white vinegar",
            "1/4 teaspoon red pepper flakes, or to taste",
            "3/4 cup raw cashews",
            "3/4 cup panko bread crumbs",
            "3/4 cup shredded, unsweetened coconut",
            "1/2 cup all-purpose flour",
            "1/2 teaspoon sea salt",
            "Freshly ground black pepper",
            "1 pound large shrimp (this will be about 18), shelled and deveined",
            "Canola oil",
            "2 large eggs, lightly beaten"
        ],
        "instructions": [
            "Combine the jam, vinegar, and red pepper flakes in a small bowl. Stir to combine. Set aside in the fridge until ready to serve. Place the cashews in a food processor and pulse to break them up a bit. Add the bread crumbs and coconut and pulse a few times just to combine. In a large bowl, whisk together the flour, salt, and pepper. Add the shrimp and toss to coat. In a large, deep skillet over medium heat, heat 1/4 inch canola oil until shimmering. Take a shrimp from the flour, shake off any excess, and dip it in the egg. Shake off any excess egg and dip the shrimp in the cashew mixture. Repeat with the remaining shrimp. Fry the shrimp in the oil, turning once, until golden, and cooked through, 4 to 5 minutes, adding more oil to the pan as needed. Drain cooked shrimp on a wire rack. Arrange cooked shrimp on a platter with the dipping sauce; serve immediately.",
            "Combine the jam, vinegar, and red pepper flakes in a small bowl. Stir to combine. Set aside in the fridge until ready to serve.",
            "Place the cashews in a food processor and pulse to break them up a bit. Add the bread crumbs and coconut and pulse a few times just to combine.",
            "In a large bowl, whisk together the flour, salt, and pepper. Add the shrimp and toss to coat.",
            "In a large, deep skillet over medium heat, heat 1/4 inch canola oil until shimmering.",
            "Take a shrimp from the flour, shake off any excess, and dip it in the egg. Shake off any excess egg and dip the shrimp in the cashew mixture. Repeat with the remaining shrimp.",
            "Fry the shrimp in the oil, turning once, until golden, and cooked through, 4 to 5 minutes, adding more oil to the pan as needed. Drain cooked shrimp on a wire rack.",
            "Arrange cooked shrimp on a platter with the dipping sauce; serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a7365ac21310874c88f1815/6:4/w_274%2Ch_169/cashew-coconut-shrimp-recipe-HC-020118.jpg"
    }
}