{
    "recipe": {
        "title": "Cast-Iron Roast Chicken with Caramelized Leeks ",
        "ingredients": [
            "1 (3 1/2–4-pound) whole chicken",
            "Kosher salt",
            "3 leeks, white and pale green parts only, halved lengthwise",
            "3 tablespoons olive oil, divided",
            "Freshly ground black pepper"
        ],
        "instructions": [
            "Pat chicken dry with paper towels and season generously with salt, inside and out. (We use 1 tsp. Diamond Crystal or 1/2 tsp. Morton kosher salt per lb.) Tie legs together with kitchen twine. Let sit 1 hour to allow salt to penetrate, or chill, uncovered, up to 1 day ahead. Place a rack in upper third of oven and set a 12” cast-iron skillet or 3-qt. enameled cast-iron baking dish on rack. Preheat oven to 425°F. Meanwhile, toss leeks and 2 Tbsp. oil in a medium bowl to coat; season with salt and pepper. Once oven reaches temperature, pat chicken dry with paper towels and lightly coat with half of the remaining oil; sprinkle with dry rub, if using. Drizzle remaining oil into hot skillet (this helps keep the chicken from sticking and tearing the skin). Place chicken in the center of skillet and arrange leeks around. Roast until leeks are browned at edges and tender and an instant-read thermometer inserted into the thickest part of breasts registers 155°F, 50–60 minutes (temperature will climb to 165°F as chicken rests). Let chicken rest in skillet at least 20 minutes and up to 45 minutes. Transfer chicken to a cutting board and carve. Serve with leeks.",
            "Pat chicken dry with paper towels and season generously with salt, inside and out. (We use 1 tsp. Diamond Crystal or 1/2 tsp. Morton kosher salt per lb.) Tie legs together with kitchen twine. Let sit 1 hour to allow salt to penetrate, or chill, uncovered, up to 1 day ahead.",
            "Place a rack in upper third of oven and set a 12” cast-iron skillet or 3-qt. enameled cast-iron baking dish on rack. Preheat oven to 425°F.",
            "Meanwhile, toss leeks and 2 Tbsp. oil in a medium bowl to coat; season with salt and pepper.",
            "Once oven reaches temperature, pat chicken dry with paper towels and lightly coat with half of the remaining oil; sprinkle with dry rub, if using. Drizzle remaining oil into hot skillet (this helps keep the chicken from sticking and tearing the skin). Place chicken in the center of skillet and arrange leeks around. Roast until leeks are browned at edges and tender and an instant-read thermometer inserted into the thickest part of breasts registers 155°F, 50–60 minutes (temperature will climb to 165°F as chicken rests). Let chicken rest in skillet at least 20 minutes and up to 45 minutes.",
            "Transfer chicken to a cutting board and carve. Serve with leeks."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59e9157a221413460f260c9e/6:4/w_274%2Ch_169/cast-iron-roasted-chicken-with-caramelized-leeks.jpg"
    }
}