{
    "recipe": {
        "title": "Cast-Iron Pizza with Fennel and Sausage ",
        "ingredients": [
            "12 oz. store-bought pizza dough, room temperature",
            "5 Tbsp. extra-virgin olive oil, divided",
            "8 oz. sweet Italian sausage, casings removed",
            "1/3 cup prepared marinara",
            "3/4 cup coarsely grated low-moisture mozzarella",
            "1/2 small fennel bulb, very thinly sliced",
            "3 garlic cloves, very thinly sliced",
            "Kosher salt",
            "Crushed red pepper flakes and torn basil leaves (for serving)"
        ],
        "instructions": [
            "Place a rack in top-most position of oven; preheat to 475°F. Place dough on a work surface; drizzle with 1 Tbsp. oil, turning to coat. Stretch out to a 10\" round and cover loosely with plastic wrap.",
            "Heat 1 Tbsp. oil in a large cast-iron skillet over medium. Cook sausage, breaking up into small pieces with a wooden spoon, until browned in spots and cooked though, 5–8 minutes. Transfer sausage to a small bowl.",
            "Remove skillet from heat and carefully lay dough inside (use spoon to help you extend dough all the way to the edges). Season with salt, then spread marinara over entire surface of dough. Top with mozzarella, then fennel, garlic, and cooked sausage. Drizzle with another 2 Tbsp. oil. Peek underneath the crust—the bottom should be golden brown and crisp from residual heat in the skillet. If it’s not, set over medium-low and cook until crust is golden brown, about 3 minutes.",
            "Transfer skillet to oven and bake pizza on top rack until crust is golden brown around the edges and cheese is browned in spots and bubbling all over, 10–14 minutes. Let cool 5 minutes, then top with red pepper flakes and basil. Sprinkle with more salt and drizzle with remaining 1 Tbsp. oil."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ac271947243eb5a46ae46e4/6:4/w_274%2Ch_169/cast-iron-pizza-with-fennel-and-sausage-recipe-BA-032818.jpg",
        "color": 6366830
    }
}