{
    "recipe": {
        "title": "Cauliflower-Cashew Soup with Crispy Buckwheat ",
        "ingredients": [
            "1/2 cup olive oil, divided",
            "4 large shallots, thinly sliced",
            "2 garlic cloves, thinly sliced",
            "2 bay leaves",
            "2 teaspoons fresh thyme leaves",
            "Kosher salt",
            "1/2 cup dry white wine",
            "1 large head of cauliflower, cored, cut into small florets, stem chopped, divided",
            "1/4 teaspoon cayenne pepper",
            "3/4 cup plus 2 tablespoons cashews",
            "6 cups (or more) vegetable stock, preferably homemade",
            "Freshly ground black pepper",
            "2 tablespoons buckwheat groats",
            "2 teaspoons fresh lemon juice",
            "1/2 teaspoon paprika"
        ],
        "instructions": [
            "Heat 1/4 cup oil in a large heavy pot over medium. Add shallots, garlic, bay leaves, and thyme; season with salt. Cook, stirring occasionally, until shallots are translucent, 6–8 minutes. Add wine, bring to a boil, and cook until reduced by half, about 4 minutes. Set 3/4 cup cauliflower aside; add the rest to pot along with cayenne and 3/4 cup cashews; season with salt. Cover pot, reduce heat to low, and cook, shaking pot occasionally, until cauliflower is fork-tender and vegetables have released all their water, 20–25 minutes (check occasionally to make sure vegetables are not browning; reduce heat if they are). Add stock and season with salt and black pepper. Bring to a boil, reduce heat, and simmer, partially covered, until cauliflower is falling apart, 20–25 minutes. Discard bay leaves. Remove from heat and let cool slightly. Meanwhile, finely chop reserved 3/4 cup cauliflower and remaining 2 tablespoons cashews. Heat remaining 1/4 cup oil in a small skillet over medium. Add cauliflower, cashews, and buckwheat; season with salt. Cook, stirring often, until cauliflower and cashews are golden brown and buckwheat is browned and crisp, 5–8 minutes. Remove from heat and stir in lemon juice and paprika. Let cool slightly. Working in batches if needed, purée soup in a blender until very smooth. Return to pot and reheat over mediumlow, stirring and adding more stock to thin if needed (soup should be the consistency of heavy cream). Taste and season soup again if needed. Serve soup topped with toasted cauliflower-buckwheat mixture. Do ahead: Soup can be made 2 days ahead (or 1 month if frozen). Let cool; transfer to airtight containers and chill.",
            "Heat 1/4 cup oil in a large heavy pot over medium. Add shallots, garlic, bay leaves, and thyme; season with salt. Cook, stirring occasionally, until shallots are translucent, 6–8 minutes.",
            "Add wine, bring to a boil, and cook until reduced by half, about 4 minutes.",
            "Set 3/4 cup cauliflower aside; add the rest to pot along with cayenne and 3/4 cup cashews; season with salt.",
            "Cover pot, reduce heat to low, and cook, shaking pot occasionally, until cauliflower is fork-tender and vegetables have released all their water, 20–25 minutes (check occasionally to make sure vegetables are not browning; reduce heat if they are).",
            "Add stock and season with salt and black pepper. Bring to a boil, reduce heat, and simmer, partially covered, until cauliflower is falling apart, 20–25 minutes. Discard bay leaves. Remove from heat and let cool slightly.",
            "Meanwhile, finely chop reserved 3/4 cup cauliflower and remaining 2 tablespoons cashews. Heat remaining 1/4 cup oil in a small skillet over medium. Add cauliflower, cashews, and buckwheat; season with salt. Cook, stirring often, until cauliflower and cashews are golden brown and buckwheat is browned and crisp, 5–8 minutes. Remove from heat and stir in lemon juice and paprika. Let cool slightly.",
            "Working in batches if needed, purée soup in a blender until very smooth. Return to pot and reheat over mediumlow, stirring and adding more stock to thin if needed (soup should be the consistency of heavy cream). Taste and season soup again if needed.",
            "Serve soup topped with toasted cauliflower-buckwheat mixture.",
            "Do ahead: Soup can be made 2 days ahead (or 1 month if frozen). Let cool; transfer to airtight containers and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5509b640b4f519dd5804a1df/6:4/w_274%2Ch_169/51263890_cauliflower-cashew-soup_1x1.jpg"
    }
}