{
    "recipe": {
        "title": "Cauliflower Melts ",
        "ingredients": [
            "1/4 cup olive oil",
            "2 garlic cloves, minced",
            "1 teaspoon salt",
            "1/2 teaspoon freshly ground pepper",
            "Medium head of cauliflower, cut into 1/2-inch-thick slabs, possibly halved to make a total of 8 slabs",
            "1/2 cup golden raisins",
            "1/4 cup white wine (optional)",
            "1/4 cup shelled pistachios",
            "8 1/2-inch-thick slices sourdough bread",
            "4 ounces Comte or Manchego cheese, cut into 8 slices",
            "2 tablespoons chopped parsley"
        ],
        "instructions": [
            "1. Preheat the oven to 350°F and line a baking sheet with parchment paper. 2. In a medium bowl, combine the oil, garlic, salt, and pepper. Add the cauliflower slabs and toss to coat. 3. Arrange the cauliflower on the prepared baking sheet. Bake for 25 minutes, flip the slabs, and bake another 10 to 20 minutes, until softened and roasty. Set aside to cool but keep the oven on. 4. Meanwhile, in a small bowl, soak the raisins in wine or water for 10 minutes. Drain. 5. In a small pan over medium-high heat, toast the pistachios, dry or with a little oil. Let cool on a paper towel, then chop coarsely. 6. Lay the bread on the baking sheet and arrange the cauliflower on the bread, cutting it to fit as needed. Sprinkle with pistachios and raisins and top with the cheese. 7. Bake until the cheese melts, 7 to 10 minutes. 8. Top the toasts with chopped parsley and serve immediately.",
            "1. Preheat the oven to 350°F and line a baking sheet with parchment paper.",
            "2. In a medium bowl, combine the oil, garlic, salt, and pepper. Add the cauliflower slabs and toss to coat.",
            "3. Arrange the cauliflower on the prepared baking sheet. Bake for 25 minutes, flip the slabs, and bake another 10 to 20 minutes, until softened and roasty. Set aside to cool but keep the oven on.",
            "4. Meanwhile, in a small bowl, soak the raisins in wine or water for 10 minutes. Drain.",
            "5. In a small pan over medium-high heat, toast the pistachios, dry or with a little oil. Let cool on a paper towel, then chop coarsely.",
            "6. Lay the bread on the baking sheet and arrange the cauliflower on the bread, cutting it to fit as needed. Sprinkle with pistachios and raisins and top with the cheese.",
            "7. Bake until the cheese melts, 7 to 10 minutes.",
            "8. Top the toasts with chopped parsley and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/551da2eae7851a541a30d5e5/6:4/w_274%2Ch_169/56389416_cauliflower-melts_6x4.jpg"
    }
}