{
    "recipe": {
        "title": "Cauliflower Mousse ",
        "ingredients": [
            "5 cups coarsely chopped cauliflower (1/2 medium head)",
            "2 1/2 teaspoons salt",
            "1 tablespoon unsalted butter",
            "1 tablespoon all-purpose flour",
            "1/2 cup milk",
            "1/4 teaspoon white pepper",
            "1/8 teaspoon freshly grated nutmeg",
            "3 large eggs, lightly beaten",
            "1/2 oz finely grated Parmigiano-Reggiano (1/4 cup)",
            "a 1-qt soufflé dish"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 350°F. Butter soufflé dish, then line bottom with a round of parchment or wax paper and butter paper. Chill dish until ready to fill. Cook cauliflower with 2 teaspoons salt in a 3- to 4-quart pot of boiling water, uncovered, until tender, 15 to 18 minutes. Drain cauliflower well in a colander, then puré in a food processor until smooth. Melt butter in a 1-quart heavy saucepan over moderately low heat. Add flour and cook, whisking, 2 minutes. Add milk in a stream, whisking, then add white pepper, nutmeg, and remaining 1/2 teaspoon salt, whisking. Bring to a boil over moderate heat, whisking, then reduce heat and simmer, whisking constantly, 2 minutes. Remove from heat and cool béchamel, 5 minutes. Whisk cauliflower puré into béchamel, then add beaten eggs, whisking until combined well. Transfer mixture to soufflé dish and put dish in a 13- by 9-inch roasting pan, then add enough boiling-hot water to pan to reach halfway up side of soufflé dish. Bake until center of mousse is firm to the touch and mousse begins to pull away from side of dish, 35 to 40 minutes. Remove mousse from oven and water bath. Position oven rack so that top of mousse will be 4 to 6 inches from broiler, then preheat broiler. Run a knife around edge of soufflé dish, then place an ovenproof platter on top of soufflé dish and invert mousse onto platter. Sprinkle cheese evenly over top of mousse and broil until cheese is melted and golden brown, about 2 minutes.",
            "Put oven rack in middle position and preheat oven to 350°F. Butter soufflé dish, then line bottom with a round of parchment or wax paper and butter paper. Chill dish until ready to fill.",
            "Cook cauliflower with 2 teaspoons salt in a 3- to 4-quart pot of boiling water, uncovered, until tender, 15 to 18 minutes. Drain cauliflower well in a colander, then puré in a food processor until smooth.",
            "Melt butter in a 1-quart heavy saucepan over moderately low heat. Add flour and cook, whisking, 2 minutes. Add milk in a stream, whisking, then add white pepper, nutmeg, and remaining 1/2 teaspoon salt, whisking. Bring to a boil over moderate heat, whisking, then reduce heat and simmer, whisking constantly, 2 minutes. Remove from heat and cool béchamel, 5 minutes.",
            "Whisk cauliflower puré into béchamel, then add beaten eggs, whisking until combined well. Transfer mixture to soufflé dish and put dish in a 13- by 9-inch roasting pan, then add enough boiling-hot water to pan to reach halfway up side of soufflé dish. Bake until center of mousse is firm to the touch and mousse begins to pull away from side of dish, 35 to 40 minutes.",
            "Remove mousse from oven and water bath. Position oven rack so that top of mousse will be 4 to 6 inches from broiler, then preheat broiler.",
            "Run a knife around edge of soufflé dish, then place an ovenproof platter on top of soufflé dish and invert mousse onto platter. Sprinkle cheese evenly over top of mousse and broil until cheese is melted and golden brown, about 2 minutes."
        ],
        "picture_link": null
    }
}