{
    "recipe": {
        "title": "Cauliflower-Crust Pizza with Tomatoes and Mozzarella ",
        "ingredients": [
            "1 small head of cauliflower (about 1 pound), coarsely chopped",
            "1 large egg, lightly beaten",
            "1 cup grated Parmesan (about 3 ounces)",
            "3/4 cup finely ground almond meal or almond flour",
            "1 garlic clove, finely chopped",
            "1/2 teaspoon dried Italian seasoning",
            "1/2 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "1 1/2 cups shredded part-skim mozzarella (about 5 ounces), divided",
            "Vegetable oil (for brushing)",
            "1/2 cup marinara sauce",
            "1/4 cup basil leaves, torn",
            "1/2 teaspoon red pepper flakes (optional)",
            "A pizza stone and peel, or 2 baking sheets"
        ],
        "instructions": [
            "Arrange a rack in middle of oven; place pizza stone or inverted (if rimmed) baking sheet on rack. Preheat to 425°F.",
            "Working in batches if needed, pulse cauliflower in a food processor fitted with the blade, or grate using the medium holes of a box grater, until fine crumbs form and are rice-like in texture. Transfer to a clean kitchen towel and tightly squeeze to remove as much liquid as possible.",
            "Mix cauliflower, egg, Parmesan, almond meal, garlic, Italian seasoning, salt, and black pepper in a medium bowl until mixture holds together when pinched.",
            "Line pizza peel or second baking sheet with parchment paper; generously brush with oil. Form cauliflower mixture into a 12\" circle with your hands on parchment. Using a rolling pin, make thickness as even as possible. Carefully slide parchment onto preheated pizza stone or baking sheet.",
            "Bake cauliflower crust until golden brown and firm to the touch, rotating halfway through, 20–22 minutes.",
            "Remove from oven. Sprinkle with 1 1/4 cups mozzarella. Top with sauce, using the back of a spoon to spread over cheese. Sprinkle with remaining 1/4 cup mozzarella.",
            "Slide pizza back onto pizza stone or baking sheet and continue to bake until bubbly and browned in spots, 5–7 minutes. Top with basil and red pepper, if using. Let sit 5 minutes, then cut into 6–8 wedges.",
            "Do Ahead Pizza can be made 3 days ahead; transfer to a resealable container and chill. Reheat in a 350°F oven until warmed through.",
            "Pizza can be made 3 days ahead; transfer to a resealable container and chill. Reheat in a 350°F oven until warmed through."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58af2ec7a847fc63de9b3d6f/6:4/w_274%2Ch_169/Cauliflower-Pizza-17022017.jpg",
        "color": 10019852
    }
}