{
    "recipe": {
        "title": "Cauliflower Sformati ",
        "ingredients": [
            "3 tablespoons olive oil",
            "1 cup minced onion",
            "2 cups (1/2-inch) cauliflower florets",
            "1 cup chicken stock",
            "3 tablespoons unsalted butter",
            "2 tablespoons flour",
            "1/2 teaspoon grated nutmeg",
            "1/4 teaspoon cayenne pepper",
            "3/4 teaspoon salt",
            "1/2 teaspoon freshly ground black pepper",
            "1 cup ricotta cheese",
            "1 cup grated fontina",
            "4 eggs, beaten",
            "4 cups arugula or watercress",
            "2 to 3 tablespoons Lemon–Olive Oil Dressing"
        ],
        "instructions": [
            "Preheat the oven to 400°F.",
            "Heat the olive oil in a medium saucepot with a lid over medium-high heat. When the oil is hot, add the minced onion, and saut´é until it is thoroughly soft, about 10 minutes. Transfer the onion to a mixing bowl to cool.",
            "Combine the cauliflower and the chicken stock in the pot you used to sauté the onion (no need to clean it first). Raise the heat to high, and bring to a boil. Cover the pot, and boil until the florets are soft, about 10 minutes or so. Strain the cauliflower, reserving the stock. Add the florets to the onion, and mash them up a bit with a fork.",
            "Using the same pot, melt the butter over low heat (no need to clean the pot first). Use a pastry brush to swirl some of the melted butter around the insides of the ramekins. Cut circles of parchment paper to fit the bottoms of the ramekins. Butter the circles, and set them in place. Set the ramekins aside.",
            "Add the flour to the remaining butter in the pan, whisking with a fork as you add to prevent lumps. Add the reserved stock a little at a time, whisking as you pour. Raise the heat to medium-high, and bring to a boil. Simmer for about 5 minutes to thicken, whisking to prevent and break up any lumps. Add the stock mixture to the cauliflower and onions, and toss to coat. Add the nutmeg, cayenne, salt, and black pepper to the bowl, and stir, mixing thoroughly. Let cool for 5 minutes.",
            "Once the cauliflower mixture has cooled a bit, fold in the cheeses. Add the eggs, and fold them in as well. Spoon the mixture into the ramekins. Pour a cup or so of hot water into a 9x13-inch casserole, and place the ramekins in the baking dish.",
            "Bake until the sformati are set and the tops are browned, about 40 minutes. (If the water evaporates during baking, add more hot water.) Remove the ramekins from the casserole, and let sit until they are thoroughly cool. (Since they are served at room temperature, you can make the sformati well in advance.)",
            "When ready to serve, toss the salad greens with the lemon–olive oil dressing. Unmold the sformati by running a thin knife around the edge of the ramekins. Place a small plate on top of each ramekin, and invert it, tapping lightly if necessary. The sformati should come out of the mold in one piece. Peel and discard the parchment. Serve, browned side up, with the greens on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a25d2c452bd5d44c1336d75/6:4/w_274%2Ch_169/cauliflower-sformati-recipe-112917.jpg",
        "color": 6697583
    }
}