{
    "recipe": {
        "title": "Cavatelli With Roman Cauliflower ",
        "ingredients": [
            "2 tablespoons salt",
            "1 medium head cauliflower, cut into 1-inch florets (about 4 cups)",
            "6 tablespoons extra-virgin olive oil, plus extra for drizzling",
            "3 shallots, finely chopped",
            "1 teaspoon red pepper flakes",
            "3 anchovy fillets, chopped",
            "1 pound cavatelli",
            "1/4 cup grated pecorino cheese, plus more for serving"
        ],
        "instructions": [
            "Add 1 tablespoon of the salt and the cauliflower to a large pot of water and bring to a boil over high heat.",
            "Cook for 3 minutes, then remove the cauliflower from the water. Retain the water.",
            "Put half of the cauliflower into a blender along with 1 cup of the cooking water and 2 tablespoons of the oil. Blend until it turns into a puree. This will be the sauce for your pasta. You may need to add more of the cooking water to reach the desired consistency (as loose as tomato puree).",
            "Heat the remaining 4 tablespoons of oil in a pan over medium heat. Add the shallots, red pepper flakes, and anchovies. Saute for 1 minute.",
            "Increase the heat to high and add the reserved cauliflower florets. Saute for 2 minutes while stirring.",
            "Add the puree to the pan and saute for 30 to 40 seconds while stirring.",
            "To the pot with the reserved cauliflower cooking water, add the remaining 1 tablespoon of salt, return the water to a boil over high heat, and add the cavatelli. Cook according to the package instructions until al dente, 5 to 8 minutes.",
            "Reserve 1 cup of the pasta cooking water. Drain the pasta, stir it into the pan with the sauce, and cook everything together for 30 seconds. Add a couple more tablespoons of the pasta cooking water for a looser consistency, if desired.",
            "Remove the pan from the heat and stir in the cheese.",
            "Drizzle each serving with olive oil and serve with extra grated cheese for sprinkling."
        ],
        "picture_link": "https://assets.epicurious.com/photos/568c257ffb9544f72b679863/6:4/w_274%2Ch_169/Cavatelli-with-Roman-Cauliflower.jpg",
        "color": 15101165
    }
}