{
    "recipe": {
        "title": "Caviar Eggs ",
        "ingredients": [
            "6 large eggs",
            "2 teaspoons distilled white vinegar",
            "1/4 cup chilled heavy cream",
            "1 teaspoon fresh lemon juice",
            "1 teaspoon vodka",
            "1/8 teaspoon plus a pinch of cayenne, divided",
            "2 tablespoons (cut into bits) plus 1 teaspoon unsalted butter, divided",
            "2 tablespoons domestic caviar such as osetra or rainbow trout",
            "Equipment: a 6- to 8-inch nonstick skillet"
        ],
        "instructions": [
            "Carefully remove top third of each eggshell by tapping around egg with a paring knife, then gently pry off top and discard. Pour eggs into a bowl, reserving shells.",
            "Use a knife to tear any membrane remaining in bottom of eggshells. Generously cover shells with cold water in a 3-qt saucepan and add vinegar. Simmer over medium heat, gently stirring occasionally and skimming off any foam, 15 minutes. Carefully transfer shells with a slotted spoon to a rack to cool. Gently wipe shells inside and out with a damp paper towel to clean completely. 3Put eggshells in eggcups or small glasses to keep them upright.",
            "Whip cream and scramble eggs: Beat cream with a whisk until it just holds stiff peaks, then beat in lemon juice, vodka, 1/4 teaspoon salt, and 1/8 teaspoon cayenne. Lightly beat eggs with a fork, then add 1 1/2 tablespoons butter, 1/8 teaspoon salt, and remaining pinch of cayenne. Melt remaining tsp butter in nonstick skillet over medium heat, then cook egg mixture, stirring constantly, until eggs are just scrambled, 3 to 5 minutes. Divide among shells and top with whipped cream and caviar.",
            "Beat cream with a whisk until it just holds stiff peaks, then beat in lemon juice, vodka, 1/4 teaspoon salt, and 1/8 teaspoon cayenne.",
            "Lightly beat eggs with a fork, then add 1 1/2 tablespoons butter, 1/8 teaspoon salt, and remaining pinch of cayenne. Melt remaining tsp butter in nonstick skillet over medium heat, then cook egg mixture, stirring constantly, until eggs are just scrambled, 3 to 5 minutes. Divide among shells and top with whipped cream and caviar."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d7926f3a00aeb2f1cb72d/6:4/w_274%2Ch_169/350244_hires.jpg",
        "color": 16560516
    }
}