{
    "recipe": {
        "title": "Cedar-Planked Monkfish with Fire-Roasted and Puttanesca Relish ",
        "ingredients": [
            "1 untreated (about 12x10x1-inch) red cedar plank",
            "3 tablespoons olive oil, divided",
            "2 plum tomatoes, halved lengthwise",
            "1 small sweet onion (such as Vidalia or Maui), quartered",
            "1 large red bell pepper, halved lengthwise",
            "1/2 cup Kalamata olives, pitted, coarsely chopped",
            "3 anchovy fillets, finely chopped",
            "2 garlic cloves, chopped",
            "2 tablespoons chopped fresh basil",
            "1 tablespoon drained capers",
            "1 tablespoon white balsamic vinegar or unseasoned rice vinegar",
            "4 6-ounce monkfish fillets",
            "8 long thin slices prosciutto"
        ],
        "instructions": [
            "Fill roasting pan with water. Add cedar plank; weigh down with can or small pot to keep submerged and soak 1 day.",
            "Prepare barbecue (high heat). Brush grill rack with 1 tablespoon oil. Arrange tomatoes, onion, and bell pepper on rimmed baking sheet. Sprinkle with salt and pepper; drizzle with 1 tablespoon oil. Grill vegetables until lightly charred and blistered, turning occasionally with tongs, about 4 minutes for tomatoes and 8 minutes for onion and pepper. Return vegetables to same sheet and cool slightly.",
            "Peel tomato halves; peel pepper halves. Chop all vegetables coarsely and place in medium bowl. Add olives, anchovies, garlic, basil, capers, vinegar, and remaining 1 tablespoon oil. Toss to blend. Season relish to taste with salt and pepper. (Can be made 1 hour ahead. Let stand at room temperature.)",
            "Sprinkle fillets with salt and pepper. Wrap 2 prosciutto slices around each fillet, leaving top and bottom exposed. Secure prosciutto with toothpicks. Press each fillet slightly to flatten top.",
            "Drain cedar plank. Place fillets on plank. Spoon 1/4 cup relish atop each fillet and press to adhere. Place plank on grill; cover barbecue. Cook fish until just opaque in center and thermometer inserted into center registers 120°F, checking occasionally and spraying plank with water if beginning to burn, about 18 minutes. Transfer fish to plates. Serve, passing remaining relish."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de5937b55306961bfd818/6:4/w_274%2Ch_169/232376.jpg"
    }
}