{
    "recipe": {
        "title": "Celery Slaw with Seeds and Dates ",
        "ingredients": [
            "1/4 cup brown mustard seeds",
            "1/3 cup unseasoned rice vinegar",
            "2 tablespoons sugar",
            "1/2 teaspoon kosher salt",
            "1 small shallot, thinly sliced",
            "1/3 cup olive oil",
            "1/4 cup unseasoned rice vinegar",
            "2 tablespoons soy sauce",
            "1 teaspoon sugar",
            "Kosher salt",
            "2 Persian cucumbers",
            "1 bunch mature arugula, tough stems trimmed (about 8 cups)",
            "4 celery stalks, thinly sliced on a diagonal, plus 1 cup celery leaves",
            "10 Medjool dates, sliced",
            "Toasted sesame seeds (for serving)"
        ],
        "instructions": [
            "Pickled mustard seeds: Place mustard seeds in a small heatproof jar or bowl. Bring vinegar, sugar, and salt to a simmer in a small saucepan over medium-high heat, stirring to dissolve sugar and salt. Pour brine over mustard seeds and let cool, about 2 hours.",
            "Place mustard seeds in a small heatproof jar or bowl. Bring vinegar, sugar, and salt to a simmer in a small saucepan over medium-high heat, stirring to dissolve sugar and salt. Pour brine over mustard seeds and let cool, about 2 hours.",
            "Slaw and assembly: Bring shallot and oil to a simmer in a small saucepan over medium heat. Cook 1 minute (watch it carefully; you don’t want the shallot to take on any color). Let cool, then pour oil through a fine-mesh sieve into a small bowl; discard shallot. Whisk shallot oil, vinegar, soy sauce, and sugar in a small bowl to combine; season vinaigrette with salt. Trim ends from cucumbers and very thinly slice lengthwise on a mandoline or with a vegetable peeler or sharp knife into long ribbons. Toss cucumbers, arugula, celery, celery leaves, and dates in a large bowl to combine. Drizzle half of dressing over slaw and add 2 Tbsp. drained pickled mustard seeds (save remaining mustard seeds for another use) and toss again to coat. Taste and season with salt. Transfer slaw to a platter and top with sesame seeds. Serve with remaining vinaigrette alongside.",
            "Bring shallot and oil to a simmer in a small saucepan over medium heat. Cook 1 minute (watch it carefully; you don’t want the shallot to take on any color). Let cool, then pour oil through a fine-mesh sieve into a small bowl; discard shallot.",
            "Whisk shallot oil, vinegar, soy sauce, and sugar in a small bowl to combine; season vinaigrette with salt.",
            "Trim ends from cucumbers and very thinly slice lengthwise on a mandoline or with a vegetable peeler or sharp knife into long ribbons. Toss cucumbers, arugula, celery, celery leaves, and dates in a large bowl to combine.",
            "Drizzle half of dressing over slaw and add 2 Tbsp. drained pickled mustard seeds (save remaining mustard seeds for another use) and toss again to coat. Taste and season with salt.",
            "Transfer slaw to a platter and top with sesame seeds. Serve with remaining vinaigrette alongside.",
            "Do Ahead Mustard seeds can be pickled 1 week ahead. Cover and chill. Vinaigrette can be made 2 days ahead. Cover and chill. Bring to room temperature before using.",
            "Mustard seeds can be pickled 1 week ahead. Cover and chill. Vinaigrette can be made 2 days ahead. Cover and chill. Bring to room temperature before using."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59693925df48bf035a7f5961/6:4/w_274%2Ch_169/celery-slaw-with-seeds-and-dates-recipe-BA-071417.jpg"
    }
}