{
    "recipe": {
        "title": "Celery-Root Bisque with Shiitakes ",
        "ingredients": [
            "2 lb celery root (sometimes called celeriac), peeled with a knife and cut into 1/2-inch cubes",
            "3 celery ribs, chopped",
            "1/2 lb shallots, chopped",
            "1 stick (1/2 cup) unsalted butter",
            "8 cups water",
            "2 teaspoons salt, or to taste",
            "1/4 teaspoon black pepper, or to taste",
            "1/4 cup heavy cream",
            "1 tablespoon fresh lemon juice, or to taste",
            "6 oz fresh shiitakes, stems discarded and caps sliced 1/4 inch thick"
        ],
        "instructions": [
            "Cook celery root, chopped celery, and shallots in 1/2 stick butter in a 5-quart heavy pot over moderate heat, covered, stirring occasionally, until softened but not browned, about 15 minutes. Add water, salt, and pepper and simmer, uncovered, until vegetables are very tender, about 30 minutes.",
            "Purée soup in batches in a blender until smooth (use caution when blending hot liquids), then return to pot.",
            "Stir in cream and reheat bisque over low heat, stirring occasionally, about 5 minutes. Stir in lemon juice.",
            "While bisque is reheating, melt 2 tablespoons butter in a 12-inch heavy skillet over moderately high heat until foam subsides, then sauté mushrooms with salt and pepper to taste, stirring, until golden brown, about 3 minutes. Transfer mushrooms with a slotted spoon to a plate and add remaining 2 tablespoons butter to skillet. Cook butter over moderate heat, swirling skillet, until browned, about 2 minutes, then transfer to a small bowl.",
            "Serve bisque topped with mushrooms and drizzled with brown butter.",
            "Serve bisque topped with mushrooms and drizzled with brown butter."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea155f9a84192308a94ff/6:4/w_274%2Ch_169/107341.jpg",
        "color": 8544968
    }
}