{
    "recipe": {
        "title": "Celery Soup with Sourdough Croutons and Tarragon Swirl ",
        "ingredients": [
            "3 teaspoons olive oil, divided",
            "6 green onions, chopped",
            "4 cups sliced celery with leaves (about 1 pound)",
            "4 cups low-salt chicken broth",
            "12 ounces white-skinned potatoes (about 2 medium), peeled, cut into 1-inch pieces",
            "1/4 teaspoon celery seeds",
            "3 tablespoons whipping cream",
            "3/4 cup 1/3-inch cubes sourdough baguette (about 1 1/2 ounces)",
            "2 tablespoons plain nonfat yogurt",
            "1 teaspoon minced fresh tarragon plus 6 sprigs for garnish"
        ],
        "instructions": [
            "Heat 1 teaspoon olive oil in large pot over medium-high heat. Add chopped green onions; sauté 2 minutes. Add sliced celery with leaves, low-salt chicken broth, whiteskinned potato pieces, and celery seeds; bring to boil. Reduce heat to medium; cover and simmer until vegetables are tender, about 15 minutes. Working in batches, puree soup in blender until smooth. Return puree to pot. Stir in 3 tablespoons whipping cream. Season to taste with salt and freshly ground black pepper. Heat remaining 2 teaspoons olive oil in small nonstick skillet over medium high heat. Add sourdough baguette cubes; sauté until brown and crisp, 3 to 4 minutes. Season croutons to taste with salt and freshly ground black pepper. Mix 2 tablespoons plain nonfat yogurt and 1 teaspoon minced fresh tarragon in small bowl. Rewarm soup. Divide soup equally among 6 bowls. Drizzle each serving with tarragon yogurt sauce. Sprinkle each serving with sourdough croutons. Garnish with tarragon sprigs and serve immediately.",
            "Heat 1 teaspoon olive oil in large pot over medium-high heat. Add chopped green onions; sauté 2 minutes. Add sliced celery with leaves, low-salt chicken broth, whiteskinned potato pieces, and celery seeds; bring to boil. Reduce heat to medium; cover and simmer until vegetables are tender, about 15 minutes.",
            "Working in batches, puree soup in blender until smooth. Return puree to pot. Stir in 3 tablespoons whipping cream. Season to taste with salt and freshly ground black pepper.",
            "Heat remaining 2 teaspoons olive oil in small nonstick skillet over medium high heat. Add sourdough baguette cubes; sauté until brown and crisp, 3 to 4 minutes. Season croutons to taste with salt and freshly ground black pepper.",
            "Mix 2 tablespoons plain nonfat yogurt and 1 teaspoon minced fresh tarragon in small bowl. Rewarm soup. Divide soup equally among 6 bowls. Drizzle each serving with tarragon yogurt sauce. Sprinkle each serving with sourdough croutons. Garnish with tarragon sprigs and serve immediately."
        ],
        "picture_link": null
    }
}