{
    "recipe": {
        "title": "Celery Root Purée with Toasted Hazelnuts ",
        "ingredients": [
            "3 pounds celery root, peeled, cut into 1/2\" cubes",
            "3 pounds russet potatoes, peeled, cut into 1\" cubes",
            "Kosher salt",
            "2/3 cup heavy cream",
            "2/3 cup whole milk",
            "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2\" cubes",
            "Freshly ground black pepper",
            "1 tablespoon good-quality hazelnut oil",
            "1/4 cup coarsely chopped toasted hazelnuts",
            "A food mill or potato ricer"
        ],
        "instructions": [
            "Place celery root and potatoes in a large heavy pot. Add cold water to cover; season with salt. Bring to a boil over medium-high heat. Reduce heat; simmer until vegetables can be pierced with a fork, 20-25 minutes. Drain vegetables well. Pass vegetables through food mill or potato ricer into same pot. Meanwhile, bring cream and milk just to a simmer in a medium saucepan; remove from heat. Stir vegetable purée constantly over medium-low heat until excess moisture evaporates, about 2 minutes. Stir butter into purée a few pieces at a time, blending between additions. Remove from heat; slowly fold in cream mixture until a smooth purée forms. Season to taste with salt and pepper. DO AHEAD: Purée can be made 1 day ahead. Cover; chill. Rewarm in a microwave or in a heatproof bowl set over a large pot of simmering water. Strain hot purée through a medium-mesh sieve into a serving bowl (this makes the texture especially smooth and creamy). Drizzle with oil; scatter hazelnuts over.",
            "Place celery root and potatoes in a large heavy pot. Add cold water to cover; season with salt. Bring to a boil over medium-high heat. Reduce heat; simmer until vegetables can be pierced with a fork, 20-25 minutes.",
            "Drain vegetables well. Pass vegetables through food mill or potato ricer into same pot.",
            "Meanwhile, bring cream and milk just to a simmer in a medium saucepan; remove from heat. Stir vegetable purée constantly over medium-low heat until excess moisture evaporates, about 2 minutes.",
            "Stir butter into purée a few pieces at a time, blending between additions. Remove from heat; slowly fold in cream mixture until a smooth purée forms. Season to taste with salt and pepper. DO AHEAD: Purée can be made 1 day ahead. Cover; chill. Rewarm in a microwave or in a heatproof bowl set over a large pot of simmering water.",
            "Strain hot purée through a medium-mesh sieve into a serving bowl (this makes the texture especially smooth and creamy). Drizzle with oil; scatter hazelnuts over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b05c2dfca98987608b0de4/6:4/w_274%2Ch_169/51123140_celery-root-puree_1x1.jpg"
    }
}