{
    "recipe": {
        "title": "Chai Doughnuts with Spiced Sugar ",
        "ingredients": [
            "1 cup sugar",
            "1/2 teaspoon ground cinnamon",
            "1/2 teaspoon kosher salt",
            "1/8 teaspoon ground cardamom",
            "1/8 teaspoon ground ginger",
            "1/8 teaspoon ground nutmeg",
            "2 cups all-purpose flour",
            "1 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "1/2 teaspoon kosher salt",
            "1/2 teaspoon ground cinnamon",
            "1/8 teaspoon ground cardamom",
            "1/8 teaspoon ground ginger",
            "1/8 teaspoon ground nutmeg",
            "1/2 cup sugar",
            "2 tablespoons unsalted butter, room temperature",
            "1 large egg, room temperature",
            "1/3 cup buttermilk",
            "2 tablespoons freshly brewed chai tea",
            "2 quarts canola oil (for frying)",
            "A 3\" round cutter, 1\" round cutter, deep-fry thermometer"
        ],
        "instructions": [
            "Make the Spiced Sugar: Whisk sugar, cinnamon, salt, cardamom, ginger, and nutmeg in a large bowl until well combined.",
            "Whisk sugar, cinnamon, salt, cardamom, ginger, and nutmeg in a large bowl until well combined.",
            "Make the doughnuts: Combine flour, baking powder, baking soda, salt, cinnamon, cardamom, ginger, and nutmeg in a large bowl. Beat sugar and butter in the bowl of a stand mixer fitted with the paddle attachment on medium speed until smooth, about 3 minutes. Add egg and continue to beat, scraping down sides of bowl as needed, until incorporated. Reduce speed to low and gradually add buttermilk and tea, beating just until combined. Gradually add dry ingredients and beat just until dough comes together. Turn out dough onto a large piece of parchment paper and cover with a second sheet of parchment. Using a rolling pin, roll dough between parchment sheets to about 1/3\" thick. Transfer dough in parchment to a rimmed baking sheet and freeze until firm, about 20 minutes. Peel off top sheet of parchment. Working on bottom sheet, punch out as many rounds as you can with 3\" cutter, then use 1\" cutter to punch out center of each round. Gather doughnut holes and scraps and re-roll; repeat process 3–4 times until all dough has been used (you should have 12 doughnuts). Place doughnuts on a second parchment-lined baking sheet and freeze until slightly chilled, about 5 minutes. Pour oil into a heavy-duty pot to a depth of 2\" and fit pot with deep-fry thermometer. Heat oil to 375ºF. Working in batches, fry doughnuts until deep golden brown, about 1 minute per side. Transfer to a wire rack lined with paper towels and let cool 2–3 minutes. Toss doughnuts in Spiced Sugar.",
            "Combine flour, baking powder, baking soda, salt, cinnamon, cardamom, ginger, and nutmeg in a large bowl.",
            "Beat sugar and butter in the bowl of a stand mixer fitted with the paddle attachment on medium speed until smooth, about 3 minutes.",
            "Add egg and continue to beat, scraping down sides of bowl as needed, until incorporated. Reduce speed to low and gradually add buttermilk and tea, beating just until combined. Gradually add dry ingredients and beat just until dough comes together.",
            "Turn out dough onto a large piece of parchment paper and cover with a second sheet of parchment. Using a rolling pin, roll dough between parchment sheets to about 1/3\" thick. Transfer dough in parchment to a rimmed baking sheet and freeze until firm, about 20 minutes.",
            "Peel off top sheet of parchment. Working on bottom sheet, punch out as many rounds as you can with 3\" cutter, then use 1\" cutter to punch out center of each round. Gather doughnut holes and scraps and re-roll; repeat process 3–4 times until all dough has been used (you should have 12 doughnuts). Place doughnuts on a second parchment-lined baking sheet and freeze until slightly chilled, about 5 minutes.",
            "Pour oil into a heavy-duty pot to a depth of 2\" and fit pot with deep-fry thermometer. Heat oil to 375ºF. Working in batches, fry doughnuts until deep golden brown, about 1 minute per side. Transfer to a wire rack lined with paper towels and let cool 2–3 minutes. Toss doughnuts in Spiced Sugar."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5621211253de6d0d5cdef6d1/6:4/w_274%2Ch_169/EP_10122015_donuts_0004.jpg"
    }
}