{
    "recipe": {
        "title": "Chalupas with Chorizo ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "3/4 cup plus 2 tablespoons masa (corn tortilla mix)*",
            "3/4 cup plus 2 tablespoons all purpose",
            "3/4 teaspoon salt",
            "1/4 cup (1/2 stick) unsalted butter, cut into 1/2-inch cubes, room temperature",
            "3 tablespoons solid vegetable shortening, room temperature",
            "1/4 cup (or more) warm water",
            "2 teaspoons canola oil",
            "1/2 cup minced onion",
            "12 ounces fresh Mexican chorizo sausage, casings removed",
            "1/4 cup water",
            "2 heaping tablespoons tomato paste",
            "Purchased tomato salsa",
            "Purchased salsa verde (green tomatillo salsa)",
            "1 avocado, peeled, pitted, cut into 1/4-inch cubes",
            "Fresh cilantro leaves"
        ],
        "instructions": [
            "Spray three 12-cup mini muffin pans with nonstick spray. Preheat oven to 350°F. Combine masa, flour, and 3/4 teaspoon salt in processor; using on/off turns, process to blend. Add butter. Add shortening by rounded teaspoonfuls. Using on/off turns, process until mixture resembles coarse meal. Add 1/4 cup warm water and process just until moist clumps form, adding more water by teaspoonfuls if dry.",
            "Transfer dough to work surface; form into ball. Roll scant tablespoonful dough between palms into 1-inch round. Flatten into disk, then press onto bottom and up sides of 1 muffin cup, keeping top edge of dough inside cup (do not form any overhang). Repeat with remaining dough.",
            "Bake crusts until dry to touch and easy to remove from cups, about 35 minutes. Cool on rack. DO AHEAD: Can be made 1 day ahead. Store at room temperature in airtight container.",
            "For filling and garnish: Heat oil in heavy medium nonstick skillet over medium-high heat. Add onion and sauté until soft, 2 to 3 minutes. Add chorizo and cook until browned and crumbly, breaking up sausage with wooden spoon or fork, about 5 minutes. Add 1/4 cup water and tomato paste. Stir until thickened, about 2 minutes. DO AHEAD Can be made 1 day ahead. Cover and chill. Rewarm filling before continuing. Divide filling among crusts (about 1 teaspoon each). Spoon 1/2 teaspoon tomato salsa atop half of chalupas and 1/2 teaspoon salsa verde atop remaining chalupas. Garnish with avocado and cilantro leaves. Also known as masa harina; available at many supermarkets and at Latin markets.",
            "Heat oil in heavy medium nonstick skillet over medium-high heat. Add onion and sauté until soft, 2 to 3 minutes. Add chorizo and cook until browned and crumbly, breaking up sausage with wooden spoon or fork, about 5 minutes. Add 1/4 cup water and tomato paste. Stir until thickened, about 2 minutes. DO AHEAD Can be made 1 day ahead. Cover and chill. Rewarm filling before continuing.",
            "Divide filling among crusts (about 1 teaspoon each). Spoon 1/2 teaspoon tomato salsa atop half of chalupas and 1/2 teaspoon salsa verde atop remaining chalupas. Garnish with avocado and cilantro leaves.",
            "Also known as masa harina; available at many supermarkets and at Latin markets.",
            "Also known as masa harina; available at many supermarkets and at Latin markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d79727b55306961bf3642/6:4/w_274%2Ch_169/350815_hires.jpg",
        "color": 13905984
    }
}