{
    "recipe": {
        "title": "Challah Bread ",
        "ingredients": [
            "400 grams (1 2/3 cups) cool room-temperature water",
            "40 grams (3 tablespoons plus 2 teaspoons) fresh yeast or 15 grams (1 tablespoon plus 1 3/4 teaspoons) active dry yeast",
            "1 kilo (7 cups) all-purpose flour (sifted, 11.7%), plus extra for shaping",
            "2 large eggs",
            "100 grams (1/2 cup) granulated sugar",
            "15 grams (1 tablespoon) fine salt",
            "75 grams (5 tablespoons) sunflower oil, canola oil, or unsalted butter (at room temperature)",
            "1 large egg",
            "1 tablespoon water",
            "Pinch of fine salt",
            "90 grams (2/3 cup) nigella, poppy, or sesame seeds (or a combination)"
        ],
        "instructions": [
            "Pour the cool water into the bowl of a stand mixer fitted with the bread hook. Crumble the yeast into the water and use your fingers to rub and dissolve it; if using active dry yeast, whisk the yeast into the water. Add the flour, eggs, sugar, salt, and oil.",
            "Mix the dough on low speed to combine the ingredients, stopping the mixer if the dough climbs up the hook or if you need to work in dry ingredients that have settled on the bottom of the bowl. Scrape the bottom and sides of the bowl as needed. It should take about 2 minutes for the dough to come together. If there are lots of dry bits in the bottom of the bowl that just aren’t getting worked in, add a tablespoon or two of water. On the other hand, if the dough looks softer than in the photo opposite, add a few pinches of flour.",
            "[Note: Eventually you’ll be able to feel the dough and know if you need to add water or flour; it’s always better to adjust the ratios when the dough is first coming together at the beginning of mixing rather than wait until the end of the kneading process, since it takes longer for ingredient additions to get worked into the dough mass at this later point and you risk overworking the dough.]",
            "Increase the speed to medium and knead until a smooth dough forms, about 4 minutes. You want the dough to be a bit firm.",
            "Stretch and fold the dough: Lightly dust your work surface with a little flour, and use a dough scraper to transfer the dough from the mixing bowl to the floured surface. Use your palms to push and tear the top of the dough away from you in one stroke, and then fold that section onto the middle of the dough. Give the dough a quarter turn and repeat the push/tear/fold process for about 1 minute. Then push and pull the dough against the work surface to round it into a ball.",
            "Lightly dust your work surface with a little flour, and use a dough scraper to transfer the dough from the mixing bowl to the floured surface. Use your palms to push and tear the top of the dough away from you in one stroke, and then fold that section onto the middle of the dough. Give the dough a quarter turn and repeat the push/tear/fold process for about 1 minute. Then push and pull the dough against the work surface to round it into a ball.",
            "Let the dough rise: Lightly dust a bowl with flour, add the dough, sprinkle just a little flour on top of the dough, and cover the bowl with plastic wrap. Set the bowl aside at room temperature until the dough has risen by about 70%, about 40 minutes (this will depend on how warm your room is—when the dough proofs in a warmer room it will take less time than in a cooler room).",
            "Lightly dust a bowl with flour, add the dough, sprinkle just a little flour on top of the dough, and cover the bowl with plastic wrap. Set the bowl aside at room temperature until the dough has risen by about 70%, about 40 minutes (this will depend on how warm your room is—when the dough proofs in a warmer room it will take less time than in a cooler room).",
            "Divide the dough: Use a plastic dough scraper to gently lift the dough out of the bowl and transfer it to a lightly floured work surface (take care not to press out the trapped gas in the dough). Gently pull the dough into a rectangular shape. Use a bench scraper or a chef’s knife to divide the dough into 3 equal horizontal strips (you can use a kitchen scale to weigh each piece if you want to be exact). Then divide each piece into 3 smaller equal parts crosswise so you end up with a total of 9 pieces. [Note: It is best not to have an overly floured work surface when rolling dough into cylinders, since the flour makes it hard for the dough to gain enough traction to be shaped into a rope.]",
            "Use a plastic dough scraper to gently lift the dough out of the bowl and transfer it to a lightly floured work surface (take care not to press out the trapped gas in the dough). Gently pull the dough into a rectangular shape. Use a bench scraper or a chef’s knife to divide the dough into 3 equal horizontal strips (you can use a kitchen scale to weigh each piece if you want to be exact). Then divide each piece into 3 smaller equal parts crosswise so you end up with a total of 9 pieces. [Note: It is best not to have an overly floured work surface when rolling dough into cylinders, since the flour makes it hard for the dough to gain enough traction to be shaped into a rope.]",
            "Shape the dough: Set a piece of dough lengthwise on your work surface. Use the palm of your hand to flatten the dough into a flat rectangle; then fold the top portion over and use your palm to press the edge into the flat part of the dough. Fold and press 3 more times—the dough will end up as a cylinder about 7 inches long. Set this piece aside and repeat with the other 8 pieces. Return to the first piece of dough and use both hands to roll the cylinder back and forth to form a long rope, pressing down lightly when you get to the ends of the rope so they are flattened. The rope should be about 14 inches long with tapered ends. Repeat with the remaining 8 cylinders. Lightly flour the long ropes (this allows for the strands of the braid to stay somewhat separate during baking; otherwise, they’d fuse together). Pinch the ends of 3 ropes together at the top (you can place a weight on top of the ends to hold them in place) and lightly flour the dough. Braid the dough, lifting each piece up and over so the braid is more stacked than it is long; you also want it to be fatter and taller in the middle, and more tapered at the ends. When you get to the end of the ropes and there is nothing left to braid, use your palm to press and seal the ends together, or, for a round festive challah, join both ends of the challah together to form a circle, then flip over so the more attractive side is showing. Repeat with the remaining 6 ropes, creating 3 braided challahs. Place the challahs on parchment paper–lined rimmed sheet pans, cover them with a kitchen towel (or place them inside an unscented plastic bag), and set them aside in a warm, draft-free spot to rise until the loaves have doubled in volume, about 40 minutes (depending on how warm the room is). Adjust the oven racks to the upper-middle and lower-middle positions and preheat the oven to 425°F.",
            "Set a piece of dough lengthwise on your work surface. Use the palm of your hand to flatten the dough into a flat rectangle; then fold the top portion over and use your palm to press the edge into the flat part of the dough. Fold and press 3 more times—the dough will end up as a cylinder about 7 inches long. Set this piece aside and repeat with the other 8 pieces.",
            "Return to the first piece of dough and use both hands to roll the cylinder back and forth to form a long rope, pressing down lightly when you get to the ends of the rope so they are flattened. The rope should be about 14 inches long with tapered ends. Repeat with the remaining 8 cylinders. Lightly flour the long ropes (this allows for the strands of the braid to stay somewhat separate during baking; otherwise, they’d fuse together).",
            "Pinch the ends of 3 ropes together at the top (you can place a weight on top of the ends to hold them in place) and lightly flour the dough. Braid the dough, lifting each piece up and over so the braid is more stacked than it is long; you also want it to be fatter and taller in the middle, and more tapered at the ends. When you get to the end of the ropes and there is nothing left to braid, use your palm to press and seal the ends together, or, for a round festive challah, join both ends of the challah together to form a circle, then flip over so the more attractive side is showing. Repeat with the remaining 6 ropes, creating 3 braided challahs. Place the challahs on parchment paper–lined rimmed sheet pans, cover them with a kitchen towel (or place them inside an unscented plastic bag), and set them aside in a warm, draft-free spot to rise until the loaves have doubled in volume, about 40 minutes (depending on how warm the room is).",
            "Adjust the oven racks to the upper-middle and lower-middle positions and preheat the oven to 425°F.",
            "Test the dough: Once the challah loaves have roughly doubled in size, do the press test: Press your finger lightly into the dough, remove it, and see if the depression fills in by half. If the depression fills back in quickly and completely, the dough needs more time to rise; if you press the dough and it slightly deflates, the dough has overproofed and will be heavier and less airy after baking.",
            "Once the challah loaves have roughly doubled in size, do the press test: Press your finger lightly into the dough, remove it, and see if the depression fills in by half. If the depression fills back in quickly and completely, the dough needs more time to rise; if you press the dough and it slightly deflates, the dough has overproofed and will be heavier and less airy after baking.",
            "Bake the loaves: Make the egg wash by mixing the egg, water, and salt together in a small bowl. Gently brush the entire surface of the loaves with egg wash, taking care not to let it pool in the creases of the braids. You want a nice thin coating. Generously sprinkle the loaves with the seeds. [Note: At the bakery, we dip the egg-washed dough facedown into a large tray of seeds and then roll it from side to side to heavily coat the bread. If you just sprinkle a few pinches over the top, it won’t look very generous or appealing after the bread has expanded and baked, so be generous with the seeds whether sprinkling or rolling.] Bake for 15 minutes. Rotate the bottom sheet pan to the top and the top sheet pan to the bottom (turning each sheet around as you go), and bake until the loaves are golden brown, about 10 minutes longer. Remove the loaves from the oven and set them aside to cool completely on the sheet pans.",
            "Make the egg wash by mixing the egg, water, and salt together in a small bowl. Gently brush the entire surface of the loaves with egg wash, taking care not to let it pool in the creases of the braids. You want a nice thin coating. Generously sprinkle the loaves with the seeds. [Note: At the bakery, we dip the egg-washed dough facedown into a large tray of seeds and then roll it from side to side to heavily coat the bread. If you just sprinkle a few pinches over the top, it won’t look very generous or appealing after the bread has expanded and baked, so be generous with the seeds whether sprinkling or rolling.]",
            "Bake for 15 minutes. Rotate the bottom sheet pan to the top and the top sheet pan to the bottom (turning each sheet around as you go), and bake until the loaves are golden brown, about 10 minutes longer. Remove the loaves from the oven and set them aside to cool completely on the sheet pans."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57e04d255380fbcb1621edf8/6:4/w_274%2Ch_169/seeded-challah-uri-scheft-091916.jpg",
        "color": 13897745
    }
}