{
    "recipe": {
        "title": "Chanterelle, Radicchio, and Pancetta Pizzas ",
        "ingredients": [
            "6 tablespoons extra-virgin olive oil, divided",
            "8 ounces fresh chanterelles, cleaned, sliced",
            "1 1/2 tablespoons plus 2 teaspoons finely chopped fresh thyme, divided",
            "1 teaspoon fresh lemon juice",
            "3 cups thinly sliced radicchio (about 1 small head)",
            "1 large leek (white and pale green parts only), halved lengthwise, thinly sliced crosswise",
            "1 1/2 pounds fresh pizza dough*",
            "1 cup (packed) Italian Fontina (such as Val d'Aosta), coarsely grated (about 4 ounces)",
            "1 8-ounce ball fresh water-packed mozzarella cheese,** drained, halved, thinly sliced",
            "2 ounces thinly sliced pancetta (Italian bacon), very coarsely chopped, divided"
        ],
        "instructions": [
            "Place pizza stone in oven. Preheat oven to 500°F. Heat 4 tablespoons oil in large skillet over high heat. Add mushrooms; sprinkle with salt and pepper. Sauté until beginning to brown, about 5 minutes. Add 1/2 tablespoon thyme; stir 30 seconds. Mix in 1 teaspoon lemon juice and season to taste with salt and pepper. Transfer to small bowl. Heat remaining 2 tablespoons oil in same skillet over high heat. Add radicchio, leek, and 1 tablespoon thyme; sprinkle with salt and pepper. Sauté vegetables until just wilted, about 2 minutes. Transfer to medium bowl. Divide pizza dough in half. Stretch and roll out each half on floured work surface to 101/2-inch round. Scatter half of Fontina and half of mozzarella on each round. Top each with radicchio mixture, then mushroom mixture. Sprinkle each with half of pancetta and 1 teaspoon thyme. Bake pizzas, 1 at a time, on pizza stone until crisp and golden, about 12 minutes. *Fresh pizza dough can be found at Italian markets and some specialty foods stores. **Sold at many supermarkets and at Italian markets and specialty foods stores. If unavailable, regular mozzarella can be substituted.",
            "Place pizza stone in oven. Preheat oven to 500°F. Heat 4 tablespoons oil in large skillet over high heat. Add mushrooms; sprinkle with salt and pepper. Sauté until beginning to brown, about 5 minutes. Add 1/2 tablespoon thyme; stir 30 seconds. Mix in 1 teaspoon lemon juice and season to taste with salt and pepper. Transfer to small bowl.",
            "Heat remaining 2 tablespoons oil in same skillet over high heat. Add radicchio, leek, and 1 tablespoon thyme; sprinkle with salt and pepper. Sauté vegetables until just wilted, about 2 minutes. Transfer to medium bowl.",
            "Divide pizza dough in half. Stretch and roll out each half on floured work surface to 101/2-inch round. Scatter half of Fontina and half of mozzarella on each round. Top each with radicchio mixture, then mushroom mixture. Sprinkle each with half of pancetta and 1 teaspoon thyme.",
            "Bake pizzas, 1 at a time, on pizza stone until crisp and golden, about 12 minutes.",
            "*Fresh pizza dough can be found at Italian markets and some specialty foods stores.",
            "**Sold at many supermarkets and at Italian markets and specialty foods stores. If unavailable, regular mozzarella can be substituted."
        ],
        "picture_link": null
    }
}