{
    "recipe": {
        "title": "Charred Steak and Broccolini with Cheese Sauce ",
        "ingredients": [
            "2 (1 1/2\"–2\" thick) boneless New York strip steaks",
            "1 tsp. freshly ground black pepper",
            "2 1/4 tsp. kosher salt, divided",
            "2 bunches broccolini (about 1 lb. total), trimmed, halved lengthwise",
            "1 Tbsp. extra-virgin olive oil",
            "3 oz. coarsely grated Gruyère (about 1½ cups)",
            "3 oz. cream cheese, cut into pieces",
            "3/4 cup whole milk",
            "1/4 tsp. freshly grated or ground nutmeg",
            "Large pinch of cayenne pepper",
            "Flaky sea salt"
        ],
        "instructions": [
            "Preheat oven to 450°F. Season steaks all over with pepper and 1 1/2 tsp. kosher salt. Let sit 10 minutes. Meanwhile, toss broccolini, oil, and 1/2 tsp. kosher salt on a rimmed baking sheet to combine. Spread out in a single layer and set aside. Using tongs if needed, hold both steaks together fat cap side down in a large ovenproof skillet, then set over high heat. Cook until pan is coated in fat, about 4 minutes. Lay steaks flat and continue to sear until deeply browned, about 3 minutes per side. Transfer skillet to oven and roast steaks until an instant-read thermometer inserted into the thickest part registers 120°F for medium-rare, 6–8 minutes. Transfer to a cutting board and let rest 10 minutes before slicing. While steaks are resting, roast reserved broccolini until crisp-tender and lightly charred, about 10 minutes. Heat cheese, cream cheese, milk, nutmeg, cayenne, and remaining 1/4 tsp. kosher salt in a medium saucepan over medium, whisking constantly, until a smooth sauce forms, about 5 minutes. Divide sauce among plates. Top with broccolini and steaks; sprinkle with sea salt.",
            "Preheat oven to 450°F. Season steaks all over with pepper and 1 1/2 tsp. kosher salt. Let sit 10 minutes.",
            "Meanwhile, toss broccolini, oil, and 1/2 tsp. kosher salt on a rimmed baking sheet to combine. Spread out in a single layer and set aside.",
            "Using tongs if needed, hold both steaks together fat cap side down in a large ovenproof skillet, then set over high heat. Cook until pan is coated in fat, about 4 minutes. Lay steaks flat and continue to sear until deeply browned, about 3 minutes per side. Transfer skillet to oven and roast steaks until an instant-read thermometer inserted into the thickest part registers 120°F for medium-rare, 6–8 minutes. Transfer to a cutting board and let rest 10 minutes before slicing.",
            "While steaks are resting, roast reserved broccolini until crisp-tender and lightly charred, about 10 minutes.",
            "Heat cheese, cream cheese, milk, nutmeg, cayenne, and remaining 1/4 tsp. kosher salt in a medium saucepan over medium, whisking constantly, until a smooth sauce forms, about 5 minutes.",
            "Divide sauce among plates. Top with broccolini and steaks; sprinkle with sea salt."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5bec8dd21e98382c66befe18/6:4/w_274%2Ch_169/NOVEMBER-COOK-THIS-NOW-steak-recipe-01112018.jpg"
    }
}