{
    "recipe": {
        "title": "Charred Octopus Taco with Harissa, Chorizo Crushed Potatoes, and Pickled Ramps ",
        "ingredients": [
            "1 3-pound whole fresh octopus, cleaned",
            "12 medium garlic cloves, crushed",
            "2 ounces fresh thyme sprigs (about 2 small bunches)",
            "2 liters olive oil",
            "1/2 ounce dried pasilla chiles",
            "1/2 ounce dried guajillo chiles",
            "1 tablespoon olive oil",
            "3 medium red onions, diced, salted, and strained for 2 hours to release water",
            "1/2 ounce cumin seeds, toasted and ground",
            "1/2 ounce coriander seeds, toasted and ground",
            "1/2 ounce caraway seeds, toasted and ground",
            "2 tablespoons lemon juice",
            "1/2 teaspoon kosher salt",
            "1 cup white balsamic vinegar",
            "1 cup sugar",
            "1 tablespoon kosher salt",
            "1/2 pound ramps, cleaned, green leaves removed and reserved for another use",
            "1 pound Yukon Gold potatoes, peeled and cut into 1/2-inch cubes",
            "3 tablespoons olive oil",
            "1 pound fresh Mexican chorizo, removed from casing",
            "Olive oil, for grilling",
            "1/2 teaspoon kosher salt",
            "1/4 teaspoon black pepper",
            "12 flour tortillas"
        ],
        "instructions": [
            "Preheat oven to 275°F. Place the octopus, garlic, and thyme in a 5-quart pot or Dutch oven. Pour olive oil over (octopus should be submerged) and bring to a simmer over medium heat. Cover the pot with foil, place in oven, and cook until tender, about 1 1/2 to 2 hours. Check the octopus periodically for tenderness by inserting a paring knife into the thickest part of an arm. When fully cooked, the knife should easily pierce the flesh. Remove from oven and let sit covered until the octopus comes to room temperature. Discard thyme and garlic. Remove and discard head, separate arms, and gently remove the purple skin.",
            "Make the harissa: Toast the chiles in a dry skillet over medium-high heat for 1 to 2 minutes until fragrant. Let cool and remove the stems and seeds. Bring 1/2 cup water to a boil in a small pot. Add chiles and simmer until tender, about 3 to 5 minutes. Purée chiles and water in a blender until smooth, scrape out and reserve. Heat the olive oil in a skillet over medium heat. Sweat the onions until tender and lightly browned, 8 to 10 minutes. Add the onions, ground spices, lemon juice, and salt to the blender with 3 tablespoons of the pepper purée. Blend all ingredients until smooth. Strain, taste, and adjust seasoning. Harissa can be made 1 day in advance.",
            "Toast the chiles in a dry skillet over medium-high heat for 1 to 2 minutes until fragrant. Let cool and remove the stems and seeds. Bring 1/2 cup water to a boil in a small pot. Add chiles and simmer until tender, about 3 to 5 minutes. Purée chiles and water in a blender until smooth, scrape out and reserve.",
            "Heat the olive oil in a skillet over medium heat. Sweat the onions until tender and lightly browned, 8 to 10 minutes. Add the onions, ground spices, lemon juice, and salt to the blender with 3 tablespoons of the pepper purée. Blend all ingredients until smooth. Strain, taste, and adjust seasoning. Harissa can be made 1 day in advance.",
            "Pickle the ramps: Bring the vinegar, sugar, salt, and 1 cup water to a boil and stir until dissolved. Place the ramps in a heatproof glass container and pour vinegar mixture over. Let sit until ramps come to room temperature, then refrigerate 1 hour. Ramps can be pickled 1 day in advance.",
            "Bring the vinegar, sugar, salt, and 1 cup water to a boil and stir until dissolved. Place the ramps in a heatproof glass container and pour vinegar mixture over. Let sit until ramps come to room temperature, then refrigerate 1 hour. Ramps can be pickled 1 day in advance.",
            "Cook the potatoes and chorizo: Start the potatoes in a medium pot with cold salted water and bring to a boil. Reduce heat and simmer until potatoes are tender, about 5 to 6 minutes. Drain, crush with a fork, and reserve. Heat the olive oil in a large skillet over medium heat and sauté the chorizo, breaking into bits, until browned and cooked through. Strain and reserve oil.",
            "Start the potatoes in a medium pot with cold salted water and bring to a boil. Reduce heat and simmer until potatoes are tender, about 5 to 6 minutes. Drain, crush with a fork, and reserve.",
            "Heat the olive oil in a large skillet over medium heat and sauté the chorizo, breaking into bits, until browned and cooked through. Strain and reserve oil.",
            "Assemble the tacos: Heat a grill or grill pan over medium-high heat. Rub the octopus with a little olive oil and grill until lightly charred, about 4 to 5 minutes per side. Slice octopus into bite-size pieces. Meanwhile, heat the reserved chorizo oil and potatoes in a large skillet over medium-high heat. Season with salt and pepper. Add the cooked chorizo and toss to combine. Taste and adjust seasoning. Warm the tortillas. Divide the crushed potatoes between the tortillas, top with octopus, a spoonful of harissa, and 2 or 3 pickled ramps.",
            "Heat a grill or grill pan over medium-high heat. Rub the octopus with a little olive oil and grill until lightly charred, about 4 to 5 minutes per side. Slice octopus into bite-size pieces. Meanwhile, heat the reserved chorizo oil and potatoes in a large skillet over medium-high heat. Season with salt and pepper. Add the cooked chorizo and toss to combine. Taste and adjust seasoning.",
            "Warm the tortillas. Divide the crushed potatoes between the tortillas, top with octopus, a spoonful of harissa, and 2 or 3 pickled ramps."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac3a546529d92b2c039503/6:4/w_274%2Ch_169/51235670_charred-octopus-taco_1x1.jpg"
    }
}