{
    "recipe": {
        "title": "Châteaubriand ",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil",
            "1 (10-ounce) center-cut beef tenderloin",
            "Kosher salt and freshly ground pepper to taste",
            "1 large shallot, peeled and chopped",
            "1/2 cup red wine (whatever you're drinking)",
            "2 tablespoons unsalted butter, chilled"
        ],
        "instructions": [
            "1. Preheat oven to 450°F. 2. In an ovenproof, heavy-bottomed frying pan, heat the olive oil over high heat until hot but not smoking. 3. Season the meat with salt and pepper, then brown it in the pan on all sides. 4. Transfer the pan to the oven and roast until the meat's internal temperature reaches 130°F (for rare), 10 to 15 minutes. Remove the pan from the oven. 5. Transfer the meat to a cutting board and tent it with foil. 6. Pour all but a thin film of fat from the pan. 7. Add the shallot and saut it over medium-low heat until golden, 2 to 3 minutes. 8. Add the wine and raise the heat to high, scraping up any brown bits from the pan. 9. When the sauce is syrupy (about 5 minutes), turn off the heat and whisk in the butter. 10. Carve the meat in thick slices and drizzle with the pan sauce.",
            "1. Preheat oven to 450°F.",
            "2. In an ovenproof, heavy-bottomed frying pan, heat the olive oil over high heat until hot but not smoking.",
            "3. Season the meat with salt and pepper, then brown it in the pan on all sides.",
            "4. Transfer the pan to the oven and roast until the meat's internal temperature reaches 130°F (for rare), 10 to 15 minutes. Remove the pan from the oven.",
            "5. Transfer the meat to a cutting board and tent it with foil.",
            "6. Pour all but a thin film of fat from the pan.",
            "7. Add the shallot and saut it over medium-low heat until golden, 2 to 3 minutes.",
            "8. Add the wine and raise the heat to high, scraping up any brown bits from the pan.",
            "9. When the sauce is syrupy (about 5 minutes), turn off the heat and whisk in the butter.",
            "10. Carve the meat in thick slices and drizzle with the pan sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9aedf9a84192308a1da4/6:4/w_274%2Ch_169/241304_hires.jpg"
    }
}