{
    "recipe": {
        "title": "Cheddar and Chive Yorkshire Pudding ",
        "ingredients": [
            "8 tablespoons melted roast beef fat reserved from rib roast pan drippings or 8 tablespoons (1 stick) unsalted butter, melted, divided",
            "6 large eggs",
            "2 cups whole milk",
            "2 cups all purpose flour",
            "1 teaspoon salt",
            "1/2 cup (packed) finely grated sharp cheddar cheese",
            "1/3 cup (generous) chopped fresh chives"
        ],
        "instructions": [
            "Position rack in center of oven; preheat to 450°F. Place large rimmed baking sheet in oven. Brush ten 3/4-cup glass baking dishes or ramekins with 2 tablespoons fat or butter. Whisk eggs to blend in large bowl. Add milk and whisk until well blended. Whisk flour and salt in medium bowl to blend. Gradually whisk flour mixture and remaining 6 tablespoons fat or butter into egg mixture until well blended (some small lumps will remain). Whisk in cheese and chives; divide batter among baking dishes (about 1/2 cup batter for each). Place baking dishes on hot baking sheet in oven. Bake until Yorkshire puddings are puffed and begin to brown, about 25 minutes. Reduce oven temperature to 350°F and bake until puddings are brown, puffed, and crisp around sides, about 20 minutes longer. Transfer Yorkshire puddings to plates. Serve immediately.",
            "Position rack in center of oven; preheat to 450°F. Place large rimmed baking sheet in oven. Brush ten 3/4-cup glass baking dishes or ramekins with 2 tablespoons fat or butter.",
            "Whisk eggs to blend in large bowl. Add milk and whisk until well blended. Whisk flour and salt in medium bowl to blend. Gradually whisk flour mixture and remaining 6 tablespoons fat or butter into egg mixture until well blended (some small lumps will remain). Whisk in cheese and chives; divide batter among baking dishes (about 1/2 cup batter for each).",
            "Place baking dishes on hot baking sheet in oven. Bake until Yorkshire puddings are puffed and begin to brown, about 25 minutes. Reduce oven temperature to 350°F and bake until puddings are brown, puffed, and crisp around sides, about 20 minutes longer. Transfer Yorkshire puddings to plates. Serve immediately."
        ],
        "picture_link": null
    }
}