{
    "recipe": {
        "title": "Cheese Flan ",
        "ingredients": [
            "1 cup sugar",
            "1/4 cup water",
            "2 1/2 cups whole milk",
            "1 (3-inch) cinnamon stick",
            "1 (14-ounces) can sweetened condensed milk",
            "8 ounces cream cheese, softened",
            "5 large eggs",
            "1 teaspoon pure vanilla extract",
            "1/8 teaspoon salt",
            "Equipment: 8 (7- to 8-ounce) ramekins"
        ],
        "instructions": [
            "Make caramel: Heat sugar and water in a small heavy saucepan over medium-high heat, stirring until sugar is dissolved. Cook, without stirring, brushing down sugar crystals from side of pan using a pastry brush dipped in cold water and swirling pan occasionally so caramel browns evenly, until dark amber. Immediately pour into ramekins and swirl so caramel coats bottom of each and partway up side, then put in a roasting pan.",
            "Heat sugar and water in a small heavy saucepan over medium-high heat, stirring until sugar is dissolved. Cook, without stirring, brushing down sugar crystals from side of pan using a pastry brush dipped in cold water and swirling pan occasionally so caramel browns evenly, until dark amber. Immediately pour into ramekins and swirl so caramel coats bottom of each and partway up side, then put in a roasting pan.",
            "Make flan: Preheat oven to 350°F with rack in middle. Bring milk with cinnamon stick just to a simmer in a small heavy saucepan, then remove from heat and let steep, covered, 5 minutes. Remove cinnamon.",
            "Preheat oven to 350°F with rack in middle.",
            "Bring milk with cinnamon stick just to a simmer in a small heavy saucepan, then remove from heat and let steep, covered, 5 minutes. Remove cinnamon.",
            "Meanwhile, blend condensed milk and cream cheese in a food processor until smooth. Add eggs, vanilla, and salt and blend until smooth. Transfer to a large bowl, then whisk in hot milk. Divide among ramekins, then add enough boiling water to pan to reach halfway up sides of ramekins. Cover pan loosely with a sheet of foil and bake until custards are just set (they will still wobble slightly in center when tapped), 45 to 55 minutes. Remove ramekins from water bath and let stand at least 15 minutes (flan will continue to set). Just before serving (warm or at room temperature), run a thin knife around flans to loosen, then invert onto plates.",
            "Meanwhile, blend condensed milk and cream cheese in a food processor until smooth. Add eggs, vanilla, and salt and blend until smooth. Transfer to a large bowl, then whisk in hot milk.",
            "Divide among ramekins, then add enough boiling water to pan to reach halfway up sides of ramekins. Cover pan loosely with a sheet of foil and bake until custards are just set (they will still wobble slightly in center when tapped), 45 to 55 minutes.",
            "Remove ramekins from water bath and let stand at least 15 minutes (flan will continue to set). Just before serving (warm or at room temperature), run a thin knife around flans to loosen, then invert onto plates."
        ],
        "picture_link": "https://assets.epicurious.com/photos/553a84d305ebb68a358ba30b/6:4/w_274%2Ch_169/6x4.jpg"
    }
}