{
    "recipe": {
        "title": "Cheesy Delicata Squash and Kale Casserole ",
        "ingredients": [
            "1/2 cup apple cider vinegar",
            "1 cup golden raisins",
            "1 large delicata squash (about 2 1/2 pounds), cut into 1/4\" half-moons",
            "5 sprigs thyme",
            "3 garlic cloves",
            "4 tablespoons extra-virgin olive oil, divided, plus more for pan",
            "1 3/4 teaspoons kosher salt, divided",
            "1 teaspoon freshly ground black pepper",
            "1/2 cup hazelnuts, coarsely chopped",
            "8 ounces ricotta",
            "3/4 cup heavy cream",
            "8 ounces low-moisture shredded mozzarella, divided",
            "1/2 cup panko (Japanese breadcrumbs)",
            "1/2 bunch (about 6 ounces) Tuscan kale, stemmed, thinly sliced",
            "A 2-quart baking dish"
        ],
        "instructions": [
            "Preheat oven to 450°F. Bring vinegar and 1/3 cup water to a simmer in a small pot. Remove from heat. Add raisins, cover, and let sit until ready to use. Divide squash, thyme, and garlic between 2 rimmed baking sheets; arrange in a single layer. Toss with 2 Tbsp. oil, 1/2 tsp. salt, and 1/2 tsp. pepper. Roast 12 minutes. Toss, then add hazelnuts to 1 section of 1 sheet. Continue to roast until hazelnuts are toasted and browned and squash is tender and cooked through, about 6 minutes more. Whisk ricotta and cream in a medium bowl until smooth. Add 6 oz. mozzarella, 3/4 tsp. salt, and remaining 1/2 tsp. pepper and whisk to combine. Remove thyme leaves from stems and add to cheese mixture. Coarsely chop garlic, add to cheese mixture, and stir to combine. Transfer hazelnuts to a large bowl. Add panko, 2 Tbsp. oil, and remaining 1/2 tsp. salt and toss to combine. Set aside 1/4 cup panko mixture. Drain raisins. Add kale, squash, and raisins to remaining panko mixture in large bowl and toss to combine. Grease 2-qt. baking dish with oil. Add half of squash mixture, then dollop with half of cheese mixture. Top with remaining squash mixture, then dollop with remaining cheese mixture. Top with remaining 2 oz. mozzarella and reserved 1/4 cup panko. Bake casserole until mozzarella is melted and browned in spots and edges are bubbling, 12–15 minutes. Let cool slightly before serving.",
            "Preheat oven to 450°F. Bring vinegar and 1/3 cup water to a simmer in a small pot. Remove from heat. Add raisins, cover, and let sit until ready to use.",
            "Divide squash, thyme, and garlic between 2 rimmed baking sheets; arrange in a single layer. Toss with 2 Tbsp. oil, 1/2 tsp. salt, and 1/2 tsp. pepper. Roast 12 minutes. Toss, then add hazelnuts to 1 section of 1 sheet. Continue to roast until hazelnuts are toasted and browned and squash is tender and cooked through, about 6 minutes more.",
            "Whisk ricotta and cream in a medium bowl until smooth. Add 6 oz. mozzarella, 3/4 tsp. salt, and remaining 1/2 tsp. pepper and whisk to combine. Remove thyme leaves from stems and add to cheese mixture. Coarsely chop garlic, add to cheese mixture, and stir to combine.",
            "Transfer hazelnuts to a large bowl. Add panko, 2 Tbsp. oil, and remaining 1/2 tsp. salt and toss to combine. Set aside 1/4 cup panko mixture.",
            "Drain raisins. Add kale, squash, and raisins to remaining panko mixture in large bowl and toss to combine.",
            "Grease 2-qt. baking dish with oil. Add half of squash mixture, then dollop with half of cheese mixture. Top with remaining squash mixture, then dollop with remaining cheese mixture. Top with remaining 2 oz. mozzarella and reserved 1/4 cup panko.",
            "Bake casserole until mozzarella is melted and browned in spots and edges are bubbling, 12–15 minutes. Let cool slightly before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59e8ea73721e11367c485146/6:4/w_274%2Ch_169/Squash-Casserole-17102017.jpg"
    }
}