{
    "recipe": {
        "title": "Cheesecake ",
        "ingredients": [
            "2 1/2 (8-oz) packages cream cheese (1 1/4 lb), softened",
            "1 1/4 sticks (1/2 cup plus 2 tablespoons) unsalted butter, softened, plus additional for pan",
            "1 1/2 cups sugar",
            "8 large eggs, separated",
            "2 teaspoons finely grated fresh lemon zest",
            "2 tablespoons fresh lemon juice",
            "1 teaspoon vanilla",
            "1/2 teaspoon orange-flower water*",
            "1/2 teaspoon almond extract",
            "1/4 cup cornstarch",
            "parchment paper cut into a 10-inch round and a 32- by 5-inch strip; a 10-inch (26-cm) springform pan"
        ],
        "instructions": [
            "Preheat oven to 350°F. Butter bottom and side of springform pan. Line bottom with round of parchment and butter round. Butter 1 side of parchment strip and fit unbuttered side of strip against buttered side of pan. (Strip will extend 2 inches above rim of pan.) Beat together cream cheese, butter, 3/4 cup sugar, egg yolks, zest, juice, vanilla, orange-flower water, and almond extract in a large bowl with an electric mixer at medium speed until creamy, about 2 minutes in a standing mixer or 3 minutes with a handheld. Add cornstarch and mix at low speed until just combined. Beat egg whites in another large bowl with cleaned beaters at medium speed until whites just hold soft peaks. Add remaining 3/4 cup sugar, 1 tablespoon at a time, beating, then increase speed to high and continue beating until meringue holds stiff, glossy peaks, about 2 minutes in standing mixer or 3 minutes with handheld. Fold one fourth of whites into cream cheese mixture to lighten, then fold in remaining whites gently but thoroughly. Line outside of springform pan with foil (covering bottom and about 1 inch up side) to waterproof. Pour batter into pan and gently smooth top. Bake in a hot water bath in middle of oven until top is golden but cake trembles slightly when pan is shaken gently, 55 to 65 minutes. (Cheesecake will rise in oven, but then will fall slightly and set as it cools.) Transfer springform pan to a rack to cool completely, then chill, loosely covered, at least 8 hours.",
            "Preheat oven to 350°F.",
            "Butter bottom and side of springform pan. Line bottom with round of parchment and butter round. Butter 1 side of parchment strip and fit unbuttered side of strip against buttered side of pan. (Strip will extend 2 inches above rim of pan.)",
            "Beat together cream cheese, butter, 3/4 cup sugar, egg yolks, zest, juice, vanilla, orange-flower water, and almond extract in a large bowl with an electric mixer at medium speed until creamy, about 2 minutes in a standing mixer or 3 minutes with a handheld. Add cornstarch and mix at low speed until just combined.",
            "Beat egg whites in another large bowl with cleaned beaters at medium speed until whites just hold soft peaks. Add remaining 3/4 cup sugar, 1 tablespoon at a time, beating, then increase speed to high and continue beating until meringue holds stiff, glossy peaks, about 2 minutes in standing mixer or 3 minutes with handheld.",
            "Fold one fourth of whites into cream cheese mixture to lighten, then fold in remaining whites gently but thoroughly.",
            "Line outside of springform pan with foil (covering bottom and about 1 inch up side) to waterproof. Pour batter into pan and gently smooth top. Bake in a hot water bath in middle of oven until top is golden but cake trembles slightly when pan is shaken gently, 55 to 65 minutes. (Cheesecake will rise in oven, but then will fall slightly and set as it cools.) Transfer springform pan to a rack to cool completely, then chill, loosely covered, at least 8 hours.",
            "Available at some supermarkets and Kalustyan's (800-352-3451).",
            "Available at some supermarkets and Kalustyan's (800-352-3451).",
            "Available at some supermarkets and Kalustyan's (800-352-3451)."
        ],
        "picture_link": null
    }
}