{
    "recipe": {
        "title": "Cheesy Potato and Kale Gratin with Rye Croutons ",
        "ingredients": [
            "4 slices seeded rye bread",
            "1 large bunch kale (preferably Tuscan; about 12 ounces), ribs removed, leaves torn into 3\" pieces",
            "6 ounces good-quality Gruyère, grated on the large holes of a food processor blade or box grater (about 2 cups)",
            "2 ounces good-quality Parmesan, grated on the large holes of a food processor blade or box grater (about 1/2 cup)",
            "2 pounds yellow-fleshed potatoes (such as Yukon Gold), unpeeled, cut crosswise into 1/8\"-thick slices (see Cooks' Note), divided",
            "1 teaspoon dried thyme, divided",
            "Kosher salt, freshly ground pepper",
            "2 1/2 cups heavy cream",
            "2 garlic cloves, finely grated or pressed",
            "3 tablespoons extra-virgin olive oil, divided",
            "A 13x9x2\" or 3-quart baking dish"
        ],
        "instructions": [
            "Arrange a rack in center of oven; preheat to 350ºF. Arrange bread slices on a rimmed baking sheet and bake, flipping once halfway through, until dry and lightly toasted, 15–20 minutes. Let cool. Transfer to a resealable plastic bag and break into irregular, 1/2\"–1\" pieces. Transfer to a medium bowl; set aside. Meanwhile, wash and spin-dry kale, then layer between paper towels or a large clean kitchen towel and pat dry. Mix Gruyère and Parmesan in a medium bowl. Shingle one-quarter of potatoes in 3 or 4 rows, slightly overlapping, in bottom of baking dish. Sprinkle with one-quarter of thyme, 1/4 tsp. salt, and 1/8 tsp. pepper. Top with 2 cups kale and one-quarter of cheese mixture. Repeat 2 more times. Shingle remaining potatoes over cheese; top with 1/4 tsp. salt, 1/8 tsp. pepper, and remaining thyme. Reserve remaining kale and cheese. Stir cream, garlic, 1/4 tsp. salt, and 1/8 tsp. pepper in a liquid measuring cup. Pour evenly over potatoes. Bake gratin 40 minutes. Cover with foil and continue to bake until cream is bubbling and thick and potatoes are tender when pierced with a paring knife, 35–45 minutes more. Meanwhile, toss reserved croutons with 2 Tbsp. oil in a medium bowl. Toss remaining kale with remaining 1 Tbsp. oil. Top gratin with kale, remaining cheese, then croutons, allowing kale pieces to peek through. Bake gratin until croutons are golden brown and exposed kale edges are well-crisped, about 15 minutes more. Let cool at least 10 minutes before serving.",
            "Arrange a rack in center of oven; preheat to 350ºF. Arrange bread slices on a rimmed baking sheet and bake, flipping once halfway through, until dry and lightly toasted, 15–20 minutes. Let cool. Transfer to a resealable plastic bag and break into irregular, 1/2\"–1\" pieces. Transfer to a medium bowl; set aside.",
            "Meanwhile, wash and spin-dry kale, then layer between paper towels or a large clean kitchen towel and pat dry.",
            "Mix Gruyère and Parmesan in a medium bowl. Shingle one-quarter of potatoes in 3 or 4 rows, slightly overlapping, in bottom of baking dish. Sprinkle with one-quarter of thyme, 1/4 tsp. salt, and 1/8 tsp. pepper. Top with 2 cups kale and one-quarter of cheese mixture. Repeat 2 more times. Shingle remaining potatoes over cheese; top with 1/4 tsp. salt, 1/8 tsp. pepper, and remaining thyme. Reserve remaining kale and cheese.",
            "Stir cream, garlic, 1/4 tsp. salt, and 1/8 tsp. pepper in a liquid measuring cup. Pour evenly over potatoes.",
            "Bake gratin 40 minutes. Cover with foil and continue to bake until cream is bubbling and thick and potatoes are tender when pierced with a paring knife, 35–45 minutes more.",
            "Meanwhile, toss reserved croutons with 2 Tbsp. oil in a medium bowl. Toss remaining kale with remaining 1 Tbsp. oil. Top gratin with kale, remaining cheese, then croutons, allowing kale pieces to peek through. Bake gratin until croutons are golden brown and exposed kale edges are well-crisped, about 15 minutes more. Let cool at least 10 minutes before serving.",
            "Do Ahead Bread can be toasted 3 days ahead. Store in an airtight container at room temperature. Kale can be torn, washed, and patted dry 3 days ahead. Wrap in paper towels, place in a resealable plastic bag, and chill. Gratin can be made 1 day ahead. Let cool, then wrap tightly in plastic and chill. Bring to room temperature, cover with foil, and warm in a 300ºF oven until heated through, 15–20 minutes. Uncover and continue to warm to re-crisp croutons and exposed kale edges, about 5 minutes.",
            "Bread can be toasted 3 days ahead. Store in an airtight container at room temperature. Kale can be torn, washed, and patted dry 3 days ahead. Wrap in paper towels, place in a resealable plastic bag, and chill.",
            "Gratin can be made 1 day ahead. Let cool, then wrap tightly in plastic and chill. Bring to room temperature, cover with foil, and warm in a 300ºF oven until heated through, 15–20 minutes. Uncover and continue to warm to re-crisp croutons and exposed kale edges, about 5 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59c032aa0e38ae1a0e29ea3e/6:4/w_274%2Ch_169/Potato-Kale-Gratin-07092017.jpg"
    }
}