{
    "recipe": {
        "title": "Cheesy Polenta Lasagne with Mushrooms and Seitan ",
        "ingredients": [
            "1/2 stick unsalted butter",
            "3 tablespoons all-purpose flour",
            "2 1/2 cups whole milk",
            "1/4 pound Italian Fontina, coarsely grated (about 1 cup)",
            "3 ounces Gruyère, coarsely grated (about 1 cup), divided",
            "Scant 1/2 teaspoon grated nutmeg",
            "3 garlic cloves, thinly sliced",
            "3 tablespoons olive oil",
            "10 ounces cremini mushrooms, thinly sliced",
            "8 ounces seitan (patted dry and thinly sliced)",
            "1/2 teaspoon thyme leaves",
            "3 tablespoons water",
            "2 (16-to 18-ounce) logs ready-made plain polenta"
        ],
        "instructions": [
            "Preheat oven to 425°F with rack in upper third. Lightly butter a 2-to 2 1/2-quart shallow baking dish.",
            "Make cheese sauce: Melt butter in a 2-to 3-quart heavy saucepan over medium heat. Whisk in flour until smooth, then cook roux, whisking frequently, until pale golden, 2 to 3 minutes. Meanwhile, heat milk in a separate small saucepan until just about to boil. Add milk to roux in 2 batches, whisking constantly until very smooth. Bring to a boil, whisking, then cook, whisking, 30 seconds. Remove from heat and whisk in Fontina, half of Gruyère, nutmeg, and 3/4 teaspoon salt. Cover and set aside, whisking occasionally.",
            "Melt butter in a 2-to 3-quart heavy saucepan over medium heat. Whisk in flour until smooth, then cook roux, whisking frequently, until pale golden, 2 to 3 minutes.",
            "Meanwhile, heat milk in a separate small saucepan until just about to boil. Add milk to roux in 2 batches, whisking constantly until very smooth. Bring to a boil, whisking, then cook, whisking, 30 seconds. Remove from heat and whisk in Fontina, half of Gruyère, nutmeg, and 3/4 teaspoon salt. Cover and set aside, whisking occasionally.",
            "Make mushroom-seitan filling: Cook garlic in oil in a 12-inch heavy skillet over medium-high heat, stirring, until beginning to turn pale golden. Stir in mushrooms, 1/2 teaspoon salt, and 1/4 teaspoon pepper and cook, stirring occasionally, until mushrooms are softened, about 3 minutes. Add seitan and thyme and cook, stirring occasionally, until mushrooms and seitan are slightly golden, about 4 minutes. Add water and cook briefly, scraping up any brown bits.",
            "Cook garlic in oil in a 12-inch heavy skillet over medium-high heat, stirring, until beginning to turn pale golden. Stir in mushrooms, 1/2 teaspoon salt, and 1/4 teaspoon pepper and cook, stirring occasionally, until mushrooms are softened, about 3 minutes. Add seitan and thyme and cook, stirring occasionally, until mushrooms and seitan are slightly golden, about 4 minutes. Add water and cook briefly, scraping up any brown bits.",
            "Assemble and bake lasagne: Spread 1/2 cup cheese sauce in bottom of baking dish. Slice 1 log of polenta into 1/4-inch-thick rounds and arrange enough rounds to cover bottom of dish, overlapping slightly. Spoon half of filling evenly over polenta, then spread with half of remaining cheese sauce (about 1 cup). Slice enough rounds from second log to form a second layer. Cover with remaining filling, then cheese sauce. Sprinkle with remaining Gruyère and bake until top is just bubbling and slightly browned, 15 to 20 minutes. Let stand 5 minutes before serving.",
            "Spread 1/2 cup cheese sauce in bottom of baking dish.",
            "Slice 1 log of polenta into 1/4-inch-thick rounds and arrange enough rounds to cover bottom of dish, overlapping slightly. Spoon half of filling evenly over polenta, then spread with half of remaining cheese sauce (about 1 cup). Slice enough rounds from second log to form a second layer. Cover with remaining filling, then cheese sauce. Sprinkle with remaining Gruyère and bake until top is just bubbling and slightly browned, 15 to 20 minutes. Let stand 5 minutes before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a4e962fa7a9917c2576c/6:4/w_274%2Ch_169/351433_hires.jpg"
    }
}