{
    "recipe": {
        "title": "Cheese- or Walnut-Filled Crepes (Atayef) ",
        "ingredients": [
            "1 cup walnuts, chopped coarsely",
            "5 Tbsp sugar",
            "Zest of 1 orange",
            "2 tsp cinnamon",
            "2 Tbsp orange blossom water",
            "10 oz akkawi cheese (desalted) or ricotta mixed with half of the mozzarella",
            "3-4 oz fresh mozzarella cheese, grated",
            "5 Tbsp sugar",
            "1 Tbsp rosewater",
            "2 1/2 cups flour",
            "Pinch of salt",
            "1 Tbsp sugar",
            "1 tsp instant dry yeast",
            "3 cups lukewarm water",
            "1 tsp baking soda",
            "2 cups of rose syrup",
            "peanut oil, for deep-frying",
            "1/2 cup ground pistachios, to garnish"
        ],
        "instructions": [
            "To prepare the walnut filling, mix the walnuts, sugar, zest, cinnamon and orange blossom water. Set aside. To prepare the cheese filling, I start the process the night before. Desalt the akkawi cheese by slicing thin and immersing in cold water, leaving it to soak. Drain and change the water again after 1 hour, repeating five or six more times to get rid of all the salt. Taste the cheese before using it to ensure no saltiness remains. Mix the 2 cheeses, sugar and rosewater and set aside in a colander to drain any excess water.",
            "Put the flour into a large bowl. Mix in the salt, sugar and yeast. Pour in the water gradually and beat vigorously with a whisk.",
            "Beat in the baking soda. The batter should be creamy and pourable. Cover and leave aside to rise for 1 hour. Spread a clean lint-free tea towel on a cookie sheet and set aside. Heat a nonstick heavy-bottomed frying pan. Whisk the batter a little before ladling 1/4 cup in the pan to make 4-inch disks. Cook only on one side. Bubbles will start to form; they are ready when there are no more shiny wet spots on the top (about 1-2 minutes). Place each atayef, browned side down, on the tea towel to cool completely.",
            "Take one atayef and cup it in your hand. Fill it with either one of the fillings. Bring the edges together to form a crescent, pinching around the edges with a little firmness to keep the filling enclosed. Fill the remaining and set aside while you prepare your \"workstation.\" Pour 2 cups of rose syrup in a deep bowl. Line a plate with paper towels. Heat the oil in a heavy-bottomed saucepan to 350°F on the thermometer. Deep-fry the filled atayef no more than four at a time until golden brown on both sides. Remove with a slotted spoon and place on the paper towels. While hot, slide a couple at a time into the cool syrup for 1 minute to absorb. Remove with another slotted spoon. Serve hot, garnished with pistachios."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5603471608929a1609a16b20/6:4/w_274%2Ch_169/51177810.jpg",
        "color": 4959148
    }
}