{
    "recipe": {
        "title": "Cheesy Chicken Enchilada Skillet ",
        "ingredients": [
            "1 tablespoon vegetable oil",
            "1/2 onion, chopped",
            "2 garlic cloves, finely chopped",
            "1 teaspoon ground cumin",
            "1 teaspoon kosher salt",
            "1 (16-ounce) jar medium red salsa",
            "1/2 cup sour cream, plus more for serving",
            "4 corn tortillas, torn into quarters",
            "4 cups shredded cooked chicken (from 1 [2 1/2-pound] rotisserie chicken)",
            "1 (15.5-ounce) can black beans, drained, rinsed",
            "1 cup shredded Mexican cheese blend",
            "Pickled jalapeños and cilantro (for serving; optional)"
        ],
        "instructions": [
            "Preheat oven to 500°F. Heat oil in a 10\" heatproof skillet over medium. Add onion, garlic, cumin, and salt and cook, stirring, until softened, about 5 minutes. Transfer onion mixture to a large bowl; reserve hot skillet. Add salsa, 1/2 cup sour cream, and 1/4 cup water to onion mixture and stir to combine. Fold in tortillas, chicken, and beans until thoroughly coated. Return mixture to reserved skillet and cook over medium heat until warmed through, about 3 minutes. Sprinkle cheese over. Transfer skillet to oven and bake until cheese is melted and bubbling, about 5 minutes. Top with sour cream, jalapeños, and cilantro, if desired.",
            "Preheat oven to 500°F. Heat oil in a 10\" heatproof skillet over medium. Add onion, garlic, cumin, and salt and cook, stirring, until softened, about 5 minutes.",
            "Transfer onion mixture to a large bowl; reserve hot skillet. Add salsa, 1/2 cup sour cream, and 1/4 cup water to onion mixture and stir to combine. Fold in tortillas, chicken, and beans until thoroughly coated. Return mixture to reserved skillet and cook over medium heat until warmed through, about 3 minutes. Sprinkle cheese over.",
            "Transfer skillet to oven and bake until cheese is melted and bubbling, about 5 minutes. Top with sour cream, jalapeños, and cilantro, if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58e52bfe0e58ea1cc02885db/6:4/w_274%2Ch_169/Chicken-Enchilada-Skillet-05042017.jpg"
    }
}