{
    "recipe": {
        "title": "Cheesy Kale and Mushroom Strata ",
        "ingredients": [
            "13 oz. sourdough or country-style bread, cut into 1 1/2\" pieces (about 7 cups)",
            "2 Tbsp. extra-virgin olive oil",
            "8 oz. crimini mushrooms, sliced 1/4\" thick",
            "2 garlic cloves, thinly sliced",
            "1 tsp. kosher salt, plus more",
            "1/2 tsp. freshly ground black pepper, plus more",
            "2 Tbsp. unsalted butter, divided",
            "3 leeks, white and pale green parts only, halved lengthwise, sliced crosswise 1/4\" thick",
            "1 bunch curly kale, ribs and stems removed, leaves torn into 2\" pieces",
            "8 large eggs",
            "2 Tbsp. whole grain Dijon mustard",
            "2 1/2 cups whole milk",
            "5 1/2 oz. Gruyère or Comté cheese, coarsely grated, divided",
            "2 oz. Parmesan, finely grated, divided"
        ],
        "instructions": [
            "Preheat oven to 350°F. Toast bread in a single layer on a rimmed baking sheet until beginning to dry out but not yet browned, 8–10 minutes. Meanwhile, heat oil in a 12\" cast-iron skillet over medium-high. Arrange mushrooms in a single layer and cook, undisturbed, until lightly browned, about 3 minutes. Add garlic, season generously with salt and pepper, and cook, tossing and reducing heat if needed, until mushrooms are golden brown all over, about 2 minutes. Push to one side and melt 1 Tbsp. butter in center of skillet. Add leeks and season with salt and pepper. Cook, stirring often and mixing into mushrooms, until softened, about 5 minutes. Add kale by the handful, tossing to wilt slightly after each addition, and cook, tossing often, until all of the kale is mostly wilted, about 4 minutes. Transfer kale mixture to a medium bowl. Let skillet cool slightly, then wipe out and coat with remaining 1 Tbsp. butter. Whisk eggs, mustard, 1 tsp. salt, and 1/2 tsp. pepper in a large bowl until no streaks remain, then whisk in milk. Arrange half of bread in skillet. Cover with half of kale mixture, then top with half of Gruyère and half of Parmesan. Top with remaining bread and kale mixture; pour egg mixture over. Press down on strata with a spatula to help bread absorb egg mixture. Scatter remaining Gruyère and Parmesan over. Bake strata until golden brown and no liquid seeps out when a knife is inserted into the center, 35–40 minutes. Let cool slightly before serving.",
            "Preheat oven to 350°F. Toast bread in a single layer on a rimmed baking sheet until beginning to dry out but not yet browned, 8–10 minutes.",
            "Meanwhile, heat oil in a 12\" cast-iron skillet over medium-high. Arrange mushrooms in a single layer and cook, undisturbed, until lightly browned, about 3 minutes. Add garlic, season generously with salt and pepper, and cook, tossing and reducing heat if needed, until mushrooms are golden brown all over, about 2 minutes. Push to one side and melt 1 Tbsp. butter in center of skillet. Add leeks and season with salt and pepper. Cook, stirring often and mixing into mushrooms, until softened, about 5 minutes. Add kale by the handful, tossing to wilt slightly after each addition, and cook, tossing often, until all of the kale is mostly wilted, about 4 minutes. Transfer kale mixture to a medium bowl. Let skillet cool slightly, then wipe out and coat with remaining 1 Tbsp. butter.",
            "Whisk eggs, mustard, 1 tsp. salt, and 1/2 tsp. pepper in a large bowl until no streaks remain, then whisk in milk. Arrange half of bread in skillet. Cover with half of kale mixture, then top with half of Gruyère and half of Parmesan. Top with remaining bread and kale mixture; pour egg mixture over. Press down on strata with a spatula to help bread absorb egg mixture. Scatter remaining Gruyère and Parmesan over.",
            "Bake strata until golden brown and no liquid seeps out when a knife is inserted into the center, 35–40 minutes. Let cool slightly before serving.",
            "Do Ahead Strata can be baked 3 days ahead. Let cool completely; cover and chill.",
            "Strata can be baked 3 days ahead. Let cool completely; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5be07fbb2fe7312d27b2e6f4/6:4/w_274%2Ch_169/cheesy-kale-and-mushroom-strata-recipe-BA-110518.jpg"
    }
}