{
    "recipe": {
        "title": "Cherry Tomatoes with Roasted Garlic Filling ",
        "ingredients": [
            "a 6-ounce head of garlic, outer husk removed and 1/4 inch trimmed from the stem end",
            "1 tablespoon olive oil",
            "1 pint cherry tomatoes (about 30)",
            "6 ounces cream cheese, softened",
            "1 teaspoon fresh lemon juice, or to taste",
            "fresh basil leaves, shredded, for garnish"
        ],
        "instructions": [
            "In a foil-lined baking dish drizzle the garlic with the oil, bake it, covered loosely with foil, in the middle of a preheated 325°F. oven for 1 1/4 hours, or until the pulp is very soft, and let it cool until it can be easily handled. Squeeze the pulp from the cloves into a bowl and let it cool. Mash the pulp until it is smooth (there should be about 1/4 cup purée.) Using a serrated knife, on a work surface cut a thin slice from the bottom of each tomato so that it stands upright. Cut off a thin slice from each stem end and with a small melon-ball cutter scoop out the flesh and seeds carefully, forming tomato shells. Sprinkle the insides of the tomato shells with salt, invert the tomatoes on racks set over paper towels, and let them drain for 30 minutes. In a bowl whisk together the cream cheese, the lemon juice, the garlic purée, and salt and pepper to taste until the filling is smooth. Using a pastry bag fitted with a small star tip, pipe the filling into the tomato shells. Garnish the filled shells with basil.",
            "In a foil-lined baking dish drizzle the garlic with the oil, bake it, covered loosely with foil, in the middle of a preheated 325°F. oven for 1 1/4 hours, or until the pulp is very soft, and let it cool until it can be easily handled. Squeeze the pulp from the cloves into a bowl and let it cool. Mash the pulp until it is smooth (there should be about 1/4 cup purée.)",
            "Using a serrated knife, on a work surface cut a thin slice from the bottom of each tomato so that it stands upright. Cut off a thin slice from each stem end and with a small melon-ball cutter scoop out the flesh and seeds carefully, forming tomato shells. Sprinkle the insides of the tomato shells with salt, invert the tomatoes on racks set over paper towels, and let them drain for 30 minutes.",
            "In a bowl whisk together the cream cheese, the lemon juice, the garlic purée, and salt and pepper to taste until the filling is smooth. Using a pastry bag fitted with a small star tip, pipe the filling into the tomato shells. Garnish the filled shells with basil."
        ],
        "picture_link": null
    }
}