{
    "recipe": {
        "title": "Cherry Hand Pies ",
        "ingredients": [
            "1 1/2 tablespoons cornstarch",
            "2 cups fresh cherries, stemmed and pitted, or about 12 ounces frozen pitted cherries, unthawed",
            "2/3 cup dried cherries",
            "1/2 cup sugar",
            "1 teaspoon vanilla extract",
            "1/8 teaspoon kosher salt",
            "1 14-ounce package all-butter puff pastry (preferably Dufour), thawed in refrigerator",
            "Flour (for dusting)",
            "1 large egg white",
            "1 1/2 teaspoon raw sugar"
        ],
        "instructions": [
            "Line a large rimmed baking sheet with parchment paper. Stir cornstarch and 1 1/2 tablespoons cold water in a small bowl to blend. Combine fresh cherries and next 4 ingredients in a large saucepan. Cook over medium heat, stirring occasionally, until cherry juices are released, about 5 minutes. Add cornstarch mixture; bring to a boil, stirring often. Remove from heat and let cool to room temperature, stirring occasionally. Roll out pastry on a lightly floured surface to an 18x15\" rectangle. Using a sharp knife or pizza cutter, cut dough into nine 6x5\" rectangles. Whisk egg white and 1 tablespoon water in another small bowl for egg wash. Working with 1 pastry rectangle at a time, place on a work surface and brush edges with egg wash. Scoop 3 tablespoons cherry mixture onto one side; fold dough over filling so that short ends meet, forming a 5x3\" packet. Crimp edges with a fork to seal. Using a sharp knife, cut a few slits in top of pie to vent. Place on prepared baking sheet; repeat with remaining dough and filling. Brush tops with egg wash, then sprinkle with raw sugar. Chill for 30 minutes. Preheat oven to 375°F. Bake pastries until tops and bottoms are golden brown, 30-40 minutes. Let cool for 10 minutes on baking sheet. Transfer to wire racks; let cool completely. DO AHEAD: Can be made 1 day ahead. Let stand at room temperature.",
            "Line a large rimmed baking sheet with parchment paper. Stir cornstarch and 1 1/2 tablespoons cold water in a small bowl to blend. Combine fresh cherries and next 4 ingredients in a large saucepan. Cook over medium heat, stirring occasionally, until cherry juices are released, about 5 minutes. Add cornstarch mixture; bring to a boil, stirring often. Remove from heat and let cool to room temperature, stirring occasionally.",
            "Roll out pastry on a lightly floured surface to an 18x15\" rectangle. Using a sharp knife or pizza cutter, cut dough into nine 6x5\" rectangles. Whisk egg white and 1 tablespoon water in another small bowl for egg wash.",
            "Working with 1 pastry rectangle at a time, place on a work surface and brush edges with egg wash. Scoop 3 tablespoons cherry mixture onto one side; fold dough over filling so that short ends meet, forming a 5x3\" packet. Crimp edges with a fork to seal. Using a sharp knife, cut a few slits in top of pie to vent. Place on prepared baking sheet; repeat with remaining dough and filling.",
            "Brush tops with egg wash, then sprinkle with raw sugar. Chill for 30 minutes. Preheat oven to 375°F. Bake pastries until tops and bottoms are golden brown, 30-40 minutes. Let cool for 10 minutes on baking sheet. Transfer to wire racks; let cool completely. DO AHEAD: Can be made 1 day ahead. Let stand at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/558c4f8d81ac1e502367c08a/6:4/w_274%2Ch_169/366393_cherry-hand-pies_6x4.jpg"
    }
}