{
    "recipe": {
        "title": "Cherry Double-Chocolate Cookies ",
        "ingredients": [
            "1 1/4 cups all-purpose flour",
            "3/4 cup unsweetened Dutch-process cocoa powder",
            "3/4 teaspoon baking soda",
            "Scant 1/2 teaspoon salt",
            "1 1/2 sticks unsalted butter, softened",
            "1 1/2 cups packed light brown sugar",
            "2 large eggs",
            "3 1/2 oz fine-quality milk chocolate, cut into 1/2-inch chunks",
            "1 cup pecans, toasted and coarsely chopped",
            "1 cup dried sour cherries"
        ],
        "instructions": [
            "Preheat oven to 375°F with racks in upper and lower thirds. Whisk together flour, cocoa powder, baking soda, and salt in a small bowl. Beat together butter and brown sugar with an electric mixer at medium-high speed until pale and fluffy, then add eggs 1 at a time, beating until combined well. Reduce speed to low and add flour mixture, mixing until just combined. Add chocolate chunks, pecans, and cherries and mix until just incorporated. Drop 2 level tablespoons of dough per cookie about 2 inches apart onto 2 ungreased large baking sheets. With dampened fingers, flatten cookies slightly. Bake, switching position of sheets halfway through baking, until puffed and set, 12 to 14 minutes. Transfer cookies to a rack to cool.",
            "Preheat oven to 375°F with racks in upper and lower thirds.",
            "Whisk together flour, cocoa powder, baking soda, and salt in a small bowl.",
            "Beat together butter and brown sugar with an electric mixer at medium-high speed until pale and fluffy, then add eggs 1 at a time, beating until combined well. Reduce speed to low and add flour mixture, mixing until just combined. Add chocolate chunks, pecans, and cherries and mix until just incorporated.",
            "Drop 2 level tablespoons of dough per cookie about 2 inches apart onto 2 ungreased large baking sheets. With dampened fingers, flatten cookies slightly.",
            "Bake, switching position of sheets halfway through baking, until puffed and set, 12 to 14 minutes. Transfer cookies to a rack to cool."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a02f3a00aeb2f1cf706/6:4/w_274%2Ch_169/239292.jpg"
    }
}