{
    "recipe": {
        "title": "Chestnut and Potato Purée ",
        "ingredients": [
            "3 pounds medium yellow-fleshed potatoes such as Yukon Gold (about 8 medium)",
            "1 stick (1/2 cup) unsalted butter",
            "3 cups bottled peeled roasted whole chestnuts (16 ounces)",
            "1 quartt half-and-half",
            "1 Turkish or 1/2 California bay leaf",
            "2 1/2 teaspoons salt",
            "3/4 teaspoon black pepper",
            "heavy-duty foil; a potato ricer or a food mill fitted with medium disk"
        ],
        "instructions": [
            "Preheat oven to 450°F. Prick each potato in a few places with a fork, then divide potatoes into 3 groups and wrap each group in foil. Bake in oven until tender when pierced with a sharp knife, 1 1/4 to 1 1/2 hours. While potatoes bake, melt butter in a 4- to 5-quart heavy pot over moderately low heat, then cook chestnuts, stirring, 5 minutes. Add half-and-half, bay leaf, salt, and pepper and gently simmer, covered, until chestnuts are very tender and cream is infused with bay leaf, 15 to 20 minutes. Discard bay leaf, then transfer chestnuts with a slotted spoon to a blender. Add enough cooking liquid to purée chestnuts easily, then purée until smooth (use caution when blending hot liquids). Return purée to pot with remaining liquid and stir together. Keep warm over very low heat. Holding them with a kitchen towel to protect your hands, carefully unwrap and peel potatoes, a few at a time, and push through ricer into chestnut mixture. Stir to combine (mixture will continue to thicken) and season to taste.",
            "Preheat oven to 450°F.",
            "Prick each potato in a few places with a fork, then divide potatoes into 3 groups and wrap each group in foil. Bake in oven until tender when pierced with a sharp knife, 1 1/4 to 1 1/2 hours.",
            "While potatoes bake, melt butter in a 4- to 5-quart heavy pot over moderately low heat, then cook chestnuts, stirring, 5 minutes. Add half-and-half, bay leaf, salt, and pepper and gently simmer, covered, until chestnuts are very tender and cream is infused with bay leaf, 15 to 20 minutes. Discard bay leaf, then transfer chestnuts with a slotted spoon to a blender. Add enough cooking liquid to purée chestnuts easily, then purée until smooth (use caution when blending hot liquids). Return purée to pot with remaining liquid and stir together. Keep warm over very low heat.",
            "Holding them with a kitchen towel to protect your hands, carefully unwrap and peel potatoes, a few at a time, and push through ricer into chestnut mixture. Stir to combine (mixture will continue to thicken) and season to taste."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd7c3f3a00aeb2f1d28b2/6:4/w_274%2Ch_169/236378.jpg"
    }
}