{
    "recipe": {
        "title": "Chestnut Pancakes with Bacon and Crème Fraîche ",
        "ingredients": [
            "6 slices thick-cut bacon, chopped",
            "3/4 cup milk",
            "2 large eggs",
            "2 teaspoons baking powder",
            "1/2 teaspoon salt",
            "1 1/2 cups coarsely chopped jarred steamed chestnuts (7 to 8 ounces), divided",
            "Créme fraîche or sour cream",
            "Chopped chives or maple syrup"
        ],
        "instructions": [
            "Cook bacon in large skillet over medium heat until brown and crisp. Using slotted spoon, transfer bacon to paper towels to drain. Transfer 2 tablespoons bacon drippings to blender; add milk and next 3 ingredients, then 1 cup chestnuts. Blend until batter is smooth. Pour batter into bowl; stir in remaining 1/2 cup chestnuts. Pour remaining drippings into small bowl. Brush same skillet with some drippings; heat over medium heat. Drop in batter by rounded tablespoonfuls. Cook pancakes until brown and cooked through, about 3 minutes per side. Transfer to plates. Top with créme fraîche and bacon, then chives or maple syrup.",
            "Cook bacon in large skillet over medium heat until brown and crisp. Using slotted spoon, transfer bacon to paper towels to drain. Transfer 2 tablespoons bacon drippings to blender; add milk and next 3 ingredients, then 1 cup chestnuts. Blend until batter is smooth. Pour batter into bowl; stir in remaining 1/2 cup chestnuts.",
            "Pour remaining drippings into small bowl. Brush same skillet with some drippings; heat over medium heat. Drop in batter by rounded tablespoonfuls. Cook pancakes until brown and cooked through, about 3 minutes per side. Transfer to plates. Top with créme fraîche and bacon, then chives or maple syrup."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54bea39f2a4b69f8647ee14b/6:4/w_274%2Ch_169/chestnut-pancakes-bacon-creme-6x4.jpg"
    }
}