{
    "recipe": {
        "title": "Chicken Cashew Chili ",
        "ingredients": [
            "2 dried ancho chilies",
            "1/4 cup cashews, raw or roasted",
            "1 cup chicken broth",
            "2 whole chicken legs plus 1/2 chicken breast (about 1 1/2 pounds total)",
            "2 tablespoons olive oil",
            "1 large onion, chopped coarse",
            "3 garlic cloves, chopped fine",
            "1 tablespoon ground cumin",
            "1 teaspoon chili powder",
            "1 teaspoon salt",
            "3 tablespoons chopped fresh coriander sprigs (wash and dry before chopping)",
            "a 14 1/2-ounce can diced tomatoes with juice",
            "1/2 cup cashews, raw or roasted",
            "1/2 ounce fine-quality bittersweet chocolate (not unsweetened) or semisweet chocolate",
            "1 cup canned kidney beans, rinsed and drained"
        ],
        "instructions": [
            "Make chili purée: Heat a small heavy skillet over moderate heat until hot and toast chilies, 1 at a time, pressing down with tongs, a few seconds on each side to make more pliable. Wearing rubber gloves, seed and devein chilies. In a blender purée chilies with cashews and broth until smooth.",
            "Heat a small heavy skillet over moderate heat until hot and toast chilies, 1 at a time, pressing down with tongs, a few seconds on each side to make more pliable. Wearing rubber gloves, seed and devein chilies. In a blender purée chilies with cashews and broth until smooth.",
            "Cut legs into drumsticks and thigh portions. Remove excess fat from chicken and pat chicken dry. In a large heavy saucepan heat oil over moderate heat until hot but not smoking and cool onion and garlic, stirring, until softened. Add cumin, chili powder, and salt and cook, stirring, 1 minute. Add chicken and stir to coat with onion mixture. Stir in chili purée, 2 tablespoons coriander, and tomatoes with juice and simmer, covered, stirring occasionally to avoid sticking, 45 minutes, or until chicken legs are cooked through. Remove pan from heat and transfer chicken to a bowl. With 2 forks shred meat, discard bones and skin. Return chicken to pan and stir in cashews, remaining tablespoon coriander, chocolate, and beans. Cook chili over moderate heat, stirring, until heated through and chocolate is melted. Chili may be made 2 days ahead and cooled completely, uncovered, before being chilled, covered.",
            "Cut legs into drumsticks and thigh portions. Remove excess fat from chicken and pat chicken dry.",
            "In a large heavy saucepan heat oil over moderate heat until hot but not smoking and cool onion and garlic, stirring, until softened. Add cumin, chili powder, and salt and cook, stirring, 1 minute. Add chicken and stir to coat with onion mixture. Stir in chili purée, 2 tablespoons coriander, and tomatoes with juice and simmer, covered, stirring occasionally to avoid sticking, 45 minutes, or until chicken legs are cooked through.",
            "Remove pan from heat and transfer chicken to a bowl. With 2 forks shred meat, discard bones and skin. Return chicken to pan and stir in cashews, remaining tablespoon coriander, chocolate, and beans. Cook chili over moderate heat, stirring, until heated through and chocolate is melted. Chili may be made 2 days ahead and cooled completely, uncovered, before being chilled, covered."
        ],
        "picture_link": null
    }
}