{
    "recipe": {
        "title": "Chicken Salad with Herbs and Aleppo Pepper ",
        "ingredients": [
            "6 garlic cloves, crushed",
            "2 teaspoons kosher salt plus more",
            "1 tablespoon Aleppo pepper or 1/2 teaspoon crushed red pepper flakes",
            "4 tablespoons red wine vinegar, divided",
            "4 tablespoons plus 1/2 cup olive oil, divided",
            "3 tablespoons chopped fresh oregano, divided",
            "Freshly ground black pepper",
            "1 3 1/2- to 4-pound chicken, cut into quarters",
            "2 6\" pita breads, split",
            "1 1/2 teaspoon za'atar",
            "1/2 cup chopped fresh flat-leaf parsley",
            "3 tablespoons fresh lemon juice",
            "4 cups baby lettuce leaves, or 1 head of Bibb lettuce, leaves torn",
            "1/2 cup fresh mint leaves",
            "1/4 cup fresh cilantro leaves with tender stems",
            "Ingredient info: Za'atar, a Middle Eastern spice blend, is available at Middle Eastern markets and specialty foods stores, and from online sources."
        ],
        "instructions": [
            "Using a large knife, chop 4 garlic cloves; sprinkle with 2 teaspoons kosher salt and mash to a paste using the side of the knife blade. Transfer to a small bowl and whisk in Aleppo pepper, 3 tablespoons vinegar, 2 tablespoons oil, and 2 tablespoons oregano; season marinade with black pepper. Place chicken in a resealable plastic bag; add marinade, seal bag, and turn to coat. Chill at least 2 hours or up to 12 hours. Place a rack in middle of oven and preheat to 400°F. Remove chicken pieces from marinade, season with salt and pepper, and place on a wire rack set inside a large rimmed baking sheet. Roast until golden brown and cooked through and an instant-read thermometer registers 165°F when inserted in the thickest part of thigh, 30-40 minutes. Let stand until cool enough to handle. Meanwhile, place pita bread halves, cut side up, on another large rimmed baking sheet. Drizzle with 2 tablespoons oil, sprinkle with za'atar, and season with salt. Bake until browned and crisp, 5-8 minutes. Let cool; break into bite-size pieces. Pull chicken meat from bones and cut into bite-size pieces; discard skin and bones. Place meat in a large bowl. Scrape in any juices from baking sheet and toss to combine. Combine parsley, lemon juice, and remaining 2 garlic cloves, 1 tablespoon vinegar, and 1 tablespoon oregano in a small bowl. Gradually whisk in remaining 1/2 cup oil; season with salt and pepper. Let vinaigrette stand 30 minutes; discard garlic. Add pita chips, lettuce, mint, and cilantro to bowl with chicken; drizzle salad with vinaigrette and toss to coat. DO AHEAD: Pita chips and dressing can be made 2 days ahead. Chicken can be roasted and cut into pieces 1 day ahead. Cover and chill chicken and dressing separately. Store pita chips airtight at room temperature.",
            "Using a large knife, chop 4 garlic cloves; sprinkle with 2 teaspoons kosher salt and mash to a paste using the side of the knife blade. Transfer to a small bowl and whisk in Aleppo pepper, 3 tablespoons vinegar, 2 tablespoons oil, and 2 tablespoons oregano; season marinade with black pepper. Place chicken in a resealable plastic bag; add marinade, seal bag, and turn to coat. Chill at least 2 hours or up to 12 hours.",
            "Place a rack in middle of oven and preheat to 400°F. Remove chicken pieces from marinade, season with salt and pepper, and place on a wire rack set inside a large rimmed baking sheet. Roast until golden brown and cooked through and an instant-read thermometer registers 165°F when inserted in the thickest part of thigh, 30-40 minutes. Let stand until cool enough to handle.",
            "Meanwhile, place pita bread halves, cut side up, on another large rimmed baking sheet. Drizzle with 2 tablespoons oil, sprinkle with za'atar, and season with salt. Bake until browned and crisp, 5-8 minutes. Let cool; break into bite-size pieces.",
            "Pull chicken meat from bones and cut into bite-size pieces; discard skin and bones. Place meat in a large bowl. Scrape in any juices from baking sheet and toss to combine.",
            "Combine parsley, lemon juice, and remaining 2 garlic cloves, 1 tablespoon vinegar, and 1 tablespoon oregano in a small bowl. Gradually whisk in remaining 1/2 cup oil; season with salt and pepper. Let vinaigrette stand 30 minutes; discard garlic.",
            "Add pita chips, lettuce, mint, and cilantro to bowl with chicken; drizzle salad with vinaigrette and toss to coat.",
            "DO AHEAD: Pita chips and dressing can be made 2 days ahead. Chicken can be roasted and cut into pieces 1 day ahead. Cover and chill chicken and dressing separately. Store pita chips airtight at room temperature."
        ],
        "picture_link": null
    }
}