{
    "recipe": {
        "title": "Chicken Tagine with Fennel and Olives ",
        "ingredients": [
            "1 teaspoon ground cumin",
            "1/2 teaspoon paprika",
            "1/2 teaspoon fine sea salt",
            "1/4 teaspoon cayenne pepper",
            "6 skinless boneless chicken thighs (1 1/2 pounds)",
            "2 tablespoons olive oil, divided",
            "2 medium fennel bulbs, stalks trimmed, bulbs halved vertically, then cut crosswise into 1/2-inch slices",
            "2 cups low-salt chicken broth",
            "2 tablespoons fresh lemon juice",
            "1/2 cup pitted brine-cured green olives, quartered lengthwise",
            "1 cup coarsely chopped fresh cilantro"
        ],
        "instructions": [
            "Mix cumin, paprika, salt, and cayenne in small bowl. Cut chicken crosswise into thirds. Toss in large bowl with spices. Heat 1 tablespoon oil in large skillet over medium-high heat. Add chicken; brown 2 minutes per side. Transfer to plate. Add 1 tablespoon oil and fennel to same skillet. Sauté until golden in spots, 5 minutes. Return chicken and juices to skillet. Add broth and lemon juice. Bring to simmer, scraping up browned bits. Cover, reduce heat to low, and cook until chicken is cooked through, 15 minutes. Add olives. Simmer until sauce thickens, 5 minutes. Stir in cilantro. Season with salt and pepper.",
            "Mix cumin, paprika, salt, and cayenne in small bowl. Cut chicken crosswise into thirds. Toss in large bowl with spices.",
            "Heat 1 tablespoon oil in large skillet over medium-high heat. Add chicken; brown 2 minutes per side. Transfer to plate.",
            "Add 1 tablespoon oil and fennel to same skillet. Sauté until golden in spots, 5 minutes. Return chicken and juices to skillet. Add broth and lemon juice. Bring to simmer, scraping up browned bits. Cover, reduce heat to low, and cook until chicken is cooked through, 15 minutes. Add olives. Simmer until sauce thickens, 5 minutes. Stir in cilantro. Season with salt and pepper."
        ],
        "picture_link": null
    }
}