{
    "recipe": {
        "title": "Chicken Soup with Caramelized Ginger ",
        "ingredients": [
            "1/2 bunch cilantro, divided",
            "2 Tbsp. sugar",
            "1 (6\") piece ginger, peeled, thinly sliced into rounds",
            "3 garlic cloves, thinly sliced",
            "4 scallions, pale-green and white parts left whole, dark-green parts thinly sliced lengthwise",
            "1 1/2 lb. skinless, boneless chicken thighs",
            "1 Fresno chile, halved, seeds removed",
            "Kosher salt",
            "2 Tbsp. soy sauce",
            "Freshly ground black pepper"
        ],
        "instructions": [
            "Gather half of cilantro into a bundle and tie together with kitchen twine. Coarsely chop remaining cilantro (stems and all); set aside for serving.",
            "Heat sugar and 3 Tbsp. water in a large saucepan over medium. Cook, stirring often, until sugar dissolves, about 2 minutes. Continue to cook, swirling pan occasionally, until syrup is golden amber, 4–6 minutes.",
            "Add ginger and cook, stirring occasionally, until ginger is softened slightly, about 5 minutes. Add garlic and pale-green and white scallion parts and cook, stirring often, until garlic is fragrant, about 2 minutes. Stir in cilantro bundle, chicken, chile, and a big pinch of salt. Pour in 8 cups cold water and bring to a boil. Reduce heat to medium-low, bring to a bare simmer, and cook, stirring occasionally, until chicken is cooked through, 10–12 minutes. Discard chile and scallions. Keep soup warm over medium-low heat.",
            "Transfer chicken to a plate and let cool slightly. Shred chicken and stir back into soup. Add soy sauce and stir to combine. Remove pot from heat; taste and season with salt, if needed.",
            "Serve soup topped with dark-green scallion parts, reserved chopped cilantro, and a few turns of pepper.",
            "Do Ahead Soup (without scallion greens or cilantro) can be made 3 days ahead. Let cool, then cover and chill.",
            "Soup (without scallion greens or cilantro) can be made 3 days ahead. Let cool, then cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c89116f49d0022aa36183cd/6:4/w_274%2Ch_169/chicken-soup-with-caramelized-ginger-recipe-BA-030119.jpg"
    }
}