{
    "recipe": {
        "title": "Chicken Marinara ",
        "ingredients": [
            "7 tablespoons olive oil",
            "4 garlic cloves, chopped",
            "3 shallots, peeled, chopped",
            "1 28-ounce can crushed tomatoes with added puree",
            "2 teaspoons dried oregano",
            "1/4 teaspoon dried crushed red pepper",
            "1/2 cup chopped fresh basil",
            "3/4 cup panko (Japanese breadcrumbs)",
            "3/4 cup grated Parmesan cheese",
            "1 cup all purpose flour",
            "2 large eggs, beaten to blend",
            "6 skinless boneless chicken breast halves",
            "3/4 cup grated mozzarella cheese"
        ],
        "instructions": [
            "Heat 4 tablespoons olive oil in heavy large saucepan over medium heat. Add garlic and shallots and sauté until tender, about 4 minutes. Add tomatoes, oregano, and crushed red pepper. Simmer until sauce thickens, about 10 minutes. Mix in basil and season to taste with salt and pepper. Blend breadcrumbs and Parmesan cheese in small bowl. Place flour and eggs in separate shallow bowls. Coat chicken with flour, then eggs, then breadcrumb mixture, patting to adhere. Heat remaining 3 tablespoons oil in heavy large nonstick skillet over medium-high heat. Add chicken and sauté until golden brown, about 4 minutes per side. Spoon 1/4 cup sauce over each chicken breast. Sprinkle with mozzarella cheese. Reduce heat to medium. Cover; cook until chicken is cooked through and cheese is melted, about 5 minutes. Rewarm remaining sauce; serve alongside chicken.",
            "Heat 4 tablespoons olive oil in heavy large saucepan over medium heat. Add garlic and shallots and sauté until tender, about 4 minutes. Add tomatoes, oregano, and crushed red pepper. Simmer until sauce thickens, about 10 minutes. Mix in basil and season to taste with salt and pepper.",
            "Blend breadcrumbs and Parmesan cheese in small bowl. Place flour and eggs in separate shallow bowls. Coat chicken with flour, then eggs, then breadcrumb mixture, patting to adhere.",
            "Heat remaining 3 tablespoons oil in heavy large nonstick skillet over medium-high heat. Add chicken and sauté until golden brown, about 4 minutes per side. Spoon 1/4 cup sauce over each chicken breast. Sprinkle with mozzarella cheese. Reduce heat to medium. Cover; cook until chicken is cooked through and cheese is melted, about 5 minutes. Rewarm remaining sauce; serve alongside chicken."
        ],
        "picture_link": null
    }
}