{
    "recipe": {
        "title": "Chickpeas and Chard with Poached Eggs ",
        "ingredients": [
            "2 tablespoons plus 1/4 cup olive oil",
            "1/2 lemon",
            "1 small onion, halved, plus",
            "2 medium onions, chopped",
            "6 garlic cloves, smashed, divided",
            "2 bay leaves",
            "1 cup dried chickpeas, soaked overnight, drained",
            "2 teaspoons kosher salt, plus more",
            "1 Fresno chile, finely chopped",
            "1 teaspoon baharat",
            "2 large bunches Swiss chard, ribs and stems removed and thinly sliced, leaves torn into 1\" pieces",
            "3 tablespoons dried barberries or dried unsweetened cranberries",
            "8 large eggs",
            "Labneh (Lebanese strained yogurt; for serving)",
            "1 tablespoon fresh marjoram leaves",
            "Freshly cracked black pepper",
            "The spice mix baharat and dried barberries are available at Middle Eastern markets or online."
        ],
        "instructions": [
            "Heat 2 tablespoons oil in a medium saucepan over medium-high. Add lemon and halved onion, cut side down, and 2 garlic cloves and cook, turning garlic occasionally, until golden brown, about 4 minutes. Add bay leaves and chickpeas; add water to cover by 1\". Bring to a boil and skim surface. Reduce heat, cover, and gently simmer 30 minutes. Stir in 2 teaspoons salt and continue to simmer until chickpeas are tender, 10–20 minutes. Remove from heat; discard lemon, onion, and bay leaves.",
            "Meanwhile, heat remaining 1/4 cup oil in a large straight-sided skillet over medium. Add chopped onion, chile, baharat, and remaining 4 garlic cloves; season with salt. Cook, stirring often, until onions are translucent, 8–10 minutes. Add Swiss chard ribs and stems and cook, stirring occasionally, until tender, 5–8 minutes.",
            "Using a slotted spoon, transfer chickpeas to skillet. Add cooking liquid to cover; bring to a simmer. Gradually add chard leaves, stirring until slightly wilted before adding more. Add barberries; cook until leaves are wilted, 5–8 minutes.",
            "With mixture at a gentle simmer, use a spoon to make 8 indentations. Crack an egg into each and simmer until whites are almost entirely opaque, about 10 minutes. Cover pan and cook just until whites are set but yolks are still runny, about 2 minutes. Season eggs with salt.",
            "Spoon chickpeas and chard into bowls, top with eggs, labneh, and marjoram, and season with pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b7203f2722874e516a1eda/6:4/w_274%2Ch_169/51260670_chickpeas-chard-poached-eggs_1x1.jpg"
    }
}