{
    "recipe": {
        "title": "Chicory, Bacon, and Poached Egg Salad ",
        "ingredients": [
            "4 oz. Parmesan",
            "1 medium shallot, finely chopped",
            "1/4 cup sherry vinegar or red wine vinegar",
            "1 Tbsp. honey",
            "7 Tbsp. extra-virgin olive oil, divided",
            "Kosher salt, freshly ground pepper",
            "8 oz. slab or thick-cut bacon, cut into 1/2\" pieces",
            "2 (8\"-long) sprigs rosemary",
            "1 lb. mixed wild mushrooms (such as shiitake, maitake, and/or oyster), woody stems removed",
            "1 lb. chicory (such as radicchio, escarole, and/or frisée), leaves torn into 3\" pieces",
            "4 large eggs"
        ],
        "instructions": [
            "Finely grate half of the Parmesan into a large bowl. Add shallot, vinegar, honey, and 5 Tbsp. oil and whisk well; season dressing with salt and pepper.",
            "Cook bacon in a large skillet over medium-high heat, stirring occasionally, until brown and beginning to crisp, about 5 minutes. Add rosemary and cook, turning once, until crisp, about 2 minutes. Using a slotted spoon, transfer bacon and rosemary to paper towels.",
            "Add remaining 2 Tbsp. oil to skillet and heat over medium-high. Arrange mushrooms in pan in a single layer and cook, undisturbed, until golden brown underneath, about 3 minutes. Season with salt and pepper, toss, and continue to cook, tossing often, until golden brown all over, about 5 minutes. Transfer to bowl with dressing, but don’t toss. Strip rosemary leaves off stems into bowl and add chicory.",
            "Meanwhile, bring a large pot of water to a boil. Reduce heat so water is at a bare simmer. Crack an egg into a small bowl; gently slide egg into water. Quickly repeat with remaining eggs. Poach, rotating eggs gently with a large slotted spoon, until whites are set but yolks are still runny, about 3 minutes. Using spoon, transfer eggs to paper towels. Season with salt and pepper.",
            "Toss salad to coat leaves; season with salt and divide among plates. Shave remaining Parmesan over and top with bacon and poached eggs."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c114963ebc6d869164578b1/6:4/w_274%2Ch_169/chicory-bacon-and-poached-egg-salad-recipe-BA-121218.jpg"
    }
}