{
    "recipe": {
        "title": "Chicken with Pork-Stuffed Cherry Peppers ",
        "ingredients": [
            "12 cherry peppers, stemmed, seeded, and rinsed",
            "1 cup water",
            "1 cup white wine vinegar",
            "2 tablespoons olive oil",
            "4 bone-in, skin-on chicken legs (separated into thighs and drumsticks) or 8 chicken thighs",
            "Salt and freshly ground black pepper",
            "1/3 cup white wine",
            "One 3-inch sprig of fresh rosemary",
            "1 1/4 cups sliced onion (1 large)",
            "1 tablespoon minced garlic",
            "1 large (6 inch) Italian sweet sausage",
            "1/2 cup chicken stock",
            "2 tablespoons chopped flat-leaf parsley, for garnish (optional)"
        ],
        "instructions": [
            "In a medium pot, combine the cherry peppers, water, and vinegar. Bring to a boil over medium-high heat and cook until the peppers lighten in color, from red to bright orange, and are pliable, about 5 minutes. Drain and set aside.",
            "In a large skillet, heat the oil over medium heat. Season the chicken with salt and pepper to taste. Add to the skillet and cook until browned all over, about 20 minutes, turning once or twice. Add the white wine and rosemary and cook until the wine has mostly evaporated, about 5 minutes. Add the onion and garlic and cook until the onion is soft, about 5 minutes.",
            "Remove the casing on the sausage. Roll the sausage meat into little balls about the size of marbles and stuff them into the cavities of the cherry peppers. Add the stuffed peppers and the stock to the skillet with the chicken. Cover and cook over medium-low heat for 15 minutes for the flavors to meld and the pork to cook. It will be pale in color. Uncover and cook until the sauce reduces by about half, 10 to 15 minutes longer.",
            "Serve garnished with parsley, if you'd like."
        ],
        "picture_link": "https://assets.epicurious.com/photos/555b6962100d9bda6d820872/6:4/w_274%2Ch_169/51253030_chicken-with-pork-stuffed-cherry-peppers_6x4.jpg"
    }
}