{
    "recipe": {
        "title": "Chicken and Green Papaya Salad ",
        "ingredients": [
            "4 small skinless, boneless chicken breasts (about 1 pound total)",
            "1 tablespoon reduced-sodium soy sauce",
            "1 teaspoon sugar",
            "1/4 teaspoon Chinese five-spice powder",
            "Kosher salt, freshly ground pepper",
            "Vegetable oil (for grilling)",
            "2 garlic cloves, finely chopped",
            "2 tablespoons fresh lime juice",
            "2 teaspoons sugar",
            "1 teaspoon fish sauce",
            "1/2 large green papaya and/or 2 green mangoes, julienned",
            "1/2 medium cucumber, peeled, julienned",
            "1 small daikon (Japanese white radish), peeled, julienned",
            "1 medium carrot, peeled, julienned",
            "6 scallions, julienned",
            "1 Fresno chile, with seeds, finely chopped",
            "Kosher salt",
            "Banana blossom petals (for serving; optional)",
            "2 tablespoons toasted sesame seeds"
        ],
        "instructions": [
            "Rub chicken with soy sauce, sugar, and five-spice powder; season with salt and pepper. Let sit at least 1 hour.",
            "Prepare grill for medium-high heat and oil grate. Grill chicken, turning often and being careful not to char, until cooked through, 5–8 minutes total. Let cool, then shred.",
            "DO AHEAD: Chicken can be seasoned 1 day ahead of grilling; cover and chill. Chicken can be cooked 1 day ahead; cover and chill.",
            "Salad and assembly: Whisk garlic, lime juice, sugar, and fish sauce in a large bowl. Add shredded grilled chicken, papaya, cucumber, daikon, carrot, scallions, and chile to bowl; season with salt and toss to coat. Serve salad on banana blossom petals, if using, sprinkled with sesame seeds.",
            "Whisk garlic, lime juice, sugar, and fish sauce in a large bowl. Add shredded grilled chicken, papaya, cucumber, daikon, carrot, scallions, and chile to bowl; season with salt and toss to coat.",
            "Serve salad on banana blossom petals, if using, sprinkled with sesame seeds."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac45c26529d92b2c03a929/6:4/w_274%2Ch_169/51234620_chicken-green-papaya_1x1.jpg",
        "color": 4330141
    }
}