{
    "recipe": {
        "title": "Chickpea and Broccoli Rabe Soup ",
        "ingredients": [
            "2 teaspoons olive oil",
            "2 slices pancetta, chopped fine",
            "1 large or 2 small carrots, peeled and diced",
            "2 celery stalks, diced",
            "4 oregano sprigs",
            "A pinch of dried chile flakes (optional)",
            "Salt",
            "4 garlic cloves, chopped",
            "2 cups cooked chickpeas",
            "2 cups chickpea cooking liquid",
            "2 cups chicken stock",
            "1 bunch of broccoli rabe",
            "A drizzle of extra-virgin olive oil"
        ],
        "instructions": [
            "Heat a heavy-bottomed pot over medium heat. Add: 2 teaspoons olive oil 2 slices pancetta, chopped fine Cook for 3 minutes and then add: 1 large or 2 small carrots, peeled and diced 2 stalks celery, diced 1 onion, diced 4 oregano sprigs A pinch of dried chile flakes (optional) Cook, stirring now and then, until soft and lightly browned, about 12 minutes. Turn down the heat if the vegetables start to brown too quickly. When the vegetables are cooked, add: Salt 4 garlic cloves, chopped 2 cups cooked chickpeas Cook for a few minutes and pour in: 2 cups chickpea cooking liquid 2 cups chicken stock Bring to a boil and reduce to a simmer. Cook for 10 minutes. Meanwhile, trim off and discard the woody stems from: 1 bunch of broccoli rabe Wash and drain, chop coarsely, and add to the soup. Cook for another 10 minutes. Test a large rabe stem. If it is not tender, cook the soup a few more minutes. Taste for salt and adjust as needed. Serve garnished with: A drizzle of extra-virgin olive oil",
            "Heat a heavy-bottomed pot over medium heat. Add: 2 teaspoons olive oil 2 slices pancetta, chopped fine",
            "Cook for 3 minutes and then add: 1 large or 2 small carrots, peeled and diced 2 stalks celery, diced 1 onion, diced 4 oregano sprigs A pinch of dried chile flakes (optional)",
            "Cook, stirring now and then, until soft and lightly browned, about 12 minutes. Turn down the heat if the vegetables start to brown too quickly. When the vegetables are cooked, add: Salt 4 garlic cloves, chopped 2 cups cooked chickpeas",
            "Cook for a few minutes and pour in: 2 cups chickpea cooking liquid 2 cups chicken stock",
            "Bring to a boil and reduce to a simmer. Cook for 10 minutes.",
            "Meanwhile, trim off and discard the woody stems from: 1 bunch of broccoli rabe",
            "Wash and drain, chop coarsely, and add to the soup. Cook for another 10 minutes. Test a large rabe stem. If it is not tender, cook the soup a few more minutes. Taste for salt and adjust as needed. Serve garnished with: A drizzle of extra-virgin olive oil"
        ],
        "picture_link": null
    }
}