{
    "recipe": {
        "title": "Chicken Salad with Crème Fraîche and Rye ",
        "ingredients": [
            "1 large skin-on, bone-in chicken breast (12-14 ounces)",
            "4 tablespoons olive oil, divided",
            "Kosher salt, freshly ground pepper",
            "3/4 cup fresh fava beans (from about 3/4 pound pods) or frozen, thawed",
            "1/2 small fennel bulb, thinly sliced",
            "1 scallion, thinly sliced",
            "2 tablespoons coarsely chopped fresh tarragon",
            "1 tablespoon Sherry vinegar",
            "1/2 cup crème fraîche",
            "1/2 small English hothouse cucumber, very thinly sliced lengthwise on a mandoline",
            "1/4 cup flat-leaf parsley leaves",
            "1/2 teaspoon finely grated lemon zest",
            "2 teaspoons fresh lemon juice",
            "8 slices Danish rye bread or other dense health bread, toasted if desired",
            "Flaky sea salt (such as Maldon)"
        ],
        "instructions": [
            "Preheat oven to 425°. Place chicken on a small rimmed baking sheet and rub with 1 tablespoon oil; season with kosher salt and pepper. Roast until golden brown and cooked through, 25-30 minutes. Let cool, then shred into bite-size pieces.",
            "If using fresh fava beans, cook in a large saucepan of boiling salted water until tender, about 4 minutes. Drain and transfer to a bowl of ice water. Drain and peel. (If using frozen fava beans, cook 2 minutes; transfer to a bowl of ice water, then drain.) Toss in a large bowl with fennel, scallion, tarragon, vinegar, chicken, and remaining 3 tablespoons oil; season with kosher salt, pepper, and more vinegar, if desired.",
            "Meanwhile, whisk crème fraîche in a medium bowl to soft peaks (it will look fluffy); season with kosher salt.",
            "Toss cucumber with parsley, lemon zest, and lemon juice in a small bowl; season with kosher salt and pepper.",
            "Serve chicken salad with bread, cucumber, and a dollop of crème fraîche, topped with sea salt and more pepper.",
            "Do ahead: Chicken can be cooked 2 days ahead; cover and chill. Shred just before using. Fava beans can be cooked 2 days ahead; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac273d6529d92b2c038daf/6:4/w_274%2Ch_169/51236450_chicken-salad_1x1.jpg"
    }
}