{
    "recipe": {
        "title": "Chicken and Mushroom Quesadillas with Carrot and Mango Slaw ",
        "ingredients": [
            "1/2 teaspoon ground cumin",
            "5 tablespoons olive oil, divided",
            "1 1/4 teaspoons kosher salt, divided",
            "3/4 teaspoon freshly ground black pepper, divided",
            "1 1/4 pounds boneless, skinless chicken thighs, trimmed",
            "6 ounces button mushrooms, trimmed, coarsely chopped",
            "2 limes",
            "1/2 cup Greek-style plain full- or low-fat yogurt",
            "3 tablespoons coarsely chopped cilantro, plus whole leaves for serving",
            "2 medium carrots (about 4 ounces each), peeled",
            "1 medium mango, thinly sliced",
            "5 ounces baby spinach (about 4 packed cups)",
            "4 (10\") flour tortillas",
            "2 cups shredded Monterey Jack cheese (about 8 ounces)"
        ],
        "instructions": [
            "Preheat oven to 425°F. Stir cumin, 3 Tbsp. oil, 1 tsp. salt, and 1/2 tsp. pepper in a large bowl. Add chicken and mushrooms and toss to coat. Spread on a rimmed baking sheet and roast until an instant-read thermometer inserted into thickest part of thigh registers 165°F, 15–17 minutes. Meanwhile, juice limes to yield 6 Tbsp. juice. Blend yogurt, 3 Tbsp. lime juice, and 3 Tbsp. cilantro in a blender until smooth. Shave carrots with a vegetable peeler lengthwise into ribbons (or use the large holes of a box grater). Whisk 1 Tbsp. oil and remaining 3 Tbsp. lime juice, 1/4 tsp. salt, and 1/4 tsp. pepper in a large bowl. Add carrots and mango; toss gently to coat. Remove baking sheet from oven, arrange spinach over chicken, and continue to roast until spinach is wilted, about 2 minutes. Transfer chicken to a cutting board, leaving spinach on sheet, and thinly slice. Arrange tortillas on a work surface. Dividing evenly, layer cheese, chicken, mushrooms, and spinach on one side of each tortilla. Fold tortillas in half to create half-moons. Heat 1 1/2 tsp. oil in a large heavy skillet over medium-low until hot. Cook 2 quesadillas, turning once, until cheese is melted and tortillas are browned, 1–2 minutes per side. Transfer quesadillas to serving plates, then cook remaining quesadillas with remaining 1 1/2 tsp. oil. Sprinkle quesadillas with cilantro leaves and serve with yogurt sauce and carrot-mango slaw alongside.",
            "Preheat oven to 425°F. Stir cumin, 3 Tbsp. oil, 1 tsp. salt, and 1/2 tsp. pepper in a large bowl. Add chicken and mushrooms and toss to coat. Spread on a rimmed baking sheet and roast until an instant-read thermometer inserted into thickest part of thigh registers 165°F, 15–17 minutes.",
            "Meanwhile, juice limes to yield 6 Tbsp. juice. Blend yogurt, 3 Tbsp. lime juice, and 3 Tbsp. cilantro in a blender until smooth.",
            "Shave carrots with a vegetable peeler lengthwise into ribbons (or use the large holes of a box grater). Whisk 1 Tbsp. oil and remaining 3 Tbsp. lime juice, 1/4 tsp. salt, and 1/4 tsp. pepper in a large bowl. Add carrots and mango; toss gently to coat.",
            "Remove baking sheet from oven, arrange spinach over chicken, and continue to roast until spinach is wilted, about 2 minutes. Transfer chicken to a cutting board, leaving spinach on sheet, and thinly slice.",
            "Arrange tortillas on a work surface. Dividing evenly, layer cheese, chicken, mushrooms, and spinach on one side of each tortilla. Fold tortillas in half to create half-moons.",
            "Heat 1 1/2 tsp. oil in a large heavy skillet over medium-low until hot. Cook 2 quesadillas, turning once, until cheese is melted and tortillas are browned, 1–2 minutes per side. Transfer quesadillas to serving plates, then cook remaining quesadillas with remaining 1 1/2 tsp. oil.",
            "Sprinkle quesadillas with cilantro leaves and serve with yogurt sauce and carrot-mango slaw alongside.",
            "Do Ahead Chicken and mushrooms can be cooked and yogurt sauce can be made 4 days ahead; cover and chill.",
            "Chicken and mushrooms can be cooked and yogurt sauce can be made 4 days ahead; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59aed0a24dac1b653786f509/6:4/w_274%2Ch_169/Chicken-and-Mushroom-Quesadillas-with-Carrot-and-Mango-Slaw-Back-to-School-Grocery-Bag-767-14082017.jpg"
    }
}