{
    "recipe": {
        "title": "Chicken Wings Five Ways ",
        "ingredients": [
            "9 to 9 1/2 pounds chicken wings (about 36 large)",
            "3 tablespoons vegetable oil plus additional for grilling",
            "Sauces to toss (see below)",
            "Sriracha Buffalo Sauce",
            "Lemon Pepper Garlic Vinaigrette",
            "Balsamic Hoisin Sauce",
            "Spicy Coconut Curry Sauce",
            "Smoked Paprika Vinaigrette"
        ],
        "instructions": [
            "Prepare grill for direct-heat cooking over medium-hot charcoal (medium-high heat for gas); see Grilling Procedure below. Cut off tips from chicken wings with kitchen shears or a large heavy knife (save to make chicken stock), then halve wings at joint. Pat dry, then toss with 3 tablespoons oil and 1 teaspoon each of salt and pepper in a large bowl. Oil grill rack, then grill wings in batches (covered only if using gas grill), turning occasionally, until cooked through, 10 to 15 minutes per batch. Toss wings in a bowl with your choice of sauce. Transfer to a platter and serve.",
            "Prepare grill for direct-heat cooking over medium-hot charcoal (medium-high heat for gas); see Grilling Procedure below.",
            "Cut off tips from chicken wings with kitchen shears or a large heavy knife (save to make chicken stock), then halve wings at joint. Pat dry, then toss with 3 tablespoons oil and 1 teaspoon each of salt and pepper in a large bowl.",
            "Oil grill rack, then grill wings in batches (covered only if using gas grill), turning occasionally, until cooked through, 10 to 15 minutes per batch. Toss wings in a bowl with your choice of sauce. Transfer to a platter and serve.",
            "Charcoal grilling instructions: Open vents on bottom of grill. Light a large chimney starter full of charcoal (preferably hardwood).",
            "Open vents on bottom of grill. Light a large chimney starter full of charcoal (preferably hardwood).",
            "For direct-heat cooking: When coals are lit, dump them out across bottom rack, leaving a space free of coals on one side of grill equal to the size of the food to be grilled where food can be moved in case of any flare-ups. When charcoal turns grayish white (start checking coals after 15 minutes), the grill will be at its hottest and will then begin to cool off. How long you can hold your hand 5 inches above the grill rack directly over the coals determines the heat of your grill, as follows: HOT: 1 to 2 seconds MEDIUM HOT: 3 to 4 seconds LOW: 5 to 6 seconds",
            "When coals are lit, dump them out across bottom rack, leaving a space free of coals on one side of grill equal to the size of the food to be grilled where food can be moved in case of any flare-ups. When charcoal turns grayish white (start checking coals after 15 minutes), the grill will be at its hottest and will then begin to cool off. How long you can hold your hand 5 inches above the grill rack directly over the coals determines the heat of your grill, as follows: HOT: 1 to 2 seconds MEDIUM HOT: 3 to 4 seconds LOW: 5 to 6 seconds",
            "Gas grill instructions: Preheat all burners on high, covered, 10 minutes, then adjust heat according to recipe.",
            "Preheat all burners on high, covered, 10 minutes, then adjust heat according to recipe."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b42c36d5e8c3e1070b410b/6:4/w_274%2Ch_169/388449_chicken-wings_1x1.jpg"
    }
}