{
    "recipe": {
        "title": "Chicken Barbecue (Inihaw na Manok) ",
        "ingredients": [
            "2 1/4 cups (540 ml) banana ketchup",
            "1 cup (240 ml) 7UP",
            "1/2 cup (120 ml) fresh lemon juice",
            "1/2 cup (120 ml) soy sauce",
            "1/2 cup (120 ml) white sugarcane vinegar",
            "1/2 cup (110 g) packed brown sugar",
            "1/4 cup (35 g) minced garlic",
            "3 pounds (1.4 kg) boneless, skinless chicken thighs, cut into 1-inch pieces",
            "Cooking spray or vegetable oil, for greasing",
            "Sawsawan, for serving"
        ],
        "instructions": [
            "In a large nonreactive bowl, storage container, or Ziploc bag, mix together the banana ketchup, 7UP, lemon juice, soy sauce, vinegar, brown sugar, and garlic until the sugar has dissolved.",
            "Add the chicken pieces and toss. Cover the bowl or container or seal the bag and marinate in the refrigerator for at least 1 hour and preferably overnight.",
            "When you are ready to cook the meat, heat a grill pan over high heat or heat a charcoal or gas grill to medium.",
            "Reserving the marinade, thread 3 or 4 pieces of chicken on each skewer, letting the pieces touch slightly, and set them on a plate or baking sheet.",
            "Pour the marinade into a saucepan and bring it to a simmer over medium-high heat. Reduce the heat to medium and cook for 10 minutes; set it aside.",
            "Spray the pan or grill grate lightly with cooking spray. Place the skewers on the grill pan or grill and cook, turning them and basting them often with the heated marinade, until they are cooked through or the center of a piece of chicken registers 165°F (75°C) on an instant-read thermometer. This should take between 8 and 15 minutes, depending on your cooking surface. (Discard any leftover marinade.)",
            "Transfer to a platter and serve immediately, with sawsawan."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b9147b3f2a7a12d4192d0a5/6:4/w_274%2Ch_169/inihaw-bbq-chicken-skewers-090418.jpg"
    }
}