{
    "recipe": {
        "title": "Chicken Gyros with Cucumber Salsa and Tsatsiki ",
        "ingredients": [
            "2 Kirby cucumbers, divided",
            "1 1/2 cups Greek yogurt (3/4 pounds)",
            "1 teaspoon fresh lemon juice, divided",
            "5 garlic cloves, minced, divided",
            "1 pint grape tomatoes, quartered",
            "1 small red onion, halved and thinly sliced",
            "1/3 cup chopped flat-leaf parsley",
            "1/4 cup chopped mint",
            "1/4 cup extra-virgin olive oil",
            "1 rounded teaspoon dried oregano",
            "1 rounded teaspoon dried rosemary, crumbled",
            "1 (12-ounces) package naan bread (four 8-inch pieces) or 4 (8-inch) pocketless pita rounds",
            "1/2 roast chicken, skin discarded, meat shredded (about 2 1/4 cups), and carcass reserved for stock",
            "1/2 head iceberg lettuce, thinly sliced"
        ],
        "instructions": [
            "Preheat broiler.",
            "Peel and grate 1 cucumber, then squeeze it with your hands to remove excess water. Stir together with yogurt, 1/2 teaspoon lemon juice, one third of garlic, and 1/4 teaspoon each of salt and pepper to make tsatsiki.",
            "Cut remaining cucumber into 1/4-inch pieces and stir together with tomatoes, onion, parsley, mint, remaining 1/2 teaspoon lemon juice, and 1/4 teaspoon each of salt and pepper to make salsa.",
            "Gently simmer oil, oregano, rosemary, remaining garlic, 1/4 teaspoon salt, and 1/8 teaspoon pepper in a small heavy saucepan, stirring constantly, until garlic is fragrant but not browned, 1 to 2 minutes. Toss chicken with 3 tablespoons garlic oil and brush one side of bread with remainder.",
            "Heat bread, oiled side up, in a 4-sided sheet pan, covered with foil, 3 to 4 inches from broiler 3 minutes. Uncover and broil, rotating bread for even coloring, until golden in spots, about 2 minutes.",
            "Spread some of tsatsiki on warm bread and top with chicken and some of lettuce and salsa. Serve remaining lettuce, salsa, and tsatsiki on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/550b06d3b1a50e633781b27c/6:4/w_274%2Ch_169/351874_chicken-gyros-cucumber-salsa-tsatsiki_6x4.jpg"
    }
}