{
    "recipe": {
        "title": "Chicken Drumsticks with Muhammara Sauce ",
        "ingredients": [
            "3 tablespoons walnuts",
            "12 chicken drumsticks (3 pounds total)",
            "1/2 teaspoon salt",
            "1/4 teaspoon black pepper",
            "1/2 cup extra-virgin olive oil",
            "1/2 cup drained bottled roasted red peppers (from a 7-ounce jar)",
            "1/3 cup fine fresh bread crumbs (from 1 slice firm white sandwich bread)",
            "1 garlic clove, minced and mashed to a paste with 1/4 teaspoon salt",
            "1 teaspoon pomegranate molasses or 2 teaspoons fresh lemon juice",
            "1/2 teaspoon ground cumin",
            "1/8 teaspoon cayenne"
        ],
        "instructions": [
            "Put oven rack in lower third of oven and preheat oven to 475°F. While oven is preheating, toast nuts on a baking sheet in oven until golden, 3 to 4 minutes. Pat chicken dry, then put in a large shallow heavy baking pan (1 inch deep) without crowding and rub with salt, pepper, and 2 tablespoons oil. Bake, without turning, until golden brown and cooked through, 30 to 35 minutes. While chicken bakes, blend together bell peppers, bread crumbs, walnuts, garlic paste, pomegranate molasses, cumin, and cayenne in a food processor until as smooth as possible, about 1 minute. With motor running, gradually add remaining 6 tablespoons oil and blend until combined well. Season sauce with salt and drizzle over baked chicken.",
            "Put oven rack in lower third of oven and preheat oven to 475°F. While oven is preheating, toast nuts on a baking sheet in oven until golden, 3 to 4 minutes.",
            "Pat chicken dry, then put in a large shallow heavy baking pan (1 inch deep) without crowding and rub with salt, pepper, and 2 tablespoons oil. Bake, without turning, until golden brown and cooked through, 30 to 35 minutes.",
            "While chicken bakes, blend together bell peppers, bread crumbs, walnuts, garlic paste, pomegranate molasses, cumin, and cayenne in a food processor until as smooth as possible, about 1 minute. With motor running, gradually add remaining 6 tablespoons oil and blend until combined well. Season sauce with salt and drizzle over baked chicken."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de51df9a84192308a7a99/6:4/w_274%2Ch_169/231489.jpg"
    }
}