{
    "recipe": {
        "title": "Chicken Satés ",
        "ingredients": [
            "1 1/2 lb skinless boneless chicken thighs, trimmed and cut into 1/2-inch-wide strips",
            "3/4 cup finely chopped shallots (about 3)",
            "3 garlic cloves, finely chopped",
            "1 tablespoon packed palm or dark brown sugar",
            "1/4 teaspoon black pepper",
            "2 tablespoons peanut or vegetable oil",
            "2 tablespoons Asian fish sauce",
            "1 tablespoon Chinese rice wine or sake",
            "1/4 teaspoon salt",
            "Accompaniment: red-curry peanut dipping sauce .",
            "about 30 (6-inch) wooden skewers, soaked in water 1 hour"
        ],
        "instructions": [
            "Combine chicken with shallots, garlic, palm sugar, pepper, oil, fish sauce, rice wine, and salt in a sealable plastic bag and turn to coat chicken, then squeeze bag to eliminate as much air as possible and seal. Marinate chicken, chilled, at least 12 hours but no longer than 24. Thread each chicken strip lengthwise onto a skewer, keeping strip as straight as possible. Discard any remaining marinade. Prepare grill for cooking over medium-hot charcoal (moderate heat for gas). Grill skewers, turning over once, until chicken is cooked through, about 4 minutes total.",
            "Combine chicken with shallots, garlic, palm sugar, pepper, oil, fish sauce, rice wine, and salt in a sealable plastic bag and turn to coat chicken, then squeeze bag to eliminate as much air as possible and seal. Marinate chicken, chilled, at least 12 hours but no longer than 24.",
            "Thread each chicken strip lengthwise onto a skewer, keeping strip as straight as possible. Discard any remaining marinade.",
            "Prepare grill for cooking over medium-hot charcoal (moderate heat for gas).",
            "Grill skewers, turning over once, until chicken is cooked through, about 4 minutes total."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55f0871aad4e361c200f795d/6:4/w_274%2Ch_169/0606-GT-CC02.01.jpg"
    }
}