{
    "recipe": {
        "title": "Chicken Stew with Potatoes and Radishes ",
        "ingredients": [
            "4 chicken legs (thigh and drumstick), patted dry",
            "Kosher salt",
            "2 tablespoons extra-virgin olive oil, plus more for drizzling",
            "1 large onion, chopped",
            "5 garlic cloves, thinly sliced",
            "2 tablespoons (or more) Hungarian hot or sweet paprika",
            "1 (28-ounce) can whole peeled tomatoes",
            "3 cups (or more) homemade chicken stock or low-sodium chicken broth",
            "1 1/2 pounds baby Yukon Gold potatoes",
            "1/2 lemon",
            "3/4 cup sour cream",
            "6 radishes (about 1 bunch), trimmed, thinly sliced"
        ],
        "instructions": [
            "Season chicken thighs all over with salt. Heat 2 Tbsp. oil in a large Dutch oven or other heavy pot over medium-high. Working in 2 batches, cook chicken, skin side down, until skin is golden brown, 8–10 minutes. Transfer chicken to a plate. Cook onion in same pot, stirring often, until softened and edges are browned, 8–10 minutes. Add garlic and cook, stirring often, until softened, about 2 minutes. Add paprika and cook, stirring, until fragrant, about 30 seconds. Add tomatoes and smash with a wooden spoon until no pieces are bigger than 1/2\". Bring to a simmer and cook until tomatoes are slightly thickened, 6–8 minutes. Add stock, potatoes, and chicken and return to a simmer. Reduce heat to medium-low and cook, stirring occasionally and adding more stock if needed to keep potatoes submerged, until chicken is very tender and potatoes are creamy, 75–90 minutes. Remove from heat; taste and add more salt or paprika if needed. Squeeze juice from lemon into a small bowl and stir in sour cream; season with salt. Toss radishes and a pinch of salt in another small bowl. Transfer stew to a platter and drizzle sour cream over (you can also serve alongside if you prefer). Top with radishes, drizzle with a little oil, and season with lots of pepper.",
            "Season chicken thighs all over with salt. Heat 2 Tbsp. oil in a large Dutch oven or other heavy pot over medium-high. Working in 2 batches, cook chicken, skin side down, until skin is golden brown, 8–10 minutes. Transfer chicken to a plate.",
            "Cook onion in same pot, stirring often, until softened and edges are browned, 8–10 minutes. Add garlic and cook, stirring often, until softened, about 2 minutes. Add paprika and cook, stirring, until fragrant, about 30 seconds.",
            "Add tomatoes and smash with a wooden spoon until no pieces are bigger than 1/2\". Bring to a simmer and cook until tomatoes are slightly thickened, 6–8 minutes. Add stock, potatoes, and chicken and return to a simmer.",
            "Reduce heat to medium-low and cook, stirring occasionally and adding more stock if needed to keep potatoes submerged, until chicken is very tender and potatoes are creamy, 75–90 minutes. Remove from heat; taste and add more salt or paprika if needed.",
            "Squeeze juice from lemon into a small bowl and stir in sour cream; season with salt. Toss radishes and a pinch of salt in another small bowl.",
            "Transfer stew to a platter and drizzle sour cream over (you can also serve alongside if you prefer). Top with radishes, drizzle with a little oil, and season with lots of pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a4fa93209ac40666fea8cdb/6:4/w_274%2Ch_169/Slow-Cooked-Chicken-Paprikash-with-potatoes-03012018.jpg"
    }
}