{
    "recipe": {
        "title": "Chicken and Tomato Stew with Caramelized Lemon ",
        "ingredients": [
            "4 chicken legs (thigh and drumstick)",
            "Kosher salt",
            "4 tablespoons extra-virgin olive oil, divided",
            "1 large onion, thinly sliced",
            "6 garlic cloves, halved",
            "2 tablespoons honey",
            "1 tablespoon tomato paste",
            "3/4 teaspoon ground turmeric",
            "1/2 teaspoon ground cinnamon",
            "1 (14.5-ounces) can whole peeled tomatoes, preferably San Marzano",
            "3 cups low-sodium chicken broth",
            "1 lemon",
            "1 1/2 teaspoons sugar",
            "2 tablespoons extra-virgin olive oil",
            "1 tablespoon toasted sesame seeds",
            "1/2 cup torn mint",
            "Flatbread (for serving)"
        ],
        "instructions": [
            "Pat chicken dry and season with salt. Let sit at room temperature at least 15 minutes and up to 1 hour ahead (or cover and chill for up to 24 hours).",
            "Heat 2 Tbsp. oil in a large Dutch oven or other heavy pot over medium-high. Cook chicken, adjusting heat as needed to avoid scorching, until deep golden brown on both sides, 10–12 minutes. Transfer chicken to a plate, leaving drippings behind.",
            "Add onion to pot and cook, stirring often, until softened, 6–8 minutes. Add garlic and cook, stirring often until onion begins to brown around the edges, about 3 minutes. Stir in honey, tomato paste, turmeric, and cinnamon and cook until fragrant, about 2 minutes. Add tomatoes and juices and smash tomatoes with a wooden spoon until pieces are no larger than 1\". Return chicken to pot, pour in broth (it should barely cover chicken), and bring to a simmer. Reduce heat to low, mostly cover pot with lid (to allow steam to escape), and gently simmer until chicken is tender and juices thicken, 70–80 minutes.",
            "Caramelized lemon and assembly: Meanwhile, trim the top and bottom from lemon, perch on a flat end, and cut lengthwise into quarters; remove seeds and white pith in the center. Thinly slice quarters crosswise into quarter-moons. Place in a medium skillet, pour in water to cover, and bring to a boil. Cook 3 minutes, then drain and pat dry with paper towels. Transfer to a small bowl; sprinkle with sugar and toss to coat. Wipe out skillet and heat oil over medium-high. Arrange lemon pieces in a single layer in skillet. Cook, turning halfway through, until deeply browned in most spots, about 3 minutes. Transfer back to bowl and season with salt. Ladle stew into bowls and top with caramelized lemon, sesame seeds, and mint. Serve with flatbread.",
            "Meanwhile, trim the top and bottom from lemon, perch on a flat end, and cut lengthwise into quarters; remove seeds and white pith in the center. Thinly slice quarters crosswise into quarter-moons. Place in a medium skillet, pour in water to cover, and bring to a boil. Cook 3 minutes, then drain and pat dry with paper towels. Transfer to a small bowl; sprinkle with sugar and toss to coat.",
            "Wipe out skillet and heat oil over medium-high. Arrange lemon pieces in a single layer in skillet. Cook, turning halfway through, until deeply browned in most spots, about 3 minutes. Transfer back to bowl and season with salt.",
            "Ladle stew into bowls and top with caramelized lemon, sesame seeds, and mint. Serve with flatbread.",
            "Do Ahead Stew (without mint) can be made 3 days ahead. Let cool; cover and chill. Add mint just before serving.",
            "Stew (without mint) can be made 3 days ahead. Let cool; cover and chill. Add mint just before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a5fc85770fa5e5f63525bee/6:4/w_274%2Ch_169/chicken-and-tomato-stew-with-caramelized-lemon-recipe-BA-011718.jpg"
    }
}