{
    "recipe": {
        "title": "Chicken and Root Vegetable Pot Pie ",
        "ingredients": [
            "3 cups low-sodium chicken stock",
            "1 cup diced Yukon Gold potatoes",
            "1 cup diced sweet potatoes",
            "1 cup diced celery root",
            "1 cup diced parsnip",
            "1 large white onion, diced",
            "1 pound boneless, skinless chicken breasts, diced",
            "2/3 cup all-purpose flour",
            "1 1/2 cups whole milk",
            "1 cup fresh or frozen peas",
            "1/4 cup chopped flat-leaf parsley",
            "2 tablespoons chopped cilantro",
            "1 teaspoon hot sauce",
            "Salt and freshly ground black pepper",
            "1 sheet frozen puff pastry dough, thawed"
        ],
        "instructions": [
            "Preheat the oven to 400°F. Place the chicken stock in a large soup pot. Bring to a boil and add the Yukon Gold and sweet potatoes, celery root, parsnip, and onion. Cover and reduce the heat to medium-low, then simmer for 5 minutes. Add the chicken and simmer for 10 minutes longer or until the chicken is just cooked. Remove the chicken and vegetables from the stock with a slotted spoon and reserve. Place the flour in a mixing bowl and gradually add the milk, whisking it into the flour until well blended. Add this mixture to the stock and bring to a simmer for 5 minutes or until thickened. Add peas, parsley, cilantro, hot sauce, and the reserved chicken and vegetables to the stock and season with salt and pepper. Place four 16-ounce ramekins on a baking sheet. Fill the ramekins with the chicken and vegetable mixture. Cut the puff pastry into 4 pieces and lay each one over a ramekin. Gently press the dough over the edges of the ramekins. Bake for 20 to 25 minutes or until the puff pastry is golden brown and the filling is bubbly. Place the hot ramekins on serving plates and enjoy.",
            "Preheat the oven to 400°F.",
            "Place the chicken stock in a large soup pot. Bring to a boil and add the Yukon Gold and sweet potatoes, celery root, parsnip, and onion. Cover and reduce the heat to medium-low, then simmer for 5 minutes. Add the chicken and simmer for 10 minutes longer or until the chicken is just cooked. Remove the chicken and vegetables from the stock with a slotted spoon and reserve.",
            "Place the flour in a mixing bowl and gradually add the milk, whisking it into the flour until well blended. Add this mixture to the stock and bring to a simmer for 5 minutes or until thickened. Add peas, parsley, cilantro, hot sauce, and the reserved chicken and vegetables to the stock and season with salt and pepper.",
            "Place four 16-ounce ramekins on a baking sheet. Fill the ramekins with the chicken and vegetable mixture.",
            "Cut the puff pastry into 4 pieces and lay each one over a ramekin. Gently press the dough over the edges of the ramekins.",
            "Bake for 20 to 25 minutes or until the puff pastry is golden brown and the filling is bubbly.",
            "Place the hot ramekins on serving plates and enjoy."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58dd7f3270312806d8bd9ddb/6:4/w_274%2Ch_169/chicken-and-root-vegetable-pot-pie-HC-033017.jpg"
    }
}