{
    "recipe": {
        "title": "Chicken with Chilaquiles and Salsa Verde ",
        "ingredients": [
            "1 cup sour cream",
            "3 to 4 tablespoons milk",
            "1 3/4 cups Mexican salsa verde such as Desert Pepper Trading Company or Frontera (sometimes called tomatillo sauce; from a 16-oz jar)",
            "1 3/4 cups reduced-sodium chicken broth (14 fl oz)",
            "2 1/2 to 3 cups coarsely shredded cooked chicken (from a 2-lb rotisserie chicken, skin removed)",
            "1/4 teaspoon salt",
            "1/4 teaspoon black pepper",
            "6 cups coarsely crushed tortilla chips (not low-fat, baked, or flavored; from a 16-oz bag) plus broken chips remaining in bag (about 1 cup)",
            "1/2 cup crumbled feta (2 oz)",
            "1/4 cup chopped fresh cilantro"
        ],
        "instructions": [
            "Stir together sour cream and just enough milk to get a thick pourable consistency. Bring salsa and broth to a boil in a 5- to 6-quart heavy pot over moderately high heat. Add chicken, salt, and pepper and cook, stirring, until chicken is heated through, 1 to 2 minutes, then stir in 6 cups tortilla chips and cook until chips are softened (but not mushy), about 1 minute. Transfer chilaquiles to a large platter. Sprinkle with feta, cilantro, and 1 cup broken chips and serve immediately, with thinned sour cream on the side.",
            "Stir together sour cream and just enough milk to get a thick pourable consistency.",
            "Bring salsa and broth to a boil in a 5- to 6-quart heavy pot over moderately high heat. Add chicken, salt, and pepper and cook, stirring, until chicken is heated through, 1 to 2 minutes, then stir in 6 cups tortilla chips and cook until chips are softened (but not mushy), about 1 minute.",
            "Transfer chilaquiles to a large platter. Sprinkle with feta, cilantro, and 1 cup broken chips and serve immediately, with thinned sour cream on the side."
        ],
        "picture_link": null
    }
}