{
    "recipe": {
        "title": "Chickpea Stew ",
        "ingredients": [
            "4 tablespoons olive oil, divided",
            "2 skinless, boneless chicken thighs",
            "Kosher salt",
            "3 large garlic cloves, minced",
            "2 tablespoons ground cumin",
            "2 tablespoons tomato paste",
            "3/4 teaspoon crushed red pepper flakes",
            "2 bay leaves",
            "2 15-ounce cans chickpeas, rinsed, drained",
            "1/2 cup chopped drained roasted red peppers from a jar",
            "2 tablespoons (or more) fresh lemon juice",
            "2 cups 1\" cubes country-style bread",
            "3 tablespoons coarsely chopped flat-leaf parsley"
        ],
        "instructions": [
            "Heat 2 tablespoons oil in a medium pot over medium-high heat. Season chicken with salt; add to pot and cook, turning once, until browned, 8-10 minutes. Transfer to a plate. Reduce heat to low and let oil cool for 1 minute; add garlic and cook, stirring often, until fragrant, 30-60 seconds. Add cumin, tomato paste, and red pepper flakes; stir until a smooth paste forms, about 1 minute. Add reserved chicken with any accumulated juices, along with bay leaves and 4 cups water. Scrape up any browned bits. Bring to a boil; reduce heat to medium-low and simmer, uncovered, occasionally stirring, until chicken is tender, about 20 minutes. Transfer chicken to a plate. Add chickpeas to pot; bring to a simmer and cook for 5 minutes. Shred chicken; add to stew. Add red peppers. Stir in remaining 2 tablespoons oil and 2 tablespoons lemon juice; simmer for 1 minute. Season with salt and more lemon juice, if desired. Divide bread cubes among bowls. Ladle soup over. Garnish with parsley.",
            "Heat 2 tablespoons oil in a medium pot over medium-high heat. Season chicken with salt; add to pot and cook, turning once, until browned, 8-10 minutes. Transfer to a plate. Reduce heat to low and let oil cool for 1 minute; add garlic and cook, stirring often, until fragrant, 30-60 seconds. Add cumin, tomato paste, and red pepper flakes; stir until a smooth paste forms, about 1 minute. Add reserved chicken with any accumulated juices, along with bay leaves and 4 cups water. Scrape up any browned bits. Bring to a boil; reduce heat to medium-low and simmer, uncovered, occasionally stirring, until chicken is tender, about 20 minutes.",
            "Transfer chicken to a plate. Add chickpeas to pot; bring to a simmer and cook for 5 minutes. Shred chicken; add to stew. Add red peppers. Stir in remaining 2 tablespoons oil and 2 tablespoons lemon juice; simmer for 1 minute. Season with salt and more lemon juice, if desired. Divide bread cubes among bowls. Ladle soup over. Garnish with parsley."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b4118b2413537c0d45ab7f/6:4/w_274%2Ch_169/388656_chickpea-stew_1x1.jpg"
    }
}