{
    "recipe": {
        "title": "Chickpea-Carrot Salad ",
        "ingredients": [
            "One 1-pound bag dried chickpeas, soaked overnight in cold water to cover",
            "1 tablespoon crushed red pepper flakes",
            "2 quarts vegetable stock or water",
            "Salt",
            "1/4 cup freshly squeezed lemon juice",
            "2 tablespoons red wine vinegar",
            "3/4 cup extra-virgin olive oil",
            "2 cups grated carrots (from 2 large or 4 medium carrots)",
            "1 cup red onion, cut into 1/4-inch dice",
            "1/2 cup chopped flat-leaf parsley",
            "1 teaspoon minced garlic"
        ],
        "instructions": [
            "1. Drain the chickpeas and transfer them to a pot. Add the red pepper flakes and stock and bring to a boil over high heat, then lower the heat and let simmer until tender, about 1 hour. Season with salt and let them rest, off the heat, for 20 minutes. 2. Drain the warm chickpeas (you should have 5 cups) and transfer them to a bowl. Add the lemon juice, vinegar, and olive oil. Season with more salt, cover with plastic wrap, and chill. 3. When ready to serve, remove the chickpeas from the refrigerator and stir in the carrots, onion, parsley, and garlic. Let rest for 1 hour so the flavors have a chance to develop. Taste and adjust seasoning if necessary.",
            "1. Drain the chickpeas and transfer them to a pot. Add the red pepper flakes and stock and bring to a boil over high heat, then lower the heat and let simmer until tender, about 1 hour. Season with salt and let them rest, off the heat, for 20 minutes.",
            "2. Drain the warm chickpeas (you should have 5 cups) and transfer them to a bowl. Add the lemon juice, vinegar, and olive oil. Season with more salt, cover with plastic wrap, and chill.",
            "3. When ready to serve, remove the chickpeas from the refrigerator and stir in the carrots, onion, parsley, and garlic. Let rest for 1 hour so the flavors have a chance to develop. Taste and adjust seasoning if necessary."
        ],
        "picture_link": null
    }
}