{
    "recipe": {
        "title": "Chicken Meatballs with Ginger and Miso ",
        "ingredients": [
            "3/4 pound ground chicken",
            "1 large egg",
            "1/4 cup panko (Japanese breadcrumbs), or fresh breadcrumbs",
            "2 tablespoons sliced scallions",
            "2 teaspoons low-sodium soy sauce",
            "1 1/2 teaspoons white miso paste",
            "1 teaspoon finely grated ginger",
            "1/4 teaspoon kosher salt",
            "Soy dipping sauce (such as Soy-Lime Dipping Sauce)",
            "Vegetable oil (for grill)",
            "4 cups chicken broth or water",
            "Kosher salt",
            "2 tablespoons vegetable oil"
        ],
        "instructions": [
            "Combine chicken, egg, panko, scallions, soy sauce, miso paste, ginger, and salt in a large bowl. Using your hands, roll mixture into 1\" balls, packing firmly. Transfer balls to a rimmed baking sheet or large plate.",
            "For grilling: Divide soy dipping sauce between 2 bowls (half for serving and half for brushing meatballs while cooking). If using wooden skewers, soak 15 minutes. Thread 2 skewers through each meatball, with 2–3 meatballs per pair of skewers. Prepare a grill for medium-high, direct heat, or place a grill pan over medium-high heat. Generously oil grates or grill pan. Grill meatballs until light grill marks form, 3–4 minutes. Turn and continue to grill until outside of meatballs are browned, 2 minutes longer.Brush meatballs with sauce, then turn and brush again. Baste and turn until meatballs are glazed and cooked through, about 1 minute more (if they start to burn, reduce heat or move to a cooler part of the grill). Serve with remaining dipping sauce.",
            "Divide soy dipping sauce between 2 bowls (half for serving and half for brushing meatballs while cooking). If using wooden skewers, soak 15 minutes. Thread 2 skewers through each meatball, with 2–3 meatballs per pair of skewers.",
            "Prepare a grill for medium-high, direct heat, or place a grill pan over medium-high heat. Generously oil grates or grill pan. Grill meatballs until light grill marks form, 3–4 minutes. Turn and continue to grill until outside of meatballs are browned, 2 minutes longer.Brush meatballs with sauce, then turn and brush again. Baste and turn until meatballs are glazed and cooked through, about 1 minute more (if they start to burn, reduce heat or move to a cooler part of the grill). Serve with remaining dipping sauce.",
            "Prepare a grill for medium-high, direct heat, or place a grill pan over medium-high heat. Generously oil grates or grill pan. Grill meatballs until light grill marks form, 3–4 minutes. Turn and continue to grill until outside of meatballs are browned, 2 minutes longer.",
            "Brush meatballs with sauce, then turn and brush again. Baste and turn until meatballs are glazed and cooked through, about 1 minute more (if they start to burn, reduce heat or move to a cooler part of the grill). Serve with remaining dipping sauce.",
            "For poaching: Bring chicken broth to a simmer in a large pot over medium-low heat; season with salt. Add meatballs and cook, covered, until cooked through, about 15 minutes.",
            "Bring chicken broth to a simmer in a large pot over medium-low heat; season with salt. Add meatballs and cook, covered, until cooked through, about 15 minutes.",
            "For baking: Preheat oven to 425°F. Grease a glass or metal baking dish with oil. Roll meatballs in oil until coated. Roast until meatballs are firm and cooked through (a meat thermometer inserted into the center should read 165°F), about 15 minutes. Let meatballs cool 5 minutes in baking dish before serving.",
            "Preheat oven to 425°F. Grease a glass or metal baking dish with oil.",
            "Roll meatballs in oil until coated. Roast until meatballs are firm and cooked through (a meat thermometer inserted into the center should read 165°F), about 15 minutes.",
            "Let meatballs cool 5 minutes in baking dish before serving.",
            "Do Ahead Meatballs can be formed, but not cooked, 1 day ahead. Wrap tightly in plastic and chill.",
            "Meatballs can be formed, but not cooked, 1 day ahead. Wrap tightly in plastic and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56cdf7b8215d75fa1ae8869f/6:4/w_274%2Ch_169/EP_02232016_sumostew_skewers.jpg"
    }
}