{
    "recipe": {
        "title": "Chicken Schnitzel with Capers and Parsley ",
        "ingredients": [
            "4 (1/4-inch-thick) chicken cutlets (1 1/4 to 1 1/2 lb total)",
            "1/2 cup all-purpose flour",
            "1 teaspoon salt",
            "1/4 teaspoon black pepper",
            "2 large eggs",
            "1 cup fine dry bread crumbs",
            "4 to 6 tablespoons vegetable oil",
            "2 1/2 tablespoons unsalted butter",
            "2 tablespoons bottled capers, rinsed, drained, and patted dry",
            "2 tablespoons chopped fresh flat-leaf parsley",
            "Accompaniment: lemon wedges"
        ],
        "instructions": [
            "Preheat oven to 200°F. Put an ovenproof platter in oven to warm.",
            "Gently pound each cutlet between 2 sheets of plastic wrap to 1/8-inch thickness with flat side of a meat pounder or with a rolling pin.",
            "Stir together flour, salt, and pepper in a shallow bowl or a pie plate. Whisk together eggs and a pinch of salt in another shallow bowl, then put bread crumbs in a third shallow bowl.",
            "Pat chicken dry and dredge in seasoned flour, shaking off excess. Dip in eggs, letting excess drip off, then dredge in bread crumbs, coating completely. Transfer to a wax-paper-lined tray and chill 10 minutes.",
            "Heat 2 tablespoons oil in a 12-inch heavy nonstick skillet over moderately high heat until hot but not smoking, then fry cutlets in 2 or 3 batches (without crowding), turning over once, until golden brown and just cooked through, about 3 minutes per batch. (Add 2 tablespoons oil to skillet between batches.) Drain cutlets on paper towels, then transfer to platter in oven to keep warm.",
            "Add butter and capers to skillet and heat over moderate heat, swirling skillet, until butter is melted. Stir in parsley and pour sauce over cutlets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df2b47b55306961bfe211/6:4/w_274%2Ch_169/230977.jpg",
        "color": 10141199
    }
}