{
    "recipe": {
        "title": "Chicken Soup with Charred Cabbage ",
        "ingredients": [
            "1 cooked chicken carcass (from a store-bought rotisserie or homemade roast chicken), plus 1 1/2 cups shredded skinless roast chicken meat",
            "8 oz. shiitake mushrooms, stems reserved, caps torn in half",
            "6 garlic cloves, crushed",
            "1 tsp. kosher salt, plus more",
            "2 Tbsp. extra-virgin olive oil",
            "1 medium head of green cabbage (about 1 lb.), cored, sliced into 1/2\"-thick ribbons",
            "Freshly ground black pepper",
            "Chili oil (for serving; optional)"
        ],
        "instructions": [
            "Bring chicken carcass, shiitake stems, garlic, 1 tsp. salt, and 8 cups water to a boil in a large pot, skimming foam from surface as needed. Cover pot and reduce heat to medium. Simmer 15 minutes. Strain broth through a fine-mesh sieve into a large bowl. Rinse out pot, then pour broth back in. Meanwhile, heat oil in a large skillet over medium-high. Cook mushroom caps, stirring occasionally, until golden brown and softened, 7–9 minutes. Transfer mushrooms to a plate; season with salt. Add cabbage to same skillet, press into an even layer, and cook, undisturbed, 2 minutes; season with salt. Turn cabbage with tongs, then continue to cook, undisturbed, until lightly charred and tender in some spots and still crisp in others, about 2 minutes. Add mushrooms, cabbage, and shredded chicken to broth and cook over medium heat just until chicken is warmed through, about 3 minutes. Season soup with salt and pepper. Divide among bowls and drizzle with chili oil if desired.",
            "Bring chicken carcass, shiitake stems, garlic, 1 tsp. salt, and 8 cups water to a boil in a large pot, skimming foam from surface as needed. Cover pot and reduce heat to medium. Simmer 15 minutes. Strain broth through a fine-mesh sieve into a large bowl. Rinse out pot, then pour broth back in.",
            "Meanwhile, heat oil in a large skillet over medium-high. Cook mushroom caps, stirring occasionally, until golden brown and softened, 7–9 minutes. Transfer mushrooms to a plate; season with salt.",
            "Add cabbage to same skillet, press into an even layer, and cook, undisturbed, 2 minutes; season with salt. Turn cabbage with tongs, then continue to cook, undisturbed, until lightly charred and tender in some spots and still crisp in others, about 2 minutes.",
            "Add mushrooms, cabbage, and shredded chicken to broth and cook over medium heat just until chicken is warmed through, about 3 minutes. Season soup with salt and pepper. Divide among bowls and drizzle with chili oil if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5be07fbb202dc55a637d9dbf/6:4/w_274%2Ch_169/chicken-soup-with-charred-cabbage-recipe-BA-110518.jpg"
    }
}