{
    "recipe": {
        "title": "Chili con Carne ",
        "ingredients": [
            "4 tablespoons vegetable oil, divided",
            "4 pounds well-trimmed boneless beef chuck (from about 5 pounds), cut into 1/2-inch cube",
            "2 medium onions, chopped",
            "1 head of garlic (about 15 cloves), peeled, chopped",
            "1/2 cup ground ancho chiles",
            "2 tablespoons ground cumin",
            "1/2 teaspoon ground allspice",
            "1/4 teaspoon ground cinnamon",
            "1/4 teaspoon ground cloves",
            "1 12-ounce bottle dark beer",
            "1 28-ounce can diced tomatoes in juice",
            "2 teaspoons dried oregano",
            "2 teaspoons coarse kosher salt",
            "2 tablespoons tomato paste",
            "3 tablespoons masa (corn tortilla mix)",
            "Coarsely grated sharp cheddar cheese",
            "Chopped green and/or red onion",
            "Chopped fresh cilantro",
            "Diced fresh tomatoes (optional)",
            "Sour cream (optional)",
            "Ingredient info: Ground ancho chiles are available in the spice section of super markets and at Latin markets. Masa (or masa harina) is sold at super markets and Latin markets."
        ],
        "instructions": [
            "Heat 1 tablespoon oil in large pot over medium-high heat. Add 1/3 of beef; sprinkle with salt. Cook until browned, stirring occasionally, about 3 minutes. Using slotted spoon, transfer beef to large bowl. Repeat 2 more times with 2 tablespoons oil and beef. Reduce heat to medium. Add 1 tablespoon oil and onions. Sauté until soft, 8 to 10 minutes. Add garlic; stir 2 minutes. Add ground anchos, cumin, allspice, cinnamon, and cloves; stir until fragrant, about 1 minute. Add beer; stir 1 minute, scraping up browned bits. Return beef and juices to pot. Add tomatoes with juice, 2 cups water, oregano, and 2 teaspoons coarse salt. Bring chili to boil. Reduce heat to low, cover with lid slightly ajar, and simmer gently until beef is just tender, 1 3/4 to 2 hours. Cool 1 hour, then chill uncovered until cold. Cover; chill overnight. Spoon fat from chili. Bring chili to simmer over medium heat. Stir in tomato paste. Sprinkle masa over; stir to blend. Simmer uncovered until thickened and beef is very tender, stirring often, and adding more water by 1/4 cupfuls if too thick, about 30 minutes. Divide chili among bowls. Top with garnishes and serve.",
            "Heat 1 tablespoon oil in large pot over medium-high heat. Add 1/3 of beef; sprinkle with salt. Cook until browned, stirring occasionally, about 3 minutes. Using slotted spoon, transfer beef to large bowl. Repeat 2 more times with 2 tablespoons oil and beef.",
            "Reduce heat to medium. Add 1 tablespoon oil and onions. Sauté until soft, 8 to 10 minutes. Add garlic; stir 2 minutes. Add ground anchos, cumin, allspice, cinnamon, and cloves; stir until fragrant, about 1 minute. Add beer; stir 1 minute, scraping up browned bits. Return beef and juices to pot. Add tomatoes with juice, 2 cups water, oregano, and 2 teaspoons coarse salt. Bring chili to boil. Reduce heat to low, cover with lid slightly ajar, and simmer gently until beef is just tender, 1 3/4 to 2 hours. Cool 1 hour, then chill uncovered until cold. Cover; chill overnight.",
            "Spoon fat from chili. Bring chili to simmer over medium heat. Stir in tomato paste. Sprinkle masa over; stir to blend. Simmer uncovered until thickened and beef is very tender, stirring often, and adding more water by 1/4 cupfuls if too thick, about 30 minutes.",
            "Divide chili among bowls. Top with garnishes and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b421cc2413537c0d45c20a/6:4/w_274%2Ch_169/363749_chili-con-carne_1x1.jpg"
    }
}