{
    "recipe": {
        "title": "Chile-and-Yogurt-Marinated Grilled Chicken ",
        "ingredients": [
            "7 dried Kashmiri or guajillo chiles, broken into pieces, seeds removed",
            "1 (1 1/2)-inch piece ginger, peeled, coarsely chopped",
            "4 garlic cloves",
            "1/2 cup plain whole-milk yogurt (not Greek)",
            "3 tablespoons fresh lime juice",
            "2 tablespoons mustard oil (optional)",
            "1 tablespoon ground coriander",
            "1 tablespoon smoked paprika",
            "1 1/2 teaspoons dried mango powder (amchoor; optional)",
            "1 1/2 teaspoons crushed dried fenugreek leaves",
            "1 1/2 teaspoons garam masala",
            "1 1/2 teaspoons ground cumin",
            "2 tablespoons vegetable oil, plus more for grill",
            "1 1/2 pounds skinless, boneless chicken thighs, patted dry",
            "Kosher salt"
        ],
        "instructions": [
            "Place chiles in a medium bowl and pour in hot water to cover. Let sit until chiles are very soft, about 30 minutes; drain. Blend chiles, ginger, garlic, yogurt, cilantro stems, lime juice, mustard oil (if using), coriander, paprika, mango powder (if using), fenugreek leaves, garam masala, cumin, and 2 Tbsp. vegetable oil in a blender until smooth. Transfer marinade to a large resealable plastic bag. Season chicken generously with salt and add to marinade. Seal bag and turn to coat chicken. Chill at least 2 hours.",
            "Let chicken sit at room temperature 1 hour before grilling.",
            "Prepare a grill for medium heat; oil grate. Remove chicken from marinade, letting excess drip back into bag, and grill, turning every minute or so, until beginning to char in spots, 8–10 minutes total. Transfer to a platter and let rest 5–10 minutes before serving.",
            "Do Ahead: Chicken can be marinated 12 hours ahead. Keep chilled.",
            "Chicken can be marinated 12 hours ahead. Keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/593ee11112c27b182380821c/6:4/w_274%2Ch_169/chile-and-yogurt-marinated-grilled-chicken.jpg"
    }
}