{
    "recipe": {
        "title": "Chile-Lime Clams with Tomatoes and Grilled Bread ",
        "ingredients": [
            "6 tablespoons unsalted butter, cut into pieces, divided",
            "2 large shallots, chopped",
            "4 garlic cloves, thinly sliced",
            "1 tablespoon tomato paste",
            "1 cup beer",
            "1 cup cherry tomatoes",
            "1 (15.5-ounce) can chickpeas, rinsed",
            "2 tablespoons (or more) sambal oelek",
            "24 littleneck clams, scrubbed",
            "1 tablespoon fresh lime juice",
            "4 thick slices country-style bread",
            "2 tablespoons olive oil",
            "Kosher salt",
            "1/2 cup cilantro leaves with tender stems",
            "Lime wedges (for serving)"
        ],
        "instructions": [
            "Prepare a grill for medium, indirect heat (for a gas grill, leave one or two burners off; for a charcoal grill, bank coals on one side of grill). Place a large cast-iron skillet on grill over direct heat (move it around to cooler part of grill as you cook if needed) and melt 4 Tbsp. butter in skillet. Add shallots and garlic and cook, stirring often, until soft, about 4 minutes. Add tomato paste and cook, stirring often, until paste darkens to a rich brick-red color, about 1 minute. Add beer and tomatoes. Bring to a boil and cook until beer is reduced nearly by half and no longer smells boozy, about 4 minutes. Stir in chickpeas and sambal oelek, then add clams. Cover (if you don’t have a lid that fits, use a sheet of foil) and cook, stirring occasionally, until clams have opened; this could take from 5–10 minutes depending on size of clams and the heat level. Remove from heat; discard any clams that don’t open. Stir in lime juice and remaining 2 Tbsp. butter.",
            "While the clams are cooking on the grill, drizzle bread with oil and season lightly with salt. Grill until golden brown and crisp, about 2 minutes per side.",
            "Transfer toast to plates and spoon clam mixture over; top with cilantro. Serve with lime wedges for squeezing over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5949411846d6626d1f1fc463/6:4/w_274%2Ch_169/chile-lime-clams-with-tomatoes-and-grilled-bread-062017.jpg",
        "color": 6556258
    }
}