{
    "recipe": {
        "title": "Chilaquiles with Fried Eggs ",
        "ingredients": [
            "7 dried guajillo or New Mexico chiles",
            "1 28-ounce can whole tomatoes, drained",
            "1 medium white onion, chopped (1 1/2 cups)",
            "5 garlic cloves, chopped",
            "1 jalapeño, with seeds, chopped",
            "1/8 teaspoon smoked or Hungarian sweet paprika",
            "2 tablespoons vegetable oil",
            "2 teaspoons honey",
            "Kosher salt, freshly ground pepper",
            "Vegetable oil (for frying)",
            "9 6\" corn tortillas, quartered, or 36 large tortilla chips",
            "Kosher salt",
            "1 cup (4 ounces) crumbled queso fresco or mild feta",
            "1 cup (4 ounces) shredded Monterey Jack",
            "4 large eggs",
            "Finely chopped white onion",
            "Thinly sliced radishes",
            "Chopped fresh cilantro",
            "Lime wedges",
            "Ingredient info: Guajillo and New Mexico chiles are sold at some supermarkets and at Latin markets. Smoked paprika is available at most supermarkets.",
            "A deep-fry thermometer"
        ],
        "instructions": [
            "Place chiles in a medium bowl; cover with 2 cups boiling water. Let chiles soak until softened, about 15 minutes. Drain, reserving soaking liquid. Discard stems and seeds; place chiles in a blender. Add tomatoes, next 4 ingredients, and 1 cup reserved soaking liquid; purée until smooth.",
            "Heat oil in a medium saucepan over medium-high heat. Add purée (it will splatter) and bring to a boil. Reduce heat to medium and simmer, partially covered and stirring occasionally, until slightly thickened, about 15 minutes (add more reserved soaking liquid if too thick). Stir in honey and season to taste with salt and pepper. DO AHEAD: Can be made 3 days ahead. Cover and chill. Rewarm before using.",
            "For assembly: Place a wire rack on a rimmed baking sheet. Pour oil into a large skillet to a depth of 1 1/2\". Prop deep-fry thermometer in skillet with bulb submerged. Heat over medium-high heat until thermometer registers 350°F. Working in batches, fry tortillas, occasionally turning with tongs, until crisp, 2-3 minutes. Transfer chips to prepared sheet and season with salt. Preheat broiler. Toss chips and 1 cup sauce in a large bowl. Transfer half of chips to a large ovenproof platter or skillet. Scatter half of cheeses over chips. Top with remaining chips and cheeses, along with 1/2 cup more sauce. Broil until cheese is golden and melted, 4-5 minutes. Meanwhile, pour oil into a nonstick skillet to lightly coat. Heat over medium heat. Add eggs and fry until whites are set but yolks are still runny, about 4 minutes. Top chilaquiles with chopped onion, radishes, cilantro, and lime wedges. Top with fried eggs and serve with remaining sauce alongside.",
            "Place a wire rack on a rimmed baking sheet. Pour oil into a large skillet to a depth of 1 1/2\". Prop deep-fry thermometer in skillet with bulb submerged. Heat over medium-high heat until thermometer registers 350°F. Working in batches, fry tortillas, occasionally turning with tongs, until crisp, 2-3 minutes. Transfer chips to prepared sheet and season with salt.",
            "Preheat broiler. Toss chips and 1 cup sauce in a large bowl. Transfer half of chips to a large ovenproof platter or skillet. Scatter half of cheeses over chips. Top with remaining chips and cheeses, along with 1/2 cup more sauce. Broil until cheese is golden and melted, 4-5 minutes.",
            "Meanwhile, pour oil into a nonstick skillet to lightly coat. Heat over medium heat. Add eggs and fry until whites are set but yolks are still runny, about 4 minutes.",
            "Top chilaquiles with chopped onion, radishes, cilantro, and lime wedges. Top with fried eggs and serve with remaining sauce alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b409522413537c0d4586e5/6:4/w_274%2Ch_169/394662_chilaquiles-fried-eggs_1x1.jpg"
    }
}