{
    "recipe": {
        "title": "Chili of Forgiveness ",
        "ingredients": [
            "1/4 cup olive oil",
            "1 large red onion, finely chopped",
            "6 garlic cloves, minced",
            "2 tablespoons finely chopped rosemary",
            "Kosher salt",
            "2 teaspoons crushed red pepper",
            "1 1/2 pounds ground dark-meat turkey (you can substitute lean ground pork)",
            "2 (28-oz.) cans whole peeled tomatoes, drained, juices reserved,and chopped",
            "4 cups diced butternut squash (See Note)",
            "2 (15-oz.) cans cannellini beans, drained and rinsed",
            "1 pound Tuscan kale (also called dinosaur or Lacinato kale), stems discarded, leaves roughly chopped (about 8 cups)",
            "12 large sage leaves, finely sliced",
            "Freshly grated Parmesan cheese, for serving"
        ],
        "instructions": [
            "Put the olive oil in a large heavy pot set over medium-high heat, add the onion, garlic, rosemary and a large pinch of salt and cook, stirring occasionally, until the onion is just barely softened, about 5 minutes. Add the crushed red pepper and toast for 30 seconds. Add the turkey and cook, stirring occasionally, until the meat is cooked through and quite browned and its moisture has evaporated, 10 to 15 minutes.",
            "Add the tomatoes and their juices to the pot, along with another big pinch of salt, increase the heat to high and bring the mixture to a boil. Turn the heat to low and gently simmer, uncovered, until the tomatoes lose their tin-can taste, about 20 minutes.",
            "Stir in the squash, cover the pot and cook over medium-low heat, stirring occasionally, until the squash is just tender, about 20 minutes. Add the beans, kale and sage and cook, uncovered, until the kale is just wilted, about 5 minutes. Season with salt. Ladle the chili into bowls and top each portion with grated Parmesan.",
            "Do Ahead The chili can be refrigerated for up to 1 week. Reheat it over medium-low heat, stirring often. It also freezes very well for up to 2 months.",
            "The chili can be refrigerated for up to 1 week. Reheat it over medium-low heat, stirring often. It also freezes very well for up to 2 months."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56d75c51b4756f7440ec68da/6:4/w_274%2Ch_169/turkey-squash-chili.jpg"
    }
}