{
    "recipe": {
        "title": "Chilled Ramen with Soy Milk and Chili Oil ",
        "ingredients": [
            "1 (1-inch) piece ginger, peeled, very finely chopped",
            "1/4 cup toasted sesame oil",
            "1/4 cup vegetable oil",
            "4 1/2 teaspoons crushed red pepper flakes",
            "1 tablespoon paprika",
            "4 teaspoons toasted sesame seeds",
            "1 tablespoon mirin (sweet Japanese rice wine)",
            "1 tablespoon raw or granulated sugar",
            "1 tablespoon red or white miso",
            "1 tablespoon sake",
            "1 tablespoon Sichuan peppercorns",
            "2 scallions, thinly sliced",
            "1 (1 1/2-inch) piece ginger, peeled, finely grated",
            "1 apple wedge (about 1/8 of apple), peeled, finely grated",
            "2 garlic cloves, finely grated",
            "2/3 cup white, sweet white, and/or red miso",
            "1 tablespoon mirin (sweet Japanese rice wine)",
            "1 tablespoon sake",
            "1 1/2 teaspoons toban djan (chili bean paste)",
            "1/2 teaspoon crushed red pepper flakes",
            "1/4 cup vegetable or other neutral oil",
            "2 scallions, thinly sliced",
            "1 teaspoon paprika",
            "Kosher salt",
            "20 ounces frozen ramen noodles or 12 ounces dried ramen noodles",
            "Kosher salt",
            "3 Persian cucumbers, cut into 1/2-inch pieces",
            "1 small red or orange bell pepper, ribs and seeds removed, very thinly sliced",
            "1/2 cup thinly sliced radishes",
            "1/4 cup thinly sliced basil",
            "4 cups soy milk or other nondairy milk or regular milk",
            "1 (3x1-inch) strip grapefruit zest, very thinly sliced",
            "2 tablespoons white or regular soy sauce",
            "Plain unsweetened granola or fried shallots, garlic chips, unsalted, dry-roasted peanuts, and/or any other store-bought crunchy toppings you want (for serving)"
        ],
        "instructions": [
            "Bring ginger, sesame oil, vegetable oil, red pepper flakes, and paprika to a gentle simmer in a small saucepan over medium heat. Let bubble gently 30 seconds, then remove from heat. Add sesame seeds, mirin, raw sugar, miso, sake, and Sichuan peppercorns and whisk until sugar is dissolved. Return paste to a gentle simmer, then let cool.",
            "Miso tare: Cook scallions, ginger, apple, garlic, miso, mirin, sake, toban djan, and red pepper flakes in a small saucepan over medium heat, stirring, just until warm (do not let it simmer) and garlic no longer tastes raw, about 5 minutes.",
            "Cook scallions, ginger, apple, garlic, miso, mirin, sake, toban djan, and red pepper flakes in a small saucepan over medium heat, stirring, just until warm (do not let it simmer) and garlic no longer tastes raw, about 5 minutes.",
            "Chili oil: Heat oil in a small saucepan over medium-high until very hot but not quite smoking. Add scallions and paprika; season with salt. Cook, swirling pan often, until scallions are browned and oil is deep red, about 2 minutes. Let cool.",
            "Heat oil in a small saucepan over medium-high until very hot but not quite smoking. Add scallions and paprika; season with salt. Cook, swirling pan often, until scallions are browned and oil is deep red, about 2 minutes. Let cool.",
            "Noodles and assembly: Cook noodles in a large pot of boiling salted water according to package instructions until al dente. Drain, then immediately chill in a bowl of ice water. Drain again. Toss cucumbers, bell pepper, and radishes with 3 Tbsp. Sichuan chili paste in a small bowl until well coated. Season to taste with salt. Toss in basil. Whisk miso tare into milk in a medium bowl, then whisk in grapefruit zest and soy sauce. Divide noodles, then milk mixture and vegetables, among bowls. Toss granola or other crunchy toppings of choice in a little chili oil in a small bowl and scatter over noodles; drizzle with more chili oil.",
            "Cook noodles in a large pot of boiling salted water according to package instructions until al dente. Drain, then immediately chill in a bowl of ice water. Drain again.",
            "Toss cucumbers, bell pepper, and radishes with 3 Tbsp. Sichuan chili paste in a small bowl until well coated. Season to taste with salt. Toss in basil.",
            "Whisk miso tare into milk in a medium bowl, then whisk in grapefruit zest and soy sauce.",
            "Divide noodles, then milk mixture and vegetables, among bowls. Toss granola or other crunchy toppings of choice in a little chili oil in a small bowl and scatter over noodles; drizzle with more chili oil.",
            "Do Ahead Sichuan chili paste can be made 1 month ahead. Cover and chill. Miso tare can be made 1 month ahead. Let cool; cover and chill. Chile oil can be made 1 month ahead. Cover and chill.",
            "Sichuan chili paste can be made 1 month ahead. Cover and chill. Miso tare can be made 1 month ahead. Let cool; cover and chill. Chile oil can be made 1 month ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/596939248ae8df0e1bed8660/6:4/w_274%2Ch_169/chilled-ramen-with-soy-milk-and-chili-oil-recipe-BA-071417.jpg",
        "color": 2096627
    }
}