{
    "recipe": {
        "title": "Chinese Five-Spice Steak with Oranges and Sesame Broccolini ",
        "ingredients": [
            "3 small oranges (about 1 lb.)",
            "1 1/2 tsp. Chinese five-spice powder",
            "1 tsp. light brown sugar",
            "2 1/4 tsp. kosher salt, divided",
            "1 hanger steak (about 1 1/4 lb.), cut in half lengthwise, center gristle removed",
            "2 Tbsp. vegetable oil",
            "3 bunches broccolini (about 1 1/2 lb.), trimmed, halved lengthwise if large",
            "2 Tbsp. toasted sesame oil",
            "1/2 tsp. crushed red pepper flakes",
            "1 tsp. toasted sesame seeds, plus more for serving",
            "3 scallions, thinly sliced",
            "Flaky sea salt",
            "Steamed rice and hot sauce (for serving; optional)"
        ],
        "instructions": [
            "Finely grate 2 tsp. orange zest from 1 orange into a small bowl. Cut all oranges in half; set aside. Add five-spice powder, brown sugar, and 2 tsp. kosher salt to bowl with zest and stir to combine. Rub steak all over with spice mixture. Heat vegetable oil in a large heavy skillet (preferably cast iron) over high. Cook steak, turning often, until browned on all sides and an instant-read thermometer inserted into the center registers 130˚F for medium-rare, 15–20 minutes total. After steak has cooked for about 5 minutes, nestle orange halves cut side down around steak and cook until well browned, about 5 minutes. Transfer oranges to a plate. Transfer steak to a cutting board and let rest 10 minutes before slicing. Arrange broccolini in an even layer in same skillet and heat over high. Cook, undisturbed, until well charred, about 3 minutes. Toss and continue to cook until tender and slightly charred all over, about 3 minutes more. Transfer to a large bowl. Squeeze in juice from 2 orange halves over. Add sesame oil, red pepper flakes, 1 tsp. sesame seeds, and remaining 1/4 tsp. kosher salt and toss to coat. Transfer steak to a platter. Arrange broccolini mixture alongside. Top with scallions, sea salt, and remaining sesame seeds. Serve with charred orange halves to squeeze over, rice, and hot sauce alongside, if desired.",
            "Finely grate 2 tsp. orange zest from 1 orange into a small bowl. Cut all oranges in half; set aside.",
            "Add five-spice powder, brown sugar, and 2 tsp. kosher salt to bowl with zest and stir to combine. Rub steak all over with spice mixture.",
            "Heat vegetable oil in a large heavy skillet (preferably cast iron) over high. Cook steak, turning often, until browned on all sides and an instant-read thermometer inserted into the center registers 130˚F for medium-rare, 15–20 minutes total. After steak has cooked for about 5 minutes, nestle orange halves cut side down around steak and cook until well browned, about 5 minutes. Transfer oranges to a plate. Transfer steak to a cutting board and let rest 10 minutes before slicing.",
            "Arrange broccolini in an even layer in same skillet and heat over high. Cook, undisturbed, until well charred, about 3 minutes. Toss and continue to cook until tender and slightly charred all over, about 3 minutes more. Transfer to a large bowl. Squeeze in juice from 2 orange halves over. Add sesame oil, red pepper flakes, 1 tsp. sesame seeds, and remaining 1/4 tsp. kosher salt and toss to coat.",
            "Transfer steak to a platter. Arrange broccolini mixture alongside. Top with scallions, sea salt, and remaining sesame seeds. Serve with charred orange halves to squeeze over, rice, and hot sauce alongside, if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a906c089d7f796508314709/6:4/w_274%2Ch_169/Spice-Steak-with-Broccolini-and-Oranges-06022017.jpg"
    }
}