{
    "recipe": {
        "title": "Chinese Broccoli with Sausage and Polenta ",
        "ingredients": [
            "2 lb Chinese broccoli, thick ends trimmed",
            "6 cups water",
            "1 1/2 teaspoons salt",
            "1 1/2 cups polenta (not instant) or yellow cornmeal",
            "3 tablespoons unsalted butter, softened",
            "1/2 cup heavy cream",
            "2 tablespoons finely grated parmesan",
            "2 tablespoons olive oil",
            "3/4 lb hot Italian sausage, casings removed",
            "2 garlic cloves, thinly sliced",
            "1 teaspoon salt",
            "1/2 teaspoon black pepper"
        ],
        "instructions": [
            "Cut broccoli stems diagonally into 1-inch pieces and coarsely chop leaves. Cook stems in a large pot of boiling salted water until just tender, about4 minutes. Stir in leaves and cook 1 minute. Drain in a colander, then rinse under cold water to stop cooking. Do not squeeze out excess water.",
            "Cook polenta: Bring water with salt to a boil in a 3-quart heavy saucepan, then add polenta in a thin stream, whisking constantly. Cook over moderate heat, whisking, 2 minutes. Reduce heat to low and simmer polenta, covered, stirring for 1 minute after every 10 minutes of cooking, 45 minutes total. Stir in butter, cream, and cheese and remove from heat.",
            "Bring water with salt to a boil in a 3-quart heavy saucepan, then add polenta in a thin stream, whisking constantly. Cook over moderate heat, whisking, 2 minutes. Reduce heat to low and simmer polenta, covered, stirring for 1 minute after every 10 minutes of cooking, 45 minutes total. Stir in butter, cream, and cheese and remove from heat.",
            "Sauté sausage and garlic while polenta cooks: Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then sauté sausage, stirring and breaking up meat into large pieces with a spoon, until browned and cooked through, about 5 minutes. Transfer with a slotted spoon to a plate. Reduce heat to moderate, then cook garlic in skillet, stirring, until golden, about 2 minutes. Add broccoli and cook, stirring and scraping up brown bits from bottom of skillet, 2 minutes. Return sausage to skillet and toss with greens, salt, and pepper. Serve over polenta.",
            "Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then sauté sausage, stirring and breaking up meat into large pieces with a spoon, until browned and cooked through, about 5 minutes. Transfer with a slotted spoon to a plate. Reduce heat to moderate, then cook garlic in skillet, stirring, until golden, about 2 minutes.",
            "Add broccoli and cook, stirring and scraping up brown bits from bottom of skillet, 2 minutes. Return sausage to skillet and toss with greens, salt, and pepper. Serve over polenta."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df877f3a00aeb2f1d62b9/6:4/w_274%2Ch_169/107739.jpg"
    }
}