{
    "recipe": {
        "title": "Chipotle Roast Chicken Tacos ",
        "ingredients": [
            "1/4 cup (1/2 stick) butter, softened",
            "1 tablespoon chopped fresh cilantro leaves plus 3 fresh cilantro sprigs",
            "1 tablespoon chopped fresh oregano leaves plus 3 fresh oregano sprigs",
            "1 tablespoon chopped fresh rosemary leaves plus 3 fresh rosemary sprigs",
            "4 teaspoons minced canned chipotle chiles in adobo*",
            "1/2 teaspoon coriander seeds, crushed in resealable plastic bag with mallet",
            "1 5 1/2- to 6-pound roasting chicken, rinsed, patted dry; neck, heart, and gizzard reserved",
            "2 large onions, each cut into 8 wedges through root end, leaving root ends intact",
            "12 garlic cloves, peeled",
            "1 cup (or more) low-salt chicken broth",
            "1/4 cup dry white wine",
            "8 warm corn tortillas",
            "1 avocado, halved, pitted, peeled, thinly sliced"
        ],
        "instructions": [
            "Using fork, mix butter, all chopped herbs, chipotle chiles, and crushed coriander in small bowl. Season to taste with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover and chill. Bring to room temperature before using.",
            "Position rack in bottom third of oven and preheat to 400°F. Place chicken, breast side up, in large roasting pan; place reserved neck, heart, and gizzard alongside. Starting at neck end of chicken, slide fingers under skin to loosen, being careful to avoid tearing. Spread all but 1 tablespoon seasoned butter over breast meat and thigh meat under skin.Rub any butter remaining on fingers over outside of chicken. Sprinkle main cavity of chicken with salt and pepper; place all herb sprigs in cavity. Tie legs together loosely.",
            "Place onion wedges in large bowl. Melt remaining 1 tablespoon seasoned butter in small saucepan over low heat; pour over onion wedges and toss to coat. Arrange onions around chicken. Sprinkle onions and chicken with salt and pepper.",
            "Roast chicken and onions 30 minutes. Scatter garlic cloves around chicken; add 1/4 cup broth to roasting pan. Continue to roast chicken until instant-read thermometer inserted into thickest part of thigh registers 170°F, basting occasionally with pan juices and adding more broth by 1/4 cupfuls as needed to maintain juices in roasting pan, about 1 hour 15 minutes.",
            "Remove roasting pan from oven. Tilt chicken, draining juices from cavity into pan. Transfer chicken, onions, and garlic to platter. Tent with foil to keep warm. Add 1/4 cup broth and wine to pan. Place over 2 burners and bring juices to boil, scraping up browned bits. Strain juices into bowl. Discard fat from top of juices.",
            "Cut meat from chicken (reserve 1 1/3 cups for tostadas). Serve, making tacos with warm tortillas, chicken, onions, garlic, and avocado. Drizzle tacos with pan juices.",
            "Dried smoked jalapeños in a spicy tomato sauce called adobo; available at some supermarkets and at specialty foods stores and Latin markets.",
            "Dried smoked jalapeños in a spicy tomato sauce called adobo; available at some supermarkets and at specialty foods stores and Latin markets.",
            "Dried smoked jalapeños in a spicy tomato sauce called adobo; available at some supermarkets and at specialty foods stores and Latin markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ae375b146a4784fa17cec11/6:4/w_274%2Ch_169/chipotle-roast-chicken-tacos-recipe-BA-042718.jpg",
        "color": 10107595
    }
}