{
    "recipe": {
        "title": "Chipotle Chicken Tortilla Soup ",
        "ingredients": [
            "3 carrots, coarsely chopped",
            "3 celery ribs, coarsely chopped",
            "2 onions, coarsely chopped",
            "1 whole chicken (about 3 1/2 pounds)",
            "1 head garlic, halved crosswise",
            "3 1/2 quart cold water",
            "25 cilantro stems",
            "2 Turkish bay leaves or 1 California",
            "3 whole allspice",
            "1 whole clove",
            "1/2 teaspoon cumin seeds",
            "1/4 teaspoon black peppercorns",
            "1 medium white onion, chopped",
            "2 garlic cloves",
            "1 1/2 to 2 tablespoons chipotles in adobo, finely chopped, plus 1 tablespoon adobo sauce",
            "1 cup medium-or short-grain brown rice",
            "1 1/2 pounds sweet potatoes (about 2), peeled and cut into 1/2-inch pieces",
            "20 (7-to 8-inch) corn tortillas",
            "6 tablespoons vegetable oil",
            "1 (15- to 19-ounces) can black beans, rinsed",
            "2 (7-to 8-ounces) firm-ripe avocados",
            "2 limes, cut into wedges",
            "1/2 cup finely chopped cilantro"
        ],
        "instructions": [
            "Bring all stock ingredients to a boil with 2 teaspoons salt and 1/2 teaspoon pepper in an 8-to 10-quart heavy pot, then skim foam.",
            "Reduce heat and gently simmer, uncovered, skimming foam occasionally, 2 3/4 hours.",
            "Transfer chicken to a cutting board, then pour stock through a fine-mesh sieve into a large bowl and discard solids. Reserve",
            "1 cup stock and return remainder to cleaned pot.",
            "Finish soup: Toast spices in a dry small skillet (not nonstick) over medium-low heat, shaking skillet occasionally, until fragrant and a shade darker, about 2 minutes. Transfer spices to a blender along with onion, garlic, chipotles with adobo sauce, 2 1/2 teaspoons salt, and reserved stock. Blend until mixture is smooth and spices are ground, about 2 minutes (use caution when blending hot liquids). Add purée to stock in pot along with rice and sweet potatoes and bring to a simmer over medium heat. Simmer, covered, until sweet potatoes and rice are tender, about 45 minutes. While soup simmers, discard skin and bones from chicken and cut or shred meat into bite-size pieces. Meanwhile, preheat oven to 375°F with racks in upper and lower thirds. Stack tortillas and cut into 1/4-inch-thick strips, then toss with oil. Spread strips in 1 layer on 2 large baking sheets and season with salt. Bake, stirring frequently and switching position of sheets halfway through baking, until deep golden and crisp, 20 to 25 minutes. When rice and sweet potatoes are tender, add chicken and beans to soup and simmer, uncovered, until just heated through, about 5 minutes. Meanwhile, quarter avocados lengthwise and cut into 1/2-inch cubes. Season soup with salt and pepper, then serve with lime wedges, chopped cilantro, avocados, and tortilla strips.",
            "Toast spices in a dry small skillet (not nonstick) over medium-low heat, shaking skillet occasionally, until fragrant and a shade darker, about 2 minutes.",
            "Transfer spices to a blender along with onion, garlic, chipotles with adobo sauce, 2 1/2 teaspoons salt, and reserved stock.",
            "Blend until mixture is smooth and spices are ground, about 2 minutes (use caution when blending hot liquids).",
            "Add purée to stock in pot along with rice and sweet potatoes and bring to a simmer over medium heat. Simmer, covered, until sweet potatoes and rice are tender, about 45 minutes.",
            "While soup simmers, discard skin and bones from chicken and cut or shred meat into bite-size pieces.",
            "Meanwhile, preheat oven to 375°F with racks in upper and lower thirds. Stack tortillas and cut into 1/4-inch-thick strips, then toss with oil. Spread strips in 1 layer on 2 large baking sheets and season with salt.",
            "Bake, stirring frequently and switching position of sheets halfway through baking, until deep golden and crisp, 20 to 25 minutes.",
            "When rice and sweet potatoes are tender, add chicken and beans to soup and simmer, uncovered, until just heated through, about 5 minutes.",
            "Meanwhile, quarter avocados lengthwise and cut into 1/2-inch cubes.",
            "Season soup with salt and pepper, then serve with lime wedges, chopped cilantro, avocados, and tortilla strips."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d798af3a00aeb2f1cb81f/6:4/w_274%2Ch_169/350927_hires.jpg"
    }
}