{
    "recipe": {
        "title": "Chivito ",
        "ingredients": [
            "1 boneless rib steak, 1 pound, sliced horizontally into 4 thin steaks (you can ask the butcher to do this)",
            "Coarse salt",
            "4 sandwich rolls",
            "1/2 cup aioli",
            "Four 1/8-inch-thick slices pancetta",
            "2 tablespoons olive oil",
            "4 large eggs",
            "4 slices boiled ham (about 4 ounces)",
            "4 ounces queso blanco or Monterey Jack, sliced 1/4 inch thick",
            "4 Boston lettuce leaves",
            "2 tomatoes, sliced",
            "2 Roasted Peppers"
        ],
        "instructions": [
            "Pound the steaks lightly with a meat mallet until they are evenly about 1/4 inch thick. Sprinkle with salt to taste. Split the rolls and spread aioli on both halves; set aside. Heat a chapa or a two-burner cast-iron griddle over medium-high heat. As it is heating, crisp the pancetta on it, turning once; set aside. When the chapa is hot enough that a drop of water sizzles on the surface, add the steaks and cook, without moving, for 2 minutes. Turn and cook for another minute, or until done to taste. Meanwhile heat the olive oil until it shimmers, then fry the eggs until the whites are cooked but the yolks are still runny. Place a steak on the bottom half of each of the rolls and top with a slice each of ham, cheese, and crisp pancetta and a fried egg. Cover the other halves with the lettuce, tomatoes, and roasted pepper, and close the sandwiches. Slice in half and serve.",
            "Pound the steaks lightly with a meat mallet until they are evenly about 1/4 inch thick. Sprinkle with salt to taste.",
            "Split the rolls and spread aioli on both halves; set aside.",
            "Heat a chapa or a two-burner cast-iron griddle over medium-high heat. As it is heating, crisp the pancetta on it, turning once; set aside. When the chapa is hot enough that a drop of water sizzles on the surface, add the steaks and cook, without moving, for 2 minutes. Turn and cook for another minute, or until done to taste.",
            "Meanwhile heat the olive oil until it shimmers, then fry the eggs until the whites are cooked but the yolks are still runny.",
            "Place a steak on the bottom half of each of the rolls and top with a slice each of ham, cheese, and crisp pancetta and a fried egg. Cover the other halves with the lettuce, tomatoes, and roasted pepper, and close the sandwiches. Slice in half and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a6056a59cdb91b5ff608/6:4/w_274%2Ch_169/354712_hires.jpg"
    }
}