{
    "recipe": {
        "title": "Chocolate Shortbread Cookies ",
        "ingredients": [
            "1 1/2 C flour",
            "1/2 C unsweetened cocoa*",
            "1/4 tsp coarse salt",
            "1/2 pound (2 sticks) unsalted butter, room temperature",
            "1/2 C granulated sugar",
            "1 tablespoon cacao nibs*",
            "*Use a high quality chocolate such as Scharfen Berger."
        ],
        "instructions": [
            "In a small bowl, sift flour and cocoa together. Add coarse salt and set aside. With an electric mixer beat butter on medium speed for 3 to 5 minutes until fluffy. Add sugar and cacao nibs and continue to beat until very light in color, about 2 minutes more. Add the flour and cocoa mixture and combine on low speed, until flour is just incorporated and dough sticks together when squeezed with fingers. On a sheet of wax paper, pat and form the dough into a log about 12 to 14 inches long and 1 to 1 1/2 inches in diameter. If you want a square or rectangular cookie rather than round, flatten each side of the log as you roll it up in the wax paper. Chill until firm, at least 1 hour. Preheat oven to 325 degrees. Line a cookie sheet with parchment. Remove the wax paper from the dough and slice the log into 1/4 inch thick slices. Lay cookies on lined baking sheets. Bake until firm, 17 to 20 minutes. Cool completely on wire racks. Can be stored in an airtight container for 3 to 4 weeks.",
            "In a small bowl, sift flour and cocoa together. Add coarse salt and set aside.",
            "With an electric mixer beat butter on medium speed for 3 to 5 minutes until fluffy. Add sugar and cacao nibs and continue to beat until very light in color, about 2 minutes more. Add the flour and cocoa mixture and combine on low speed, until flour is just incorporated and dough sticks together when squeezed with fingers.",
            "On a sheet of wax paper, pat and form the dough into a log about 12 to 14 inches long and 1 to 1 1/2 inches in diameter. If you want a square or rectangular cookie rather than round, flatten each side of the log as you roll it up in the wax paper. Chill until firm, at least 1 hour.",
            "Preheat oven to 325 degrees.",
            "Line a cookie sheet with parchment. Remove the wax paper from the dough and slice the log into 1/4 inch thick slices. Lay cookies on lined baking sheets. Bake until firm, 17 to 20 minutes. Cool completely on wire racks. Can be stored in an airtight container for 3 to 4 weeks."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad62df19925f464b3b5632/6:4/w_274%2Ch_169/51192010_shortbread-cookies_1x1.jpg"
    }
}