{
    "recipe": {
        "title": "Chocolate Merlot Cake ",
        "ingredients": [
            "2 cups (250 g/1/2 lb) flour",
            "3/4 cup (100 g/3 1/4 oz) cocoa",
            "1 1/4 teaspoons baking soda",
            "1/2 teaspoon salt",
            "3/4 cup (175 g/6 oz) butter",
            "1 3/4 cup (350 g/15 oz) sugar",
            "2 eggs",
            "1 teaspoon vanilla",
            "1 1/4 cups (300 ml/1/2 pt) well-rounded red wine",
            "confectioners' sugar (for sprinkling)",
            "1/2 cup (125 g/4 oz) Concord grape jelly",
            "2 to 3 tablespoons red wine",
            "two 9-inch (22 cm) cake pans"
        ],
        "instructions": [
            "1. Heat the oven to 350°F (175°C/Gas 4). Butter the cake pans, line each pan with a round of parchment paper, and brush again with butter. Sprinkle the pans with flour, discarding the excess. Sift flour with the cocoa, baking soda, and salt into a bowl. 2. Cream the butter in an electric mixer, beat in the sugar, and continue beating until the mixture is light and fluffy, 3 to 5 minutes. Add the eggs, one by one, and then the vanilla, and continue beating 1 to 2 minutes. Sift a third of the flour over the butter mixture and fold them together, using a spoon. Fold in a third of the wine. Add the remaining flour and wine alternately in two batches. 3. Spread batter in the prepared pans and bake in the oven until the cakes start to shrink from the sides of the pan, 30 to 35 minutes; a metal skewer inserted in the center should come out clean. Let the cakes cool 10 minutes in the pans, then turn them out on a rack to cool completely. 4. Meanwhile make the wine jelly: Melt the jelly with the wine over low heat, stirring gently until combined. Let it cool. 5. Shortly before serving, sandwich the cake with the cooled jelly. Sprinkle the top with confectioners' sugar and transfer the cake to a plate to serve.",
            "1. Heat the oven to 350°F (175°C/Gas 4). Butter the cake pans, line each pan with a round of parchment paper, and brush again with butter. Sprinkle the pans with flour, discarding the excess. Sift flour with the cocoa, baking soda, and salt into a bowl.",
            "2. Cream the butter in an electric mixer, beat in the sugar, and continue beating until the mixture is light and fluffy, 3 to 5 minutes. Add the eggs, one by one, and then the vanilla, and continue beating 1 to 2 minutes. Sift a third of the flour over the butter mixture and fold them together, using a spoon. Fold in a third of the wine. Add the remaining flour and wine alternately in two batches.",
            "3. Spread batter in the prepared pans and bake in the oven until the cakes start to shrink from the sides of the pan, 30 to 35 minutes; a metal skewer inserted in the center should come out clean. Let the cakes cool 10 minutes in the pans, then turn them out on a rack to cool completely.",
            "4. Meanwhile make the wine jelly: Melt the jelly with the wine over low heat, stirring gently until combined. Let it cool.",
            "5. Shortly before serving, sandwich the cake with the cooled jelly. Sprinkle the top with confectioners' sugar and transfer the cake to a plate to serve."
        ],
        "picture_link": null
    }
}