{
    "recipe": {
        "title": "Chocolate and Passionfruit Layer Cake ",
        "ingredients": [
            "Butter, for greasing",
            "2 x My Favorite Chocolate Cake",
            "150ml (2/3 cup) heavy cream",
            "1 tbsp confectioners' sugar",
            "10 tbsp Passionfruit Curd, with or without seeds",
            "50g (1/4 cup/1/2 stick) butter",
            "100g (3 1/2oz) dark chocolate, chopped",
            "75g (2/3 cup) confectioners' sugar",
            "1 tsp milk",
            "Sprinkle of chocolate shavings, to decorate",
            "2 [20cm (8-inch)] round tins"
        ],
        "instructions": [
            "Preheat the oven to 180°C/160°C fan/gas 4/350°F then grease two 20cm (8-inch) tins and line with baking parchment. Make two batches of My Favorite Chocolate Cake recipe and use it to fill the tins. Bake for 25–30 minutes until risen and a skewer inserted comes out clean. Leave to cool in the tin for ten minutes before turning out onto a cooling rack. Whip the cream and confectioners' sugar together in a small bowl until it forms soft peaks and holds its shape when mixed. Be careful to stop when it reaches soft peaks or you might over-whip the cream, which will ruin the finished cake. Spread the whipped cream all over the top of one of the cake layers, then cover with spoonfuls of passionfruit curd. Carefully sandwich the second layer on top of the first. To make the icing, melt the butter and chocolate together in a microwave or in a heatproof bowl over a pan of simmering water. Remove from the heat and mix in the confectioners' sugar and the milk, then use a palette knife to spread it over the top of the cake. Sprinkle over chocolate shavings before serving. Keep any leftover cake in the fridge, where it will keep well for 2–3 days.",
            "Preheat the oven to 180°C/160°C fan/gas 4/350°F then grease two 20cm (8-inch) tins and line with baking parchment.",
            "Make two batches of My Favorite Chocolate Cake recipe and use it to fill the tins.",
            "Bake for 25–30 minutes until risen and a skewer inserted comes out clean. Leave to cool in the tin for ten minutes before turning out onto a cooling rack.",
            "Whip the cream and confectioners' sugar together in a small bowl until it forms soft peaks and holds its shape when mixed. Be careful to stop when it reaches soft peaks or you might over-whip the cream, which will ruin the finished cake.",
            "Spread the whipped cream all over the top of one of the cake layers, then cover with spoonfuls of passionfruit curd. Carefully sandwich the second layer on top of the first.",
            "To make the icing, melt the butter and chocolate together in a microwave or in a heatproof bowl over a pan of simmering water. Remove from the heat and mix in the confectioners' sugar and the milk, then use a palette knife to spread it over the top of the cake. Sprinkle over chocolate shavings before serving. Keep any leftover cake in the fridge, where it will keep well for 2–3 days."
        ],
        "picture_link": "https://assets.epicurious.com/photos/593ab5f9e468e80d4bf4d5d2/6:4/w_274%2Ch_169/chocolate-passionfruit-cake-HC-060617.jpg"
    }
}