{
    "recipe": {
        "title": "Chocolate Peanut Toffee ",
        "ingredients": [
            "4 sticks (1 pound) unsalted butter, cut into pieces",
            "2 cups sugar",
            "1/4 teaspoon salt",
            "4 cups whole cocktail peanuts plus 1 cup chopped (1 pound 10 ounces)",
            "1 cup chopped cocktail peanuts",
            "7 to 8 ounces 70%-cacao bittersweet chocolate, finely chopped",
            "Equipment: a 15- by 10- by 1-inch baking pan; a candy thermometer; a metal offset spatula",
            "1 candy thermometer",
            "1 metal offset spatula"
        ],
        "instructions": [
            "Butter baking pan and put on a heatproof surface. Bring butter, sugar, and salt to a boil in a 4- to 5-quart heavy pot over medium-high heat, whisking until smooth, then boil, stirring occasionally, until mixture is deep golden and registers 300°F (hard-crack stage) on thermometer, 15 to 20 minutes. Immediately stir in whole peanuts, then carefully pour hot toffee into center of baking pan. Spread with spatula, smoothing top, and let stand 1 minute, then immediately sprinkle chocolate on top. Let stand until chocolate is melted, 4 to 5 minutes, then spread over toffee with cleaned spatula. Sprinkle evenly with chopped peanuts, then freeze until chocolate is firm, about 30 minutes. Break into pieces.",
            "Butter baking pan and put on a heatproof surface.",
            "Bring butter, sugar, and salt to a boil in a 4- to 5-quart heavy pot over medium-high heat, whisking until smooth, then boil, stirring occasionally, until mixture is deep golden and registers 300°F (hard-crack stage) on thermometer, 15 to 20 minutes.",
            "Immediately stir in whole peanuts, then carefully pour hot toffee into center of baking pan. Spread with spatula, smoothing top, and let stand 1 minute, then immediately sprinkle chocolate on top. Let stand until chocolate is melted, 4 to 5 minutes, then spread over toffee with cleaned spatula. Sprinkle evenly with chopped peanuts, then freeze until chocolate is firm, about 30 minutes. Break into pieces."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57643068ff66dde1456dfee0/6:4/w_274%2Ch_169/Chocolate-Peanut-Toffee.jpg"
    }
}