{
    "recipe": {
        "title": "Chocolate Chip Bread Pudding with Cinnamon-Rum Sauce ",
        "ingredients": [
            "1 1-pound loaf brioche* or egg bread with crust, cut into 1-inch cubes",
            "10 tablespoons (1 1/4 sticks) unsalted butter, melted",
            "1 cup semisweet chocolate chips",
            "2 1/2 cups half and half",
            "1 cup sugar",
            "6 large eggs",
            "4 large egg yolks",
            "2 tablespoons vanilla extract",
            "1/8 teaspoon salt",
            "2 tablespoons (packed) dark brown sugar",
            "Cinnamon-Rum Sauce"
        ],
        "instructions": [
            "Preheat oven to 350°F. Butter 13x9x2-inch glass baking dish. Place bread in large bowl; pour 8 tablespoons melted butter over bread and toss to coat. Add chocolate chips and toss to combine. Transfer mixture to prepared dish. Whisk half and half, 1 cup sugar, eggs, egg yolks, vanilla extract, and salt in large bowl to blend. Pour over bread cubes in dish. Let stand 30 minutes, occasionally pressing bread cubes into custard. (Can be prepared 1 day ahead. Cover and refrigerate.) Drizzle remaining 2 tablespoons melted butter over pudding; sprinkle with brown sugar. Bake bread pudding until puffed, brown, and set in center, about 1 hour. Serve warm with Cinnamon-Rum Sauce.",
            "Preheat oven to 350°F. Butter 13x9x2-inch glass baking dish. Place bread in large bowl; pour 8 tablespoons melted butter over bread and toss to coat. Add chocolate chips and toss to combine. Transfer mixture to prepared dish.",
            "Whisk half and half, 1 cup sugar, eggs, egg yolks, vanilla extract, and salt in large bowl to blend. Pour over bread cubes in dish. Let stand 30 minutes, occasionally pressing bread cubes into custard. (Can be prepared 1 day ahead. Cover and refrigerate.) Drizzle remaining 2 tablespoons melted butter over pudding; sprinkle with brown sugar. Bake bread pudding until puffed, brown, and set in center, about 1 hour. Serve warm with Cinnamon-Rum Sauce.",
            "*Brioche is a golden, light bread made from egg- and butter-enriched yeast dough. It is available at French bakeries and some large supermarkets.",
            "*Brioche is a golden, light bread made from egg- and butter-enriched yeast dough. It is available at French bakeries and some large supermarkets."
        ],
        "picture_link": null
    }
}