{
    "recipe": {
        "title": "Chocolate, Cherry, and Macadamia Bark ",
        "ingredients": [
            "Unsalted butter for the baking sheet",
            "7 oz (220 g) milk chocolate, chopped",
            "1 oz (30 g) unsweetened chocolate, chopped",
            "3/4 cup (4 oz/120 g) halved roasted macadamia nuts",
            "3/4 cup (4 oz/120 g) pitted dried sour cherries"
        ],
        "instructions": [
            "Butter a baking sheet and line with waxed paper. Combine the chocolates in the top pan of a double boiler or in a heatproof bowl. Place over (not touching) barely simmering water and heat, stirring occasionally, until melted and smooth. Stir 1/2 cup (2 1/2 oz/75 g) of the macadamias and 1/2 cup (2 1/2 oz/75 g) of the cherries into the melted chocolate, then pour onto the prepared baking sheet, tilting to spread slightly. Sprinkle with the remaining 1/4 cup (1 1/2 oz/45 g) each of the nuts and cherries. Refrigerate the candy, uncovered, until firm, about 1 hour. Gently peel the candy from the waxed paper. Then, holding the candy with the waxed paper (to prevent fingerprints), break the chocolate into large, irregular pieces. Store in an airtight container in the refrigerator for up to 2 weeks.",
            "Butter a baking sheet and line with waxed paper. Combine the chocolates in the top pan of a double boiler or in a heatproof bowl. Place over (not touching) barely simmering water and heat, stirring occasionally, until melted and smooth. Stir 1/2 cup (2 1/2 oz/75 g) of the macadamias and 1/2 cup (2 1/2 oz/75 g) of the cherries into the melted chocolate, then pour onto the prepared baking sheet, tilting to spread slightly. Sprinkle with the remaining 1/4 cup (1 1/2 oz/45 g) each of the nuts and cherries. Refrigerate the candy, uncovered, until firm, about 1 hour.",
            "Gently peel the candy from the waxed paper. Then, holding the candy with the waxed paper (to prevent fingerprints), break the chocolate into large, irregular pieces. Store in an airtight container in the refrigerator for up to 2 weeks.",
            "About macadamias These rich nuts originated in Australia, but are now widely grown in Hawaii. Smooth, off-white, and round, macadamia nuts resemble large chickpeas (garbanzo beans). Oil rich, they add crunch and buttery flavor to candies and baked goods.",
            "These rich nuts originated in Australia, but are now widely grown in Hawaii. Smooth, off-white, and round, macadamia nuts resemble large chickpeas (garbanzo beans). Oil rich, they add crunch and buttery flavor to candies and baked goods."
        ],
        "picture_link": null
    }
}