{
    "recipe": {
        "title": "Chocolate Cream Pie ",
        "ingredients": [
            "1 1/3 cups chocolate wafer crumbs (from about 26 cookies such as Nabisco Famous Chocolate Wafers)",
            "5 tablespoons unsalted butter, melted",
            "1/4 cup sugar",
            "2/3 cup sugar",
            "1/4 cup cornstarch",
            "1/2 teaspoon salt",
            "4 large egg yolks",
            "3 cups whole milk",
            "5 oz fine-quality bittersweet chocolate (not unsweetened), melted",
            "2 oz unsweetened chocolate, melted",
            "2 tablespoons unsalted butter, softened",
            "1 teaspoon vanilla",
            "3/4 cup chilled heavy cream",
            "1 tablespoon sugar"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 350°F.",
            "Stir together crumbs, butter, and sugar and press on bottom and up side of a 9-inch pie plate (1-quart capacity). Bake until crisp, about 15 minutes, and cool on a rack.",
            "Make filling: Whisk together sugar, cornstarch, salt, and yolks in a 3-quart heavy saucepan until combined well, then add milk in a stream, whisking. Bring to a boil over moderate heat, whisking, then reduce heat and simmer, whisking, 1 minute (filling will be thick). Force filling through a fine-mesh sieve into a bowl, then whisk in chocolates, butter, and vanilla. Cover surface of filling with a buttered round of wax paper and cool completely, about 2 hours. Spoon filling into crust and chill pie, loosely covered, at least 6 hours.",
            "Whisk together sugar, cornstarch, salt, and yolks in a 3-quart heavy saucepan until combined well, then add milk in a stream, whisking. Bring to a boil over moderate heat, whisking, then reduce heat and simmer, whisking, 1 minute (filling will be thick).",
            "Force filling through a fine-mesh sieve into a bowl, then whisk in chocolates, butter, and vanilla. Cover surface of filling with a buttered round of wax paper and cool completely, about 2 hours.",
            "Spoon filling into crust and chill pie, loosely covered, at least 6 hours.",
            "Make topping: Just before serving, beat cream with sugar in a bowl using an electric mixer until it just holds stiff peaks, then spoon on top of pie.",
            "Just before serving, beat cream with sugar in a bowl using an electric mixer until it just holds stiff peaks, then spoon on top of pie."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59a424fc882e3f1b79ea4a82/6:4/w_274%2Ch_169/chocolate-pudding-pie-recipe-082817.jpg",
        "color": 10298178
    }
}