{
    "recipe": {
        "title": "Chocolate-Dipped Ice Cream Sandwiches ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "1 cup all purpose flour",
            "1/4 teaspoon baking soda",
            "Pinch of salt",
            "1/2 cup (1 stick) unsalted butter, cut into 4 pieces",
            "1/2 cup (packed) golden brown sugar",
            "2 tablespoons golden syrup (such as Lyle's) or light corn syrup",
            "2 large egg yolks",
            "1/2 teaspoon vanilla extract",
            "2 2/3 cups premium ice cream (such as dulce de leche or banana), softened",
            "9 ounces bittersweet chocolate (do not exceed 61% cacao), chopped",
            "3 tablespoons vegetable oil",
            "Assorted decorations (such as chopped nuts, colored sprinkles, toffee bits, and cacao nibs)",
            "Even easier: Make sandwiches with your favorite cookies and ice cream. Dip in the melted chocolate, then decorate.",
            "Test-kitchen tip: If you use a soft ice cream (such as dulce de leche), the sandwiches can be served directly from the freezer. If made with a firmer ice cream, they'll need to soften at room temperature for about ten minutes."
        ],
        "instructions": [
            "Preheat oven to 325°F. Line 13 x 9 x 2-inch metal baking pan (preferably with straight sides) with foil, leaving 1-inch overhang on long sides. Coat lightly with nonstick spray.",
            "Whisk flour, baking soda, and pinch of salt in medium bowl. Melt butter in medium skillet over medium heat. Cook until milk solids on bottom of pan turn deep golden brown, stirring often, about 5 minutes. Transfer browned butter to small bowl.",
            "Place sugar and syrup in large bowl. Pour browned butter over. Whisk to combine (mixture will not be smooth). Whisk in egg yolks and vanilla. Add flour mixture; stir just to blend. Transfer soft dough to prepared pan; press into even layer.",
            "Bake cookie layer until golden brown around edges and sides are just beginning to pull away from pan edges, 15 to 17 minutes. Cool completely in pan on rack.",
            "Using foil overhang as aid, lift cookie layer from pan and place on work surface. Place sheet of plastic wrap lengthwise in same pan, leaving overhang on both short sides of pan. Place another sheet of plastic wrap crosswise in pan, leaving overhang on long sides of pan. Cut cookie layer in half crosswise. Return 1 cookie half, top side down, to pan, placing snugly in 1 short end of pan. Slightly soften ice cream in microwave in 15-second intervals. Spread ice cream evenly over cookie in pan. Place second cookie half, top side up, atop ice cream, pressing slightly to adhere. Fold plastic wrap up and over ice cream-filled cookie. Freeze until firm, at least 4 hours.",
            "Line baking sheet with parchment paper or waxed paper. Unwrap ice cream-filled cookie; place on work surface. Using serrated knife, cut cookie lengthwise in half, then cut each strip crosswise into 4 sandwiches. Place on sheet; freeze.",
            "Stir chocolate and oil in medium metal bowl set over saucepan of barely simmering water until melted and smooth; cool to lukewarm. Arrange decorations on plates. Working with 1 ice cream sandwich at a time, dip half of sandwich in melted chocolate, allowing excess chocolate to drip back into bowl. Press sandwich gently into decorations on plate. Return to sheet in freezer. Freeze until chocolate sets and freezes, about 1 hour. DO AHEAD: Can be made 2 days ahead. Wrap each sandwich individually in foil and keep frozen."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b31c7d3edeef84363bbde4/6:4/w_274%2Ch_169/360258_ice-cream-sandwiches_1x1.jpg"
    }
}