{
    "recipe": {
        "title": "Chocolate Chip Cookies/Cookie Sandwiches ",
        "ingredients": [
            "1 cup coconut oil",
            "6 tablespoons homemade applesauce or store-bought unsweetened applesauce",
            "1 teaspoon salt",
            "2 tablespoons pure vanilla extract",
            "1 ¼ cups evaporated cane juice",
            "2 cups Bob's Red Mill gluten-free all-purpose baking flour",
            "¼ cup flax meal",
            "1 teaspoon baking soda",
            "1 ½ teaspoons xanthan gum",
            "1 cup vegan chocolate chips"
        ],
        "instructions": [
            "Preheat the oven the 325°F. Line 2 baking sheets with parchment paper. In a medium bowl, mix together the oil, applesauce, salt, vanilla, and evaporated cane juice. In another medium bowl, whisk together the flour, flax meal, baking soda and xanthan gum. Using a rubber spatula, carefully add the dry ingredients to the wet mixture and stir until a grainy dough is formed. Gently fold in the chocolate chips just until they are evenly distributed through the dough. Using a melon baller, scoop the dough onto the prepared baking sheets, spacing the portions 1 inch apart. Gently press each with the heel of your hand to help them spread. Bake the cookies on the center rack for 15 minutes, rotating the sheets 180 degrees after 9 minutes. The finished cookies will be crisp on the edges and soft in the center. Let the cookies stand on the sheets for 10 minutes, then transfer them to a wire rack and cool completely before covering. Store the cookies in an airtight container at room temperature for up to 3 days.",
            "Preheat the oven the 325°F. Line 2 baking sheets with parchment paper.",
            "In a medium bowl, mix together the oil, applesauce, salt, vanilla, and evaporated cane juice. In another medium bowl, whisk together the flour, flax meal, baking soda and xanthan gum. Using a rubber spatula, carefully add the dry ingredients to the wet mixture and stir until a grainy dough is formed. Gently fold in the chocolate chips just until they are evenly distributed through the dough.",
            "Using a melon baller, scoop the dough onto the prepared baking sheets, spacing the portions 1 inch apart. Gently press each with the heel of your hand to help them spread. Bake the cookies on the center rack for 15 minutes, rotating the sheets 180 degrees after 9 minutes. The finished cookies will be crisp on the edges and soft in the center.",
            "Let the cookies stand on the sheets for 10 minutes, then transfer them to a wire rack and cool completely before covering. Store the cookies in an airtight container at room temperature for up to 3 days."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a5b9e0acd286555db8be/6:4/w_274%2Ch_169/353949_hires.jpg"
    }
}