{
    "recipe": {
        "title": "Chocolate-Honey Tart ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "9 whole chocolate graham crackers (about 5 ounces)",
            "4 tablespoons unsalted butter, room temperature, divided",
            "1 tablespoon honey",
            "1 cup whipping cream",
            "2 teaspoons dried lavender blossoms*",
            "12 ounces bittersweet or semisweet chocolate chips",
            "1 tablespoon unsweetened cocoa powder"
        ],
        "instructions": [
            "Preheat oven to 350°F. Spray 9-inch diameter tart pan with removable bottom with nonstick spray. Grind graham crackers with 3 tablespoons butter and honey in processor until fine crumbs form. Press crumbs evenly onto bottom (not up sides) of prepared tart pan. Bake until set, about 10 minutes. Cool. Bring cream and lavender just to boil in small saucepan. Reduce heat to low and simmer 5 minutes. Place chocolate in medium saucepan. Strain hot cream mixture into saucepan with chocolate. Stir over medium-low heat just until melted and smooth. Add cocoa powder and remaining 1 tablespoon butter; stir until melted and smooth. Pour chocolate mixture over crust in tart pan. Chill at least 45 minutes (chocolate will be slightly soft after 45 minutes and firm after 2 hours). Cut into wedges and serve. DO AHEAD: Can be made 1 day ahead. Cover and keep chilled. Let stand at room temperature 1 hour before serving.",
            "Preheat oven to 350°F. Spray 9-inch diameter tart pan with removable bottom with nonstick spray. Grind graham crackers with 3 tablespoons butter and honey in processor until fine crumbs form. Press crumbs evenly onto bottom (not up sides) of prepared tart pan. Bake until set, about 10 minutes. Cool.",
            "Bring cream and lavender just to boil in small saucepan. Reduce heat to low and simmer 5 minutes. Place chocolate in medium saucepan. Strain hot cream mixture into saucepan with chocolate. Stir over medium-low heat just until melted and smooth. Add cocoa powder and remaining 1 tablespoon butter; stir until melted and smooth. Pour chocolate mixture over crust in tart pan. Chill at least 45 minutes (chocolate will be slightly soft after 45 minutes and firm after 2 hours). Cut into wedges and serve. DO AHEAD: Can be made 1 day ahead. Cover and keep chilled. Let stand at room temperature 1 hour before serving.",
            "Also called culinary lavender buds; available at many natural foods stores and some farmers' markets and from Dean and Deluca<\\a>",
            "Also called culinary lavender buds; available at many natural foods stores and some farmers' markets and from Dean and Deluca<\\a>",
            "Also called culinary lavender buds; available at many natural foods stores and some farmers' markets and from Dean and Deluca<\\a>"
        ],
        "picture_link": "https://assets.epicurious.com/photos/573b18a102b760eb4b9de8e3/6:4/w_274%2Ch_169/241875_hires.jpg"
    }
}