{
    "recipe": {
        "title": "Chocolate Kumquat Spring Rolls ",
        "ingredients": [
            "5 kumquats, cut into 1/4-inch slices and seeded, juices reserved",
            "1/2 cup plus 1 tablespoon ( 4 1/2 ounces/127 grams) heavy whipping cream",
            "1/8 teaspoon of salt",
            "8 1/4 ounces (233 grams) bittersweet chocolate, finely chopped",
            "1 large egg yolk",
            "1 tablespoon Grand Marnier",
            "1 tablespoon unsalted butter, softened",
            "Thirty-six 5-inch square spring roll wrappers",
            "1 large egg, lightly beaten",
            "Canola, vegetable, or other neutral oil for deep-frying"
        ],
        "instructions": [
            "1. Put the kumquat slices and their juices into a small saucepan, add the cream and salt, and warm over medium heat just until bubbles form around the edges of the pan. Remove from the heat.",
            "2. Put the chocolate into the bowl of a food processor and pour the hot kumquat cream over it. Let sit for 2 minutes, then process until the mixture becomes smooth and shiny. Add the egg yolk, Grand Marnier, and butter and process to combine.",
            "3. Line an 8 1/2 x 4 1/2-inch loaf pan with plastic wrap. Pour the chocolate mixture into the pan and transfer to the freezer. Freeze, uncovered, until completely hard.",
            "4. Unmold the chocolate bar and peel off the plastic wrap. Cut the bar lengthwise in half, then cut each half crosswise into 1/2-inch slices. You should have 36 chocolate bars.",
            "5. Lightly brush the entire surface of a spring roll wrapper with a bit of the beaten egg. Turn the wrapper so that you see a diamond, and lay a chocolate bar across the end closest to you so that the ends of the bar meet the edges of the wrapper to form a triangle. Take the corner of the wrapper closest to you and wrap it around the chocolate, then roll the chocolate away from you one full rotation. Tightly fold the sides in toward the center, then continue to roll up to the end of the wrapper, making sure the end is tightly sealed. Set on a baking sheet. Repeat with the remaining wrappers and chocolate. Freeze the spring rolls for at least 10 minutes or up to 2 days; take them out only when you are ready to fry them.",
            "6. Fill a saucepan with oil to a depth of 2 inches and heat to 350°F. When the oil is ready (a tiny pinch of flour will sizzle), add a few spring rolls, taking care to not crowd the pan, and cook, turning occasionally and adjusting the heat as necessary to maintain 350°F, until golden brown, about 4 minutes. Drain on paper towels and cook the remaining rolls. Serve warm."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d77f97b55306961bf32e0/6:4/w_274%2Ch_169/241616_hires.jpg",
        "color": 11765196
    }
}