{
    "recipe": {
        "title": "Chocolate-Chestnut Mousse ",
        "ingredients": [
            "10.5 ounces vacuum-packed or jarred roasted or steamed chestnuts (about 2 cups)",
            "2 cups whole milk",
            "1/2 cup sugar",
            "1 tablespoon vanilla extract",
            "1/2 teaspoon kosher salt",
            "5 ounces best-quality bittersweet chocolate (at least 70% cacao), divided",
            "1 1/2 teaspoons brandy, divided",
            "3 cups heavy cream, divided"
        ],
        "instructions": [
            "Bring chestnuts, milk, sugar, vanilla, and salt to a boil over high heat in a small saucepan. Reduce heat, bring to a simmer, and cook, stirring occasionally, until milk is reduced by one-quarter and chestnuts smash fairly easily against the side of the pot with the back of a spoon, 15–17 minutes.",
            "Meanwhile, finely chop 4 oz. chocolate. Using a peeler, shave remaining 1 oz. chocolate; set aside until ready to serve.",
            "Purée chestnut mixture in a blender on high speed until very smooth, about 2 minutes. Add chopped chocolate and 1 tsp. brandy and blend on high speed until chocolate is melted, about 30 seconds. Scrape into a large bowl and let cool to room temperature, stirring occasionally (if lumps form, stir vigorously until smooth), 15–20 minutes.",
            "Whip 2 cups cream with a whisk in another large bowl until it just barely holds soft peaks. Stir one-third of cream into chocolate mixture to lighten it, then fold in remaining cream just until incorporated. Transfer mousse to a large serving bowl, cover, and chill at least 2 hours or up to 1 day.",
            "Whip remaining 1 cup cream and 1/2 tsp. brandy with whisk in a large bowl to medium peaks. Garnish mousse with reserved chocolate shavings and serve with whipped cream alongside.",
            "Do ahead Mousse can be made 1 day ahead; cover and chill.",
            "Mousse can be made 1 day ahead; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/566607cf00de9d2a3815f9e4/6:4/w_274%2Ch_169/EPI_120315_CHOCOLATEMOUSSE_160.jpg",
        "color": 12921363
    }
}