{
    "recipe": {
        "title": "Chocolate Hazelnut Torte ",
        "ingredients": [
            "1 stick (1/2 cup) unsalted butter plus additional for greasing pan",
            "1 cup hazelnuts (5 oz)",
            "6 oz fine-quality bittersweet chocolate (not unsweetened; not more than 60% cacao)",
            "2 tablespoons potato starch",
            "1/4 teaspoon salt",
            "1/2 cup sugar",
            "4 large eggs, separated, at room temperature for 30 minutes",
            "1 teaspoon vanilla",
            "Garnish: Passover confectioners sugar",
            "a 9- to 91/2-inch springform pan; parchment paper"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 350°F.",
            "Generously butter bottom and side of springform pan, then line bottom with a round of parchment paper and butter parchment paper.",
            "Toast hazelnuts in a shallow baking pan in oven, shaking pan once or twice, until golden, about 12 minutes. Place nuts in a kitchen towel and rub off any loose skins while nuts are still warm, then cool nuts completely.",
            "Reduce oven temperature to 325°F.",
            "While nuts cool, melt butter and chocolate together in a heatproof bowl set over a pot of simmering water.",
            "Pulse hazelnuts in a food processor with potato starch, salt, and 1/4 cup sugar until finely ground. (Be careful not to grind to a paste.)",
            "Whisk together yolks and 2 tablespoons sugar in a large bowl. Whisk in chocolate mixture, then add nut mixture and vanilla and whisk until combined (mixture will be slightly grainy).",
            "Beat whites with a pinch of salt in another bowl with an electric mixer at medium speed until they hold soft peaks. Add remaining 2 tablespoons sugar a little at a time, beating, and beat until whites just hold stiff peaks. Fold one fourth of whites into chocolate mixture to lighten, then fold in remaining whites gently but thoroughly. Pour batter into springform pan, then bake until a wooden pick or skewer inserted in center comes out with a few moist crumbs adhering, 35 to 40 minutes. Transfer to a rack and cool completely in pan, about 1 hour. Run a knife around edge of torte to loosen, then remove side of pan. Dust with Passover confectioners sugar ."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd72df3a00aeb2f1d26ea/6:4/w_274%2Ch_169/234278.jpg"
    }
}