{
    "recipe": {
        "title": "Chocolate Hazelnut Spiced Cookies ",
        "ingredients": [
            "1 1/2 cups hazelnuts (9 ounces), toasted , loose skins rubbed off in a kitchen towel while still warm, and nuts cooled completely",
            "3/4 cup sugar",
            "1/2 cup all-purpose flour",
            "1/2 cup unsweetened cocoa powder (not Dutch-process)",
            "1 teaspoon baking soda",
            "3/4 teaspoon salt",
            "1/2 teaspoon ground cinnamon",
            "1/8 teaspoon ground cloves",
            "3 tablespoons cold unsalted butter, cut into 1/2-inch cubes",
            "1 tablespoon grated orange zest",
            "3 tablespoons fresh orange juice",
            "1 tablespoon hazelnut-flavored liqueur (preferably Frangelico)",
            "1/2 cup confectioners sugar",
            "1/2 cup unsweetened cocoa powder (not Dutch-process)",
            "3 tablespoons water",
            "1 tablespoon hazelnut-flavored liqueur"
        ],
        "instructions": [
            "Preheat oven to 325°F with rack in middle. Butter a large baking sheet.",
            "Pulse hazelnuts, sugar, flour, cocoa powder, baking soda, salt, cinnamon, and cloves in a food processor until nuts are finely chopped, then add butter and zest and pulse until mixture resembles coarse meal with some small (roughly pea-size) butter lumps. Add juice and liqueur and pulse until dough comes together into a ball but is still crumbly. Form level tablespoons of dough into balls and flatten to about 1 1/2 inches in diameter, arranging 1 inch apart on baking sheet.",
            "Bake cookies until puffed and slightly cracked, about 15 minutes. Transfer to a rack to cool completely.",
            "Make icing while cookies cool: Whisk together all icing ingredients until smooth. Dip tops of cooled cookies into icing and transfer to a wax-paper-lined baking sheet. Let stand until icing is set, about 1 hour.",
            "Whisk together all icing ingredients until smooth.",
            "Dip tops of cooled cookies into icing and transfer to a wax-paper-lined baking sheet. Let stand until icing is set, about 1 hour."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d7847f9a841923089d629/6:4/w_274%2Ch_169/242042_hires.jpg",
        "color": 14711133
    }
}