{
    "recipe": {
        "title": "Chocolate-Cinnamon Bundt Cake with Mocha Icing ",
        "ingredients": [
            "1 cup boiling water",
            "1/2 cup natural unsweetened cocoa powder",
            "4 teaspoons instant espresso powder, divided",
            "2 cups unbleached all purpose flour",
            "2 teaspoons baking powder",
            "2 teaspoons ground cinnamon",
            "1 teaspoon salt",
            "2 1/2 cups (packed) golden brown sugar, divided",
            "1 cup vegetable oil",
            "1 tablespoon vanilla extract",
            "2 large eggs",
            "1 1/4 cups mini semisweet chocolate chips, divided",
            "1/4 cup (1/2 stick) unsalted butter, room temperature"
        ],
        "instructions": [
            "Preheat oven to 350°F. Generously brush 12-to 15-cup nonstick Bundt pan with oil. Whisk 1 cup boiling water, cocoa powder, and 2 teaspoons espresso powder in 2-cup glass measure. Whisk 2 cups flour, baking powder, cinnamon, and salt in medium bowl. Using electric mixer, beat 2 cups brown sugar, 1 cup vegetable oil, and 1 tablespoon vanilla in large bowl to blend. Add eggs; beat to blend. Beat mixture until smooth, about 30 seconds longer. Beat in half of flour mixture, then cocoa mixture. Add remaining flour mixture; beat to blend. Fold in 1 cup chocolate chips. Transfer batter to prepared Bundt pan.",
            "Bake cake until tester inserted near center comes out clean, about 50 minutes. Cool the cake 10 minutes. Invert cake onto rack; cool 15 minutes longer.",
            "Meanwhile, stir remaining 1/2 cup brown sugar, 2 teaspoons espresso powder, and 2 tablespoons water in small saucepan over medium heat until sugar melts. Remove from heat. Add butter and remaining 1/4 cup chocolate chips; stir until butter and chocolate melt. Cool slightly. Using spoon, drizzle icing over cake. Cool cake completely, slice, and serve."
        ],
        "picture_link": null,
        "color": 2485748
    }
}