{
    "recipe": {
        "title": "Chocolate Satin ",
        "ingredients": [
            "10 ounces (300 g) 70% bittersweet chocolate, finely chopped (see Notes)",
            "1/2 teaspoon fine sea salt",
            "1 teaspoon pure vanilla extract",
            "2 cups (500 ml) heavy cream",
            "3 large egg whites, free-range and organic, at room temperature (see Notes)",
            "1 cup (120 g) confectioners’ sugar, sifted",
            "A sifter; a heavy-duty mixer fitted with a whisk; a 6-quart (6 l) metal bowl; a 1-1/2-quart (1.5 l) saucepan; an attractive 2-quart (2 l) serving bowl."
        ],
        "instructions": [
            "Place the chocolate in the metal bowl. Sprinkle with the salt and vanilla extract.",
            "In the saucepan, bring the cream just to a simmer over medium heat. Pour the hot cream into the bowl with the chocolate and, working rapidly, mix with a wooden spoon to melt the chocolate until you have a smooth and glossy texture, about 2 minutes. Let cool.",
            "In the bowl of the mixer, whisk the egg whites at the highest speed until frothy, about 10 seconds. Continue whisking until soft peaks form, about 1 minute more. Add the sugar 1 tablespoon at a time and whisk at the highest speed until satiny and stiff peaks form, about 2 minutes more. The mixture should be airy, glossy, and stiff like a meringue.",
            "Add about one-quarter of the egg white mixture to the cooled chocolate mixture to lighten it. Whisk gently until no streaks of white remain. Spoon the rest of the whipped egg white on top of the mixture in the bowl. Fold in the whipped egg white by hand: Using the edge of the spatula or a large metal spoon, cut through the two mixtures until you reach the bottom, then draw the spoon along the bottom of the bowl. Turn your wrist to bring the spoon up the side of the bowl, lightly bringing the chocolate mixture from the bottom to the top. As you do so, turn the bowl about 45 degrees, lightly overturning the spoon to fold the chocolate on top of the egg whites. Turning the bowl as you fold will incorporate the mixtures more efficiently. Continue cutting into the mixture and folding until just incorporated.",
            "Pour the mixture into the serving bowl and cover with plastic wrap. Refrigerate until firm, at least 6 hours or up to 1 week. The dessert will be firmer than a mousse but not as firm as a cake or brownie. Scoop into ice cream bowls with an ice cream scoop or large, rounded spoon. Serve chilled.",
            "Variation: Mix about 1/2 cup (60 g) cocoa nibs into the chocolate mixture before folding, and/or sprinkle the top of the satin with cocoa nibs at serving time.",
            "Mix about 1/2 cup (60 g) cocoa nibs into the chocolate mixture before folding, and/or sprinkle the top of the satin with cocoa nibs at serving time.",
            "Do Ahead This dessert can be prepared up to 1 week in advance, covered with plastic wrap, and refrigerated.",
            "This dessert can be prepared up to 1 week in advance, covered with plastic wrap, and refrigerated."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58bdacd292eece36cc1d3f7b/6:4/w_274%2Ch_169/chocolate-satin-mousse-patricia-wells-030617.jpg"
    }
}