{
    "recipe": {
        "title": "Chocolate-Caramel Slice ",
        "ingredients": [
            "1 cup all purpose flour",
            "1/4 cup (packed) golden brown sugar",
            "2 teaspoons cornstarch",
            "1/4 teaspoon salt",
            "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
            "1 tablespoon ice water",
            "1 large egg yolk",
            "1 (14-ounce) can sweetened condensed milk",
            "1/2 cup (packed) golden brown sugar",
            "6 tablespoons (3/4 stick) unsalted butter, diced",
            "2 tablespoons golden syrup (such as Lyle's Golden Syrup) or dark corn syrup",
            "1 teaspoon vanilla extract",
            "6 ounces bittersweet or semisweet chocolate, chopped",
            "3 tablespoons whipping cream",
            "Flaked sea salt (such as Maldon)"
        ],
        "instructions": [
            "Preheat oven to 350°F. Butter 11x7x2-inch metal baking pan. Blend first 4 ingredients in processor. Add butter. Using on/off turns, blend until coarse meal forms. Add 1 tablespoon ice water and egg yolk. Blend until moist clumps form. Press dough onto bottom of pan; pierce all over with fork. Bake until golden, piercing if crust bubbles, about 20 minutes. Cool completely.",
            "For toppings: Whisk first 5 ingredients in medium saucepan over medium heat until sugar dissolves, butter melts, and mixture comes to boil. Attach candy thermometer to side of pan. Boil gently until caramel is thick and temperature registers 225°F, whisking constantly, about 6 minutes. Pour caramel evenly over crust; cool 15 minutes to set.",
            "Whisk first 5 ingredients in medium saucepan over medium heat until sugar dissolves, butter melts, and mixture comes to boil. Attach candy thermometer to side of pan. Boil gently until caramel is thick and temperature registers 225°F, whisking constantly, about 6 minutes. Pour caramel evenly over crust; cool 15 minutes to set.",
            "Meanwhile, melt chocolate with cream in microwave in 15-second intervals, stirring occasionally. Spread chocolate over warm caramel; sprinkle with sea salt. Refrigerate until chocolate is set, at least 1 hour. DO AHEAD Can be made 3 days ahead. Cover and keep refrigerated. Cut dessert lengthwise into 4 strips. Cut each strip crosswise into 5 or 6 slices. Transfer to platter and serve.",
            "Meanwhile, melt chocolate with cream in microwave in 15-second intervals, stirring occasionally. Spread chocolate over warm caramel; sprinkle with sea salt. Refrigerate until chocolate is set, at least 1 hour. DO AHEAD Can be made 3 days ahead. Cover and keep refrigerated.",
            "Cut dessert lengthwise into 4 strips. Cut each strip crosswise into 5 or 6 slices. Transfer to platter and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9991f3a00aeb2f1cf5b2/6:4/w_274%2Ch_169/238232.jpg",
        "color": 1853410
    }
}