{
    "recipe": {
        "title": "Chocolate Tart with Candied Clementine Peel ",
        "ingredients": [
            "Vegetable oil for greasing pan",
            "5 ounces wheatmeal biscuits such as Carr's whole-wheat crackers, finely ground (1 1/3 cups)",
            "2 tablespoons sugar",
            "5 tablespoons unsalted butter, melted",
            "2 large egg yolks",
            "1 1/3 cups heavy cream",
            "10 1/2 ounces fine-quality bittersweet chocolate (not unsweetened), finely chopped",
            "1/2 cup candied clementine peel (not sugarcoated; recipe follows), finely chopped",
            "Garnish: candied clementine peel",
            "a 9- or 10-inch fluted round tart pan (1 inch deep) with a removable bottom; an instant-read thermometer"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 350°F. Lightly oil tart pan.",
            "Stir together biscuit crumbs, sugar, and butter in a bowl, then press crumb mixture evenly onto bottom of tart pan. Bake crust 10 minutes, then cool completely in pan on a rack.",
            "Make filling: Lightly beat yolks in a small bowl. Bring cream to a simmer in a 2-quart heavy saucepan and remove from heat. Add about one third of hot cream to yolks in a slow stream, whisking constantly, then pour yolk mixture into remaining cream, whisking. Cook custard over moderately low heat, stirring constantly with a wooden spoon, until it is thick enough to coat back of spoon and registers 170°F on thermometer, 1 to 2 minutes (do not let boil). Remove from heat and add chopped chocolate, whisking until smooth, then whisk in chopped candied peel. Pour filling evenly over crust and chill tart, uncovered, until firm, at least 2 hours. Remove side of pan and serve tart chilled or at cool room temperature.",
            "Lightly beat yolks in a small bowl. Bring cream to a simmer in a 2-quart heavy saucepan and remove from heat. Add about one third of hot cream to yolks in a slow stream, whisking constantly, then pour yolk mixture into remaining cream, whisking.",
            "Cook custard over moderately low heat, stirring constantly with a wooden spoon, until it is thick enough to coat back of spoon and registers 170°F on thermometer, 1 to 2 minutes (do not let boil). Remove from heat and add chopped chocolate, whisking until smooth, then whisk in chopped candied peel.",
            "Pour filling evenly over crust and chill tart, uncovered, until firm, at least 2 hours. Remove side of pan and serve tart chilled or at cool room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de516f3a00aeb2f1d52e4/6:4/w_274%2Ch_169/231393.jpg"
    }
}