{
    "recipe": {
        "title": "Chocolate Cups with Chocolate Mousse ",
        "ingredients": [
            "12 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
            "8 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
            "3 tablespoons water",
            "3 large egg yolks",
            "1/4 cup powdered sugar",
            "1/2 cup ground toasted hazelnuts",
            "2 tablespoons Frangelico (hazelnut liqueur)",
            "1 1/2 cups chilled whipping cream",
            "1/4 cup chopped toasted hazelnuts"
        ],
        "instructions": [
            "Line 10 muffin cups with paper liners. Melt chocolate in top of double boiler over simmering water, stirring until smooth. Spoon 1 tablespoon melted chocolate into each paper liner. Using pastry brush, brush chocolate over bottom and up sides of liners to coat evenly. Freeze until chocolate firms, about 30 minutes",
            "Remelt chocolate; add 1 tablespoon to each cup and brush over bottom and up sides, forming second coat. Freeze until completely set, about 1 hour. (Can be made 1 day ahead. Cover; keep frozen.)",
            "For mousse: Melt chocolate in top of double boiler over simmering water, stirring until smooth. Cool briefly. Meanwhile, combine water, yolks and powdered sugar in large metal bowl. Set bowl over simmering water in base of double boiler and whisk until mixture is frothy and candy thermometer registers 160°F, about 6 minutes. Remove from over water. Using electric mixer, beat until thick and cool, about 3 minutes. Fold cooled chocolate, then ground hazelnuts and Frangelico into yolk mixture. Beat cream in medium bowl until stiff peaks form. Fold into chocolate mixture in 3 additions. Peel paper liner from each chocolate cup. Arrange cups on platter. Pipe mousse into cups, dividing equally. Sprinkle chopped hazelnuts over. Serve immediately or chill up to 1 day.",
            "Melt chocolate in top of double boiler over simmering water, stirring until smooth. Cool briefly.",
            "Meanwhile, combine water, yolks and powdered sugar in large metal bowl. Set bowl over simmering water in base of double boiler and whisk until mixture is frothy and candy thermometer registers 160°F, about 6 minutes. Remove from over water. Using electric mixer, beat until thick and cool, about 3 minutes. Fold cooled chocolate, then ground hazelnuts and Frangelico into yolk mixture. Beat cream in medium bowl until stiff peaks form. Fold into chocolate mixture in 3 additions.",
            "Peel paper liner from each chocolate cup. Arrange cups on platter. Pipe mousse into cups, dividing equally. Sprinkle chopped hazelnuts over. Serve immediately or chill up to 1 day."
        ],
        "picture_link": null
    }
}