{
    "recipe": {
        "title": "Chocolate Sour Cream Zucchini Cake with Chocolate Glaze ",
        "ingredients": [
            "Butter for the pan",
            "3 cups grated zucchini (about 2 smallish ones)",
            "3/4 teaspoon salt, plus more for salting the zucchini",
            "2 1/2 cups all-purpose flour",
            "2/3 cup unsweetened cocoa powder",
            "1 teaspoon baking soda",
            "1/2 teaspoon baking powder",
            "1 2/3 cups sugar",
            "1/2 cup (1 stick) unsalted butter, softened",
            "1/2 cup vegetable oil or light olive oil",
            "2 large eggs, at room temperature",
            "1 1/4 teaspoons vanilla extract",
            "1/2 cup sour cream, at room temperature",
            "Chocolate Glaze"
        ],
        "instructions": [
            "Put the grated zucchini in a colander placed over a large bowl. Salt it lightly, tossing gently to mix. Set aside for 30 minutes to drain.",
            "Preheat the oven to 325°F (170°C). Butter a 9x9-inch cake pan.",
            "Sift the flour, cocoa powder, baking soda, baking powder, and 3/4 teaspoon salt into a bowl.",
            "Combine the sugar, butter, oil, eggs, and vanilla in another large bowl. Using an electric mixer (handheld is fine), beat the ingredients on medium-high speed for 2 minutes, until well blended. Add one-third of the dry mixture to the liquid and blend it in on low speed. Beat in half of the sour cream, followed by another third of the dry mixture, the rest of the sour cream, and the remaining dry mixture. The batter will start to get heavier late in the mixing, and you may want to do the last bit of mixing with a wooden spoon or rubber spatula.",
            "Lift the zucchini out of the colander and give it a gentle squeeze, but don’t squeeze out all the moisture. Add the zucchini to the batter and fold it in with a rubber spatula until evenly mixed. Scrape the batter into the pan and smooth with a spoon.",
            "Bake the cake on the middle oven rack for 60 to 70 minutes, until a tester inserted into the center of the cake comes out clean. Transfer the cake to a cooling rack and cool thoroughly.",
            "When the cake has cooled, prepare the glaze, rewarming it if it has firmed up. When it has thickened slightly but is still thin enough to pour easily, slowly pour it over the cake, tilting the cake to spread it around. Cool for at least 10 minutes before slicing and serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5963e17f8ae8df0e1bed8647/6:4/w_274%2Ch_169/chocolate-sour-cream-zucchini-cake-recipe-071017.jpg",
        "color": 5339918
    }
}