{
    "recipe": {
        "title": "Chocolate Mousse Pie ",
        "ingredients": [
            "21 chocolate sandwich cookies (such as Oreos)",
            "1/4 cup (1/2 stick) unsalted butter, cut into pieces, room temperature",
            "12 ounces semisweet chocolate, finely chopped",
            "1 teaspoon vanilla extract",
            "Pinch of salt",
            "3 3/4 cups chilled whipping cream",
            "1/4 cup sugar",
            "Chocolate shavings (optional)"
        ],
        "instructions": [
            "Preheat oven to 350°F. Butter 9-inch-diameter springform pan with 2 3/4-inch-high sides. Finely grind cookies in processor. Add butter and process until mixture is evenly moistened. Press crumb mixture onto bottom and up sides of prepared pan to form thin crust. Bake crust 5 minutes. Transfer crust to rack and cool completely.",
            "For Mousse: Combine chocolate, vanilla and salt in processor. Bring 1 cup cream to boil in heavy small saucepan. With processor running, gradually pour hot cream through feed tube and process until chocolate is melted and smooth. Transfer mixture to large bowl. Cool to room temperature, stirring occasionally. Beat 2 cups cream and sugar in large bowl to stiff peaks. Fold into chocolate mixture. Pour mousse into prepared crust. Chill until set, about 6 hours. (Can be prepared 1 day ahead.) Beat remaining 3/4 cup cream in medium bowl to firm peaks. Transfer to pastry bag fitted with medium star tip. Pipe rosettes of cream around edge of cake. Garnish with chocolate shavings.",
            "Combine chocolate, vanilla and salt in processor. Bring 1 cup cream to boil in heavy small saucepan. With processor running, gradually pour hot cream through feed tube and process until chocolate is melted and smooth. Transfer mixture to large bowl. Cool to room temperature, stirring occasionally.",
            "Beat 2 cups cream and sugar in large bowl to stiff peaks. Fold into chocolate mixture. Pour mousse into prepared crust. Chill until set, about 6 hours. (Can be prepared 1 day ahead.)",
            "Beat remaining 3/4 cup cream in medium bowl to firm peaks. Transfer to pastry bag fitted with medium star tip. Pipe rosettes of cream around edge of cake. Garnish with chocolate shavings."
        ],
        "picture_link": "https://assets.epicurious.com/photos/583f3202e5ba7cdd0eb88201/6:4/w_274%2Ch_169/chocolate-mousse-pie.jpg"
    }
}