{
    "recipe": {
        "title": "Chocolate Budino with Candied Walnuts ",
        "ingredients": [
            "1/2 cup sugar",
            "1 cup coarsely chopped walnuts",
            "Kosher salt",
            "1 cup bittersweet chocolate wafers (disks, pistoles, fèves; preferably 70%–74% cacao) or 5 oz. chocolate, finely chopped",
            "1 cup heavy cream",
            "1 cup whole milk",
            "6 large egg yolks",
            "1/4 cup sugar",
            "3/4 tsp. kosher salt",
            "1 Tbsp. extra-virgin olive oil (preferably Olio Verde), plus more for serving",
            "Flaky sea salt",
            "Freshly ground black pepper",
            "Salted caramel gelato or ice cream (for serving; optional)"
        ],
        "instructions": [
            "Candied Walnuts: Bring sugar and 1/2 cup water to a boil in a small saucepan over medium-high heat, swirling occasionally to dissolve sugar. As soon as the sugar is dissolved, add walnuts and bring syrup back up to a simmer. Cook, swirling saucepan occasionally for even cooking, until walnuts look slightly translucent and are softened, 30–35 minutes. Drain walnuts in a mesh sieve and arrange in a single layer on a rimmed baking sheet lined with a silicone baking mat or parchment paper. Sprinkle walnuts with salt. Place a rack in upper third of oven and preheat to 300°F. Bake walnuts in oven, stirring once or twice, until well browned, 15–18 minutes. Let cool, then break up into small pieces.",
            "Bring sugar and 1/2 cup water to a boil in a small saucepan over medium-high heat, swirling occasionally to dissolve sugar. As soon as the sugar is dissolved, add walnuts and bring syrup back up to a simmer. Cook, swirling saucepan occasionally for even cooking, until walnuts look slightly translucent and are softened, 30–35 minutes.",
            "Drain walnuts in a mesh sieve and arrange in a single layer on a rimmed baking sheet lined with a silicone baking mat or parchment paper. Sprinkle walnuts with salt.",
            "Place a rack in upper third of oven and preheat to 300°F. Bake walnuts in oven, stirring once or twice, until well browned, 15–18 minutes. Let cool, then break up into small pieces.",
            "Budino and assembly: Place chocolate in a medium bowl; set aside. Bring cream and milk to a bare simmer in a large saucepan and remove from heat. Vigorously whisk egg yolks and sugar in another medium bowl until pale yellow and sugar is dissolved (rub between fingers to check), about 2 minutes. Gradually pour cream mixture into egg yolk mixture, whisking vigorously. Immediately pour egg yolk mixture into saucepan and cook over medium heat, stirring constantly with a heatproof rubber spatula and making sure to get into the corners of the pan, until an instant-read thermometer registers 175°F (custard should be thick enough to coat a spoon; do not let it simmer or allow thermometer to go above 180°F). Pour custard over reserved chocolate and let sit until chocolate is melted, about 5 minutes. Using an immersion blender or a whisk, blend until emulsified (if using a whisk, you may want to strain budino through a fine-mesh sieve after to ensure a silky texture). Add kosher salt and 1 Tbsp. oil to chocolate mixture and blend to incorporate. Divide budino evenly among six 8–12-oz. glasses. Cover with plastic wrap and chill until firm, at least 1 hour. Top each budino with candied walnuts, sprinkle with sea salt and pepper, and drizzle with a little oil. Serve with scoops of gelato if desired.",
            "Place chocolate in a medium bowl; set aside. Bring cream and milk to a bare simmer in a large saucepan and remove from heat.",
            "Vigorously whisk egg yolks and sugar in another medium bowl until pale yellow and sugar is dissolved (rub between fingers to check), about 2 minutes.",
            "Gradually pour cream mixture into egg yolk mixture, whisking vigorously. Immediately pour egg yolk mixture into saucepan and cook over medium heat, stirring constantly with a heatproof rubber spatula and making sure to get into the corners of the pan, until an instant-read thermometer registers 175°F (custard should be thick enough to coat a spoon; do not let it simmer or allow thermometer to go above 180°F).",
            "Pour custard over reserved chocolate and let sit until chocolate is melted, about 5 minutes. Using an immersion blender or a whisk, blend until emulsified (if using a whisk, you may want to strain budino through a fine-mesh sieve after to ensure a silky texture). Add kosher salt and 1 Tbsp. oil to chocolate mixture and blend to incorporate.",
            "Divide budino evenly among six 8–12-oz. glasses. Cover with plastic wrap and chill until firm, at least 1 hour.",
            "Top each budino with candied walnuts, sprinkle with sea salt and pepper, and drizzle with a little oil. Serve with scoops of gelato if desired.",
            "Do Ahead Walnuts can be candied 1 week ahead. Store airtight at room temperature. Budinos (without toppings) can be made 3 days ahead. Keep chilled.",
            "Walnuts can be candied 1 week ahead. Store airtight at room temperature. Budinos (without toppings) can be made 3 days ahead. Keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ba00b2fb1754b7eaace513a/6:4/w_274%2Ch_169/chocolate-budino-with-candied-walnuts-recipe-BA-091718.jpg"
    }
}