{
    "recipe": {
        "title": "Chocolate Chip and Peanut Blondies ",
        "ingredients": [
            "1 cup all purpose flour",
            "1/2 teaspoon salt",
            "1/4 teaspoon baking soda",
            "1/2 cup (1 stick) unsalted butter",
            "1 1/4 cups (packed) golden brown sugar",
            "2 large eggs",
            "1 teaspoon vanilla extract",
            "1/2 cup salted roasted peanuts, divided",
            "1/2 cup bittersweet chocolate chips (about 3 ounces), divided"
        ],
        "instructions": [
            "Preheat oven to 350°F. Butter and flour 8x8x2- inch metal baking pan. Whisk 1 cup flour, salt, and baking soda in medium bowl to blend. Melt 1/2 cup butter in heavy large saucepan over low heat. Remove from heat; add sugar and whisk until smooth. Cool mixture 2 minutes; whisk in eggs and vanilla. Using flexible spatula, stir in flour mixture, then half of peanuts and half of chocolate chips. Spread batter in prepared pan; sprinkle with remaining peanuts and chocolate chips. Bake blondies until golden, tester inserted into center comes out clean, and edges just begin to pull away from sides of pan, about 30 minutes; cool completely in pan on rack. DO AHEAD: Can be made 2 days ahead. Cover tightly and store at room temperature. Cut blondies into 16 squares; serve.",
            "Preheat oven to 350°F. Butter and flour 8x8x2- inch metal baking pan. Whisk 1 cup flour, salt, and baking soda in medium bowl to blend. Melt 1/2 cup butter in heavy large saucepan over low heat. Remove from heat; add sugar and whisk until smooth. Cool mixture 2 minutes; whisk in eggs and vanilla. Using flexible spatula, stir in flour mixture, then half of peanuts and half of chocolate chips. Spread batter in prepared pan; sprinkle with remaining peanuts and chocolate chips.",
            "Bake blondies until golden, tester inserted into center comes out clean, and edges just begin to pull away from sides of pan, about 30 minutes; cool completely in pan on rack. DO AHEAD: Can be made 2 days ahead. Cover tightly and store at room temperature.",
            "Cut blondies into 16 squares; serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a5b36a59cdb91b5ff578/6:4/w_274%2Ch_169/353839_hires.jpg"
    }
}