{
    "recipe": {
        "title": "Chocolate Brownies with Peanut Butter Frosting ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "5 ounces unsweetened chocolate, coarsely chopped",
            "4 ounces bittersweet (not unsweetened) or semisweet chocolate, coarsely chopped",
            "1/2 cup (1 stick) unsalted butter",
            "1 1/2 cups sugar",
            "4 large eggs",
            "1 teaspoon vanilla extract",
            "1/2 cup all purpose flour",
            "1/4 teaspoon salt",
            "1 cup creamy peanut butter (do not use old-fashioned or freshly ground)",
            "3 tablespoons unsalted butter, room temperature",
            "2/3 cup powdered sugar",
            "1 teaspoon vanilla extract"
        ],
        "instructions": [
            "Preheat oven to 350°F. Line 13x9x2-inch baking pan with aluminum foil, leaving 2-inch overhang on both short sides. Spray foil with nonstick spray. Combine both chocolates and butter in heavy small saucepan. Stir over low heat until melted and smooth. Cool to barely lukewarm. Using electric mixer, beat sugar, eggs, and vanilla extract in large bowl on high speed until mixture thickens and is pale yellow, about 5 minutes. Reduce mixer speed to low; beat in flour and salt, then melted chocolate mixture. Transfer mixture to prepared baking pan.",
            "Bake brownies until tester inserted into center comes out with moist crumbs still attached, about 20 minutes. Transfer baking pan to rack; cool 15 minutes. Press gently on edges of brownies to level with center. Cool completely in baking pan.",
            "For frosting: Combine peanut butter and butter in medium bowl. Using electric mixer, beat until smooth. Add powdered sugar and vanilla extract and beat until well blended and smooth. Spread frosting evenly over brownies in pan. Refrigerate at least 1 hour. Using foil as aid, lift out brownies from pan. Cut into squares. (Can be prepared 1 day ahead. Cover and keep refrigerated. Let stand at room temperature 30 minutes before serving.)",
            "Combine peanut butter and butter in medium bowl. Using electric mixer, beat until smooth. Add powdered sugar and vanilla extract and beat until well blended and smooth. Spread frosting evenly over brownies in pan. Refrigerate at least 1 hour. Using foil as aid, lift out brownies from pan. Cut into squares. (Can be prepared 1 day ahead. Cover and keep refrigerated. Let stand at room temperature 30 minutes before serving.)"
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df25bf9a84192308a85ba/6:4/w_274%2Ch_169/109715.jpg",
        "color": 3771915
    }
}