{
    "recipe": {
        "title": "Chocolate-Filled Hazelnut Cookies ",
        "ingredients": [
            "3/4 cup hazelnuts, toasted , any loose skins rubbed off in a kitchen towel, and cooled",
            "1 cup confectioners sugar",
            "1 stick (1/2 cup) unsalted butter, well softened",
            "1/4 teaspoon finely grated fresh lemon zest",
            "1/8 teaspoon salt",
            "1 cup cake flour (not self-rising)",
            "3 oz fine-quality bittersweet chocolate (not unsweetened; preferably 70% cacao), chopped",
            "parchment paper"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 350°F. Line 2 or 3 baking sheets with parchment paper.",
            "Grind nuts with confectioners sugar in a food processor until powdery (be careful not to process to a paste).",
            "Beat together butter, zest, salt, and nut mixture in a large bowl with a rubber spatula or wooden spoon until creamy, then add flour, stirring until just incorporated (do not overwork).",
            "Roll level 1/2 teaspoons of dough into tiny balls (the size of marbles) and arrange 1 inch apart on baking sheets. Bake, 1 sheet at a time, until very pale golden, 12 to 14 minutes, then slide parchment with cookies onto a rack to cool completely.",
            "Melt chocolate in a metal bowl set over a saucepan of barely simmering water, stirring occasionally, until smooth. Spoon melted chocolate into a small plastic bag and seal bag, forcing out excess air. Snip off 1 bottom corner of bag with scissors to form a small hole.",
            "Pipe a small mound (about 1/8 teaspoon) of melted chocolate onto flat sides of 10 cookies, then top with 10 more cookies, pressing flat sides together to help adhere. Repeat procedure with remaining cookies."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df23ef9a84192308a855a/6:4/w_274%2Ch_169/109547.jpg",
        "color": 13152214
    }
}