{
    "recipe": {
        "title": "Chocolate-Oatmeal Moon Pies ",
        "ingredients": [
            "1 1/4 cups unbleached all-purpose flour",
            "3/4 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "1/2 teaspoon kosher salt",
            "2 1/4 cups old-fashioned oats",
            "1 cup dried tart cherries, chopped",
            "1 cup pecans, chopped",
            "3/4 cup semisweet or bittersweet chocolate (4 ounces), chopped into chocolate chip-size chunks",
            "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
            "1 1/2 cups (packed) dark brown sugar",
            "1 large egg",
            "1 teaspoon vanilla extract",
            "2 7-ounce jars marshmallow creme",
            "1/2 cup semisweet or bittersweet chocolate (2 1/2 ounces), chopped",
            "1 tablespoon honey",
            "1/2 cup heavy cream"
        ],
        "instructions": [
            "Arrange racks in upper and lower thirds of oven; preheat to 350°F. Line 3 baking sheets with parchment paper. Whisk flour, baking powder, baking soda, and salt in a medium bowl. Combine oats, cherries, pecans, and chocolate in a large bowl.",
            "Using an electric mixer, beat butter and sugar in another large bowl, occasionally scraping down sides of bowl, until smooth, about 2 minutes. Add egg and vanilla and beat to blend. Scrape down sides of bowl. With machine running at low speed, gradually add flour mixture; beat just to blend. Stir in oat mixture with a wooden spoon just to blend.",
            "Using a 1-ounce ice cream scoop or scooping out 2 level tablespoonfuls of dough, measure dough into 36 portions. Divide among baking sheets. Using your hands, gently press down on each dough ball until 1/2\" thick.",
            "Bake cookies for 12 minutes. Rotate sheets front to back and top to bottom; continue baking until cookies are golden brown and edges have begun to set but centers are still soft (cookies will appear underdone and shiny in centers), 7-8 minutes longer. Do not overbake. Let cookies cool on baking sheets. DO AHEAD: Cookies can be made 2 days ahead. Store airtight at room temperature.",
            "Spread 1 tablespoon marshmallow creme on bottom of 18 cookies. Sandwich with remaining cookies.",
            "For chocolate dipping sauce: Place chocolate and honey in a medium bowl. Bring cream just to a boil in a small saucepan. Pour over chocolate and honey; let stand for 1 minute; stir until melted and smooth. Drizzle over cookies or serve alongside sandwich cookies for dipping.",
            "Place chocolate and honey in a medium bowl. Bring cream just to a boil in a small saucepan. Pour over chocolate and honey; let stand for 1 minute; stir until melted and smooth. Drizzle over cookies or serve alongside sandwich cookies for dipping."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b411712413537c0d45aab4/6:4/w_274%2Ch_169/388712_moon-pies_1x1.jpg"
    }
}