{
    "recipe": {
        "title": "Chocolate, Hazelnut and Ginger Biscotti ",
        "ingredients": [
            "1 2/3 cups all purpose flour",
            "1 cup sugar",
            "1/3 cup unsweetened cocoa powder",
            "1 teaspoon baking soda",
            "1/2 teaspoon salt",
            "4 large eggs",
            "2 teaspoons vanilla extract",
            "1 1/4 cups semisweet chocolate chips (about 8 ounces)",
            "2/3 cup hazelnuts, toasted, husked, coarsely chopped",
            "1/3 cup finely chopped crystallized ginger",
            "6 ounces good-quality white chocolate (such as Lindt or Baker’s), chopped"
        ],
        "instructions": [
            "Preheat oven to 350°F. Line large baking sheet with parchment paper. Sift first 5 ingredients into medium bowl. Add 3 eggs and vanilla; beat until blended. Stir in chocolate chips, nuts and crystallized ginger (dough will be firm). Turn dough out onto floured surface. Gather into ball. Divide dough in half. Roll each half into 12-inch-long log. Transfer logs to prepared baking sheet, spacing 3 inches apart. Flatten each to 2 1/2-inch-wide log. Whisk remaining egg in small bowl to blend. Brush logs with some of beaten egg. Bake logs until golden and firm to touch, about 35 minutes. Cool logs on baking sheet 15 minutes. Reduce oven temperature to 325°F. Transfer logs to cutting board. Using serrated knife, cut logs crosswise into scant 1/2-inch-wide slices. Place slices, cut side down, on large baking sheets. Bake until firm, about 15 minutes. Transfer biscotti to racks and cool completely. Stir white chocolate in top of double boiler set over barely simmering water until melted and smooth. Remove from over water. Place biscotti on rack set over baking sheet. Using spoon, drizzle melted white chocolate decoratively in zigzag pattern over biscotti. Let stand until chocolate is firm. (Can be prepared ahead. Store biscotti in airtight container at room temperature up to 2 weeks or freeze up to 1 month.)",
            "Preheat oven to 350°F. Line large baking sheet with parchment paper. Sift first 5 ingredients into medium bowl. Add 3 eggs and vanilla; beat until blended. Stir in chocolate chips, nuts and crystallized ginger (dough will be firm). Turn dough out onto floured surface. Gather into ball. Divide dough in half. Roll each half into 12-inch-long log. Transfer logs to prepared baking sheet, spacing 3 inches apart. Flatten each to 2 1/2-inch-wide log. Whisk remaining egg in small bowl to blend. Brush logs with some of beaten egg.",
            "Bake logs until golden and firm to touch, about 35 minutes. Cool logs on baking sheet 15 minutes. Reduce oven temperature to 325°F.",
            "Transfer logs to cutting board. Using serrated knife, cut logs crosswise into scant 1/2-inch-wide slices. Place slices, cut side down, on large baking sheets. Bake until firm, about 15 minutes. Transfer biscotti to racks and cool completely.",
            "Stir white chocolate in top of double boiler set over barely simmering water until melted and smooth. Remove from over water. Place biscotti on rack set over baking sheet. Using spoon, drizzle melted white chocolate decoratively in zigzag pattern over biscotti. Let stand until chocolate is firm. (Can be prepared ahead. Store biscotti in airtight container at room temperature up to 2 weeks or freeze up to 1 month.)"
        ],
        "picture_link": "https://assets.epicurious.com/photos/5612e65df35fab51707e7f56/6:4/w_274%2Ch_169/102709.jpg"
    }
}