{
    "recipe": {
        "title": "Chocolate-Almond Bark with Sea Salt ",
        "ingredients": [
            "1/2 cup sugar",
            "1 tablespoons unsalted butter",
            "1 1/2 cups roasted Marcona almonds (not in oil)",
            "1 pound good-quality dark chocolate (62%-70% cacao), finely chopped",
            "Coarse sea salt (for sprinkling)"
        ],
        "instructions": [
            "Line a baking sheet with a silicone baking mat or foil. Combine sugar with 2 tablespoons water in a small saucepan. Stir over medium-low heat until sugar dissolves. Bring to a boil and cook, occasionally swirling pan and brushing down sides with a wet pastry brush, until caramel is dark amber, about 5 minutes. Remove from heat. Immediately add butter; whisk until melted. Add almonds; stir until well coated. Transfer to baking sheet, spreading out to separate nuts. Let cool. Break up any large clumps of nuts. Set aside 1/4 of nuts. Stir chocolate in a medium bowl set over a saucepan of simmering water until melted. Remove from heat, add nuts from baking sheet, and stir quickly to combine. Spread chocolate-nut mixture on same baking sheet, keeping nuts in a single layer. Top with the reserved nuts; sprinkle with salt. Chill until chocolate is set, about 3 hours. Break bark into pieces and store between layers of parchment or waxed paper. DO AHEAD: Can be made 1 week ahead. Keep chilled.",
            "Line a baking sheet with a silicone baking mat or foil. Combine sugar with 2 tablespoons water in a small saucepan. Stir over medium-low heat until sugar dissolves. Bring to a boil and cook, occasionally swirling pan and brushing down sides with a wet pastry brush, until caramel is dark amber, about 5 minutes. Remove from heat. Immediately add butter; whisk until melted. Add almonds; stir until well coated. Transfer to baking sheet, spreading out to separate nuts. Let cool. Break up any large clumps of nuts. Set aside 1/4 of nuts.",
            "Stir chocolate in a medium bowl set over a saucepan of simmering water until melted. Remove from heat, add nuts from baking sheet, and stir quickly to combine. Spread chocolate-nut mixture on same baking sheet, keeping nuts in a single layer. Top with the reserved nuts; sprinkle with salt. Chill until chocolate is set, about 3 hours.",
            "Break bark into pieces and store between layers of parchment or waxed paper. DO AHEAD: Can be made 1 week ahead. Keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56043aba7c9cb37c518d5d0b/6:4/w_274%2Ch_169/368956_hires.jpg"
    }
}