{
    "recipe": {
        "title": "Chocolate Candy Cane Cookies ",
        "ingredients": [
            "1 3/4 cups all purpose flour",
            "1/2 cup unsweetened cocoa powder (preferably Dutch-process)",
            "1/4 teaspoon salt",
            "1 cup sugar",
            "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
            "1 large egg",
            "1 cup plus 2 tablespoons powdered sugar",
            "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
            "3/4 teaspoon peppermint extract",
            "2 drops (or more) red food coloring",
            "1/2 cup crushed red-and-white-striped candy canes or hard peppermint candies (about 4 ounces)"
        ],
        "instructions": [
            "Whisk flour, cocoa, and salt in medium bowl to blend. Using electric mixer, beat sugar and butter in large bowl until well blended. Beat in egg. Add dry ingredients; beat until blended. Refrigerate dough 1 hour.",
            "Preheat oven to 350°F. Line 2 baking sheets with parchment paper. Scoop out dough by level tablespoonfuls, then roll into smooth balls. Place balls on prepared baking sheets, spacing about 2 inches apart. Using bottom of glass or hands, flatten each ball to 2-inch round (edges will crack). Bake until cookies no longer look wet and small indentation appears when tops of cookies are lightly touched with fingers, about 11 minutes (do not overbake or cookies will become too crisp). Cool on sheet 5 minutes. Transfer chocolate cookies to racks and cool completely.",
            "For filling: Using electric mixer, beat powdered sugar and butter in medium bowl until well blended. Add peppermint extract and 2 drops food coloring. Beat until light pink and well blended, adding more food coloring by dropfuls if darker pink color is desired. Spread 2 generous teaspoons filling evenly over flat side of 1 cookie to edges; top with another cookie, flat side down, pressing gently to adhere. Repeat with remaining cookies and peppermint filling. Place crushed candy canes on plate. Roll edges of cookie sandwiches in crushed candies (candies will adhere to filling). (Cookie sandwiches can be made ahead. Store in single layer in airtight container at room temperature up to 3 days or freeze up to 2 weeks.)",
            "Using electric mixer, beat powdered sugar and butter in medium bowl until well blended. Add peppermint extract and 2 drops food coloring. Beat until light pink and well blended, adding more food coloring by dropfuls if darker pink color is desired. Spread 2 generous teaspoons filling evenly over flat side of 1 cookie to edges; top with another cookie, flat side down, pressing gently to adhere. Repeat with remaining cookies and peppermint filling.",
            "Place crushed candy canes on plate. Roll edges of cookie sandwiches in crushed candies (candies will adhere to filling). (Cookie sandwiches can be made ahead. Store in single layer in airtight container at room temperature up to 3 days or freeze up to 2 weeks.)"
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd6e6f9a84192308a4c3b/6:4/w_274%2Ch_169/233372.jpg",
        "color": 1460604
    }
}