{
    "recipe": {
        "title": "Chocolate Griddle Cakes with Chocolate Sauce ",
        "ingredients": [
            "1 cup heavy cream",
            "7 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped",
            "1/2 cup Dutch-process unsweetened cocoa powder",
            "1 1/4 cups all-purpose flour",
            "1 cup sugar",
            "1/2 teaspoon baking soda",
            "1/8 teaspoon salt",
            "2 whole large eggs",
            "1 large egg yolk",
            "3/4 cup well-shaken buttermilk",
            "1/4 cup vegetable oil",
            "1 teaspoon vanilla",
            "Unsalted butter for greasing griddle"
        ],
        "instructions": [
            "Make sauce: Bring cream to a boil in a 1-quart saucepan, then pour hot cream over chocolate in a bowl, gently whisking until smooth. Keep warm or at room temperature.",
            "Bring cream to a boil in a 1-quart saucepan, then pour hot cream over chocolate in a bowl, gently whisking until smooth. Keep warm or at room temperature.",
            "Make griddle cakes: Sift together cocoa, flour, sugar, baking soda, and salt into a large bowl, then whisk in eggs, yolk, buttermilk, oil, and vanilla until combined well. Heat a griddle or nonstick skillet over moderately low heat and lightly coat with butter. Working in batches of 2 or 3, pour 1/4 cup batter per cake onto hot griddle and cook until bubbles appear on surface, 1 to 2 minutes. Flip cakes with a large spatula and cook until tops spring back when pressed gently, about 1 minute more. Transfer to a plate and loosely cover with foil to keep warm. Add 1/2 teaspoon butter to griddle between batches. Serve cakes in stacks, topped with chocolate sauce.",
            "Sift together cocoa, flour, sugar, baking soda, and salt into a large bowl, then whisk in eggs, yolk, buttermilk, oil, and vanilla until combined well.",
            "Heat a griddle or nonstick skillet over moderately low heat and lightly coat with butter.",
            "Working in batches of 2 or 3, pour 1/4 cup batter per cake onto hot griddle and cook until bubbles appear on surface, 1 to 2 minutes. Flip cakes with a large spatula and cook until tops spring back when pressed gently, about 1 minute more. Transfer to a plate and loosely cover with foil to keep warm. Add 1/2 teaspoon butter to griddle between batches.",
            "Serve cakes in stacks, topped with chocolate sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54bac8d4e231becc7f3d36ab/6:4/w_274%2Ch_169/chocolate-griddlecakes-sauce-6x4.jpg"
    }
}