{
    "recipe": {
        "title": "Chocolate Fudge with Bourbon Sugar ",
        "ingredients": [
            "1 vanilla bean, split lengthwise",
            "1 cup demerara sugar",
            "2 tablespoons bourbon",
            "Nonstick vegetable oil spray",
            "10 ounce bittersweet chocolate (preferably 72%), coarsely chopped",
            "4 ounces unsweetened chocolate, coarsely chopped",
            "1 14-ounce can sweetened condensed milk",
            "10 tablespoons (1 1/4 sticks) unsalted butter, cut into pieces",
            "2 tablespoons bourbon",
            "1 tablespoon light corn syrup",
            "1/4 teaspoons kosher salt",
            "1 vanilla bean, split lengthwise",
            "Flaky sea salt (such as Maldon)"
        ],
        "instructions": [
            "Preheat oven to 150° or as low as yours will go. Scrape vanilla seeds into a small bowl; stir in demerara sugar and bourbon. Spread on a parchment-lined baking sheet and let dry out in oven overnight, leaving door slightly ajar. Mixture should feel like demerara sugar again in the morning.",
            "Fudge: Line an 8x8\" baking dish with parchment paper, leaving a generous overhang on 2 sides; lightly coat with nonstick spray. Heat chocolates in a heatproof bowl set over a saucepan of simmering water (do not let bowl touch water), stirring occasionally, until almost completely melted. Set aside. Combine condensed milk, butter, bourbon, corn syrup, and kosher salt in a small saucepan; scrape in vanilla seeds and add pod. Heat over medium until barely hot (same as the chocolate). Gently stir one quarter of milk mixture into chocolate with a rubber spatula. Add another quarter of milk mixture, stirring to incorporate (it might look broken and greasy; don't worry, it will come back together). Continue with remaining milk mixture in 2 additions, stirring vigorously until fudge is very shiny and almost elastic, about 5 minutes. Scrape into prepared pan and smooth top. Sprinkle with bourbon sugar and sea salt. Let cool, then cover and chill at least 4 hours. Turn out fudge onto a cutting board and slice into 2x3/4\" rectangles, 2\" squares, or triangles.",
            "Line an 8x8\" baking dish with parchment paper, leaving a generous overhang on 2 sides; lightly coat with nonstick spray. Heat chocolates in a heatproof bowl set over a saucepan of simmering water (do not let bowl touch water), stirring occasionally, until almost completely melted. Set aside.",
            "Combine condensed milk, butter, bourbon, corn syrup, and kosher salt in a small saucepan; scrape in vanilla seeds and add pod. Heat over medium until barely hot (same as the chocolate).",
            "Gently stir one quarter of milk mixture into chocolate with a rubber spatula. Add another quarter of milk mixture, stirring to incorporate (it might look broken and greasy; don't worry, it will come back together). Continue with remaining milk mixture in 2 additions, stirring vigorously until fudge is very shiny and almost elastic, about 5 minutes. Scrape into prepared pan and smooth top. Sprinkle with bourbon sugar and sea salt. Let cool, then cover and chill at least 4 hours.",
            "Turn out fudge onto a cutting board and slice into 2x3/4\" rectangles, 2\" squares, or triangles."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54aadd036529d92b2c02e625/6:4/w_274%2Ch_169/51259290_chocolate-fudge-bourbon_1x1.jpg",
        "color": 12792917
    }
}