{
    "recipe": {
        "title": "Chocolate Plum Cake ",
        "ingredients": [
            "3/4 cup (1 1/2 sticks) unsalted butter, plus more for pan",
            "1 pound ripe or very ripe plums, coarsely chopped",
            "6 ounces bittersweet chocolate (70–72% cacao), coarsely chopped",
            "5 large eggs, room temperature",
            "1 1/2 cups sugar",
            "3/4 cup all-purpose flour",
            "1 tablespoon baking powder",
            "1/4 teaspoon kosher salt",
            "1 1/2 cups cold heavy cream",
            "Unsweetened cocoa powder (for dusting)",
            "A 9-inch-diameter springform pan"
        ],
        "instructions": [
            "Preheat oven to 350°F. Butter bottom and sides of springform pan and line bottom with parchment. Purée plums in a blender until very smooth (you need 1 1/2 cups; reserve any additional purée for another use). If plums are not ripe enough to form a very smooth purée, strain through a fine-mesh sieve. Combine chocolate and 3/4 cup butter in a large heatproof bowl. Set bowl over a medium saucepan of barely simmering water (do not let bowl touch water). Stir until chocolate is melted and smooth. Remove bowl from saucepan. Stir plum purée into chocolate mixture until well combined. Using an electric mixer on medium speed, beat eggs and sugar in another large bowl until pale and tripled in volume, 10–12 minutes. Using a rubber spatula, fold about 1/3 of the egg mixture into chocolate mixture to lighten, then fold chocolate mixture into remaining egg mixture until combined. Combine flour, baking powder, and salt in a medium bowl, then fold dry ingredients into chocolate mixture until combined. Pour batter into prepared pan and smooth surface. Bake cake until center is set and sides are beginning to brown, 45–55 minutes. Transfer to a wire rack and let cake cool completely in pan (cake will sink a little in the center as it cools). Meanwhile, using an electric mixer on medium-low speed, beat cream in a large bowl until soft peaks form. Unmold cake (run a knife around the edge to help release, if needed) and transfer to a platter. Mound whipped cream in center of cake, then dust with cocoa powder.",
            "Preheat oven to 350°F. Butter bottom and sides of springform pan and line bottom with parchment.",
            "Purée plums in a blender until very smooth (you need 1 1/2 cups; reserve any additional purée for another use). If plums are not ripe enough to form a very smooth purée, strain through a fine-mesh sieve.",
            "Combine chocolate and 3/4 cup butter in a large heatproof bowl. Set bowl over a medium saucepan of barely simmering water (do not let bowl touch water). Stir until chocolate is melted and smooth. Remove bowl from saucepan. Stir plum purée into chocolate mixture until well combined.",
            "Using an electric mixer on medium speed, beat eggs and sugar in another large bowl until pale and tripled in volume, 10–12 minutes. Using a rubber spatula, fold about 1/3 of the egg mixture into chocolate mixture to lighten, then fold chocolate mixture into remaining egg mixture until combined.",
            "Combine flour, baking powder, and salt in a medium bowl, then fold dry ingredients into chocolate mixture until combined.",
            "Pour batter into prepared pan and smooth surface. Bake cake until center is set and sides are beginning to brown, 45–55 minutes. Transfer to a wire rack and let cake cool completely in pan (cake will sink a little in the center as it cools).",
            "Meanwhile, using an electric mixer on medium-low speed, beat cream in a large bowl until soft peaks form. Unmold cake (run a knife around the edge to help release, if needed) and transfer to a platter. Mound whipped cream in center of cake, then dust with cocoa powder."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560027cbbd6b8b837d72d2d3/6:4/w_274%2Ch_169/EP_09182015_chocolateplumcake_inset.jpg"
    }
}