{
    "recipe": {
        "title": "Chocolate Cream Pie Squares ",
        "ingredients": [
            "7 tablespoons unsalted butter, melted, plus 2 tablespoons unsalted butter, at room temperature",
            "1 package (14.3 ounces) Oreo cookies (about 38 Oreos)",
            "8 ounces semisweet chocolate, finely chopped, or chocolate chips",
            "2 1/2 cups heavy (whipping) cream",
            "1/4 cup confectioners' sugar",
            "1 teaspoon pure vanilla extract"
        ],
        "instructions": [
            "Adjust an oven rack to the middle position and preheat the oven to 350°F. Grease a 10x16-inch rimmed sheet pan with 1 tablespoon room-temperature butter and set aside.",
            "Place the Oreos in the bowl of a food processor and pulverize until fine. Add the melted butter and continue to process until the crumbs hold together when squeezed, about five (1-second) pulses. Turn the cookie crumbs out onto the prepared sheet pan and, with the bottom of a measuring cup, press them to the edges of the prepared pan in an even layer. (Don’t worry about working the crumbs up the sides of the pan.) Bake the crust until it is set, about 8 minutes. Set aside to cool.",
            "Add the chocolate and 1 1/4 cups cream to a microwave-safe bowl and microwave in 20-second increments, stirring between each, until the chocolate is completely melted, about 1 1/2 minutes. Whisk until glossy and smooth. Whisk in the remaining tablespoon of room-temperature butter and pour the chocolate mixture over the baked crust, spreading it evenly with an offset spatula. Cover the pan with plastic wrap and refrigerate until the filling is completely set, about 2 hours.",
            "Combine the remaining 1 1/4 cups cream, confectioners' sugar, and vanilla in a medium-size bowl. Beat with a handheld mixer or a whisk (or using a stand mixer fitted with a whisk) at medium-high speed until the mixture forms stiff peaks. Spread the cream over the chocolate filling. Slice into 20 bars and serve. The bars will keep in an airtight container (or in the sheet pan covered with plastic wrap) in the refrigerator for up to 3 days."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a12fee43accc82cfc6a9ad8/6:4/w_274%2Ch_169/chocolate-cream-pie-squares-recipe-112017.jpg",
        "color": 7173452
    }
}