{
    "recipe": {
        "title": "Chocolate Glazed Chocolate Tart ",
        "ingredients": [
            "9 (5- by 2 1/4-inch) chocolate graham crackers (not chocolate-covered), finely ground (1 cup)",
            "5 tablespoons unsalted butter, melted",
            "1/4 cup sugar",
            "1 1/4 cups heavy cream",
            "9 ounces bittersweet chocolate (not more than 65% cacao if marked), chopped",
            "2 large eggs",
            "1 teaspoon pure vanilla extract",
            "1/4 teaspoon salt",
            "2 tablespoon heavy cream",
            "1 3/4 ounces bittersweet chocolate, finely chopped",
            "1 teaspoon light corn syrup",
            "1 tablespoon warm water",
            "a 9-inch round fluted tart pan (1 inch deep)"
        ],
        "instructions": [
            "Preheat oven to 350°F with rack in middle.",
            "Stir together all ingredients and press evenly onto bottom and 3/4 inch up side of tart pan. Bake until firm, about 10 minutes. Cool on a rack 15 to 20 minutes",
            "Make filling: Bring cream to a boil, then pour over chocolate in a bowl and let stand 5 minutes. Gently stir until smooth. Whisk together eggs, vanilla, and salt in another bowl, then stir into melted chocolate. Pour filling into cooled crust. Bake until filling is set about 3 inches from edge but center is still wobbly, 20 to 25 minutes. (Center will continue to set as tart cools.) Cool completely in pan on rack, about 1 hour.",
            "Bring cream to a boil, then pour over chocolate in a bowl and let stand 5 minutes. Gently stir until smooth. Whisk together eggs, vanilla, and salt in another bowl, then stir into melted chocolate.",
            "Pour filling into cooled crust. Bake until filling is set about 3 inches from edge but center is still wobbly, 20 to 25 minutes. (Center will continue to set as tart cools.) Cool completely in pan on rack, about 1 hour.",
            "Make glaze: Bring cream to a boil and remove from heat. Stir in chocolate until smooth. Stir in corn syrup, then warm water Pour glaze onto tart, then tilt and rotate tart so glaze coats top evenly. Let stand until glaze is set, about 1 hour.",
            "Bring cream to a boil and remove from heat. Stir in chocolate until smooth. Stir in corn syrup, then warm water",
            "Pour glaze onto tart, then tilt and rotate tart so glaze coats top evenly. Let stand until glaze is set, about 1 hour."
        ],
        "picture_link": "https://assets.epicurious.com/photos/573b18a17c662ad74a43a64d/6:4/w_274%2Ch_169/243610_hires.jpg",
        "color": 15675801
    }
}