{
    "recipe": {
        "title": "Chorizo Corn Bread Stuffing ",
        "ingredients": [
            "1 1/2 cups yellow cornmeal",
            "1 cup all-purpose flour",
            "1/4 cup sugar",
            "1 tablespoon baking powder",
            "1 teaspoon salt",
            "1 cup milk",
            "1 large egg",
            "3/4 stick (6 tablespoons) unsalted butter, melted and cooled",
            "1/2 stick (1/4 cup) unsalted butter",
            "2 cups chopped onions",
            "8 ounces Spanish chorizo (dry-cured spiced sausage), casing removed and sausage coarsely chopped (about 1 1/2 cups packed; see Cooks' Notes)",
            "2 cups fresh, or thawed frozen, corn kernels (one 10-ounce package)",
            "1 teaspoon dried sage",
            "1/2 teaspoon salt",
            "1/2 teaspoon freshly ground black pepper",
            "1/2 cup coarsely chopped flat-leaf parsley",
            "2 cups turkey stock or reduced-sodium chicken broth",
            "8-inch square baking pan"
        ],
        "instructions": [
            "For corn bread: Heat oven to 400°F with rack in middle and butter an 8-inch square baking pan. Whisk together cornmeal, flour, sugar, baking powder, and salt in a large bowl. Whisk together milk, egg, and butter in a small bowl and stir into dry ingredients. Pour batter into buttered baking pan. Bake until golden and a tester comes out clean, 25 to 30 minutes. Cool corn bread in pan on a rack 10 minutes, then turn out onto rack to cool completely. Cut corn bread into 3/4-inch cubes and put in a large bowl.",
            "Heat oven to 400°F with rack in middle and butter an 8-inch square baking pan.",
            "Whisk together cornmeal, flour, sugar, baking powder, and salt in a large bowl.",
            "Whisk together milk, egg, and butter in a small bowl and stir into dry ingredients. Pour batter into buttered baking pan.",
            "Bake until golden and a tester comes out clean, 25 to 30 minutes.",
            "Cool corn bread in pan on a rack 10 minutes, then turn out onto rack to cool completely.",
            "Cut corn bread into 3/4-inch cubes and put in a large bowl.",
            "For stuffing: Melt butter in a 12-inch heavy skillet over medium heat, then add onions and cook, stirring occasionally, until softened, about 8 minutes. Add chorizo, corn, sage, salt, and pepper and cook, stirring occasionally, 10 minutes. Remove from heat and add parsley. Toss chorizo mixture with corn bread and transfer to a 13- by 9-inch baking pan. Drizzle with chicken broth. Bake at 400°F uncovered, until golden brown, about 30 minutes.",
            "Melt butter in a 12-inch heavy skillet over medium heat, then add onions and cook, stirring occasionally, until softened, about 8 minutes.",
            "Add chorizo, corn, sage, salt, and pepper and cook, stirring occasionally, 10 minutes. Remove from heat and add parsley.",
            "Toss chorizo mixture with corn bread and transfer to a 13- by 9-inch baking pan. Drizzle with chicken broth.",
            "Bake at 400°F uncovered, until golden brown, about 30 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b280f29a93d64c380b06e2/6:4/w_274%2Ch_169/369369_chorizo-corn-bread-stuffing_1x1.jpg"
    }
}