{
    "recipe": {
        "title": "Christmas Pork Tenderloin ",
        "ingredients": [
            "5 garlic cloves, peeled",
            "1 tablespoon freshly ground black pepper",
            "1 tablespoon ground allspice",
            "1 tablespoon kosher salt",
            "1 tablespoon light brown sugar",
            "3 tablespoons rosemary leaves, plus 6 sprigs",
            "2 tablespoons extra-virgin olive oil, plus more for brushing",
            "2 large pork tenderloins (about 3 pounds)",
            "12 ounces thin-sliced bacon (about 12 slices)",
            "Cranberry sauce (for serving; optional)"
        ],
        "instructions": [
            "Pulse garlic, pepper, allspice, salt, brown sugar, 3 Tbsp. rosemary leaves, and 2 Tbsp. oil in a food processor until a paste forms. Alternatively, finely chop garlic and 3 Tbsp. rosemary leaves and transfer to a small bowl; stir in pepper, allspice, salt, brown sugar, and 2 Tbsp. oil. Rub garlic paste all over pork. Let sit at least 30 minutes, or cover and chill up to overnight. Arrange a rack in top third of oven; preheat to 425°F. Wrap each tenderloin in bacon, working in a spiral from top to bottom and letting each layer overlap slightly, until completely covered (about 5 bacon slices per tenderloin). Secure any exposed bacon slice ends with toothpicks. Arrange 6 rosemary sprigs on a rimmed baking sheet. Arrange pork over. Brush tops of tenderloins with oil. Roast pork until an instant-read thermometer inserted into thickest part registers 140°F for medium-rare (about 20 minutes) or 145° for medium, (about 25 minutes). Transfer to a cutting board and let rest 10 minutes before slicing. Serve with cranberry sauce alongside, if using.",
            "Pulse garlic, pepper, allspice, salt, brown sugar, 3 Tbsp. rosemary leaves, and 2 Tbsp. oil in a food processor until a paste forms. Alternatively, finely chop garlic and 3 Tbsp. rosemary leaves and transfer to a small bowl; stir in pepper, allspice, salt, brown sugar, and 2 Tbsp. oil.",
            "Rub garlic paste all over pork. Let sit at least 30 minutes, or cover and chill up to overnight.",
            "Arrange a rack in top third of oven; preheat to 425°F. Wrap each tenderloin in bacon, working in a spiral from top to bottom and letting each layer overlap slightly, until completely covered (about 5 bacon slices per tenderloin). Secure any exposed bacon slice ends with toothpicks.",
            "Arrange 6 rosemary sprigs on a rimmed baking sheet. Arrange pork over. Brush tops of tenderloins with oil. Roast pork until an instant-read thermometer inserted into thickest part registers 140°F for medium-rare (about 20 minutes) or 145° for medium, (about 25 minutes). Transfer to a cutting board and let rest 10 minutes before slicing. Serve with cranberry sauce alongside, if using.",
            "Do Ahead Pork can be rubbed 1 day ahead. Cover and chill.",
            "Pork can be rubbed 1 day ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a270e5204072728dadcd2e1/6:4/w_274%2Ch_169/Christmas-Pork-Tenderloin-28112017.jpg"
    }
}