{
    "recipe": {
        "title": "Christina Tosi's Christmas Treats ",
        "ingredients": [
            "4 tablespoons (1/2 stick) unsalted butter",
            "4 cups mini marshmallows*",
            "6 cups cereal (Rice Krispies, cornflakes, Golden Grahams, Kix, etc.)",
            "Nonstick vegetable-oil spray",
            "Up to 1 cup dried fruit, such as blueberries, cranberries, cherries, banana chips, or candied ginger, large pieces chopped or crushed",
            "Up to 1 cup nuts or seeds, such as pecans, peanuts, walnuts, pepitas, or sunflower seeds, toasted and coarsely chopped",
            "1/2 cup semisweet chocolate chips",
            "1/4 cup creamy peanut butter (do not use natural or freshly ground; mix peanut butter into the melted-marshmallow mixture before adding cereal)",
            "1 to 2 tablespoons sesame seeds",
            "2 tablespoons sprinkles or other edible decoration",
            "1/2 teaspoon ground spices, such as cinnamon or ginger",
            "*To make this recipe, you'll need slightly less than 1 (16-ounce) bag of mini marshmallows. Snack on the extras or save them for hot cocoa.",
            "Equipment: 9- by 13-inch baking pan, parchment or wax paper"
        ],
        "instructions": [
            "Spray a 9- by 13-inch baking pan with nonstick vegetable-oil spray.",
            "In an extra-large saucepan over low heat, melt the butter. Add the marshmallows and heat, stirring constantly, until completely melted, about 2 minutes. (Add the peanut butter, if using, and stir to combine.) Remove from the heat, add the cereal and use a sturdy, long-handled wooden or metal spoon to stir until the cereal is well coated in the butter-marshmallow mixture. Add any optional mix-ins and stir to incorporate.",
            "Scrape the mixture into the prepared pan and spread evenly. Cut a piece of parchment or wax paper into a roughly 9- by 13-inch rectangle and spray with nonstick vegetable-oil spray. Place the greased parchment or wax paper on top of the treats and press the mixture into the pan until it's 1/2 to 1 inch thick. Let cool until firm, 15 to 20 minutes.",
            "Using a large, sharp knife cut the treats into approximately 2-inch squares. DO AHEAD: Treats can be made ahead and kept, in an airtight container at room temperature, for 2 to 3 days, or frozen up to 1 month."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad405519925f464b3b2929/6:4/w_274%2Ch_169/51205030_hchristmas-treats_1x1.jpg",
        "color": 3110413
    }
}