{
    "recipe": {
        "title": "Christmas Gallete ",
        "ingredients": [
            "1 1/2 cups all purpose flour",
            "2 tablespoons sugar",
            "3/4 teaspoon salt",
            "10 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
            "2 tablespoons chilled nonhydrogenated solid vegetable shortening, cut into 1/2-inch cubes",
            "2 tablespoons (or more) ice water",
            "3 medium Granny Smith apples (1 1/4 pounds total), peeled, cored, cut into 1/2-inch cubes (about 4 cups)",
            "2 firm but ripe medium Anjou or Bartlett pears (about 18 ounces), peeled, cored, cut into 1/2-inch cubes (about 2 1/2 cups)",
            "1 cup assorted moist plump dried fruit (such as raisins, cherries, and diced apricots)",
            "7 tablespoons orange marmalade, divided",
            "4 tablespoons sugar, divided",
            "1 teaspoon finely grated peeled fresh ginger",
            "3/4 teaspoon ground ginger",
            "Nonstick vegetable-oil spray",
            "Vanilla ice cream or sweetened whipped cream"
        ],
        "instructions": [
            "Mix flour, sugar, and salt in processor. Add butter and shortening; pulse until coarse meal forms. Add 2 tablespoons ice water; pulse until moist clumps form, adding more water by teaspoonfuls if dry. Gather dough into ball; flatten into disk and wrap in plastic. Chill 2 hours. DO AHEAD: Can be made 1 day ahead. Keep chilled. Let stand at room temperature 30 minutes before continuing.",
            "For filling: Preheat oven to 425°F. Mix apples, pears, dried fruit, 3 tablespoons marmalade, 3 tablespoons sugar, fresh ginger, and ground ginger in large bowl to coat. Roll crust out between 2 large sheets of waxed paper to 13-inch round. Place sheet of parchment on rimless baking sheet; spray parchment with nonstick spray. Remove top sheet of waxed paper from crust. Invert crust onto parchment, then peel off second sheet of waxed paper. Spoon filling onto crust, leaving 2-inch border around edges. Fold crust border up and over filling, folding and pleating occasionally. Brush crust edges lightly with water. Sprinkle damp crust with remaining 1 tablespoon sugar. Bake galette 50 minutes. Reduce heat to 400°F. Loosely cover filling with small sheet of foil. Bake until crust is deep golden and filling is tender, about 20 minutes longer. Slide knife or offset spatula under galette to loosen from parchment. Cool galette slightly on sheet on rack. Heat remaining 4 tablespoons marmalade and 1 tablespoon water in small saucepan over medium heat, stirring often, until marmalade melts. Spoon marmalade glaze over filling. Serve galette warm or at room temperature with vanilla ice cream or sweetened whipped cream.",
            "Preheat oven to 425°F. Mix apples, pears, dried fruit, 3 tablespoons marmalade, 3 tablespoons sugar, fresh ginger, and ground ginger in large bowl to coat.",
            "Roll crust out between 2 large sheets of waxed paper to 13-inch round. Place sheet of parchment on rimless baking sheet; spray parchment with nonstick spray. Remove top sheet of waxed paper from crust. Invert crust onto parchment, then peel off second sheet of waxed paper. Spoon filling onto crust, leaving 2-inch border around edges. Fold crust border up and over filling, folding and pleating occasionally.",
            "Brush crust edges lightly with water. Sprinkle damp crust with remaining 1 tablespoon sugar.",
            "Bake galette 50 minutes. Reduce heat to 400°F. Loosely cover filling with small sheet of foil.",
            "Bake until crust is deep golden and filling is tender, about 20 minutes longer. Slide knife or offset spatula under galette to loosen from parchment. Cool galette slightly on sheet on rack.",
            "Heat remaining 4 tablespoons marmalade and 1 tablespoon water in small saucepan over medium heat, stirring often, until marmalade melts. Spoon marmalade glaze over filling.",
            "Serve galette warm or at room temperature with vanilla ice cream or sweetened whipped cream."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d7967f3a00aeb2f1cb7c5/6:4/w_274%2Ch_169/350779_hires.jpg"
    }
}