{
    "recipe": {
        "title": "Christmas Bombe with Spiced Cake and Chocolate-Brandy Glaze ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "1/2 cup light corn syrup",
            "1/2 cup sugar",
            "2 large egg whites",
            "1/8 teaspoon cream of tartar",
            "2 (8-ounce) packages cream cheese, softened",
            "1 cup heavy cream",
            "3/4 cup sweetened condensed milk",
            "1 teaspoon vanilla extract",
            "1/8 teaspoon kosher salt",
            "1 1/4 cups dried, bright orange apricots (about 8 ounces), halved",
            "1 1/4 cups Luxardo or maraschino cherries (about 7 ounces), halved, rinsed, patted dry",
            "1 1/4 cups unsalted pistachios (about 6 ounces), coarsely chopped",
            "Nonstick vegetable oil spray",
            "1 cup (2 sticks) unsalted butter",
            "6 ounces bittersweet chocolate (70–72% cacao), coarsely chopped",
            "5 large eggs, room temperature",
            "1 1/2 cups sugar",
            "3/4 cup all-purpose flour",
            "1 tablespoon baking powder",
            "1 1/4 teaspoons ground cinnamon",
            "1/4 teaspoon finely grated orange zest",
            "1/4 teaspoon ground cloves",
            "1/4 teaspoon ground nutmeg",
            "1/4 teaspoon kosher salt",
            "4 1/2 ounces bittersweet chocolate, chopped",
            "1/2 cup plus 2 tablespoons heavy cream",
            "Pinch of kosher salt",
            "1 tablespoons brandy (optional)",
            "A 9\" round cake pan; a cake board"
        ],
        "instructions": [
            "Spray a large bowl (at least 12-cup capacity; the stainless steel bowl of a stand mixer is perfect) with nonstick spray, then line with plastic wrap, leaving a generous overhang.",
            "Heat corn syrup, sugar, and 1/4 cup water in a small saucepan over low until sugar is melted. Increase heat to medium and cook until an instant-read thermometer registers 240°F, about 5 minutes.",
            "Meanwhile, using an electric mixer on medium-high speed (or a stand mixer fitted with the whisk attachment), beat egg whites and cream of tartar in a large bowl until soft peaks form. Reduce mixer speed to low and carefully add sugar syrup to egg whites in a slow and steady stream. Increase speed to high and beat until mixture is light, glossy, and fluffy, 6–8 minutes.",
            "Using electric mixer on high speed, beat cream cheese in another large bowl until creamy, about 3 minutes. Add heavy cream, milk, vanilla, and salt and beat until smooth.",
            "Whisk one–third of meringue into cream cheese mixture to lighten. Gently fold remaining meringue into cream cheese mixture. Fold in apricots, cherries, and pistachios.",
            "Pour mixture into prepared bowl, smooth top, then bring plastic up and over bombe, pressing against bottom of bowl to compact. Freeze until hard, at least 12 hours.",
            "Make the cake: Preheat oven to 350°F. Lightly coat cake pan with nonstick spray. Line bottom of pan with parchment paper; lightly coat parchment with nonstick spray. Heat butter and chocolate in a large heatproof bowl set over a medium saucepan of barely simmering water (do not let bowl touch water), stirring, until chocolate is melted and smooth. Using electric mixer on medium speed, beat eggs and sugar in another large bowl until pale and tripled in volume, 10–12 minutes. Whisk flour, baking powder, cinnamon, orange zest, cloves, nutmeg, and salt in a medium bowl. Whisk dry ingredients into chocolate mixture until well combined. Using a rubber spatula, fold about one-third of egg mixture into chocolate mixture to lighten, then fold chocolate mixture into remaining egg mixture until combined. Pour batter into prepared pan; smooth surface. Bake cake until center is set and sides are beginning to brown, 45–50 minutes. Transfer to a wire rack and let cake cool completely in pan (cake will sink a little in the center as it cools).",
            "Preheat oven to 350°F. Lightly coat cake pan with nonstick spray. Line bottom of pan with parchment paper; lightly coat parchment with nonstick spray.",
            "Heat butter and chocolate in a large heatproof bowl set over a medium saucepan of barely simmering water (do not let bowl touch water), stirring, until chocolate is melted and smooth.",
            "Using electric mixer on medium speed, beat eggs and sugar in another large bowl until pale and tripled in volume, 10–12 minutes.",
            "Whisk flour, baking powder, cinnamon, orange zest, cloves, nutmeg, and salt in a medium bowl. Whisk dry ingredients into chocolate mixture until well combined. Using a rubber spatula, fold about one-third of egg mixture into chocolate mixture to lighten, then fold chocolate mixture into remaining egg mixture until combined.",
            "Pour batter into prepared pan; smooth surface. Bake cake until center is set and sides are beginning to brown, 45–50 minutes. Transfer to a wire rack and let cake cool completely in pan (cake will sink a little in the center as it cools).",
            "Make glaze and assemble: Trim cake board to fit inside bowl with mousse (slightly smaller than diameter of bowl). Remove cake from pan and trim to flatten top, then trim to size of cake board. Place cake on board, then place board on a wire rack set on a sheet tray. Rub bowl with a very hot, wet towel to defrost slightly; remove plastic wrap from top of bowl. Invert bowl upside down on top of cake. Using plastic, gently pull so mousse comes free; adjust to center mousse on cake, if needed. Peel off plastic. Place chocolate in a medium bowl. Heat cream in a small pot over medium until hot but not boiling. Pour over chocolate, let sit 5 minutes, then stir until smooth. Add salt and brandy (if using) and stir to combine. Spoon glaze over bombe, letting it drip over sides to coat thoroughly. Transfer bombe to a platter. Cut into wedges with a hot dry knife (run knife under hot water and wipe dry between slices).",
            "Trim cake board to fit inside bowl with mousse (slightly smaller than diameter of bowl). Remove cake from pan and trim to flatten top, then trim to size of cake board. Place cake on board, then place board on a wire rack set on a sheet tray.",
            "Rub bowl with a very hot, wet towel to defrost slightly; remove plastic wrap from top of bowl. Invert bowl upside down on top of cake. Using plastic, gently pull so mousse comes free; adjust to center mousse on cake, if needed. Peel off plastic.",
            "Place chocolate in a medium bowl. Heat cream in a small pot over medium until hot but not boiling. Pour over chocolate, let sit 5 minutes, then stir until smooth. Add salt and brandy (if using) and stir to combine.",
            "Spoon glaze over bombe, letting it drip over sides to coat thoroughly.",
            "Transfer bombe to a platter. Cut into wedges with a hot dry knife (run knife under hot water and wipe dry between slices).",
            "Do Ahead Mousse bombe can be made 1 week ahead. Keep frozen. Cake can be baked 1 day ahead. Store tightly wrapped at room temperature.",
            "Mousse bombe can be made 1 week ahead. Keep frozen. Cake can be baked 1 day ahead. Store tightly wrapped at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a1ee3252954013554ff2b51/6:4/w_274%2Ch_169/Retro-Christmas-Fruits-Chocolate-Bombe-sliced-21112017.jpg"
    }
}