{
    "recipe": {
        "title": "Christmas Cutouts with Vanilla Icing ",
        "ingredients": [
            "3 cups all purpose flour",
            "1 teaspoon baking powder",
            "1/2 teaspoon salt",
            "1 cup (2 sticks) unsalted butter, room temperature",
            "1 cup sugar",
            "1 large egg",
            "2 tablespoons sour cream",
            "1 teaspoon vanilla extract",
            "Additional sugar",
            "4 cups (or more) sifted powdered sugar (sifted, then measured)",
            "3 tablespoons (or more) whole milk",
            "1/2 teaspoon vanilla extract",
            "Colored sugar crystals, sprinkles, and/or decors",
            "Food-safe colored markers (such as FooDoodler pens; see note*)"
        ],
        "instructions": [
            "For cookies: Sift first 3 ingredients into medium bowl. Using electric mixer, beat butter and 1 cup sugar in large bowl to blend well. Add egg, sour cream, and vanilla; beat 1 minute. Beat in dry ingredients in 2 additions until just blended. Gather dough together; divide in half. Flatten each half into disk; wrap in plastic and chill 1 hour. (Can be made 1 day ahead. Keep chilled. Soften dough slightly at room temperature before rolling out.) Line 2 baking sheets with parchment paper. Sprinkle work surface and top of dough disks with additional sugar. Working with 1 disk at a time, roll out dough to 1/4-inch thickness (dough will be very soft). Using assorted 2- to 3-inch cookie cutters, cut out cookies. Transfer to prepared sheets, spacing 1 inch apart. Gather scraps and roll out on sugared surface; cut out more cookies. Repeat until all dough is used. Chill all cookies on baking sheets at least 15 minutes and up to 1 hour. Preheat oven to 350°F. Bake cookies, 1 sheet at a time, until light golden at edges, about 12 minutes. Transfer cookies to racks and cool completely.",
            "Sift first 3 ingredients into medium bowl. Using electric mixer, beat butter and 1 cup sugar in large bowl to blend well. Add egg, sour cream, and vanilla; beat 1 minute. Beat in dry ingredients in 2 additions until just blended. Gather dough together; divide in half. Flatten each half into disk; wrap in plastic and chill 1 hour. (Can be made 1 day ahead. Keep chilled. Soften dough slightly at room temperature before rolling out.)",
            "Line 2 baking sheets with parchment paper. Sprinkle work surface and top of dough disks with additional sugar. Working with 1 disk at a time, roll out dough to 1/4-inch thickness (dough will be very soft). Using assorted 2- to 3-inch cookie cutters, cut out cookies. Transfer to prepared sheets, spacing 1 inch apart. Gather scraps and roll out on sugared surface; cut out more cookies. Repeat until all dough is used. Chill all cookies on baking sheets at least 15 minutes and up to 1 hour.",
            "Preheat oven to 350°F. Bake cookies, 1 sheet at a time, until light golden at edges, about 12 minutes. Transfer cookies to racks and cool completely.",
            "For icing: Combine 4 cups powdered sugar, 3 tablespoons milk, and vanilla in medium bowl. Stir until icing is well blended, smooth, and spreadable, adding more milk by teaspoonfuls if too thick or more sugar by tablespoonfuls if too thin. Using small icing spatula or table knife, spread thin layer of icing atop each cookie. If using colored sugar crystals, sprinkle over cookies before icing sets. If using food-safe colored markers, let icing dry about 30 minutes; decorate cookies as desired. (Can be made 3 days ahead. Store airtight between sheets of waxed paper at room temperature.)",
            "Combine 4 cups powdered sugar, 3 tablespoons milk, and vanilla in medium bowl. Stir until icing is well blended, smooth, and spreadable, adding more milk by teaspoonfuls if too thick or more sugar by tablespoonfuls if too thin. Using small icing spatula or table knife, spread thin layer of icing atop each cookie. If using colored sugar crystals, sprinkle over cookies before icing sets. If using food-safe colored markers, let icing dry about 30 minutes; decorate cookies as desired. (Can be made 3 days ahead. Store airtight between sheets of waxed paper at room temperature.)",
            "*The Bon Appetit test-kitchen staff used food-safe colored markers, called FooDoodler pens, to decorate these cookies. The markers are available at Sur La Table stores or can be ordered from King Arthur Flour (800-827-6836) or bakerscatalogue.com.",
            "*The Bon Appetit test-kitchen staff used food-safe colored markers, called FooDoodler pens, to decorate these cookies. The markers are available at Sur La Table stores or can be ordered from King Arthur Flour (800-827-6836) or bakerscatalogue.com."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df94c7b55306961bfe959/6:4/w_274%2Ch_169/108973.jpg"
    }
}