{
    "recipe": {
        "title": "Churros with Spiced Hot Chocolate ",
        "ingredients": [
            "1 cup sugar",
            "2 teaspoons ground cinnamon",
            "1/2 teaspoon coarse kosher salt",
            "1 cup whole milk",
            "1/4 cup (1/2 stick) unsalted butter",
            "2 teaspoons sugar",
            "1/2 teaspoon coarse kosher salt",
            "1 cup all purpose flour",
            "4 large eggs",
            "3 cups canola oil (for frying)",
            "Spiced Hot Chocolate"
        ],
        "instructions": [
            "Whisk all ingredients in medium bowl to blend.",
            "For churro batter: Bring first 4 ingredients to boil in heavy medium saucepan, stirring until sugar dissolves and butter melts. Reduce heat to medium-low. Add flour; stir vigorously with wooden spoon until shiny dough mass forms, about 1 minute. Transfer to large bowl; cool 5 minutes. Using electric mixer, beat in eggs, 1 at a time; continue beating until smooth, shiny, sticky paste forms. (Can be made 2 hours ahead. Cover and let stand at room temperature.)",
            "Bring first 4 ingredients to boil in heavy medium saucepan, stirring until sugar dissolves and butter melts. Reduce heat to medium-low. Add flour; stir vigorously with wooden spoon until shiny dough mass forms, about 1 minute. Transfer to large bowl; cool 5 minutes. Using electric mixer, beat in eggs, 1 at a time; continue beating until smooth, shiny, sticky paste forms. (Can be made 2 hours ahead. Cover and let stand at room temperature.)",
            "Heat oil in heavy large skillet over medium heat to 350°F. Working in batches, spoon batter into pastry bag fitted with large star tip. Pipe batter into hot oil in 3 1/2- to 4-inch-long ribbons (use knife if necessary to cut batter at end of star tip) and allow batter to slide into oil. Fry churros until brown and cooked through in center, about 2 minutes per side. Transfer to paper towels. Cool 5 minutes, then toss in cinnamon sugar to coat. Serve warm with Spiced Hot Chocolate.",
            "Heat oil in heavy large skillet over medium heat to 350°F. Working in batches, spoon batter into pastry bag fitted with large star tip. Pipe batter into hot oil in 3 1/2- to 4-inch-long ribbons (use knife if necessary to cut batter at end of star tip) and allow batter to slide into oil. Fry churros until brown and cooked through in center, about 2 minutes per side. Transfer to paper towels. Cool 5 minutes, then toss in cinnamon sugar to coat. Serve warm with Spiced Hot Chocolate."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df20c7b55306961bfe081/6:4/w_274%2Ch_169/109279.jpg"
    }
}