{
    "recipe": {
        "title": "Cider-Poached Apples with Candied Walnuts, Rum Cream, and Cider Syrup ",
        "ingredients": [
            "6 medium Gala apples (about 3 pounds), cored from bottom, leaving stems on",
            "1/2 lemon",
            "1/2 gallon apple cider",
            "1 cup packed light brown sugar",
            "1 cup chopped walnuts (4 ounces)",
            "2 tablespoons granulated sugar",
            "1 tablespoon unsalted butter, melted",
            "1 large egg white, lightly beaten",
            "1/2 cup chilled heavy cream",
            "1 1/2 tablespoon granulated sugar",
            "1 tablespoon dark rum",
            "1/4 teaspoon pure vanilla extract",
            "Accompaniment: 2 tablespoon bottled boiled cider"
        ],
        "instructions": [
            "Peel top third of each apple and rub peeled part with lemon half. Put apples in a wide 5-quart heavy pot and add cider and brown sugar. Bring to a boil, covered, over medium heat (this will take 25 to 30 minutes). Remove from heat and cool apples in cider, covered, about 1 hour.",
            "Make candied walnuts: Preheat oven to 450°F with rack in lower third. Stir together all ingredients with a pinch of salt, then spread on a small baking sheet into a 10-inch round. Bake, rotating sheet halfway through, until golden, 5 to 6 minutes. Transfer to a rack and loosen nuts, then cool (nuts will crisp as they cool).",
            "Preheat oven to 450°F with rack in lower third.",
            "Stir together all ingredients with a pinch of salt, then spread on a small baking sheet into a 10-inch round. Bake, rotating sheet halfway through, until golden, 5 to 6 minutes. Transfer to a rack and loosen nuts, then cool (nuts will crisp as they cool).",
            "Whip cream and assemble dessert: Beat cream with sugar, rum, and vanilla using an electric mixer until it just holds soft peaks. Drain apples, reserving poaching liquid for another use. Put an apple on each plate and sprinkle with candied walnuts. Dollop cream next to each apple and drizzle (bottled) boiled cider all over.",
            "Beat cream with sugar, rum, and vanilla using an electric mixer until it just holds soft peaks.",
            "Drain apples, reserving poaching liquid for another use. Put an apple on each plate and sprinkle with candied walnuts. Dollop cream next to each apple and drizzle (bottled) boiled cider all over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d79577b55306961bf3601/6:4/w_274%2Ch_169/350631_hires.jpg",
        "color": 10731626
    }
}