{
    "recipe": {
        "title": "Cinnamon Rolls with Icing ",
        "ingredients": [
            "2/3 cup whole milk",
            "2 (1/4-ounce) envelopes instant yeast (4 teaspoons total)",
            "1/2 cup sugar",
            "2 large eggs, at room temperature",
            "3 cups unbleached bread flour",
            "1 teaspoon fine sea salt or table salt",
            "4 tablespoons (1/2 stick) unsalted butter, cut into 6 pieces and softened at room temperature",
            "8 tablespoons (1 stick) unsalted butter, cut into small pieces and softened at room temperature, plus additional butter for greasing the pan and plastic wrap",
            "3/4 cup packed light brown sugar",
            "1 tablespoon ground cinnamon",
            "2 teaspoons pure vanilla extract",
            "2 tablespoons unsalted butter",
            "1 cup confectioners' sugar, sifted after measuring",
            "Instant-read thermometer, stand mixer fitted with a dough hook, 13- by 9-inch metal baking pan, parchment paper or foil"
        ],
        "instructions": [
            "Make the dough: In a heavy, small saucepan over moderate heat, warm the milk until it almost reaches a boil. Remove the pan from the heat and let the milk cool to lukewarm (about 100°F). In the bowl of a stand mixer, whisk together the lukewarm milk and yeast. Wait 30 seconds, then whisk again. Add the sugar and eggs and whisk to combine. Add the flour and salt and use a rubber spatula to stir together. Scrape the bowl to make sure there is no unabsorbed flour clinging to the sides or at the bottom of the bowl. Distribute the butter pieces on the surface of the dough, then place the bowl on the mixer and attach the dough hook. With the mixer on low, knead the dough until it comes together, about 2 minutes. Using a rubber spatula, scrape the dough off the hook and from the bottom and sides of the bowl. With the mixer on medium, knead the dough until it's smooth and elastic, about 1 minute. Cover the bowl with plastic wrap and let the dough rest at warm room temperature for 1 hour. (The dough won't double in size, but may look slightly puffy.)",
            "In a heavy, small saucepan over moderate heat, warm the milk until it almost reaches a boil. Remove the pan from the heat and let the milk cool to lukewarm (about 100°F).",
            "In the bowl of a stand mixer, whisk together the lukewarm milk and yeast. Wait 30 seconds, then whisk again. Add the sugar and eggs and whisk to combine. Add the flour and salt and use a rubber spatula to stir together. Scrape the bowl to make sure there is no unabsorbed flour clinging to the sides or at the bottom of the bowl. Distribute the butter pieces on the surface of the dough, then place the bowl on the mixer and attach the dough hook.",
            "With the mixer on low, knead the dough until it comes together, about 2 minutes. Using a rubber spatula, scrape the dough off the hook and from the bottom and sides of the bowl. With the mixer on medium, knead the dough until it's smooth and elastic, about 1 minute. Cover the bowl with plastic wrap and let the dough rest at warm room temperature for 1 hour. (The dough won't double in size, but may look slightly puffy.)",
            "While the dough is proofing, make the cinnamon butter: In a medium bowl, use a rubber spatula to beat the butter until smooth. Add the brown sugar, cinnamon, and vanilla and beat until smooth and fully combined. Make sure the mixture is easily spreadable, and beat it a little longer if it seems too firm. Line a 13- by 9-inch metal baking pan with parchment paper or foil, allowing 1 to 2 inches to hang over the long ends of the pan. Butter the parchment or foil. Lightly flour a work surface and scrape the dough out of the bowl. Lightly flour the dough then gently press and pull it into a 12- by 18-inch rectangle. Dot the cinnamon butter all over the surface, then use a knife or small offset spatula to evenly spread it over the entire surface of the dough. Starting at one of the 18-inch-long edges, roll up the dough, jellyroll-style. After rolling, push and gently squeeze the roll together to make it 18 inches long. Use a sharp knife to cut the roll into 12 (1 1/2-inch-thick) slices. One at a time, work the slices into an even round shape (they squish when cut) and arrange them, cut side down and about 1 inch apart on all sides, in the prepared pan, in 4 rows of 3 rolls. Cover the pan with buttered plastic wrap and let the rolls proof at warm room temperature until they are puffed and starting to fill the spaces in between them, 1 to 2 hours depending on the room temperature (the warmer the kitchen, the faster the rolls will proof). Once you see the rolls puffing visibly, set a rack in the middle of the oven and preheat to 400°F. Place the pan in the oven, decrease the temperature to 375°F, and bake the rolls until they are well-risen and golden, about 25 minutes. Cool the rolls in the pan on a rack for 10 minutes. Using the parchment paper or foil overhang, lift the rolls out of the pan and transfer to a work surface. DO AHEAD: Cinnamon rolls can be baked, cooled, and stored in an airtight container, up to 2 days. Warm the cinnamon rolls in a 350°F oven for about 10 minutes then ice them as described below. Cinnamon rolls can also be frozen: Once cool, return the cinnamon rolls, still on the parchment or foil, to the pan, wrap the pan in a double layer of foil, and freeze up to 2 weeks. Defrost the rolls then warm them in a 350°F oven for about 10 minutes, ice, and serve.",
            "In a medium bowl, use a rubber spatula to beat the butter until smooth. Add the brown sugar, cinnamon, and vanilla and beat until smooth and fully combined. Make sure the mixture is easily spreadable, and beat it a little longer if it seems too firm.",
            "Line a 13- by 9-inch metal baking pan with parchment paper or foil, allowing 1 to 2 inches to hang over the long ends of the pan. Butter the parchment or foil.",
            "Lightly flour a work surface and scrape the dough out of the bowl. Lightly flour the dough then gently press and pull it into a 12- by 18-inch rectangle. Dot the cinnamon butter all over the surface, then use a knife or small offset spatula to evenly spread it over the entire surface of the dough.",
            "Starting at one of the 18-inch-long edges, roll up the dough, jellyroll-style. After rolling, push and gently squeeze the roll together to make it 18 inches long. Use a sharp knife to cut the roll into 12 (1 1/2-inch-thick) slices. One at a time, work the slices into an even round shape (they squish when cut) and arrange them, cut side down and about 1 inch apart on all sides, in the prepared pan, in 4 rows of 3 rolls. Cover the pan with buttered plastic wrap and let the rolls proof at warm room temperature until they are puffed and starting to fill the spaces in between them, 1 to 2 hours depending on the room temperature (the warmer the kitchen, the faster the rolls will proof).",
            "Once you see the rolls puffing visibly, set a rack in the middle of the oven and preheat to 400°F. Place the pan in the oven, decrease the temperature to 375°F, and bake the rolls until they are well-risen and golden, about 25 minutes.",
            "Cool the rolls in the pan on a rack for 10 minutes. Using the parchment paper or foil overhang, lift the rolls out of the pan and transfer to a work surface. DO AHEAD: Cinnamon rolls can be baked, cooled, and stored in an airtight container, up to 2 days. Warm the cinnamon rolls in a 350°F oven for about 10 minutes then ice them as described below. Cinnamon rolls can also be frozen: Once cool, return the cinnamon rolls, still on the parchment or foil, to the pan, wrap the pan in a double layer of foil, and freeze up to 2 weeks. Defrost the rolls then warm them in a 350°F oven for about 10 minutes, ice, and serve.",
            "Make the icing: In a small saucepan over low heat, warm the butter and 2 tablespoons water, stirring occasionally, until the butter is melted and the liquid is gently simmering. Remove the pan from the heat, add the confectioners' sugar, and use a small rubber spatula to stir the icing until it's thick and creamy. Using a small spoon, drizzle about a tablespoon of the icing in the center of each roll and use the back of the spoon to spread the icing over the tops of the rolls. Let the icing set for about 10 minutes, then separate and serve the rolls.",
            "In a small saucepan over low heat, warm the butter and 2 tablespoons water, stirring occasionally, until the butter is melted and the liquid is gently simmering. Remove the pan from the heat, add the confectioners' sugar, and use a small rubber spatula to stir the icing until it's thick and creamy.",
            "Using a small spoon, drizzle about a tablespoon of the icing in the center of each roll and use the back of the spoon to spread the icing over the tops of the rolls. Let the icing set for about 10 minutes, then separate and serve the rolls."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b0239f766062b2034459e7/6:4/w_274%2Ch_169/51160400_cinnamon-rolls_1x1.jpg"
    }
}