{
    "recipe": {
        "title": "Cinnamon-Scented Breakfast Quinoa ",
        "ingredients": [
            "1 cup quinoa (all red or a mix of red, white, or black)",
            "1 1/2 cups water",
            "2 cinnamon sticks",
            "1/4 teaspoon salt",
            "Broken or chopped walnuts, pure maple syrup or honey, milk, and flaky sea salt such as Maldon"
        ],
        "instructions": [
            "Wash quinoa in several changes of water in a bowl, rubbing grains and letting them settle before pouring off water (if quinoa does not settle, drain in a large fine-mesh sieve after each rinse), until water is clear. Drain washed quinoa well in a large fine-mesh sieve. Combine all ingredients in a heavy medium saucepan and bring to a boil, covered. Reduce heat to low and cook, covered, until water is absorbed and quinoa is tender, about 20 minutes. Remove pan from heat and let stand, covered, 5 minutes. Fluff with a fork and keep covered to keep warm. Remove cinnamon sticks. Divide quinoa among bowls and top with walnuts, maple syrup or honey, milk, and sea salt.",
            "Wash quinoa in several changes of water in a bowl, rubbing grains and letting them settle before pouring off water (if quinoa does not settle, drain in a large fine-mesh sieve after each rinse), until water is clear.",
            "Drain washed quinoa well in a large fine-mesh sieve.",
            "Combine all ingredients in a heavy medium saucepan and bring to a boil, covered. Reduce heat to low and cook, covered, until water is absorbed and quinoa is tender, about 20 minutes.",
            "Remove pan from heat and let stand, covered, 5 minutes. Fluff with a fork and keep covered to keep warm. Remove cinnamon sticks.",
            "Divide quinoa among bowls and top with walnuts, maple syrup or honey, milk, and sea salt."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b2dfe911c5d6af478b2a1b/6:4/w_274%2Ch_169/366130_breakfast-quinoa_1x1.jpg"
    }
}