{
    "recipe": {
        "title": "Cinnamon-Date Buns ",
        "ingredients": [
            "16 Medjool dates, pitted (about 8 ounces)",
            "1/4 teaspoon kosher salt",
            "1/2 cup (1 stick) unsalted butter, room temperature",
            "1 tablespoon finely grated orange zest",
            "1 teaspoon ground cinnamon",
            "1/3 cup whole milk",
            "4 tablespoons honey, divided",
            "1 envelope active dry yeast (about 2 1/4 teaspoons)",
            "2 large egg yolks",
            "2 large eggs",
            "1/3 cup buttermilk",
            "1 cup spelt flour",
            "1 1/4 teaspoons kosher salt",
            "2 cups all-purpose flour, plus more for surface",
            "1/2 cup (1 stick) unsalted butter, cut into pieces, room temperature, plus melted butter for bowl and brushing",
            "1/4 cup sugar",
            "1 teaspoon ground cinnamon"
        ],
        "instructions": [
            "Bring dates, salt, and 1 1/2 cups water to a boil in a medium saucepan. Reduce heat and simmer, stirring and mashing occasionally, until dates are falling apart and water is evaporated (it should be a thick paste), 10-15 minutes. Let cool, then stir in butter, orange zest, and cinnamon.",
            "Do ahead: Date filling can be made 1 week ahead. Cover and chill. Bring to room temperature before using.",
            "Dough and assembly: Preheat oven to 375°. Heat milk and 1 tablespoon honey in a small saucepan until lukewarm. Combine milk mixture and yeast in the bowl of a stand mixer. As soon as yeast is foamy, about 5 minutes, add egg yolks, 1 egg, buttermilk, spelt flour, salt, 2 cups all-purpose flour, and remaining 3 tablespoons honey; mix on medium speed until dough is smooth, shiny, and elastic, 5-8 minutes. With motor running, add 1/2 cup room temperature butter, 1 piece at a time, waiting until each piece is incorporated before adding the next. Mix 1 minute, then increase speed to medium-high and mix until dough is soft and supple, 6-8 minutes. (No stand mixer? Whisk ingredients into yeast mixture in a large bowl, then knead dough on a clean surface. Mix in butter with a sturdy wooden spoon, then knead briefly to make sure butter is well incorporated.) Place dough in a buttered medium bowl. Brush with melted butter; cover with plastic wrap. Let dough rise in a warm spot until doubled in size, 1–1 1/2 hours (2–2 1/2 hours if dough was made ahead and chilled). Divide dough in half. Roll out 1 piece on a lightly floured surface to a 15x5\" rectangle. Evenly spread with half of date filling and cut into 8 triangles. Starting with a pointy end, roll up dough (like a reverse crescent roll). Place, seam side down, on a parchment-lined baking sheet. Repeat with remaining dough, date filling, and another baking sheet. Cover buns with plastic wrap and let rise in a warm spot until almost doubled in size, 30–40 minutes. Mix sugar and cinnamon in a small bowl. Whisk remaining egg and 1 teaspoon water in another small bowl and brush over buns. Sprinkle with cinnamon sugar; bake until golden brown, 20–25 minutes. Let cool slightly before serving. Do ahead: Dough (before rise) can be made 1 day ahead. Cover and chill.",
            "Preheat oven to 375°. Heat milk and 1 tablespoon honey in a small saucepan until lukewarm. Combine milk mixture and yeast in the bowl of a stand mixer. As soon as yeast is foamy, about 5 minutes, add egg yolks, 1 egg, buttermilk, spelt flour, salt, 2 cups all-purpose flour, and remaining 3 tablespoons honey; mix on medium speed until dough is smooth, shiny, and elastic, 5-8 minutes.",
            "With motor running, add 1/2 cup room temperature butter, 1 piece at a time, waiting until each piece is incorporated before adding the next. Mix 1 minute, then increase speed to medium-high and mix until dough is soft and supple, 6-8 minutes. (No stand mixer? Whisk ingredients into yeast mixture in a large bowl, then knead dough on a clean surface. Mix in butter with a sturdy wooden spoon, then knead briefly to make sure butter is well incorporated.)",
            "Place dough in a buttered medium bowl. Brush with melted butter; cover with plastic wrap. Let dough rise in a warm spot until doubled in size, 1–1 1/2 hours (2–2 1/2 hours if dough was made ahead and chilled).",
            "Divide dough in half. Roll out 1 piece on a lightly floured surface to a 15x5\" rectangle. Evenly spread with half of date filling and cut into 8 triangles. Starting with a pointy end, roll up dough (like a reverse crescent roll). Place, seam side down, on a parchment-lined baking sheet. Repeat with remaining dough, date filling, and another baking sheet.",
            "Cover buns with plastic wrap and let rise in a warm spot until almost doubled in size, 30–40 minutes.",
            "Mix sugar and cinnamon in a small bowl. Whisk remaining egg and 1 teaspoon water in another small bowl and brush over buns. Sprinkle with cinnamon sugar; bake until golden brown, 20–25 minutes. Let cool slightly before serving.",
            "Do ahead: Dough (before rise) can be made 1 day ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b7212eac90eb2c34cfc415/6:4/w_274%2Ch_169/51260340_cinnamon-date-buns_1x1.jpg",
        "color": 1987440
    }
}