{
    "recipe": {
        "title": "Cinnamon Toast Ice Cream ",
        "ingredients": [
            "2 cups whole milk",
            "2 (3-inch) cinnamon sticks",
            "5 slices firm white sandwich bread",
            "1/2 stick (1/4 cup) unsalted butter, melted",
            "2 tablespoons packed light brown sugar",
            "1/2 teaspoon ground cinnamon",
            "6 large egg yolks",
            "1/2 cup granulated sugar",
            "1/4 teaspoon molasses",
            "1 cup heavy cream",
            "an instant-read thermometer; an ice cream maker"
        ],
        "instructions": [
            "Bring milk and cinnamon sticks to a boil in a 2-quart heavy saucepan, then remove from heat and let steep, covered, 30 minutes.",
            "While milk steeps, put oven racks in upper and lower thirds of oven and preheat oven to 300°F.",
            "Cut 3 slices bread into 1/4-inch cubes and transfer to a bowl. Quarter remaining 2 slices and pulse in a food processor to make bread crumbs. Whisk together butter, brown sugar, and ground cinnamon in another bowl. Drizzle 3 tablespoons butter mixture over bread cubes and stir to lightly coat. Spread in 1 layer in a shallow baking pan. Add bread crumbs to remaining butter mixture and stir to evenly coat. Spread crumbs evenly in another shallow baking pan.",
            "Bake bread cubes and crumbs, stirring occasionally and switching position of pans halfway through baking, until golden brown and crisp, about 25 minutes total. Cool in pans on racks, then transfer bread crumbs to a bowl.",
            "Return milk to a boil, then pour over bread crumbs and let stand 10 minutes. Pour milk through a fine-mesh sieve into saucepan, pressing hard on solids, then discarding them.",
            "Whisk together yolks, granulated sugar, molasses, and a pinch of salt in a bowl. Return milk mixture to a boil and add half to yolk mixture in a slow stream, whisking until combined well. Add yolk mixture in a slow stream to milk in saucepan, whisking, then cook over low heat, stirring constantly, until mixture is thickened and thermometer registers 170 to 175°F (do not let boil).",
            "Remove from heat and immediately stir in cream, then pour custard through fine-mesh sieve into a metal bowl. Quick-chill custard by setting bowl into a larger bowl of ice and cold water and stirring occasionally until cold, about 15 minutes. Freeze custard in ice cream maker until almost firm. Fold bread cubes into ice cream, then transfer to an airtight container and put in freezer to harden, at least 2 hours."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ba3c6eb8e22884fe3b12f8d/6:4/w_274%2Ch_169/cinnamon-toast-ice-cream-recipe-092018.jpg"
    }
}