{
    "recipe": {
        "title": "Cinnamon Bun Bundt Cake ",
        "ingredients": [
            "1 envelope (1/4 ounce, 2 1/2 teaspoons) active dry yeast",
            "1/4 cup plus 1 teaspoon granulated sugar",
            "1/4 cup warm water (105° to 110°F)",
            "6 tablespoons (3/4 stick) unsalted butter, at room temperature",
            "4 large egg yolks",
            "3/4 cup buttermilk",
            "1 teaspoon salt",
            "3 1/2 to 4 cups all-purpose flour (spooned into cup and leveled off)",
            "Vegetable oil for the bowl",
            "Flour for the work surface",
            "4 tablespoons (1/2 stick) unsalted butter, melted, plus more for the pan",
            "2/3 cup plus 3 tablespoons packed light brown sugar",
            "1 tablespoon ground cinnamon",
            "1/8 teaspoon salt",
            "When purchasing packages of yeast, be sure and check the \"use by\" date so you are working with yeast that is truly active. If you're uncertain about the temperature of the water you're using to activate it, use an instant-read thermometer to make sure you get to 105° to 110°F."
        ],
        "instructions": [
            "To make the dough: In a small bowl, dissolve the yeast and 1 teaspoon granulated sugar in the warm water. Let stand for 5 minutes, or until foamy. Meanwhile, in a stand mixer fitted with the paddle attachment, beat the butter and 1/4 cup granulated sugar until smooth. Beat in the egg yolks, buttermilk, and salt until well combined. Beat in the yeast mixture. But in 3 1/2 cups of the flour until combined. Transfer the dough to a lightly floured work surface and knead until smooth, adding more flour if necessary. Transfer the dough to a lightly oiled bowl, cover with plastic wrap, and let stand at room temperature until doubled in volume, about I hour. (If you've got an 8-cup or larger clear measuring cup, use this as your bowl—this makes it really easy to see if the dough has doubled.)",
            "In a small bowl, dissolve the yeast and 1 teaspoon granulated sugar in the warm water. Let stand for 5 minutes, or until foamy.",
            "Meanwhile, in a stand mixer fitted with the paddle attachment, beat the butter and 1/4 cup granulated sugar until smooth. Beat in the egg yolks, buttermilk, and salt until well combined.",
            "Beat in the yeast mixture. But in 3 1/2 cups of the flour until combined. Transfer the dough to a lightly floured work surface and knead until smooth, adding more flour if necessary.",
            "Transfer the dough to a lightly oiled bowl, cover with plastic wrap, and let stand at room temperature until doubled in volume, about I hour. (If you've got an 8-cup or larger clear measuring cup, use this as your bowl—this makes it really easy to see if the dough has doubled.)",
            "To prepare the filling: Transfer the dough to a lightly floured work surface and roll to a 12 × 18-inch rectangle. Brush weigh 3 tablespoons of the melted butter. In a small bowl, combine the 2/3 cup brown sugar, the cinnamon, and salt and sprinkle over the dough. Starting at one short end, roll into a cylinder. Cut crosswise into 10 equal pieces. Brush a 10- to 12-cup Bundt pan with melted butter and coat with the 3 tablespoons brown sugar. Place the pieces of dough, seam side down, around the pan, angling the pieces slightly so that no piece completely covers the swirl pattern of its neighbor. Cover with plastic wrap and let rise until light and puffed, about 45 minutes. Preheat the oven to 350°F. Bake for 35 minutes, or until the buns are golden brown and well risen. Remove from the oven and let cool in the pan for 5 minutes, then invert onto a cake plate. Serve warm or at room temperature.",
            "Transfer the dough to a lightly floured work surface and roll to a 12 × 18-inch rectangle. Brush weigh 3 tablespoons of the melted butter. In a small bowl, combine the 2/3 cup brown sugar, the cinnamon, and salt and sprinkle over the dough. Starting at one short end, roll into a cylinder. Cut crosswise into 10 equal pieces.",
            "Brush a 10- to 12-cup Bundt pan with melted butter and coat with the 3 tablespoons brown sugar. Place the pieces of dough, seam side down, around the pan, angling the pieces slightly so that no piece completely covers the swirl pattern of its neighbor. Cover with plastic wrap and let rise until light and puffed, about 45 minutes.",
            "Preheat the oven to 350°F.",
            "Bake for 35 minutes, or until the buns are golden brown and well risen. Remove from the oven and let cool in the pan for 5 minutes, then invert onto a cake plate. Serve warm or at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad64eb6529d92b2c045ce6/6:4/w_274%2Ch_169/51196640_cinnamon-bun-bundt-cake_1x1.jpg"
    }
}