{
    "recipe": {
        "title": "Citrus and Chile Braised Short Ribs ",
        "ingredients": [
            "8 (5–6-inch) English-style bone-in beef short ribs (about 6 pounds)",
            "Kosher salt, freshly ground pepper",
            "2 tablespoons vegetable oil",
            "2 medium onions, chopped",
            "2 heads of garlic, halved crosswise",
            "4 celery stalks, chopped",
            "2 medium carrots, peeled, chopped",
            "2 tablespoons tomato paste",
            "1 teaspoon coriander seeds",
            "1 teaspoon cumin seeds",
            "7 chiles de árbol, divided, or 1 teaspoon crushed red pepper flakes",
            "4 sprigs oregano",
            "4 wide strips orange zest, plus some thin strips for serving",
            "1 cup plus 2 tablespoons fresh orange juice",
            "2 limes, halved",
            "1/2 cup fresh cilantro leaves with tender stems"
        ],
        "instructions": [
            "Season short ribs with salt and pepper. Place on a rimmed baking sheet and chill, uncovered, at least 2 hours (ribs are even better if you can do this a day ahead). Preheat oven to 325°F. Heat oil in a large heavy pot over medium. Working in batches, cook short ribs until evenly browned, about 5 minutes on each side. Transfer to a platter; pour off pan drippings between batches. Wipe out any burned bits from pot, but leave the golden-brown pieces (doing this will keep the finished sauce from tasting bitter). Place onions, garlic, celery, carrots, tomato paste, coriander seeds, cumin seeds, and 6 chiles in pot; season with salt and pepper and stir to coat. Increase heat to medium-high and cook, stirring often, until vegetables are softened, tomato paste is slightly darkened in color, and spices are fragrant, 10–12 minutes. Add oregano, wide strips of orange zest, 1 cup orange juice, and 6 cups water to pot, scraping up any browned bits; season with salt and pepper. Add ribs with any juices accumulated on the platter, making sure they're completely submerged. Cover pot and braise ribs in the oven until meat is tender and falling off the bone, 4–5 hours. Carefully transfer ribs to a platter. Strain braising liquid into a large bowl, then return to pot. Bring to a boil, then reduce heat and simmer until reduced by half (it will be thickened but still saucy). Return short ribs to pot and turn to coat. To serve, drizzle short ribs with remaining 2 tablespoons orange juice and squeeze limes and crush remaining chile over. Top with cilantro and thin strips of orange zest.",
            "Season short ribs with salt and pepper. Place on a rimmed baking sheet and chill, uncovered, at least 2 hours (ribs are even better if you can do this a day ahead).",
            "Preheat oven to 325°F. Heat oil in a large heavy pot over medium. Working in batches, cook short ribs until evenly browned, about 5 minutes on each side. Transfer to a platter; pour off pan drippings between batches.",
            "Wipe out any burned bits from pot, but leave the golden-brown pieces (doing this will keep the finished sauce from tasting bitter). Place onions, garlic, celery, carrots, tomato paste, coriander seeds, cumin seeds, and 6 chiles in pot; season with salt and pepper and stir to coat. Increase heat to medium-high and cook, stirring often, until vegetables are softened, tomato paste is slightly darkened in color, and spices are fragrant, 10–12 minutes.",
            "Add oregano, wide strips of orange zest, 1 cup orange juice, and 6 cups water to pot, scraping up any browned bits; season with salt and pepper. Add ribs with any juices accumulated on the platter, making sure they're completely submerged. Cover pot and braise ribs in the oven until meat is tender and falling off the bone, 4–5 hours.",
            "Carefully transfer ribs to a platter. Strain braising liquid into a large bowl, then return to pot. Bring to a boil, then reduce heat and simmer until reduced by half (it will be thickened but still saucy). Return short ribs to pot and turn to coat.",
            "To serve, drizzle short ribs with remaining 2 tablespoons orange juice and squeeze limes and crush remaining chile over. Top with cilantro and thin strips of orange zest.",
            "Do Ahead Short ribs can be braised 5 days ahead. Let cool; cover and chill in strained braising liquid.",
            "Short ribs can be braised 5 days ahead. Let cool; cover and chill in strained braising liquid."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a4fb9f63472cc3db07a4952/6:4/w_274%2Ch_169/citrus-and-chile-braised-short-ribs-recipe-BA-010518.jpg"
    }
}