{
    "recipe": {
        "title": "Clam and Calamari Seafood Stew with Salsa Verde ",
        "ingredients": [
            "2 tablespoons finely chopped fresh Italian parsley",
            "1 tablespoon chopped fresh oregano",
            "1 tablespoon chopped fresh mint",
            "2 teaspoons chopped fresh thyme",
            "1 tablespoon red wine vinegar",
            "1 teaspoon whole grain Dijon mustard",
            "1/2 cup extra-virgin olive oil",
            "1 2 1/4-to 2 1/2-pound whole striped bass, scaled, gutted, boned, head removed; fillets skinned and cut into 1-inch cubes, all bones, skin, and head reserved for broth",
            "5 cups water",
            "5 tablespoons extra-virgin olive oil",
            "1 2/3 cups chopped red onion",
            "1 2/3 cups chopped fresh fennel bulb",
            "2 garlic cloves, thinly sliced",
            "1/2 teaspoon (scant) dried crushed red pepper",
            "1/4 cup tomato paste",
            "20 large brine-cured green olives (such as Castelvetrano or Cerignola)",
            "16 Manila clams, scrubbed",
            "4 ounces cleaned squid; bodies cut into 1/2-inch-wide rings, tentacles halved",
            "8 1/2-inch-thick slices country bread"
        ],
        "instructions": [
            "Combine all herbs in medium bowl. Whisk in vinegar and mustard, then gradually whisk in oil. Season salsa verde to taste with salt and pepper. Cover and let stand at room temperature until ready to use, up to 2 hours.",
            "For seafood stew: Bring fish bones, skin, and head and 5 cups water to simmer in large saucepan over medium-high heat. Reduce heat to medium and simmer until broth is reduced to 4 cups, about 30 minutes; strain broth into bowl. Heat oil in heavy large pot over medium-low heat. Add onion, fennel, and garlic. Sauté until very soft but not brown, about 25 minutes. Mix in crushed red pepper; stir 1 minute. Add tomato paste and stir until beginning to darken, about 5 minutes. Add broth and olives and bring to simmer. Add all fish and seafood. Simmer uncovered until clams open and fish and squid are just opaque in center and tender, 6 to 8 minutes (discard any clams that do not open). Season seafood stew to taste with salt and pepper. Toast bread. Cut each slice in half. Place 2 bread halves in each of 4 shallow bowls. Ladle stew over bread, dividing equally. Drizzle stew with salsa verde. Serve, passing remaining bread and salsa verde separately.",
            "Bring fish bones, skin, and head and 5 cups water to simmer in large saucepan over medium-high heat. Reduce heat to medium and simmer until broth is reduced to 4 cups, about 30 minutes; strain broth into bowl.",
            "Heat oil in heavy large pot over medium-low heat. Add onion, fennel, and garlic. Sauté until very soft but not brown, about 25 minutes. Mix in crushed red pepper; stir 1 minute. Add tomato paste and stir until beginning to darken, about 5 minutes. Add broth and olives and bring to simmer. Add all fish and seafood. Simmer uncovered until clams open and fish and squid are just opaque in center and tender, 6 to 8 minutes (discard any clams that do not open). Season seafood stew to taste with salt and pepper.",
            "Toast bread. Cut each slice in half. Place 2 bread halves in each of 4 shallow bowls. Ladle stew over bread, dividing equally. Drizzle stew with salsa verde. Serve, passing remaining bread and salsa verde separately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3ec5e21388ef838b0f2ad/6:4/w_274%2Ch_169/354858_clam-calamari-seafood-stew_1x1.jpg"
    }
}