{
    "recipe": {
        "title": "Classic Herb and Fennel Stuffing ",
        "ingredients": [
            "1 2-lb. loaf country-style bread, torn into 1\"–1 1/2\" pieces",
            "1/4 cup extra-virgin olive oil",
            "2 medium onions, finely chopped",
            "1 fennel bulb, finely chopped",
            "4 celery stalks, finely chopped",
            "1/2 cup dry white wine",
            "1 cup (2 sticks) unsalted butter",
            "1 cup chopped parsley",
            "2 Tbsp. chopped sage",
            "1 Tbsp. chopped rosemary",
            "1 Tbsp. chopped thyme",
            "3 tsp. kosher salt",
            "2 tsp. freshly ground black pepper",
            "2 large eggs",
            "2 1/2 cups low-sodium chicken broth"
        ],
        "instructions": [
            "Place a rack in middle of oven; preheat to 250°F. Arrange bread in a single layer on a rimmed baking sheet. Bake, tossing occasionally, until dried out, about 1 hour. Let cool; transfer to a very large bowl. Increase oven temperature to 350°F. Meanwhile, heat oil in a large skillet over medium-high. Cook onions, fennel, and celery, stirring often, until softened but not yet browned, 8–10 minutes. Add wine and cook, stirring, until almost completely evaporated, about 1 minute. Add butter and cook, stirring, until melted, about 3 minutes. Scrape vegetable mixture over bread in bowl and mix in parsley, sage, rosemary, thyme, salt, and pepper. Whisk eggs and broth in a medium bowl to combine. Pour over bread mixture; fold gently until thoroughly coated. Divide between two 8x8\" baking dishes (you can also put it all in a 13x9\" baking dish if you prefer) and pack stuffing down. Cover with foil and bake until you can see some bubbles around the edges of the dishes, 30–35 minutes. Increase oven temperature to 425°F. Uncover stuffing and bake until top is golden brown and crisp, 20–25 minutes. Let sit 10 minutes before serving. Bread can be baked 2 days ahead; store airtight at room temperature. Stuffing can be assembled 1 day ahead; cover and chill. Bring to room temperature before baking.",
            "Place a rack in middle of oven; preheat to 250°F. Arrange bread in a single layer on a rimmed baking sheet. Bake, tossing occasionally, until dried out, about 1 hour. Let cool; transfer to a very large bowl. Increase oven temperature to 350°F.",
            "Meanwhile, heat oil in a large skillet over medium-high. Cook onions, fennel, and celery, stirring often, until softened but not yet browned, 8–10 minutes. Add wine and cook, stirring, until almost completely evaporated, about 1 minute. Add butter and cook, stirring, until melted, about 3 minutes. Scrape vegetable mixture over bread in bowl and mix in parsley, sage, rosemary, thyme, salt, and pepper.",
            "Whisk eggs and broth in a medium bowl to combine. Pour over bread mixture; fold gently until thoroughly coated. Divide between two 8x8\" baking dishes (you can also put it all in a 13x9\" baking dish if you prefer) and pack stuffing down. Cover with foil and bake until you can see some bubbles around the edges of the dishes, 30–35 minutes.",
            "Increase oven temperature to 425°F. Uncover stuffing and bake until top is golden brown and crisp, 20–25 minutes. Let sit 10 minutes before serving.",
            "Bread can be baked 2 days ahead; store airtight at room temperature. Stuffing can be assembled 1 day ahead; cover and chill. Bring to room temperature before baking."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5be07fbce1b7a75a08ea063b/6:4/w_274%2Ch_169/classic-herb-and-fennel-stuffing-recipe-BA-110518.jpg"
    }
}