{
    "recipe": {
        "title": "Classic Crème Brûlée ",
        "ingredients": [
            "3 cups heavy cream",
            "1 vanilla bean, halved lengthwise, or 1 1/2 teaspoons vanilla extract",
            "6 large egg yolks",
            "1/3 cup granulated sugar",
            "Pinch of salt",
            "3 tablespoons turbinado sugar, such as Sugar in the Raw",
            "6 (5-ounce) flameproof ramekins; a small blowtorch"
        ],
        "instructions": [
            "Put a rack in the middle of oven and preheat oven to 325°F.",
            "Pour cream into a 2-quart heavy saucepan. Using tip of a knife, scrape seeds from vanilla bean, if using, into cream and add pod (if using vanilla extract, do not add it yet). Heat cream over moderate heat until hot but not boiling; remove from heat and discard pod.",
            "Whisk together yolks, granulated sugar, and salt in a medium bowl until well combined. Add hot cream in a slow stream, whisking constantly until combined. Pour custard through a fine-mesh sieve into a bowl and whisk in vanilla extract, if using. Ladle custard into ramekins.",
            "Arrange ramekins in a roasting pan and add enough boiling water to pan to reach halfway up sides of ramekins. Bake until custards are just set, 25 to 30 minutes. With tongs, transfer custards to a rack to cool, then refrigerate, uncovered, for at least 4 hours.",
            "Just before serving, sprinkle turbinado sugar evenly over custards. Move blowtorch flame evenly back and forth close to sugar until sugar is caramelized. Let stand until sugar is hardened, 3 to 5 minutes.",
            "Variation: Coffee Crème Brûlée: Stir 1 1/2 tablespoons instant espresso powder into the hot cream and proceed as directed.",
            "Coffee Crème Brûlée: Stir 1 1/2 tablespoons instant espresso powder into the hot cream and proceed as directed."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c4f41171acf104e82e65e00/6:4/w_274%2Ch_169/Creme-Brulee-recipe-012319.jpg",
        "color": 13224150
    }
}