{
    "recipe": {
        "title": "Classic Sugar Cookies ",
        "ingredients": [
            "2 cups all-purpose flour",
            "1/2 teaspoon kosher salt",
            "2 sticks (8 ounces) unsalted butter, at room temperature",
            "3/4 cup sugar",
            "1 large egg",
            "1 teaspoon vanilla extract",
            "cookie cutters (if making roll-and-cut cookies)"
        ],
        "instructions": [
            "In a medium bowl, whisk flour and salt together. Place butter and sugar in the bowl of a stand mixer and beat on high speed until well combined, about 3 minutes. Add egg and vanilla and beat until just combined. Reduce speed to low and gradually add the flour mixture; mix until just combined.",
            "For roll-and-cut cookies: Form dough into two equal-sized balls and flatten into discs. Wrap both in plastic and chill at least 1 hour. Position oven racks in the upper and lower thirds of the oven and preheat to 350°F. Prepare a well-floured surface and a well-floured rolling pin. Working with one disc at a time, roll dough to 1/4 inch thick. Cut out as many cookies as possible with cutters (if dough becomes too soft, return to refrigerator and chill until firm). Arrange cookies 1 inch apart on 2 ungreased baking sheets and chill 15 minutes. Gather scraps, form into a small disc, and chill until firm. Bake cookies until golden brown at edges (rotating baking sheets and switching position on racks halfway through), 15 to 20 minutes. Transfer to cooling racks to cool completely. Roll out the second disc of dough and scraps (reroll scraps only once) and bake on cooled baking sheets. Transfer to racks to cool completely. Decorate, if desired.",
            "Form dough into two equal-sized balls and flatten into discs. Wrap both in plastic and chill at least 1 hour.",
            "Position oven racks in the upper and lower thirds of the oven and preheat to 350°F. Prepare a well-floured surface and a well-floured rolling pin. Working with one disc at a time, roll dough to 1/4 inch thick. Cut out as many cookies as possible with cutters (if dough becomes too soft, return to refrigerator and chill until firm). Arrange cookies 1 inch apart on 2 ungreased baking sheets and chill 15 minutes. Gather scraps, form into a small disc, and chill until firm.",
            "Bake cookies until golden brown at edges (rotating baking sheets and switching position on racks halfway through), 15 to 20 minutes. Transfer to cooling racks to cool completely.",
            "Roll out the second disc of dough and scraps (reroll scraps only once) and bake on cooled baking sheets. Transfer to racks to cool completely. Decorate, if desired.",
            "For slice-and-bake cookies: Halve dough and form into two logs, 1 1/2 inches in diameter. Wrap logs in plastic and roll to form a more uniform round shape. Chill at least 2 hours. Position oven racks in the upper and lower thirds of the oven and preheat to 350°F. Slice cookies into 1/4-inch-thick rounds and arrange 1 inch apart on ungreased baking sheets. Bake cookies until golden brown at edges (rotating baking sheets and switching position on racks halfway through), 15 to 20 minutes. Transfer to cooling racks to cool completely. Decorate, if desired.",
            "Halve dough and form into two logs, 1 1/2 inches in diameter. Wrap logs in plastic and roll to form a more uniform round shape. Chill at least 2 hours.",
            "Position oven racks in the upper and lower thirds of the oven and preheat to 350°F. Slice cookies into 1/4-inch-thick rounds and arrange 1 inch apart on ungreased baking sheets. Bake cookies until golden brown at edges (rotating baking sheets and switching position on racks halfway through), 15 to 20 minutes. Transfer to cooling racks to cool completely. Decorate, if desired."
        ],
        "picture_link": null
    }
}