{
    "recipe": {
        "title": "Classic Glazed Doughnuts ",
        "ingredients": [
            "1 tablespoon plus 1 teaspoon active dry yeast",
            "1 cup whole milk, heated to 110°F",
            "2 to 2 1/2 cups (320 to 400 grams) bread flour",
            "1 teaspoon pure vanilla extract",
            "3 large egg yolks",
            "2 tablespoons (30 grams) superfine sugar",
            "1/2 teaspoon table salt",
            "4 tablespoons (1/2 stick or 2 ounces) unsalted butter, softened at room temperature and cut into cubes",
            "Vegetable oil for frying",
            "Basic Sugar Glaze",
            "Chocolate Glaze",
            "Stand mixer fitted with the paddle attachment and dough hook, 2 large baking sheets, non-terry dish towel, 3-inch-diameter doughnut cutter with 1-inch-diameter hole (or cookie cutters), wire cooling rack, deep-fry thermometer"
        ],
        "instructions": [
            "In a medium bowl, combine 1 tablespoon of the yeast with 3/4 cup of the warm milk and stir to dissolve the yeast. Add 3/4 cup of the flour and stir to create a smooth paste. Cover the bowl with plastic wrap and let the flour mixture rest in a warm place for 30 minutes.",
            "Once 30 minutes have passed, in the bowl of a stand mixer fitted with the paddle attachment, combine the remaining 1 teaspoon yeast with the remaining 1/4 cup milk (the milk will be room temperature at this point). Add the rested flour mixture along with the vanilla and egg yolks and mix on low until the ingredients are incorporated and the dough is smooth, about 30 seconds. Turn off the mixer and add 1 cup of flour, along with the sugar and salt. Mix on medium until the dough starts to come together, about 30 seconds. Add the butter and mix on medium until it's incorporated, about 30 seconds.",
            "Remove the paddle attachment from the mixer, and switch to the dough hook. Start adding the remaining flour, 1/4 cup at a time (turning the mixer off for each addition) and knead the dough on medium until it completely pulls away from the side of the bowl and is smooth and not too sticky, about 1 minute. The dough will be very soft and moist but not so sticky that you can't roll it out. (For this step, you may only need to use as little as 1/4 cup flour, so there may be flour leftover.) Cover the bowl with plastic wrap and let the dough rest in a warm place for 30 minutes.",
            "Once 30 minutes have passed, gently press down on the dough to remove any gas bubbles then chill, covered, for at least 1 hour and up to 12 hours.",
            "When ready to roll out the dough, line a baking sheet with a lightly floured non-terry towel. Lightly flour a work surface and roll out the dough to a 1/2-inch thickness. Using doughnut or cookie cutters, cut out 3-inch-diameter rounds with 1-inch-diameter holes. (For filled doughnuts, don't cut out the holes.) Arrange the doughnuts on the prepared baking sheet, leaving at least 1 inch between doughnuts. Cover the doughnuts loosely with plastic wrap and let them proof in a warm place until almost doubled in size, 30 to 40 minutes. Check to see if the doughnuts are ready every 5 to 10 minutes. To test, use a fingertip to lightly touch one of the doughnuts. If the dough springs back immediately, it needs more time; if it springs back slowly, it's ready; and if the dough doesn't spring back at all, it's over-proofed. You can punch down and reroll over-proofed dough once.",
            "While the doughnuts are proofing, line a baking sheet with 2 layers of paper towels and place a wire rack on top of the towels. In a heavy-bottomed large pot or deep fryer, heat at least 2 inches of oil until a deep-fry thermometer registers 360°F. Working in batches, use a slotted metal spoon or spatula to carefully place the doughnuts in the hot oil. Fry, flipping once, until light golden brown, 1 to 2 minutes per side. Transfer as done to the wire rack and return the oil to 360°F between batches. Let the doughnuts cool slightly before glazing with the Basic Sugar Glaze or Chocolate Glaze ."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b0226d766062b20344580a/6:4/w_274%2Ch_169/51160200_glazed-doughnuts_1x1.jpg"
    }
}