{
    "recipe": {
        "title": "Classic Caramel Sauce ",
        "ingredients": [
            "3/4 cup heavy whipping cream",
            "1/2 cup (3 1/2 ounces) granulated sugar",
            "2 tablespoons water",
            "1 teaspoon honey",
            "4 tablespoons (2 ounces, 1/2 stick) unsalted butter, softened",
            "1/2 teaspoon pure vanilla extract"
        ],
        "instructions": [
            "Bring the cream to a boil in a 1-quart saucepan over medium heat. Cook the sugar, water, and honey in a 3-quart heavy-duty saucepan over high heat until the mixture comes to a boil. Brush around the inside of the pan with a damp pastry brush at the point where the sugar syrup meets the sides of the pan. Do this twice during the cooking process to prevent the sugar from crystallizing. Cook the mixture over high heat, without stirring, until it turns amber colored, 6–8 minutes. Lower the heat to medium and slowly add the hot cream to the sugar mixture while stirring constantly. The cream will bubble and foam. Continue stirring to make sure there are no lumps. Remove the saucepan from the heat and stir in the butter until it is completely melted. Then stir in the vanilla. Transfer the caramel sauce to a bowl, cover tightly with plastic wrap, cool slightly, and serve warm.",
            "Bring the cream to a boil in a 1-quart saucepan over medium heat.",
            "Cook the sugar, water, and honey in a 3-quart heavy-duty saucepan over high heat until the mixture comes to a boil. Brush around the inside of the pan with a damp pastry brush at the point where the sugar syrup meets the sides of the pan. Do this twice during the cooking process to prevent the sugar from crystallizing.",
            "Cook the mixture over high heat, without stirring, until it turns amber colored, 6–8 minutes. Lower the heat to medium and slowly add the hot cream to the sugar mixture while stirring constantly. The cream will bubble and foam. Continue stirring to make sure there are no lumps. Remove the saucepan from the heat and stir in the butter until it is completely melted. Then stir in the vanilla.",
            "Transfer the caramel sauce to a bowl, cover tightly with plastic wrap, cool slightly, and serve warm."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad355419925f464b3b05e9/6:4/w_274%2Ch_169/51204230_caramel-sauce_1x1.jpg"
    }
}