{
    "recipe": {
        "title": "Classic Snickerdoodle Cookies ",
        "ingredients": [
            "1 1/2 cups all-purpose flour",
            "1 teaspoon baking soda",
            "1 teaspoon cream of tartar",
            "1/2 cup (1 stick) cold unsalted butter, cut into 1/2\" pieces",
            "1/4 teaspoon kosher salt",
            "1 cup sugar, divided",
            "1 large egg, room temperature",
            "2 teaspoons ground cinnamon"
        ],
        "instructions": [
            "Whisk flour, baking soda, and cream of tartar in a medium bowl. Using an electric mixer on medium speed, beat butter in a large bowl until pale yellow, 2–3 minutes. Scrape down sides, add salt and 3/4 cup sugar, and continue to beat until light and fluffy, 3–4 minutes more. Scrape down sides, add egg, and blend until just incorporated. Reduce mixer speed to low and gradually add dry ingredients, beating until just incorporated. Gather dough into a ball, wrap ball in plastic wrap, and chill until firm, about 30 minutes. Place racks in upper and lower thirds of oven; preheat to 375°F. Line 2 rimmed baking sheets with parchment paper. Mix cinnamon and remaining 1/4 cup sugar in a small bowl. Using your hands, roll tablespoonfuls of dough into balls. Roll balls in cinnamon sugar, then transfer to prepared sheets, spacing about 2\" apart. Bake cookies, rotating sheets halfway through, until just golden brown around the edges, 8–10 minutes (cookies will firm up as they cool). Let cookies cool on sheets a few minutes, then transfer to wire racks and let cool completely.",
            "Whisk flour, baking soda, and cream of tartar in a medium bowl. Using an electric mixer on medium speed, beat butter in a large bowl until pale yellow, 2–3 minutes. Scrape down sides, add salt and 3/4 cup sugar, and continue to beat until light and fluffy, 3–4 minutes more. Scrape down sides, add egg, and blend until just incorporated. Reduce mixer speed to low and gradually add dry ingredients, beating until just incorporated.",
            "Gather dough into a ball, wrap ball in plastic wrap, and chill until firm, about 30 minutes.",
            "Place racks in upper and lower thirds of oven; preheat to 375°F. Line 2 rimmed baking sheets with parchment paper. Mix cinnamon and remaining 1/4 cup sugar in a small bowl. Using your hands, roll tablespoonfuls of dough into balls. Roll balls in cinnamon sugar, then transfer to prepared sheets, spacing about 2\" apart.",
            "Bake cookies, rotating sheets halfway through, until just golden brown around the edges, 8–10 minutes (cookies will firm up as they cool). Let cookies cool on sheets a few minutes, then transfer to wire racks and let cool completely."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58cfd77d1406b443e2a13780/6:4/w_274%2Ch_169/Snickerdoodle-recipe-20032017.jpg"
    }
}