{
    "recipe": {
        "title": "Classic Potted Pork ",
        "ingredients": [
            "1 tablespoon sugar",
            "1 teaspoon freshly ground white pepper",
            "1/4 teaspoon dried thyme",
            "1/4 teaspoon ground cinnamon",
            "1/4 teaspoon ground cloves",
            "1/4 teaspoon ground nutmeg",
            "1 tablespoon kosher salt plus more",
            "2 pounds skinless, boneless pork shoulder (Boston butt)",
            "1 1/4 cups (2 1/2 sticks) unsalted butter",
            "1 tablespoon fresh thyme leaves",
            "1 tablespoon vegetable oil",
            "4 large shallots, halved lengthwise",
            "1/2 cup brandy",
            "1 garlic clove, crushed",
            "1 sprig thyme",
            "2 cups low-sodium chicken broth",
            "2 tablespoons Sherry vinegar or red wine vinegar",
            "1 tablespoon sugar",
            "Kosher salt",
            "1 baguette, thinly sliced, toasted",
            "Whole grain mustard (for serving)"
        ],
        "instructions": [
            "Preheat oven to 275°F. Mix sugar, pepper, dried thyme, cinnamon, cloves, nutmeg, and 1 tablespoon salt in a small bowl. Place pork in a roasting pan and season with spice mixture. Cover with foil and cook until fork-tender, 3-4 hours. Let pork cool in pan.",
            "Meanwhile, heat butter in a small saucepan over medium heat until foaming, about 5 minutes. Skim foam from surface; discard. Gently simmer butter, skimming foam from surface, until butter is clear (do not let solids brown). Slowly pour clarified butter into a small bowl, leaving solids behind (you should have about 1 cup). Cover and chill until firm, 1-2 hours.",
            "Coarsely shred pork and place in the bowl of a stand mixer fitted with the paddle attachment. Add fresh thyme and 3/4 cup clarified butter and mix on medium-low speed until a coarse but emulsified mixture forms; season with salt. Divide mixture between two 8-oz. jars, packing down. Melt remaining clarified butter in a small saucepan over low heat; pour over mixture. Cover jars. Chill until pork mixture is firm, at least 4 hours.",
            "DO AHEAD: Clarified butter and potted pork can be made 1 week ahead. Keep chilled. Let potted pork sit at room temperature 2 hours before serving.",
            "For braised shallots and assembly: Heat oil in a large saucepan over medium heat. Add shallots and cook, stirring occasionally, until browned, 8-10 minutes; remove from heat. Add brandy, then return pan to heat and cook shallot mixture until brandy is reduced by half, about 2 minutes. Add garlic, thyme, and broth; cook, stirring occasionally, until shallots are soft and glazed, 25-35 minutes. Remove from heat, discard garlic and thyme, and stir in vinegar and sugar; season with salt. Let cool. Serve potted pork with braised shallots, toasts, and mustard. DO AHEAD: Shallots can be made 3 days ahead. Cover and chill.",
            "Heat oil in a large saucepan over medium heat. Add shallots and cook, stirring occasionally, until browned, 8-10 minutes; remove from heat. Add brandy, then return pan to heat and cook shallot mixture until brandy is reduced by half, about 2 minutes. Add garlic, thyme, and broth; cook, stirring occasionally, until shallots are soft and glazed, 25-35 minutes. Remove from heat, discard garlic and thyme, and stir in vinegar and sugar; season with salt. Let cool.",
            "Serve potted pork with braised shallots, toasts, and mustard.",
            "DO AHEAD: Shallots can be made 3 days ahead. Cover and chill."
        ],
        "picture_link": null
    }
}