{
    "recipe": {
        "title": "Classic Sauce Espagnole ",
        "ingredients": [
            "1/4 pound unsalted lard, chopped",
            "1 large carrot, sliced in thin rounds",
            "1 onion, chopped",
            "1 bay leaf",
            "1/4 teaspoon dried thyme or 1 teaspoon chopped fresh thyme",
            "1/4 cup white wine",
            "2 1/2 tablespoons butter",
            "2 tablespoons flour",
            "3 1/4 cups very rich meat stock, or 3 cups boullion and 3 tablespoons meat glaze",
            "1 pound ripe tomatoes, skinned, quartered and seeded",
            "Salt, pepper to taste"
        ],
        "instructions": [
            "Put lard in a heavy saucepan over low heat, cook for 10 minutes. Add carrot, onion, bay leaf and thyme; stir while cooking over medium heat and until onions are well browned. Spoon off 2 or 3 tablespoons of the liquid fat. Add wine and cook until liquid is reduced by half. While this mixture is reducing, melt the butter in another heavy saucepan, add the flour and brown over low heat. Remove from heat, add 2 cups of stock or combined boullion and meat glaze stirring with a whisk. Return to heat, bring to boil, add vegetable mixture. Reduce heat to very low and let cook for 3 hours, stirring occasionally and skimming from time to time. Strain the sauce through an extremely fine sieve, pressing down on vegetables with a wooden spoon. Add 1 cup stock and again simmer over lowest heat for 3 hours. Put in refrigerator overnight. In the morning skim off fat. Peel tomatoes after drenching with boiling water. Add tomatoes to sauce along with remaining stock. Cook over moderate heat. After tomatoes have liquified, continue cooking until you have about 1 1/4 cups sauce remaining. Add salt and fresh pepper to taste. Use 2 or 3 tablespoons of sauce per serving.",
            "Put lard in a heavy saucepan over low heat, cook for 10 minutes. Add carrot, onion, bay leaf and thyme; stir while cooking over medium heat and until onions are well browned. Spoon off 2 or 3 tablespoons of the liquid fat. Add wine and cook until liquid is reduced by half.",
            "While this mixture is reducing, melt the butter in another heavy saucepan, add the flour and brown over low heat. Remove from heat, add 2 cups of stock or combined boullion and meat glaze stirring with a whisk. Return to heat, bring to boil, add vegetable mixture. Reduce heat to very low and let cook for 3 hours, stirring occasionally and skimming from time to time.",
            "Strain the sauce through an extremely fine sieve, pressing down on vegetables with a wooden spoon. Add 1 cup stock and again simmer over lowest heat for 3 hours. Put in refrigerator overnight. In the morning skim off fat. Peel tomatoes after drenching with boiling water. Add tomatoes to sauce along with remaining stock. Cook over moderate heat. After tomatoes have liquified, continue cooking until you have about 1 1/4 cups sauce remaining. Add salt and fresh pepper to taste. Use 2 or 3 tablespoons of sauce per serving."
        ],
        "picture_link": null
    }
}