{
    "recipe": {
        "title": "Classic Potato Gratin ",
        "ingredients": [
            "5 garlic cloves, divided",
            "1 tablespoon unsalted butter, room temperature",
            "2 medium shallots, quartered through root ends",
            "2 1/2 cups heavy cream",
            "1 tablespoon kosher salt",
            "1 teaspoon freshly ground black pepper",
            "1 tablespoon thyme leaves, plus more",
            "4 pounds russet potatoes, scrubbed, very thinly sliced on a mandoline",
            "3 ounces Gruyere, finely grated",
            "1 ounce Parmesan, finely grated"
        ],
        "instructions": [
            "Preheat oven to 325°F. Cut 1 garlic clove in half and rub the inside of a 3-qt. shallow baking dish with cut sides. Smear butter all over inside of dish. Bring shallots, cream, salt, pepper, 1 Tbsp. thyme, and remaining 4 garlic cloves to a simmer in a small saucepan over low heat; cook until shallots and garlic are very soft, 15–20 minutes. Let cool slightly. Transfer to a blender; blend until smooth. Arrange potato slices in prepared dish, fanning out a handful at a time and placing in dish at an angle (this ensures every scoop will have tender potatoes from the bottom and crisp edges from the top). Shingle as you work until bottom of dish is covered. Tuck smaller slices into any gaps to fill. Pour cream mixture over potatoes and cover dish tightly with foil. Bake potatoes until tender and creamy, 60–75 minutes. Let cool. Place rack in highest position; heat broiler. Remove foil and top potatoes with Gruyere and Parmesan. Broil until cheese is bubbling and top of gratin is golden brown, 5–10 minutes. Serve topped with more thyme leaves.",
            "Preheat oven to 325°F. Cut 1 garlic clove in half and rub the inside of a 3-qt. shallow baking dish with cut sides. Smear butter all over inside of dish. Bring shallots, cream, salt, pepper, 1 Tbsp. thyme, and remaining 4 garlic cloves to a simmer in a small saucepan over low heat; cook until shallots and garlic are very soft, 15–20 minutes. Let cool slightly. Transfer to a blender; blend until smooth.",
            "Arrange potato slices in prepared dish, fanning out a handful at a time and placing in dish at an angle (this ensures every scoop will have tender potatoes from the bottom and crisp edges from the top). Shingle as you work until bottom of dish is covered. Tuck smaller slices into any gaps to fill. Pour cream mixture over potatoes and cover dish tightly with foil. Bake potatoes until tender and creamy, 60–75 minutes. Let cool.",
            "Place rack in highest position; heat broiler. Remove foil and top potatoes with Gruyere and Parmesan. Broil until cheese is bubbling and top of gratin is golden brown, 5–10 minutes. Serve topped with more thyme leaves.",
            "Do ahead Gratin can be baked 1 day ahead. Cover and chill. Bring to room temperature before broiling.",
            "Gratin can be baked 1 day ahead. Cover and chill. Bring to room temperature before broiling."
        ],
        "picture_link": "https://assets.epicurious.com/photos/563a38114cc2d53b6f514265/6:4/w_274%2Ch_169/classic-potato-gratin.jpg"
    }
}