{
    "recipe": {
        "title": "Classic Eggs Benedict with Blender Hollandaise ",
        "ingredients": [
            "1 1/4 cups (2 1/2 sticks) unsalted butter, cut into large pieces",
            "2 large egg yolks",
            "1 tablespoon (or more) fresh lemon juice",
            "1/2 teaspoon (or more) kosher salt",
            "Kosher salt",
            "4 English muffins, split",
            "2 tablespoons unsalted butter, softened",
            "8 slices Canadian bacon or thick-cut ham",
            "8 large eggs",
            "Olive oil (for greasing; optional)",
            "1 tablespoon sliced chives",
            "Paprika (for serving; optional)"
        ],
        "instructions": [
            "Cook butter in a small saucepan over medium heat until melted and foamy. Pour into a spouted measuring cup leaving milk solids in bottom of pot; discard milk solids.",
            "Blend egg yolks, lemon juice, and 1 tsp. water in a blender until smooth. Remove small inset lid from top and, with the motor running, slowly pour in butter in a thin stream. Add salt and blend until creamy. Taste and add more salt or lemon juice, if needed. Transfer to a glass bowl, measuring cup, or small pot. Press plastic wrap directly onto surface so a skin doesn’t form, then place close to stovetop to keep warm up to 1 hour. If hollandaise seems too thick when you’re ready to serve, whisk in warm water 1 tsp. at a time.",
            "Assemble the eggs Benedict: Heat a large pot of salted water over high until tiny bubbles appear on the bottom (water temperature should be about 180°F). Reduce heat to very low to maintain the temperature. Meanwhile, using a toaster, toaster oven, or oven set at 400°F, toast English muffins until golden brown. Slather muffins with butter and divide among plates. Heat a dry large skillet over medium-high and cook bacon until browned and warmed through, 2–3 minutes per side. Top each muffin half with bacon. Adjust heat so water temperature is about 180°F. For perfectly shaped poached eggs with minimal wispy egg white strands, set a medium-sized fine-mesh sieve over a medium bowl. Crack 1 egg into a small bowl, then gently transfer to strainer. Gently swirl for a few seconds to allow any stray whites to drain, then scrape bottom of strainer on lip of bowl to remove any excess. With egg still in strainer, carefully lower into hot water until egg is completely submerged. Gently shake and swirl strainer, shaping egg with a slotted spoon. When edges of egg white start to turn opaque (about 30 seconds), carefully release egg from strainer with slotted spoon into water. Cook egg, flipping occasionally with slotted spoon, until white is opaque and firm and yolk is plump and jiggles slightly to the touch, 3–3 1/2 minutes more. While first egg is cooking, repeat steps to cook remaining eggs, but keep an eye on which went in first. Use a timer to avoid overcooking. When egg is ready, carefully remove from hot water with slotted spoon. To serve immediately, place a paper towel under spoon and shake spoon gently to remove excess water. Transfer egg to an oiled plate or rimmed baking sheet, or place 1 egg on top of each piece of bacon. Spoon a few tablespoons of hollandaise over eggs. Top with chives and a light dusting of paprika, if desired. Serve immediately.",
            "Heat a large pot of salted water over high until tiny bubbles appear on the bottom (water temperature should be about 180°F). Reduce heat to very low to maintain the temperature.",
            "Meanwhile, using a toaster, toaster oven, or oven set at 400°F, toast English muffins until golden brown. Slather muffins with butter and divide among plates.",
            "Heat a dry large skillet over medium-high and cook bacon until browned and warmed through, 2–3 minutes per side. Top each muffin half with bacon.",
            "Adjust heat so water temperature is about 180°F. For perfectly shaped poached eggs with minimal wispy egg white strands, set a medium-sized fine-mesh sieve over a medium bowl. Crack 1 egg into a small bowl, then gently transfer to strainer. Gently swirl for a few seconds to allow any stray whites to drain, then scrape bottom of strainer on lip of bowl to remove any excess.",
            "With egg still in strainer, carefully lower into hot water until egg is completely submerged. Gently shake and swirl strainer, shaping egg with a slotted spoon. When edges of egg white start to turn opaque (about 30 seconds), carefully release egg from strainer with slotted spoon into water.",
            "Cook egg, flipping occasionally with slotted spoon, until white is opaque and firm and yolk is plump and jiggles slightly to the touch, 3–3 1/2 minutes more. While first egg is cooking, repeat steps to cook remaining eggs, but keep an eye on which went in first. Use a timer to avoid overcooking.",
            "When egg is ready, carefully remove from hot water with slotted spoon. To serve immediately, place a paper towel under spoon and shake spoon gently to remove excess water. Transfer egg to an oiled plate or rimmed baking sheet, or place 1 egg on top of each piece of bacon.",
            "Spoon a few tablespoons of hollandaise over eggs. Top with chives and a light dusting of paprika, if desired. Serve immediately.",
            "Do Ahead To poach eggs in advance, immediately transfer poached eggs to a bowl of ice water to stop the cooking process. Transfer to a resealable container filled with cold water (eggs should be fully submerged) and chill up to 3 days. To serve, place eggs in a bowl of hot tap water until they feel warm to the touch, about 2 minutes. Hollandaise can made 2 days ahead; press plastic wrap directly on surface and chill. To serve, fill a saucepan with a few inches of water and set a heatproof bowl on top (bottom of bowl should not touch water). Bring water to a simmer over medium-low heat and transfer hollandaise to bowl. Gently reheat sauce, whisking occasionally, until warm. If it's too thick, whisk in hot tap water 1 tsp. at a time.",
            "To poach eggs in advance, immediately transfer poached eggs to a bowl of ice water to stop the cooking process. Transfer to a resealable container filled with cold water (eggs should be fully submerged) and chill up to 3 days. To serve, place eggs in a bowl of hot tap water until they feel warm to the touch, about 2 minutes.",
            "Hollandaise can made 2 days ahead; press plastic wrap directly on surface and chill. To serve, fill a saucepan with a few inches of water and set a heatproof bowl on top (bottom of bowl should not touch water). Bring water to a simmer over medium-low heat and transfer hollandaise to bowl. Gently reheat sauce, whisking occasionally, until warm. If it's too thick, whisk in hot tap water 1 tsp. at a time."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5900d6a4dd16ea535a7aed58/6:4/w_274%2Ch_169/Classic-Eggs-Benedict-26042017.jpg"
    }
}