{
    "recipe": {
        "title": "Classic Double-Crust Apple Pie ",
        "ingredients": [
            "2 1/2 cups all purpose flour",
            "1/2 teaspoon salt",
            "10 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into 1/2-inch pieces",
            "1/2 cup chilled solid vegetable shortening, cut into 1/2-inch pieces",
            "4 tablespoons (about) ice water",
            "Nonstick vegetable oil spray",
            "1 3/4 pounds sweet apples, such as Spartan or Golden Delicious, peeled, cored, thinly sliced (about 5 1/2 cups)",
            "1 3/4 pounds tart apples, such as Granny Smith or Pippin, peeled, cored, thinly sliced (about 5 1/2 cups)",
            "3/4 cup plus 1 tablespoon sugar",
            "1 teaspoon fresh lemon juice",
            "1/2 teaspoon plus large pinch of ground cinnamon",
            "large pinch of ground cinnamon",
            "1/2 teaspoon vanilla extract",
            "1 tablespoon all purpose flour",
            "3 tablespoons unsalted butter, diced",
            "1 tablespoon whole milk"
        ],
        "instructions": [
            "For crust: Whisk flour and salt in large bowl to blend. Add butter and shortening and rub in with fingertips until very coarse meal forms. Sprinkle with 3 tablespoons water; toss until moist clumps form, adding more water by teaspoonfuls if mixture is dry. Gather dough into ball; divide in half. Flatten into disks. Wrap in plastic; chill at least 1 hour. (Can be made 1 day ahead. Keep refrigerated. Soften slightly at room temperature before using.)",
            "Whisk flour and salt in large bowl to blend. Add butter and shortening and rub in with fingertips until very coarse meal forms. Sprinkle with 3 tablespoons water; toss until moist clumps form, adding more water by teaspoonfuls if mixture is dry. Gather dough into ball; divide in half. Flatten into disks. Wrap in plastic; chill at least 1 hour. (Can be made 1 day ahead. Keep refrigerated. Soften slightly at room temperature before using.)",
            "For filling: Preheat oven to 400°F. Spray 9-inch-diameter deep-dish glass pie dish with nonstick spray. Stir all apples, 3/4 cup sugar, lemon juice, 1/2 teaspoon cinnamon, and vanilla in large bowl to blend. Let stand until juices form, about 15 minutes. Mix in flour. Roll out 1 dough disk on lightly floured surface to 12-inch round. Place dough in prepared pie dish. Spoon in filling; dot with butter. Roll out second dough disk to 13-inch round. Using small bottle cap, cut out ten 1/2-inch-diameter circles from dough for decoration; discard circles. Drape dough over filling. Seal top and bottom crust edges together; trim to 1/2-inch overhang. Fold overhang under; crimp decoratively. Brush pie with milk. Combine remaining 1 tablespoon sugar and large pinch of cinnamon in small bowl; sprinkle over pie. Transfer pie to baking sheet; place in oven. Immediately reduce temperature to 375°F. Bake pie until crust is golden brown, apples are tender and filling is bubbling thickly, covering edge with foil if browning too quickly, about 2 hours. Cool 30 minutes. Serve warm or at room temperature. (Can be made 1 day ahead. Cover loosely; store at room temperature.)",
            "Preheat oven to 400°F. Spray 9-inch-diameter deep-dish glass pie dish with nonstick spray. Stir all apples, 3/4 cup sugar, lemon juice, 1/2 teaspoon cinnamon, and vanilla in large bowl to blend. Let stand until juices form, about 15 minutes. Mix in flour.",
            "Roll out 1 dough disk on lightly floured surface to 12-inch round. Place dough in prepared pie dish. Spoon in filling; dot with butter. Roll out second dough disk to 13-inch round. Using small bottle cap, cut out ten 1/2-inch-diameter circles from dough for decoration; discard circles. Drape dough over filling. Seal top and bottom crust edges together; trim to 1/2-inch overhang. Fold overhang under; crimp decoratively. Brush pie with milk. Combine remaining 1 tablespoon sugar and large pinch of cinnamon in small bowl; sprinkle over pie.",
            "Transfer pie to baking sheet; place in oven. Immediately reduce temperature to 375°F. Bake pie until crust is golden brown, apples are tender and filling is bubbling thickly, covering edge with foil if browning too quickly, about 2 hours. Cool 30 minutes. Serve warm or at room temperature. (Can be made 1 day ahead. Cover loosely; store at room temperature.)"
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea899f3a00aeb2f1d7279/6:4/w_274%2Ch_169/105845.jpg"
    }
}