{
    "recipe": {
        "title": "Clay-Pot Miso Chicken ",
        "ingredients": [
            "16 chicken thighs with skin and bone (5 pounds)",
            "1/2 cup dried wood ear mushrooms",
            "10 cups water, divided",
            "About 4 cups chicken stock or reduced-sodium chicken broth (32 fluid ounces)",
            "2 (c) stalks burdock root (sometimes called gobo) or salsify (optional)",
            "1 teaspoon distilled white vinegar or fresh lemon juice",
            "3 tablespoons canola oil",
            "2 large onions, coarsely chopped",
            "1 lb fresh shiitake mushrooms, stems discarded, large caps quartered",
            "3 tablespoons finely chopped peeled ginger",
            "3 tablespoons finely chopped garlic",
            "1 cup mirin (Japanese sweet rice wine)",
            "1 cup white miso (also called shiro miso)",
            "1/2 cup soy sauce",
            "1 lb mustard greens, tough stems and ribs discarded and leaves coarsely chopped (16 cups)",
            "Accompaniment: steamed Asian white rice",
            "Garnish: chopped scallions"
        ],
        "instructions": [
            "Preheat oven to 500°F with rack in middle.",
            "Pat chicken dry, then roast, skin side up, in 1 layer in a 17- by 12-inch shallow baking pan until skin is golden brown, 35 to 40 minutes.",
            "While chicken roasts, soak wood ear mushrooms in 4 cups water until softened, about 15 minutes. Drain in a sieve, then rinse well and discard any hard pieces. Drain well, squeezing out excess water.",
            "Transfer roasted chicken to a bowl and pour pan juices through a fine-mesh sieve into a 1-quart glass measure. Let stand until fat rises to top, 1 to 2 minutes, then skim off and discard fat. Add enough stock to bring total to 4 cups liquid.",
            "Reduce oven to 300°F and move rack to lower third.",
            "Peel burdock root, and, if more than 1-inch-thick, halve lengthwise. Cut crosswise into 1-inch pieces. Transfer burdock root to a bowl, then add vinegar and 2 cups water.",
            "Heat oil in a 7- to 8-quart heavy pot over medium-high heat until it shimmers, then sauté onions until softened and beginning to brown. Add shiitakes, ginger, and garlic and sauté until garlic is golden, 3 to 5 minutes.",
            "Add mirin and boil, stirring and scraping up any brown bits, 1 minute. Stir in miso and soy sauce, then stir in chicken, wood ear mushrooms, burdock (drained), stock mixture, and remaining 4 cups water. Bring to a boil, skimming off any froth.",
            "Cover pot and braise in oven until chicken is tender, about 1 hour.",
            "Stir in mustard greens and continue to braise, covered, 5 minutes. Serve in shallow bowls."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a43f3a00aeb2f1cf7b2/6:4/w_274%2Ch_169/240262_hires.jpg",
        "color": 12205881
    }
}