{
    "recipe": {
        "title": "Clay Pot Chicken with Dates, Sucuk and Bulgur ",
        "ingredients": [
            "2 ounces unsalted butter",
            "1 tablespoon extra-virgin olive oil",
            "2 red onions, cut into thick rings",
            "1 clove garlic, sliced",
            "2 long red peppers, seeded and cut into rings",
            "2 long green peppers, seeded and cut into rings",
            "2 long green chiles, seeded and diced",
            "1 heaped teaspoon ground cumin",
            "1 level teaspoon ground cinnamon",
            "generous splash of sherry",
            "2 large vine-ripened tomatoes, skinned, seeded and diced",
            "2 ounces bulgur, washed",
            "1 1/2 cups chicken stock",
            "1 stick cinnamon",
            "2 star anise",
            "few sprigs thyme",
            "2 1-pound chickens",
            "sea salt",
            "freshly ground black pepper",
            "1 tablespoon olive oil",
            "2 ounces sucuk, sliced",
            "4 medjool dates, seeded and cut into quarters"
        ],
        "instructions": [
            "Preheat the oven to 400°F. Heat the butter and extra-virgin olive oil in a heavy-based casserole dish. Gently sweat the onions, garlic, peppers and chiles with the cumin and cinnamon for about 5 minutes, or until the vegetables soften. Add the sherry, tomatoes, bulgur, chicken stock, cinnamon, star anise and thyme and bring to the boil. Lower the heat, then cover and simmer gently for 5 minutes. Meanwhile, cut the chickens into quarters and season lightly with salt and pepper. In another heavy-based frying pan, heat the olive oil over a medium heat and brown the meat lightly all over. Add the sucuk and fry until golden brown on both sides. Transfer the poussins and sucuk to the casserole dish and tuck in the dates. Cover the pan and cook in the preheated oven for 20 minutes. Taste and adjust the seasoning and serve immediately.",
            "Preheat the oven to 400°F. Heat the butter and extra-virgin olive oil in a heavy-based casserole dish. Gently sweat the onions, garlic, peppers and chiles with the cumin and cinnamon for about 5 minutes, or until the vegetables soften. Add the sherry, tomatoes, bulgur, chicken stock, cinnamon, star anise and thyme and bring to the boil. Lower the heat, then cover and simmer gently for 5 minutes.",
            "Meanwhile, cut the chickens into quarters and season lightly with salt and pepper.",
            "In another heavy-based frying pan, heat the olive oil over a medium heat and brown the meat lightly all over. Add the sucuk and fry until golden brown on both sides. Transfer the poussins and sucuk to the casserole dish and tuck in the dates. Cover the pan and cook in the preheated oven for 20 minutes. Taste and adjust the seasoning and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d7977f3a00aeb2f1cb7f4/6:4/w_274%2Ch_169/350834.jpg"
    }
}