{
    "recipe": {
        "title": "Cleansing Tea ",
        "ingredients": [
            "1-2\" cinnamon stick",
            "1/4 cup coriander seeds",
            "4 cups water",
            "1 bunch cilantro (with roots if possible)",
            "1 bunch rosemary",
            "1-2\" piece peeled ginger",
            "2 bags detox tea (such as Traditional Medicinals EveryDay Detox)",
            "1 tablespoon manuka or raw honey",
            "1 tablespoon raw unfiltered apple cider vinegar"
        ],
        "instructions": [
            "Toast a 2\" cinnamon stick and 1/4 cup coriander seeds in a dry small skillet over medium heat, tossing occasionally, until beginning to crackle, about 4 minutes. Crush on a cutting board with the side of a chef's knife or cleaver. Transfer to a large saucepan; add 4 cups water. Cook over medium-high heat until very warm but not hot. Meanwhile, lightly bruise 1 bunch cilantro (with roots if possible) and 1 bunch rosemary with the side of your knife. Add to saucepan along with a finely grated 2\" piece peeled ginger, 2 bags detox tea (such as Traditional Medicinals EveryDay Detox), 1 tablespoon manuka or raw honey, and 1 tablespoon raw unfiltered apple cider vinegar; stir to dissolve honey. Reduce heat to low and let mixture steep until flavorful, 10–15 minutes. Strain into a pint jar or large glass, pressing to extract as much liquid as possible.",
            "Toast a 2\" cinnamon stick and 1/4 cup coriander seeds in a dry small skillet over medium heat, tossing occasionally, until beginning to crackle, about 4 minutes. Crush on a cutting board with the side of a chef's knife or cleaver. Transfer to a large saucepan; add 4 cups water. Cook over medium-high heat until very warm but not hot.",
            "Meanwhile, lightly bruise 1 bunch cilantro (with roots if possible) and 1 bunch rosemary with the side of your knife. Add to saucepan along with a finely grated 2\" piece peeled ginger, 2 bags detox tea (such as Traditional Medicinals EveryDay Detox), 1 tablespoon manuka or raw honey, and 1 tablespoon raw unfiltered apple cider vinegar; stir to dissolve honey. Reduce heat to low and let mixture steep until flavorful, 10–15 minutes. Strain into a pint jar or large glass, pressing to extract as much liquid as possible."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54dcdfcce77a7de93305d334/6:4/w_274%2Ch_169/51263650_cleansing-tea_1x1.jpg"
    }
}