{
    "recipe": {
        "title": "Cock-a-Leekie Pie ",
        "ingredients": [
            "6 tablespoons unsalted butter, divided",
            "3 bacon slices, cut into 1/4\" pieces",
            "2 pounds skinless, boneless chicken breasts or thighs",
            "Kosher salt, freshly ground pepper",
            "3 leeks, white and pale-green parts only, thinly sliced into rounds",
            "2 sprigs thyme, leaves stripped",
            "1/2 cup quartered pitted prunes",
            "1/3 cup all-purpose flour, plus more",
            "2 cups low-sodium chicken broth",
            "All-Butter Pie Dough",
            "1 large egg, beaten to blend"
        ],
        "instructions": [
            "Place a rack in lower third of oven; preheat to 375°. Melt 2 tablespoons butter in a large skillet over medium-high. Cook bacon, stirring often, until crisp, about 4 minutes. Transfer to a plate with a slotted spoon.",
            "Season chicken with salt and pepper and cook in same skillet until brown, about 3 minutes per side. Add a splash of water to skillet. Cover, reduce heat, and cook until chicken is cooked through, 10-12 minutes. Transfer to a plate.",
            "Add leeks to skillet, season with salt and pepper, and cook, stirring often, until softened, about 5 minutes. Add a splash of water, cover, and cook until leeks are very soft, 5-7 minutes. Transfer to a large bowl. Shred chicken and add to leeks along with thyme leaves and prunes.",
            "Melt remaining 4 tablespoons butter in a medium saucepan over medium-high heat. Whisk in 1/3 cup flour and cook, whisking constantly, until golden brown, about 3 minutes. Whisk in broth, adding a little at a time, until smooth. Simmer, stirring occasionally, until thickened, 5-7 minutes. Mix sauce into leek mixture; season with salt and pepper. Let cool.",
            "Roll out 1 disk of dough on a lightly floured surface to a 14\" round. Transfer to a 10\" cast-iron skillet or a 9 1/2\"-diameter deep pie dish. Lift up edge and let dough slump down into dish. Trim, leaving a 1\" overhang. Spoon filling into skillet. Roll out second disk of dough to 11\" round. Drape over filling and trim to a 1\" overhang. Fold overhang under; crimp with a fork. Cut a few vents in top; brush with egg.",
            "Bake until crust is golden brown, 50-60 minutes. Let pie cool slightly.",
            "Do ahead: Filling can be made 1 day ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54dcdebee77a7de93305ccd2/6:4/w_274%2Ch_169/51263480_cock-a-leekie-pie_1x1.jpg"
    }
}