{
    "recipe": {
        "title": "Coconut Rice and Peas ",
        "ingredients": [
            "1 cup dried red kidney beans, soaked overnight, drained",
            "2 tablespoons unsalted butter",
            "1 large shallot, finely chopped",
            "1 tablespoon chopped oregano",
            "1 teaspoon chopped thyme",
            "2 garlic cloves, finely grated",
            "Kosher salt, freshly ground pepper",
            "1 (13.5-ounce) can unsweetened coconut milk",
            "2 cups basmati rice"
        ],
        "instructions": [
            "Place beans in a large saucepan and cover with 6 cups cold water. Bring to a simmer over medium heat, skimming foam from surface as needed, then reduce heat to maintain a bare simmer. Cook, adding water as needed to keep beans covered by at least 1\", until beans are completely tender, 1–1 1/2 hours.",
            "Heat butter in a medium skillet over medium. Add shallot, oregano, and thyme and cook, stirring often, until shallot is translucent, about 4 minutes. Add garlic and cook, stirring, until fragrant, about 1 minute. Remove skillet from heat. Use a slotted spoon to transfer beans to skillet and stir to combine. Season with salt and pepper. Set aside.",
            "Pour out all but 2 cups bean cooking liquid from saucepan; add coconut milk and bring to a simmer over medium heat. While liquid is heating up, place rice in a fine-mesh sieve and rinse under cold water until water runs clear. Add rice to saucepan, reduce heat to a bare simmer, and cover. Cook rice 10 minutes, then uncover and stir in reserved bean mixture. Taste and adjust seasoning with more salt if needed. Cover pan and cook until rice is tender, 8–10 minutes. Remove from heat and uncover. Fluff rice with a fork.",
            "Do Ahead Rice and beans can be made 1 hour ahead. Keep covered. Reheat gently before serving.",
            "Rice and beans can be made 1 hour ahead. Keep covered. Reheat gently before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59233d7fbb553a5f5751b910/6:4/w_274%2Ch_169/coconut-rice-and-peas-052217.jpg"
    }
}