{
    "recipe": {
        "title": "Coconut Milk French Toast with Pineapple Syrup ",
        "ingredients": [
            "8 (1\"-thick) slices challah, brioche, or other rich, dense bread",
            "1 (20-oz.) can cubed pineapple in juice",
            "2 Tbsp. virgin coconut oil, divided, plus more for brushing",
            "1 cup plus 1 Tbsp. sugar, divided",
            "1/2 tsp. kosher salt, divided",
            "1 (14-oz.) can coconut milk, preferably full-fat",
            "1 tsp. vanilla extract"
        ],
        "instructions": [
            "Preheat oven to 275°F. Arrange bread on a rimmed baking sheet and toast, flipping once halfway through, until dry but not browned, 20–30 minutes. This will help the bread absorb the coconut milk without sogging out.",
            "While bread toasts, drain pineapple cubes, reserving juice. Heat 1 Tbsp. oil in a medium skillet over medium. Cook pineapple, stirring occasionally, until golden brown, about 10 minutes. Add juice, 1 cup sugar, 1/4 tsp. salt, and 1/2 cup water and bring to a boil. Reduce heat to medium-low and simmer, stirring occasionally, until pineapple breaks down a little and juice is syrupy and thick, 10–12 minutes. Transfer to a medium bowl and cover with a kitchen towel to keep warm.",
            "Whisk coconut milk, vanilla, and remaining 1 Tbsp. sugar and 1/4 tsp. salt in a large bowl.",
            "Heat 1 Tbsp. oil in a nonstick skillet over medium-high. Working in batches, dip each slice of bread into coconut milk mixture and let soak about 15 seconds. Flip and soak 15 more seconds. Cook, flipping halfway through, until golden brown on each side, 3–4 minutes per side. Repeat with remaining bread, brushing skillet with more oil between batches.",
            "Arrange toast on a platter. Top with pineapple pieces and syrup."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ac24860968b1f5f9f70b522/6:4/w_274%2Ch_169/Google-Express-Coconut-Milk-French-Toast-recipe-23012018.jpg",
        "color": 13136661
    }
}