{
    "recipe": {
        "title": "Coconut Cake with Mascarpone Frosting ",
        "ingredients": [
            "2 1/2 cups all purpose flour",
            "2 teaspoons baking powder",
            "1 2/3 cups sugar",
            "3/4 cup (1 1/2 sticks) plus 3 tablespoons unsalted butter, room temperature",
            "1 teaspoon vanilla extract",
            "4 large eggs, room temperature",
            "3/4 cup whole milk",
            "1 1/2 cups finely grated peeled fresh coconut",
            "2 3/4 teaspoons finely grated lime peel, divided",
            "3/4 cup mascarpone cheese* (about 6 ounces)",
            "1/4 teaspoon ground cloves",
            "2 2/3 cups powdered sugar",
            "1/2 cup 1-inch-long strips shaved coconut with brown inner coating left intact (about 2 ounces; use vegetable peeler)"
        ],
        "instructions": [
            "Preheat oven to 325°F. Line bottom of 9-inch diameter springform pan with parchment paper; butter paper and pan.",
            "Whisk flour and baking powder in medium bowl. Using electric mixer, beat sugar, 3/4 cup butter, and vanilla in large bowl until blended. Beat in eggs 1 at a time. Add flour mixture alternately with milk in 2 additions each, beating until just blended. Stir in 1 1/2 cups finely grated coconut and 1 1/4 teaspoons lime peel.",
            "Transfer mixture to prepared pan; smooth top. Bake until tester inserted into center comes out clean, about 1 hour 20 minutes. Cool cake in pan 20 minutes. Cut around sides to loosen; invert onto platter. Cool completely.",
            "Using electric mixer, beat 3 tablespoons butter, 1 1/2 teaspoons lime peel, mascarpone, and cloves in large bowl. Add powdered sugar; beat just until smooth.",
            "Spread mascarpone frosting over top of cooled cake. Garnish top edge with 1/2 cup shaved coconut. DO AHEAD Can be made 1 day ahead. Cover with cake dome and chill. Bring to room temperature before serving.",
            "*An Italian cream cheese; sold at many supermarkets and at Italian markets.",
            "*An Italian cream cheese; sold at many supermarkets and at Italian markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d784ef3a00aeb2f1cb514/6:4/w_274%2Ch_169/242118_hires.jpg",
        "color": 1371534
    }
}