{
    "recipe": {
        "title": "Cocoa-Nut Energy Bites ",
        "ingredients": [
            "1 tablespoon virgin coconut oil, melted, cooled, plus more for pan",
            "3 tablespoons cacao nibs",
            "5 ounces pitted Medjool dates (about 8)",
            "1/2 cup nut butter",
            "3 tablespoons ground chia seeds, ground flaxseed, and/or ground hemp seeds",
            "1 teaspoon kosher salt",
            "1/2 teaspoon ground cinnamon",
            "3 tablespoons almond flour or meal",
            "3 tablespoons unsweetened shredded coconut",
            "Flaky sea salt"
        ],
        "instructions": [
            "Brush an 8 1/2x4 1/2\" loaf pan with oil; line with parchment paper, leaving an overhang on long sides. Pulse cacao nibs in a food processor to a fine powder; transfer to a bowl.",
            "Place dates in a small heatproof bowl; pour boiling water over to submerge. Cover with plastic wrap; let sit until softened, 8–10 minutes.",
            "Drain dates and transfer to food processor. Add nut butter and remaining 1 Tbsp. oil; process in long pulses until dates disintegrate and ingredients come together (mixture will be crumbly). Add seeds, kosher salt, and cinnamon; pulse to incorporate. Add almond flour, ground cacao nibs, and shredded coconut and pulse just to combine. Press into prepared pan in an even layer, compacting as firmly as possible (it will look slightly greasy, but oils will solidify once mixture is cold). Cover and chill until firm, about 1 hour.",
            "Uncover and use sides of parchment paper to lift bar out of pan. Cut into a 6x3 grid to form squares; sprinkle with sea salt.",
            "Do Ahead Energy bites can be made 5 days ahead. Cover and chill, or freeze up to 2 weeks.",
            "Energy bites can be made 5 days ahead. Cover and chill, or freeze up to 2 weeks."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59233d802b31d77622a16c90/6:4/w_274%2Ch_169/cocoa-nut-energy-bites-BA-051722.jpg"
    }
}