{
    "recipe": {
        "title": "Coconut Shrimp Beignets with Pepper Jelly Sauce ",
        "ingredients": [
            "Canola oil or other neutral vegetable oil, for deep frying",
            "1 cup pepper jelly (we use Tabasco brand)",
            "2 tablespoons Creole mustard or any country-style whole-grain mustard",
            "2 tablespoons champagne vinegar (apple cider vinegar is a good substitute)",
            "2 cups all-purpose flour",
            "1 cup shredded sweetened coconut",
            "1 tablespoon baking powder",
            "1 teaspoon salt",
            "1/2 teaspoon cayenne pepper",
            "1/4 cup very thinly sliced green onions, white and green parts",
            "1 (12-ounce) bottle of amber beer (we use Abita amber, but any amber will do)",
            "Water (optional)",
            "1 pound small shrimp, peeled and deveined"
        ],
        "instructions": [
            "Fill a heavy, deep saucepan with at least 6 inches of oil. Heat the oil over medium-high heat until it registers 340°F on a deep-fry thermometer.",
            "To make the sauce, combine the jelly, mustard, and vinegar; whisk until smooth and chill until needed (this can be made 1 day in advance).",
            "To make the batter, in a large bowl, combine the flour, coconut, baking powder, salt, cayenne pepper, and green onions. Whisk the ingredients together thoroughly and make a well in the center.",
            "Slowly pour the beer into the well, whisking from the inside to the outside until the mixture has the consistency of pancake batter. If it's not, thin it with a touch of water.",
            "Line a plate with paper towels and have ready. Fold the shrimp into the batter. Using 2 tablespoons, carefully scoop one batter-coated shrimp into one spoon, and with the other spoon, push the mixture into the hot oil (be careful not to splash the oil). For best results, fry no more than four beignets at a time. Using a slotted spoon, turn the beignets to cook 1 minute per side, until puffy and light brown all over. With a slotted spoon, remove the beignets from the oil and let drain on the prepared plate.",
            "To serve, season with salt and accompany with the sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b082f5fca98987608b47a7/6:4/w_274%2Ch_169/51120000_coconut-shrimp-beignets_1x1.jpg",
        "color": 4822273
    }
}