{
    "recipe": {
        "title": "Coconut Mousse ",
        "ingredients": [
            "2 cups boiling-hot water",
            "1/2 pound unsweetened dried coconut (2 3/4 cups)",
            "1 (13- to 14-ounce) can sweetened condensed milk",
            "About 1/4 cup whole milk",
            "2 1/2 teaspoons unflavored gelatin (from two 1/4-ounce packages)",
            "1/2 cup well-chilled heavy cream",
            "4 large egg whites",
            "Garnish: toasted sweetened flaked coconut; fresh lime zest",
            "cheesecloth"
        ],
        "instructions": [
            "Pour boiling-hot water over dried coconut in a blender, then blend, scraping down sides as necessary, until combined well, about 30 seconds (use caution when blending hot liquids). Cool in blender until cool enough to handle.",
            "Line a large fine-mesh sieve with several layers of cheesecloth and set it over a bowl. Pour coconut mixture into lined sieve and squeeze out as much liquid as possible.",
            "Whisk together sweetened condensed milk and 1 cup coconut milk in a large bowl.",
            "Pour remaining coconut milk into a 1-cup glass measure and add enough whole milk to bring total to 1 cup, then transfer to a small saucepan.",
            "Sprinkle gelatin over milk mixture in saucepan and let stand 1 minute to soften, then heat over moderate heat, whisking occasionally, until gelatin is dissolved (do not let boil). Whisk into sweetened condensed milk mixture in large bowl until combined. Quick-chill by putting bowl in a larger bowl of ice and cold water and stirring occasionally until mixture is the consistency of raw egg whites, about 10 minutes. Remove bowl from ice bath.",
            "Beat cream with an electric mixer until it holds soft peaks, then fold cream into coconut mixture gently but thoroughly.",
            "Using cleaned beaters, beat egg whites with a pinch of salt until they hold soft peaks, then fold into coconut mixture gently but thoroughly. Chill, covered, until set, about 1 hour."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d99a6f9a84192308a1a6c/6:4/w_274%2Ch_169/238416.jpg"
    }
}