{
    "recipe": {
        "title": "Coconut Coffee Marbled Ice Cream Cake ",
        "ingredients": [
            "3/4 cup chocolate wafer crumbs (from about 15 cookies such as Nabisco Famous Chocolate Wafers)",
            "1 teaspoon instant-espresso powder",
            "2 tablespoons unsalted butter, melted",
            "1 pt premium coffee ice cream, softened slightly",
            "1 pt premium coconut sorbet, softened slightly",
            "3 tablespoons heavy cream",
            "1 tablespoon light corn syrup",
            "1 tablespoon packed dark brown sugar",
            "1 teaspoon unsweetened Dutch-process cocoa powder",
            "1/8 teaspoon salt",
            "2 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped",
            "1 tablespoon unsalted butter",
            "1 teaspoon vanilla",
            "a 1 1/2-qt rectangular mold such as a 12- by 3 1/4- by 2 3/4-inch pté mold; parchment paper; an offset metal spatula"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 375°F.",
            "Line mold with a double layer of parchment paper, allowinga few inches of overhang along each side.",
            "Stir together crumbs, espresso powder, and butter and press over bottom of mold. Bake until crisp, about 10 minutes, then cool completely in mold on a rack, about 20 minutes.",
            "Make ice cream layer: Scoop and drop ice cream and sorbet alternately into mold in 1 layer until crust is covered, then smooth with offset spatula until flat. Make another layer in same manner. Freeze, covered with plastic wrap, until firm, at least 2 hours.",
            "Scoop and drop ice cream and sorbet alternately into mold in 1 layer until crust is covered, then smooth with offset spatula until flat. Make another layer in same manner. Freeze, covered with plastic wrap, until firm, at least 2 hours.",
            "Make fudge sauce and finish cake: Bring cream, corn syrup, brown sugar, cocoa, salt, and half of chocolate to a boil in a 1- to 1 1/2-quart heavy saucepan over moderate heat, stirring until chocolate is melted. Reduce heat and simmer, stirring occasionally, 5 minutes, then remove from heat. Add butter, vanilla, and remaining chocolate and stir until smooth. Cool fudge sauce to warm, at least 15 minutes. Pour warm sauce over ice cream layer and freeze again, uncovered, until firm, about 15 minutes. Remove cake by grasping both ends of parchment, and transfer it to a platter. Using a spatula to stabilize end of cake, carefully slide parchment out from under cake.",
            "Bring cream, corn syrup, brown sugar, cocoa, salt, and half of chocolate to a boil in a 1- to 1 1/2-quart heavy saucepan over moderate heat, stirring until chocolate is melted. Reduce heat and simmer, stirring occasionally, 5 minutes, then remove from heat.",
            "Add butter, vanilla, and remaining chocolate and stir until smooth.",
            "Cool fudge sauce to warm, at least 15 minutes.",
            "Pour warm sauce over ice cream layer and freeze again, uncovered, until firm, about 15 minutes. Remove cake by grasping both ends of parchment, and transfer it to a platter. Using a spatula to stabilize end of cake, carefully slide parchment out from under cake."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd760f9a84192308a4d9b/6:4/w_274%2Ch_169/235036.jpg",
        "color": 11792698
    }
}