{
    "recipe": {
        "title": "Coconut Zucchini Noodles and Spiced Meatballs ",
        "ingredients": [
            "1 pound ground pasture-raised lamb",
            "1 tablespoon freshly grated ginger",
            "2 scallions, sliced paper-thin",
            "1 teaspoon ground turmeric",
            "1 tablespoon wheat-free tamari",
            "1 tablespoon fish sauce (Red Boat is a Clean-approved brand)",
            "1 tablespoon lime juice",
            "2 to 3 tablespoons coconut oil",
            "1/2 cup sliced onions",
            "2 garlic cloves",
            "2 tablespoons minced lemongrass",
            "1 red chile pepper, minced (optional)",
            "1 (13.5-ounce) can unsweetened coconut milk",
            "1/4 cup water",
            "1 broccoli crown, cut into small florets (about 2 cups)",
            "3/4 to 1 pound zucchini, ends removed and sliced lengthwise with a peeler or mandoline into long pappardelle-like “noodles”",
            "Sea salt to taste",
            "1/2 cup roughly chopped fresh cilantro",
            "1 lime, cut into wedges"
        ],
        "instructions": [
            "First, prepare the meatballs. In a large bowl, combine all the ingredients for the meatballs and mix them thoroughly with your hands or a wooden spoon. Wet your hands, then form even-size balls. I usually go for about the size of a golf ball.",
            "Heat a 4-quart Dutch oven over medium-high heat. Melt the coconut oil, and once it’s nice and hot, add the meatballs. Cook them for 30 to 45 seconds on each side, until they are all nicely browned. When they are about halfway done browning, make some space in the center of the pan and add the onions, garlic, lemongrass, and optional red chile. Continue to cook the mixture for 1 to 2 minutes, then move the meatballs back into the center of the pan and add the coconut milk and water. Cover the pan and simmer for about 5 more minutes before adding the broccoli. Within a few minutes the broccoli should be tender and the coconut milk reduced and starting to thicken. Carefully fold in the zucchini noodles and allow them to cook in the liquid. Cook them just until the zucchini is tender. Salt to taste.",
            "Serve with a garnish of cilantro and a squeeze of lime."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58dd7f3339487313e3d24af9/6:4/w_274%2Ch_169/coconut-zucchini-noodles-and-meatballs-HC-033017.jpg"
    }
}