{
    "recipe": {
        "title": "Cocoa-Dusted Dark Chocolate Bombe ",
        "ingredients": [
            "3 1/4 cups heavy cream",
            "2 1/4 cups sugar",
            "12 ounces unsweetened baker's chocolate (we recommend Valrhona cacao paste), chopped",
            "1/4 cup sugar",
            "2 ounces dark chocolate (we recommend Valrhona Manjari 64%), chopped",
            "1 1/2 cups flour, plus extra for coating the bowl",
            "7 eggs",
            "1 egg yolk",
            "1 1/4 cups sugar",
            "2/3 cup unsweetened cocoa powder (we recommend Valrhona 100% Pure Cacao Powder)",
            "3 1/4 tablespoons milk",
            "3 1/2 tablespoons butter, melted",
            "1 pound tempered chocolate"
        ],
        "instructions": [
            "In a small saucepan, combine the heavy cream and sugar and bring to a simmer. Place the chocolate in a heatproof bowl and pour the hot cream mixture over the top. Rest for 1 minute, then whisk together until smooth.Transfer the mixture to a shallow baking dish and cover the surface with plastic wrap. Cool at room temperature until the ganache thickens to a frosting consistency.",
            "For the Chocolate Syrup In a medium saucepan, bring the sugar and 3/4 cup water to a simmer. Remove from the heat and, using a hand blender, puree in the chocolate until smooth. Set aside to cool.",
            "In a medium saucepan, bring the sugar and 3/4 cup water to a simmer. Remove from the heat and, using a hand blender, puree in the chocolate until smooth. Set aside to cool.",
            "For the Chocolate Genoise Cake Preheat the oven to 320°F. Grease the inside of a 3-quart stainless steel bowl with nonstick cooking spray and lightly coat with flour. Fill one-third of a medium saucepan with water and bring to a simmer. In the bowl of an electric mixer, whisk to combine the eggs, yolk, and sugar. Set the bowl over the pot of simmering water. Continue whisking until the temperature of the mixture reaches 140°F. Remove from the heat and place the bowl on the mixer fit with a whisk attachment. Whip at medium-high speed until it cools to room temperature and forms ribbons as it falls from the whisk, about 5 minutes. Sift the cocoa powder and the 1 1/2 cups flour together into a medium bowl. With a rubber spatula, fold the dry ingredients into the egg mixture in 3 additions, until no streaks remain. Fold in the milk and melted butter until just combined. Transfer the batter to the prepared 3-quart stainless steel bowl. Place the bowl on a baking sheet and transfer to the oven. Bake for 1 hour, and check the cake by inserting a cake tester into the center. Once the tester comes out clean, remove from the oven and immediately invert the cake onto a cooling rack. Once cooled, use a serrated knife to divide the cake into 3 even layers and set them on the rack. Brush each layer with about 2 tablespoons chocolate syrup per side to moisten. Frost the top of the 2 bottom layers with enough ganache to equal the thickness of the cake layers. Stack the layers back together and frost the outside of the cake with the remaining ganache.",
            "Preheat the oven to 320°F. Grease the inside of a 3-quart stainless steel bowl with nonstick cooking spray and lightly coat with flour.",
            "Fill one-third of a medium saucepan with water and bring to a simmer. In the bowl of an electric mixer, whisk to combine the eggs, yolk, and sugar. Set the bowl over the pot of simmering water. Continue whisking until the temperature of the mixture reaches 140°F. Remove from the heat and place the bowl on the mixer fit with a whisk attachment. Whip at medium-high speed until it cools to room temperature and forms ribbons as it falls from the whisk, about 5 minutes.",
            "Sift the cocoa powder and the 1 1/2 cups flour together into a medium bowl. With a rubber spatula, fold the dry ingredients into the egg mixture in 3 additions, until no streaks remain.",
            "Fold in the milk and melted butter until just combined. Transfer the batter to the prepared 3-quart stainless steel bowl.",
            "Place the bowl on a baking sheet and transfer to the oven. Bake for 1 hour, and check the cake by inserting a cake tester into the center. Once the tester comes out clean, remove from the oven and immediately invert the cake onto a cooling rack.",
            "Once cooled, use a serrated knife to divide the cake into 3 even layers and set them on the rack. Brush each layer with about 2 tablespoons chocolate syrup per side to moisten.",
            "Frost the top of the 2 bottom layers with enough ganache to equal the thickness of the cake layers. Stack the layers back together and frost the outside of the cake with the remaining ganache.",
            "For the Chocolate Ribbons Pour about 1/2 cup of chocolate onto a flat marble, glass, or stainless steel surface. Spread it into a 1-millimeter-thick rectangle, about 2 feet long by 6 inches wide. Allow the chocolate to set for 5 minutes, or until it is no longer liquid or shiny yet is still slightly soft. With a straight-edged stainless steel spatula held at a 45-degree angle, scrape the chocolate widthwise to form wavy ribbons. Transfer the ribbons to a tray and repeat the process until all the chocolate is used. Decorate the cake with the ribbons.",
            "Pour about 1/2 cup of chocolate onto a flat marble, glass, or stainless steel surface. Spread it into a 1-millimeter-thick rectangle, about 2 feet long by 6 inches wide. Allow the chocolate to set for 5 minutes, or until it is no longer liquid or shiny yet is still slightly soft. With a straight-edged stainless steel spatula held at a 45-degree angle, scrape the chocolate widthwise to form wavy ribbons. Transfer the ribbons to a tray and repeat the process until all the chocolate is used. Decorate the cake with the ribbons."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad4f9e19925f464b3b4653/6:4/w_274%2Ch_169/51199030_cocoa-dark-chocolate-bombe_1x1.jpg"
    }
}