{
    "recipe": {
        "title": "Coco Lopez Coconut Cake ",
        "ingredients": [
            "1/2 pound (2 sticks) unsalted butter, plus more for greasing the pan",
            "2 cups sugar",
            "2 teaspoons pure vanilla extract",
            "4 large eggs",
            "3 cups all-purpose flour",
            "2 teaspoons baking powder",
            "1/4 teaspoon fine sea salt",
            "1 1/2 cups whole milk",
            "1/2 cup Coco Lopez cream of coconut",
            "2 teaspoons coconut extract",
            "1 cup unsweetened shredded coconut"
        ],
        "instructions": [
            "Have all your ingredients at room temperature. Preheat the oven to 350°F. Butter the pan of your choice or line the pan with wax paper or parchment and butter the paper.",
            "With a hand mixer or a stand mixer fitted with the paddle attachment, whip the butter for 1 minute on high speed, then scrape down the sides of the bowl with a spatula.",
            "Add the sugar to the butter and beat on high speed for 2 minutes. Scrape down the sides of the bowl again.",
            "With the mixer on medium-low speed, add the vanilla; then add the eggs one at a time. Scrape down the sides of the bowl midway through.",
            "Combine the flour, baking powder, and sea salt in a separate bowl. In another bowl, combine the milk, cream of coconut, and coconut extract.",
            "With the mixer on low speed, add half the flour mixture. When it’s mostly incorporated, add half the milk mixture. Add the remainder of the dry and wet ingredients, scraping down the sides of the bowl between additions. Stop mixing as soon as you have a smooth batter. Stir in the shredded coconut.",
            "Pour the batter into the prepared pan and bake until the middle of the cake feels springy when you gently press your finger against it. All ovens are different, so it’s important to do the fingerprint test to see if the cake is done.",
            "Let the cake cool completely before icing."
        ],
        "picture_link": null
    }
}