{
    "recipe": {
        "title": "Coconut Tarts ",
        "ingredients": [
            "2 cups all-purpose flour",
            "1/8 teaspoon baking powder",
            "1/8 teaspoon salt",
            "1/2 cup butter, chilled and cubed",
            "1/2 cup vegetable shortening",
            "2/3 cup cold water",
            "2 1/4 cups grated fresh coconut (about 1 medium coconut)",
            "3/4 cup sugar",
            "1/2 teaspoon mixed essence (see Tip, below)",
            "1 egg yolk",
            "2 teaspoons milk"
        ],
        "instructions": [
            "Combine the flour, baking powder, and salt in bowl of food processor. Add the butter and shortening, and pulse until crumbs the size of peas form. Slowly add 1 cup cold water until the dough just comes together. Wrap in plastic wrap and chill for at least 1 hour. In the meantime, combine the coconut, sugar, mixed essence, and 1 cup of water in a saucepan, and simmer the mixture until the sugar melts and liquid thickens to the consistency of maple syrup, about 30 minutes. Cool. To make the tarts: Preheat the oven to 350°F degrees. Dust the chilled dough with flour and divide into 15 balls. Flatten the balls and then roll out to 1/8 inch thick, dusting with flour as necessary to prevent sticking. Place 1 tablespoon of filling on the center of a disk. Lightly brush the edges of the disk with water and fold the dough over the filling to create a half-moon. Crimp the edges closed, using a fork. Repeat with the rest of the dough. Beat the egg yolk and milk together, and brush over the tarts. Prick each tart once or twice so that steam can escape. Bake on a parchment-lined baking sheet for 20 to 25 minutes, or until the tarts are golden brown. Cool and serve.",
            "Combine the flour, baking powder, and salt in bowl of food processor. Add the butter and shortening, and pulse until crumbs the size of peas form. Slowly add 1 cup cold water until the dough just comes together. Wrap in plastic wrap and chill for at least 1 hour.",
            "In the meantime, combine the coconut, sugar, mixed essence, and 1 cup of water in a saucepan, and simmer the mixture until the sugar melts and liquid thickens to the consistency of maple syrup, about 30 minutes. Cool.",
            "To make the tarts: Preheat the oven to 350°F degrees. Dust the chilled dough with flour and divide into 15 balls. Flatten the balls and then roll out to 1/8 inch thick, dusting with flour as necessary to prevent sticking.",
            "Place 1 tablespoon of filling on the center of a disk. Lightly brush the edges of the disk with water and fold the dough over the filling to create a half-moon. Crimp the edges closed, using a fork. Repeat with the rest of the dough.",
            "Beat the egg yolk and milk together, and brush over the tarts. Prick each tart once or twice so that steam can escape. Bake on a parchment-lined baking sheet for 20 to 25 minutes, or until the tarts are golden brown. Cool and serve."
        ],
        "picture_link": null
    }
}