{
    "recipe": {
        "title": "Coconut-Strawberry Ice Cream Pie ",
        "ingredients": [
            "1 cup unsweetened shredded coconut",
            "6 oz. graham crackers",
            "1/2 cup virgin coconut oil",
            "3/4 tsp. kosher salt",
            "Nonstick vegetable oil spray",
            "2 pints coconut ice cream or gelato (not dairy-free)",
            "2 pints strawberry ice cream or gelato",
            "6 oz. strawberries, hulled, halved, quartered if large",
            "1 Tbsp. fresh lemon juice",
            "1 Tbsp. sugar"
        ],
        "instructions": [
            "Place a rack in middle of oven; preheat to 350°F. Toast coconut on a rimmed baking sheet until golden brown, 3–5 minutes. Let cool 5 minutes.",
            "Place graham crackers in a large resealable plastic bag, seal, and crush to fine crumbs with a rolling pin or heavy pot. Transfer to a medium bowl. Add toasted coconut, coconut oil, and salt and mix well. Mixture will look quite crumbly and dry at this point, but it will come together as it chills.",
            "Lightly coat a 9\" pie dish with nonstick spray. Transfer graham cracker mixture to pie dish and press evenly and very firmly across bottom and up sides of dish with a flat-bottomed measuring cup (make sure crust extends all the way up to the lip of the dish). Chill until ready to fill (at least 20 minutes).",
            "Filling and assembly: While the crust is chilling, remove coconut ice cream from containers (just peel away container if it’s paper, or use a rubber spatula to help slide ice cream out intact if container is plastic). Cut ice cream into 2\" pieces and place in a medium bowl. Repeat with strawberry ice cream, placing in a separate medium bowl. Let sit until slightly softened, about 5 minutes, then stir each, separately, with a large rubber spatula or wooden spoon until the consistency of thick cake batter. Transfer bowls to freezer and chill ice cream 10 minutes. Remove ice cream from freezer. Scrape strawberry ice cream into bowl with coconut ice cream. Fold together a couple of times with spatula until swirled. Don’t overmix; you want thick marbled ribbons. Chill in freezer 10 minutes. Scrape marbled ice cream into crust. Using a large spoon, create deep decorative swirls in ice cream (the strawberries will be poured into these divots later). Freeze until ice cream is very firm, at least 6 hours. Toss strawberries, lemon juice, and sugar in a medium bowl. Let sit at least 35 minutes and up to 1 hour. Remove pie from freezer and lower the bottom of the pie dish into a shallow bowl of warm water; hold it there 5 minutes (this will help slices release more easily). Spoon strawberries into divots; if you run out of places to contain them, reserve extras for serving. Running the blade of a chef’s knife under hot water and wiping dry before first cut and repeating as needed between cuts (this will give you neat sides), slice pie into wedges. Serve with any remaining strawberries alongside.",
            "While the crust is chilling, remove coconut ice cream from containers (just peel away container if it’s paper, or use a rubber spatula to help slide ice cream out intact if container is plastic). Cut ice cream into 2\" pieces and place in a medium bowl. Repeat with strawberry ice cream, placing in a separate medium bowl. Let sit until slightly softened, about 5 minutes, then stir each, separately, with a large rubber spatula or wooden spoon until the consistency of thick cake batter. Transfer bowls to freezer and chill ice cream 10 minutes.",
            "Remove ice cream from freezer. Scrape strawberry ice cream into bowl with coconut ice cream. Fold together a couple of times with spatula until swirled. Don’t overmix; you want thick marbled ribbons. Chill in freezer 10 minutes.",
            "Scrape marbled ice cream into crust. Using a large spoon, create deep decorative swirls in ice cream (the strawberries will be poured into these divots later). Freeze until ice cream is very firm, at least 6 hours.",
            "Toss strawberries, lemon juice, and sugar in a medium bowl. Let sit at least 35 minutes and up to 1 hour.",
            "Remove pie from freezer and lower the bottom of the pie dish into a shallow bowl of warm water; hold it there 5 minutes (this will help slices release more easily). Spoon strawberries into divots; if you run out of places to contain them, reserve extras for serving.",
            "Running the blade of a chef’s knife under hot water and wiping dry before first cut and repeating as needed between cuts (this will give you neat sides), slice pie into wedges. Serve with any remaining strawberries alongside.",
            "Do Ahead Pie (without berries) can be made 1 week ahead. Cover with plastic wrap once hardened and keep frozen.",
            "Pie (without berries) can be made 1 week ahead. Cover with plastic wrap once hardened and keep frozen."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b61e36974c6260cdf9edd9e/6:4/w_274%2Ch_169/coconut-strawberry-ice-cream-pie-recipe-BA-080118.jpg",
        "color": 4633864
    }
}