{
    "recipe": {
        "title": "Coconut Sheet Cake with Hibiscus Sauce ",
        "ingredients": [
            "2 cups water",
            "1 cup dried hibiscus flowers (about 1 1/2 ounces)",
            "1/2 cup sugar",
            "1 teaspoon finely grated lemon peel",
            "1 teaspoon finely grated lime peel",
            "1 teaspoon finely grated orange peel",
            "1 3/4 cups cake flour",
            "1 1/2 teaspoons baking powder",
            "1/2 teaspoon salt",
            "2/3 cup buttermilk",
            "4 large egg whites",
            "1/4 teaspoon coconut extract",
            "1 1/3 cups sugar",
            "10 tablespoons (1 1/4 sticks) unsalted butter, room temperature",
            "1 1/2 cups chilled heavy whipping cream",
            "4 tablespoons sweetened cream of coconut (such as Coco López), divided",
            "1 cup sweetened flaked coconut, lightly toasted",
            "Ingredient info: Dried hibiscus flowers, also called jamaica flowers, are available at some natural foods stores and at Latin markets. Look for sweetened cream of coconut in the liquor section of most supermarkets.",
            "Test-kitchen tip: When you're reducing the hibiscus sauce, spoon a bit of the hot sauce on a chilled plate to see how thick it will be when it is refrigerated."
        ],
        "instructions": [
            "For sauce: Bring 2 cups water to boil in small saucepan. Stir in hibiscus flowers. Remove from heat; let steep uncovered 10 minutes. Pour hibiscus mixture through fine-mesh sieve set over bowl, pressing on solids to extract all liquid; discard solids. Return hibiscus liquid to same saucepan. Add sugar; bring to boil, stirring until sugar dissolves. Boil gently over medium heat until liquid is reduced to 1 cup, 10 to 12 minutes. Remove from heat. Stir in lemon peel, lime peel, and orange peel; steep 10 minutes. Strain sauce into bowl. Cover; chill until cold, at least 2 hours. DO AHEAD: Can be made 3 days ahead. Keep chilled.",
            "Bring 2 cups water to boil in small saucepan. Stir in hibiscus flowers. Remove from heat; let steep uncovered 10 minutes.",
            "Pour hibiscus mixture through fine-mesh sieve set over bowl, pressing on solids to extract all liquid; discard solids. Return hibiscus liquid to same saucepan. Add sugar; bring to boil, stirring until sugar dissolves. Boil gently over medium heat until liquid is reduced to 1 cup, 10 to 12 minutes. Remove from heat. Stir in lemon peel, lime peel, and orange peel; steep 10 minutes. Strain sauce into bowl. Cover; chill until cold, at least 2 hours. DO AHEAD: Can be made 3 days ahead. Keep chilled.",
            "For cake: Preheat oven to 350°F. Butter 13 x 9 x 2-inch metal baking pan. Whisk flour, baking powder, and salt in medium bowl. Whisk buttermilk, egg whites, and coconut extract in another medium bowl. Using electric mixer, beat sugar and butter in large bowl until light and fluffy. Add flour mixture to butter mixture in 3 additions alternately with buttermilk mixture in 2 additions, beating to blend well between additions and occasionally scraping bottom and sides of bowl with rubber spatula. Transfer batter to pan; spread evenly. Bake cake until pale golden and tester inserted into center comes out with some crumbs attached, 29 to 32 minutes. Cool cake completely in pan on rack. DO AHEAD: Can be made 1 day ahead. Cover pan tightly and store cake at room temperature.",
            "Preheat oven to 350°F. Butter 13 x 9 x 2-inch metal baking pan. Whisk flour, baking powder, and salt in medium bowl. Whisk buttermilk, egg whites, and coconut extract in another medium bowl. Using electric mixer, beat sugar and butter in large bowl until light and fluffy. Add flour mixture to butter mixture in 3 additions alternately with buttermilk mixture in 2 additions, beating to blend well between additions and occasionally scraping bottom and sides of bowl with rubber spatula. Transfer batter to pan; spread evenly.",
            "Bake cake until pale golden and tester inserted into center comes out with some crumbs attached, 29 to 32 minutes. Cool cake completely in pan on rack. DO AHEAD: Can be made 1 day ahead. Cover pan tightly and store cake at room temperature.",
            "For topping: Using electric mixer, beat whipping cream and 2 tablespoons cream of coconut in large bowl until peaks form. Spread whipped cream over top of cake. Drizzle 2 tablespoons cream of coconut over whipped cream. Using table knife, swirl cream of coconut throughout whipped cream. Sprinkle toasted coconut over. Cut cake into squares; transfer to plates. Drizzle hibiscus sauce around cake.",
            "Using electric mixer, beat whipping cream and 2 tablespoons cream of coconut in large bowl until peaks form. Spread whipped cream over top of cake. Drizzle 2 tablespoons cream of coconut over whipped cream. Using table knife, swirl cream of coconut throughout whipped cream. Sprinkle toasted coconut over.",
            "Cut cake into squares; transfer to plates. Drizzle hibiscus sauce around cake."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b306da11c5d6af478b824f/6:4/w_274%2Ch_169/359794_coconut-sheet-cake_1x1.jpg"
    }
}