{
    "recipe": {
        "title": "Cod With Afghan Spices ",
        "ingredients": [
            "4 fresh cod steaks (each 1\" thick and 8 ounces) or 4 cod fillets (each 6 ounces)",
            "1 small onion, chopped",
            "3 garlic cloves, chopped",
            "1 piece (1\") fresh ginger, peeled, chopped",
            "1 to 2 serrano chiles or jalapenños, seeded, chopped (leave the seeds in for more heat)",
            "3 tablespoons fresh lemon juice",
            "6 tablespoons vegetable oil, divided",
            "1 teaspoon ground coriander",
            "Coarse salt (kosher or sea)",
            "Freshly ground black pepper",
            "1/2 teaspoon crushed red pepper flakes",
            "Lemon wedges, for serving"
        ],
        "instructions": [
            "Rinse cod under cold water, pat dry with paper towels; place in a nonreactive baking dish. Make marinade: Combine onion, garlic, ginger, chiles, lemon juice, 3 tablespoons oil, coriander, 1 1/2 teaspoons salt, and 1/2 teaspoon pepper in a blender. Add 2 tablespoons water and purée until smooth, adding more water as necessary to thin. Pour marinade over cod, turning fish once or twice to coat it evenly. Refrigerate, covered, for at least 2 hours and up to 8, turning once or twice to marinate evenly. Make basting mixture: Mix together red pepper flakes, 1/2 teaspoon each of salt and pepper, and remaining 3 tablespoons oil in a small bowl. Prepare grill for direct cooking on high heat. Brush and oil grill grate. Drain marinade from cod; discard marinade. Generously brush each piece of fish on both sides with basting mixture. If using a fish basket, spray or brush it with oil and fasten marinated cod inside. Place fish or fish basket on the hot grate, and grill until cod is cooked through, 4-6 minutes per side. If grilling fillets directly on the grate, arrange them on a diagonal to the bars, then rotate them a quarter-turn after 2 minutes on each side to create crosshatch grill marks. Turn cod over when the bottom is golden brown. To test for doneness, press fish with your fingers; it should break into clean flakes. Brush the fish with any remaining basting mixture as it cooks. Serve with lemon wedges.",
            "Rinse cod under cold water, pat dry with paper towels; place in a nonreactive baking dish.",
            "Make marinade: Combine onion, garlic, ginger, chiles, lemon juice, 3 tablespoons oil, coriander, 1 1/2 teaspoons salt, and 1/2 teaspoon pepper in a blender. Add 2 tablespoons water and purée until smooth, adding more water as necessary to thin. Pour marinade over cod, turning fish once or twice to coat it evenly. Refrigerate, covered, for at least 2 hours and up to 8, turning once or twice to marinate evenly.",
            "Make basting mixture: Mix together red pepper flakes, 1/2 teaspoon each of salt and pepper, and remaining 3 tablespoons oil in a small bowl.",
            "Prepare grill for direct cooking on high heat.",
            "Brush and oil grill grate. Drain marinade from cod; discard marinade. Generously brush each piece of fish on both sides with basting mixture. If using a fish basket, spray or brush it with oil and fasten marinated cod inside. Place fish or fish basket on the hot grate, and grill until cod is cooked through, 4-6 minutes per side.",
            "If grilling fillets directly on the grate, arrange them on a diagonal to the bars, then rotate them a quarter-turn after 2 minutes on each side to create crosshatch grill marks. Turn cod over when the bottom is golden brown. To test for doneness, press fish with your fingers; it should break into clean flakes. Brush the fish with any remaining basting mixture as it cooks. Serve with lemon wedges."
        ],
        "picture_link": null
    }
}