{
    "recipe": {
        "title": "Coeur à la Crème ",
        "ingredients": [
            "4 (10x10-inch) squares cheesecloth",
            "1 (8-ounce) package cream cheese, room temperature",
            "1 cup crème fraîche or sour cream",
            "6 tablespoons powdered sugar, divided",
            "1 teaspoon fresh lemon juice",
            "1/2 teaspoon vanilla extract",
            "Pinch of salt",
            "1 pound small strawberries, hulled, quartered (about 1 2/3 cups)"
        ],
        "instructions": [
            "Rinse cheesecloth under water; squeeze until just damp. Line each of four 3- to 4-inch coeur à la crème molds with 1 square of cheesecloth. Using electric mixer, beat cream cheese, crème fraîche, 4 tablespoons powdered sugar, lemon juice, vanilla, and salt in large bowl until smooth, about 4 minutes. Press through fine strainer; divide among molds. Fold cheesecloth over. Place molds in shallow baking dish; cover with plastic wrap. Chill at least 4 hours and up to 1 day. Stir strawberries with 2 tablespoons powdered sugar; let stand 30 minutes. Unwrap molds; invert onto plates. Spoon strawberries around and serve.",
            "Rinse cheesecloth under water; squeeze until just damp. Line each of four 3- to 4-inch coeur à la crème molds with 1 square of cheesecloth. Using electric mixer, beat cream cheese, crème fraîche, 4 tablespoons powdered sugar, lemon juice, vanilla, and salt in large bowl until smooth, about 4 minutes. Press through fine strainer; divide among molds. Fold cheesecloth over. Place molds in shallow baking dish; cover with plastic wrap. Chill at least 4 hours and up to 1 day.",
            "Stir strawberries with 2 tablespoons powdered sugar; let stand 30 minutes. Unwrap molds; invert onto plates. Spoon strawberries around and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d99b7f3a00aeb2f1cf63e/6:4/w_274%2Ch_169/238538.jpg"
    }
}