{
    "recipe": {
        "title": "Coffee Malteds ",
        "ingredients": [
            "1 1/2 cups all-purpose flour",
            "1/4 cup unflavored malted milk powder",
            "1/2 teaspoon baking powder",
            "8 tablespoons unsalted butter, cut into chunks, at room temperature",
            "1/2 cup sugar",
            "1/4 cup packed light brown sugar",
            "1 tablespoon ground coffee, preferably from espresso beans (or use instant or powdered coffee or espresso)",
            "1/2 teaspoon fine sea salt",
            "1 large egg, at room temperature",
            "1 large egg yolk, at room temperature",
            "1 teaspoon pure vanilla extract"
        ],
        "instructions": [
            "Position the racks to divide the oven into thirds and preheat it to 350°F. Line two baking sheets with parchment paper or silicone baking mats. Whisk the flour, malt powder, and baking powder together. Working with a stand mixer fitted with the paddle attachment, or in a bowl with a hand mixer, beat the butter, both sugars, espresso, and salt together on medium speed until well blended, about 3 minutes. Scrape down the bowl, return to medium speed and, one by one, beat in the egg, yolk, and vanilla, beating for 1 minute after each goes in. Turn off the mixer, add the dry ingredients all at once and pulse, just to begin incorporating the flour and malt powder. When the risk of flying flour is passed, mix on low speed only until the dry ingredients disappear into the dough. You'll have a rather crumbly dough, but that's fine. Give the dough a few last turns with a sturdy flexible spatula and then reach in, knead if necessary and gather the dough into a ball. Using a small cookie scoop, scoop out level portions of dough, or use a teaspoon to get rounded spoonfuls. Roll the dough into balls and place them an inch apart on the lined baking sheets. Bake the cookies for 14 minutes, rotating the baking sheets top to bottom and front to back after 8 minutes. The cookies will be soft and golden only around the edges; they won't look done, and they're not—they'll firm as they cool. Transfer the sheets to racks and then, after about 10 minutes, carefully lift the cookies onto the racks to cool completely.",
            "Position the racks to divide the oven into thirds and preheat it to 350°F. Line two baking sheets with parchment paper or silicone baking mats.",
            "Whisk the flour, malt powder, and baking powder together.",
            "Working with a stand mixer fitted with the paddle attachment, or in a bowl with a hand mixer, beat the butter, both sugars, espresso, and salt together on medium speed until well blended, about 3 minutes. Scrape down the bowl, return to medium speed and, one by one, beat in the egg, yolk, and vanilla, beating for 1 minute after each goes in. Turn off the mixer, add the dry ingredients all at once and pulse, just to begin incorporating the flour and malt powder. When the risk of flying flour is passed, mix on low speed only until the dry ingredients disappear into the dough. You'll have a rather crumbly dough, but that's fine. Give the dough a few last turns with a sturdy flexible spatula and then reach in, knead if necessary and gather the dough into a ball.",
            "Using a small cookie scoop, scoop out level portions of dough, or use a teaspoon to get rounded spoonfuls. Roll the dough into balls and place them an inch apart on the lined baking sheets.",
            "Bake the cookies for 14 minutes, rotating the baking sheets top to bottom and front to back after 8 minutes. The cookies will be soft and golden only around the edges; they won't look done, and they're not—they'll firm as they cool. Transfer the sheets to racks and then, after about 10 minutes, carefully lift the cookies onto the racks to cool completely.",
            "Do Ahead Packed in a tightly covered container, the cookies will keep for up to 3 days (after that, they get firmer and are perfect for dunking...in coffee, of course). Wrapped airtight, they can be frozen for up to 2 months.",
            "Packed in a tightly covered container, the cookies will keep for up to 3 days (after that, they get firmer and are perfect for dunking...in coffee, of course). Wrapped airtight, they can be frozen for up to 2 months."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58caf80f4dd825764b291e28/6:4/w_274%2Ch_169/Coffee-Malteds_16032017.jpg"
    }
}