{
    "recipe": {
        "title": "Coffee Baked Alaska with Mocha Sauce ",
        "ingredients": [
            "1 quart coffee ice cream, softened",
            "1 10.75-ounce frozen pound cake",
            "4 large egg whites",
            "1/4 teaspoon cream of tartar",
            "1 teaspoon coffee liqueur",
            "1/3 cup sugar",
            "1 1/2 cups freshly brewed strong coffee",
            "10 ounces semisweet chocolate, chopped",
            "2 tablespoons coffee liqueur"
        ],
        "instructions": [
            "Line 9x5x2 1/2-inch metal loaf pan with plastic wrap, leaving overhang. Spoon ice cream into prepared pan, spreading evenly and smoothing top. Cut cake horizontally in half. Arrange 1 cake piece, cut side down, atop ice cream and against 1 corner of pan. Cut remaining cake piece into strips and arrange in pan to cover ice cream completely. Cover with overhanging plastic and freeze until firm, at least 4 hours.",
            "Uncover cake. Invert onto metal or other ovenproof platter. Freeze while preparing meringue. Beat egg whites in large bowl until foamy. Add cream of tartar. Beat until soft peaks form. Beat in liqueur. Gradually add sugar, beating until stiff glossy peaks form. Spread meringue over cake, covering cake completely and sealing meringue to platter. Freeze overnight.",
            "For sauce: Combine coffee and semisweet chocolate in heavy small saucepan. Stir over medium-low heat until mixture is smooth. Increase heat to medium. Simmer until sauce thickens, about 2 minutes. Cool slightly. Stir in coffee liqueur. (Can be prepared 3 days ahead. Keep cake frozen. Cover sauce and refrigerate; rewarm sauce over medium-low heat before serving.) Position rack in center of oven and preheat to 500°F for 20 minutes. Bake dessert until meringue is lightly browned and just set, about 3 minutes. Cut baked Alaska into slices; arrange on plates. Spoon warm sauce around dessert and serve.",
            "Combine coffee and semisweet chocolate in heavy small saucepan. Stir over medium-low heat until mixture is smooth. Increase heat to medium. Simmer until sauce thickens, about 2 minutes. Cool slightly. Stir in coffee liqueur. (Can be prepared 3 days ahead. Keep cake frozen. Cover sauce and refrigerate; rewarm sauce over medium-low heat before serving.)",
            "Position rack in center of oven and preheat to 500°F for 20 minutes. Bake dessert until meringue is lightly browned and just set, about 3 minutes.",
            "Cut baked Alaska into slices; arrange on plates. Spoon warm sauce around dessert and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5612e60cf35fab51707e7e9e/6:4/w_274%2Ch_169/102139.jpg"
    }
}