{
    "recipe": {
        "title": "Cold-Brew Iced Coffee Concentrate ",
        "ingredients": [
            "12 ounces coarsely ground fresh coffee beans",
            "Milk (optional)",
            "Cheesecloth"
        ],
        "instructions": [
            "Place ground coffee in a large container. Gradually add 7 cups cold water. Stir gently to be sure all grounds are moistened. Cover with a layer of cheesecloth. Let stand at room temperature for 15 hours. Remove cheesecloth and use it to line a fine-mesh sieve set over a large pitcher. Pour coffee through sieve into pitcher (do not stir); rinse jar and set aside. Discard cheesecloth with solids. Line same sieve with a large coffee filter and set over reserved jar. Strain coffee through sieve into jar. (It may take up to 45 minutes for all of the coffee to drip through; do not stir or coffee may become cloudy.) Cover and chill. DO AHEAD: Coffee concentrate can be made 2 weeks ahead. Keep chilled. Fill a glass with ice. Dilute 1 part coffee concentrate with 1 part milk, if desired, or water.",
            "Place ground coffee in a large container. Gradually add 7 cups cold water. Stir gently to be sure all grounds are moistened. Cover with a layer of cheesecloth. Let stand at room temperature for 15 hours.",
            "Remove cheesecloth and use it to line a fine-mesh sieve set over a large pitcher. Pour coffee through sieve into pitcher (do not stir); rinse jar and set aside. Discard cheesecloth with solids.",
            "Line same sieve with a large coffee filter and set over reserved jar. Strain coffee through sieve into jar. (It may take up to 45 minutes for all of the coffee to drip through; do not stir or coffee may become cloudy.) Cover and chill. DO AHEAD: Coffee concentrate can be made 2 weeks ahead. Keep chilled.",
            "Fill a glass with ice. Dilute 1 part coffee concentrate with 1 part milk, if desired, or water."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b0a21ec6a78d1a4a608aa5/6:4/w_274%2Ch_169/51104260_iced-coffee_1x1.jpg"
    }
}