{
    "recipe": {
        "title": "Cold Roast Salmon with Smashed Green Bean Salad ",
        "ingredients": [
            "1 (3 1/2–3 3/4-lb.) whole side of salmon",
            "7 Tbsp. extra-virgin olive oil, divided, plus more for serving",
            "4 tsp. kosher salt, divided, plus more",
            "1/2 tsp. crushed red pepper flakes, divided",
            "1/4 cup fresh lemon juice",
            "2 lb. green beans, trimmed",
            "1 bunch radishes, preferably French breakfast, trimmed",
            "1 cup coarsely chopped salted, roasted pistachios",
            "Freshly ground black pepper",
            "Flaky sea salt",
            "Lemon wedges (for serving)",
            "Lemony Yogurt Sauce and/or Grilled Serrano Salsa Verde (for serving)"
        ],
        "instructions": [
            "Preheat oven to 300°F. Place salmon on a rimmed baking sheet and rub 2 Tbsp. oil over each side. Season all over with black pepper, 2 tsp. kosher salt, and 1/4 tsp. red pepper flakes. Arrange skin side down and roast until a tester, metal skewer, or thin-bladed knife inserted laterally through salmon flesh meets no resistance, 20–25 minutes. (Fish should be opaque throughout and just able to flake.) Let cool.",
            "While salmon is roasting, make the salad. Whisk lemon juice, 3 Tbsp. oil, 2 tsp. kosher salt, and remaining 1/4 tsp. red pepper flakes in a large bowl to combine. Set dressing aside.",
            "Working in batches, place green beans in a large resealable plastic bag. Seal bag and whack beans with a rolling pin to split the skins and soften the insides without completely pulverizing the flesh. Place in bowl with reserved dressing. Toss, massaging with your hands to break beans down further and coat. Let sit at room temperature at least 1 hour.",
            "Thinly slice radishes lengthwise. Place in a large bowl of ice water, cover, and chill until ready to serve (this will allow you to get the prep out of the way and keep the radishes crisp and firm).",
            "Just before serving, drain radishes and toss with marinated green beans. Add pistachios; taste salad and season with pepper if needed. Transfer to a platter and drizzle with oil and sprinkle with sea salt.",
            "Using 2 spatulas, carefully transfer salmon to another platter, leaving skin behind on baking sheet. Drizzle with oil and squeeze juice from a lemon wedge or two over; sprinkle with sea salt. Serve with more lemon wedges and Lemony Yogurt Sauce and/or Grilled Serrano Salsa Verde alongside.",
            "Do Ahead Salmon can be roasted and green beans can be marinated 1 day ahead; cover and chill separately. About 45 minutes before serving, remove green beans from the fridge and let sit at room temperature to warm up a bit. Radishes can be sliced 1 day ahead; keep chilled.",
            "Salmon can be roasted and green beans can be marinated 1 day ahead; cover and chill separately. About 45 minutes before serving, remove green beans from the fridge and let sit at room temperature to warm up a bit. Radishes can be sliced 1 day ahead; keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b61e374f769c40c0ee16120/6:4/w_274%2Ch_169/cold-roast-salmon-with-smashed-green-bean-salad-recipe-BA-080118.jpg",
        "color": 1145484
    }
}