{
    "recipe": {
        "title": "\"Cold-Fry\" Frites ",
        "ingredients": [
            "2 pounds (1 kg/about 4 large) russet potatoes",
            "2 1/2 quarts (2.5 l) vegetable oil, such as sunflower oil, at room temperature",
            "Fine sea salt",
            "A French-fry cutter (optional); 2 thick, clean kitchen towels; a 4- to 9-quart (4 to 9 l) heavy-duty saucepan or cast-iron pot; a kitchen timer; a wire skimmer or slotted metal spoon; 2 trays lined with paper towels; a warmed platter."
        ],
        "instructions": [
            "Rinse the potatoes, peel them, rinse again, and cut lengthwise into 3/8-inch (10 mm) fries. (Precision is not essential here: I love the tiny, crunchy, almost-burned bits that emerge from the fryer.)",
            "Soak the potatoes in a bowl of cold water for about 5 minutes, changing the water when it becomes cloudy (at least twice), until the water remains clear. (Soaking releases the starch in potatoes, making them less rigid and less likely to stick together while cooking.)",
            "Drain the potatoes and wrap them in the kitchen towels to dry. (Removing the excess liquid will speed up the cooking time and reduce the likelihood of the potatoes splattering once the oil is hot.)",
            "Transfer the potatoes to the saucepan and set it over the stove. Pour the oil over the potatoes. Do not cover the pot. Set the heat to high, stirring the potatoes gently with a metal spoon to distribute and prevent sticking. (A metal spoon lets you feel if any potato bits are stuck to the bottom of the pan and scrape them up.)",
            "The oil should move from a peppy simmer to a boil in about 9 minutes. When the oil starts to boil, set a timer for 17 minutes. Stir the potatoes very gently every 3 to 4 minutes to prevent sticking and ensure even cooking. Don’t worry about overboiling—the oil should boil rapidly and evenly with no need to adjust the heat throughout the entire process.",
            "When the timer rings, the potatoes should have begun to take on color, turning from white to slightly golden, but will still have about 4 minutes remaining until they are fully cooked. For these last few minutes, watch them closely, stirring gently. When the fries are a deep golden brown, taste one to make sure they are truly crisp and firm on the outside with a creamy interior. They should not be the least bit soggy, so resist the urge to remove them from the oil too soon. When you are happy with the consistency, carefully transfer the rest of the fries with the wire skimmer or slotted spoon to the paper-towel-lined trays to drain. Season with salt and serve immediately on the warmed platter.",
            "Tips Use firm, fresh potatoes. Rinse and soak them well to rid them of starch. The less starch in the potatoes, the crispier the fries will be. To keep the oil well contained in the pot, make sure there is at least 2 inches (5 cm) of room from the top of the oil to the rim of the pot. We have made these fries in varied quantities with proportionate quantities of oil and pot size: 1 pound (500 g) potatoes/1 1/2 quarts (1.5 l) oil/4-quart (4 l) pot 2 pounds (1 kg) potatoes/2 1/2 quarts (2.5 l) oil/5- to 7-quart (5 to 7 l) pot 3 pounds (1.5 kg) potatoes/3 quarts (3 l) oil/7-quart (7 l) pot 4 pounds (2 kg) potatoes/4 quarts (4 l) oil/8- to 9-quart (8 to 9 l) pot Do not use an aluminum pot; it will not hold the heat in the same manner as a heavy cast-iron or stainless steel pot, and the results may not be satisfactory. After frying, let the oil cool and strain it through cheesecloth into the original containers. Store in the refrigerator and reuse up to five times. Mark the bottles as to number of uses and sniff the oil before reusing; if there is any scent of rancidity, toss. Each time the oil is reused, add about 1 cup (250 ml) fresh, new oil to the mix.",
            "Use firm, fresh potatoes. Rinse and soak them well to rid them of starch. The less starch in the potatoes, the crispier the fries will be.",
            "To keep the oil well contained in the pot, make sure there is at least 2 inches (5 cm) of room from the top of the oil to the rim of the pot.",
            "We have made these fries in varied quantities with proportionate quantities of oil and pot size: 1 pound (500 g) potatoes/1 1/2 quarts (1.5 l) oil/4-quart (4 l) pot 2 pounds (1 kg) potatoes/2 1/2 quarts (2.5 l) oil/5- to 7-quart (5 to 7 l) pot 3 pounds (1.5 kg) potatoes/3 quarts (3 l) oil/7-quart (7 l) pot 4 pounds (2 kg) potatoes/4 quarts (4 l) oil/8- to 9-quart (8 to 9 l) pot",
            "Do not use an aluminum pot; it will not hold the heat in the same manner as a heavy cast-iron or stainless steel pot, and the results may not be satisfactory.",
            "After frying, let the oil cool and strain it through cheesecloth into the original containers. Store in the refrigerator and reuse up to five times. Mark the bottles as to number of uses and sniff the oil before reusing; if there is any scent of rancidity, toss. Each time the oil is reused, add about 1 cup (250 ml) fresh, new oil to the mix."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58bdb1606ff8ed57f965330e/6:4/w_274%2Ch_169/cold-fry-frites-patricia-wells-030617.jpg"
    }
}