{
    "recipe": {
        "title": "Collard Green Salad with Cashews and Lime ",
        "ingredients": [
            "1 cup unsalted, roasted cashews, divided",
            "4 tablespoons finely grated Pecorino, divided, plus shaved for serving",
            "Kosher salt, freshly ground black pepper",
            "1 anchovy fillet packed in oil, drained, finely chopped",
            "1/4 cup olive oil",
            "2 tablespoons fresh lime juice",
            "1 teaspoon pink peppercorns, crushed, plus more for serving",
            "1/2 bunch collard greens, ribs and stems removed, leaves coarsely torn"
        ],
        "instructions": [
            "Process 1/2 cup cashews, 2 tablespoons grated Pecorino, and 3 tablespoons water in a food processor, thinning with more water as needed, until a smooth, creamy paste forms; season with salt and black pepper. Set cashew paste aside. Whisk anchovy, oil, lime juice, 1 teaspoon pink peppercorns, and 2 tablespoons grated Pecorino in a large bowl; season with salt and black pepper. Coarsely chop remaining 1/2 cup cashews. Add nuts and collard greens to large bowl and toss to coat, gently massaging dressing into leaves with your fingers to bruise and slightly wilt. Spread some reserved cashew paste onto each plate and top with salad and shaved Pecorino; sprinkle with more crushed pink peppercorns.",
            "Process 1/2 cup cashews, 2 tablespoons grated Pecorino, and 3 tablespoons water in a food processor, thinning with more water as needed, until a smooth, creamy paste forms; season with salt and black pepper. Set cashew paste aside.",
            "Whisk anchovy, oil, lime juice, 1 teaspoon pink peppercorns, and 2 tablespoons grated Pecorino in a large bowl; season with salt and black pepper. Coarsely chop remaining 1/2 cup cashews. Add nuts and collard greens to large bowl and toss to coat, gently massaging dressing into leaves with your fingers to bruise and slightly wilt.",
            "Spread some reserved cashew paste onto each plate and top with salad and shaved Pecorino; sprinkle with more crushed pink peppercorns."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54acbfb86529d92b2c03f3f5/6:4/w_274%2Ch_169/51210450_collard-green-salad_1x1.jpg"
    }
}