{
    "recipe": {
        "title": "Collard Green Wraps with Curried Tofu ",
        "ingredients": [
            "5 scallions",
            "4 garlic cloves, finely grated",
            "1 (2\") piece ginger, peeled, finely grated",
            "1 Tbsp. virgin coconut oil or vegetable oil",
            "2 Tbsp. Thai red curry paste",
            "1 (14-oz.) package firm tofu, drained, broken into 1\" pieces",
            "1 cup unsweetened coconut milk",
            "Kosher salt",
            "1 Tbsp. fresh lime juice",
            "1 Fresno chile, thinly sliced (optional)",
            "1 bunch collard greens, leaves halved lengthwise, ribs and stems removed, covered, chilled",
            "1/2 cup cilantro leaves with tender stems",
            "1/2 cup Dang Original coconut chips or toasted unsweetened coconut flakes",
            "Lime wedges (for serving)"
        ],
        "instructions": [
            "Remove dark green tops from scallions and thinly slice on a diagonal. Place in a small bowl, cover with a damp paper towel, and chill until ready to serve. Thinly slice remaining white and pale green parts crosswise and place in another small bowl; add garlic and ginger. (Have scallion mixture, curry paste, tofu, and coconut milk near the stove and at the ready so you can work quickly.)",
            "Heat oil in a large skillet over medium-high. Cook scallion mixture, stirring, until just beginning to brown, about 1 minute. Add curry paste and cook, stirring, until it begins to stick to pan, about 1 minute. Add tofu and coconut milk, season with salt, and bring to a simmer. Reduce heat to medium-low and simmer gently until sauce is almost completely evaporated and you can see the bottom of skillet, 5–7 minutes. Stir in lime juice.",
            "Transfer tofu mixture to a platter and top with chile, if using. Arrange collard greens, cilantro, and reserved scallion tops on platter so that each component is visible and easily accessible. Place coconut chips in a small bowl and arrange lime wedges on a small plate."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b61e370f769c40c0ee1611e/6:4/w_274%2Ch_169/collard-green-wraps-with-curried-tofu-recipe-BA-080118.jpg",
        "color": 10847873
    }
}