{
    "recipe": {
        "title": "Combo Reuben ",
        "ingredients": [
            "1 recipe Junior's Russian Dressing",
            "1/4 cup (1/2 stick) unsalted butter",
            "2 slices rye bread",
            "Four 1-ounce slices Swiss cheese",
            "3 ounces very thinly sliced lean corned beef (about 10 slices)",
            "3 ounces very thinly sliced lean pastrami (about 10 slices)",
            "1/2 cup drained fresh sauerkraut"
        ],
        "instructions": [
            "Make the Russian Dressing and refrigerate until needed. Butter one side of both slices of bread. Melt the rest of the butter on a griddle or in a large skillet over medium heat. Place both slices of bread, buttered side down, on the hot griddle. Top each with 2 slices of cheese. Microwave the corned beef and pastrami, in separate stacks, on high, for about 1 minute, just until the meat begins to steam (do not overheat). When the bread has toasted and the cheese has melted, top one slice of bread with the stack of hot pastrami, then cover with the stack of hot corned beef. Top the other slice of bread with the sauerkraut. Flip the side with the sauerkraut on top of the one with the meat and grill for about 2 minutes, until the Reuben is hot throughout. Transfer to a cutting board.",
            "Make the Russian Dressing and refrigerate until needed.",
            "Butter one side of both slices of bread. Melt the rest of the butter on a griddle or in a large skillet over medium heat. Place both slices of bread, buttered side down, on the hot griddle. Top each with 2 slices of cheese.",
            "Microwave the corned beef and pastrami, in separate stacks, on high, for about 1 minute, just until the meat begins to steam (do not overheat).",
            "When the bread has toasted and the cheese has melted, top one slice of bread with the stack of hot pastrami, then cover with the stack of hot corned beef. Top the other slice of bread with the sauerkraut. Flip the side with the sauerkraut on top of the one with the meat and grill for about 2 minutes, until the Reuben is hot throughout. Transfer to a cutting board.",
            "Cut the sandwich the Junior's way: First, slice the sandwich vertically into two pieces—one piece twice the width of the other. Slice the larger piece on the diagonal into two equal triangles. You now have three small overstuffed Reubens for each plate. Serve immediately, with the Russian Dressing on the side.",
            "First, slice the sandwich vertically into two pieces—one piece twice the width of the other. Slice the larger piece on the diagonal into two equal triangles. You now have three small overstuffed Reubens for each plate. Serve immediately, with the Russian Dressing on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59417f14a76fcc25997a3528/6:4/w_274%2Ch_169/HOW-TO-MAKE-SAUERKRAUT-COMBO-REUBEN-09062017.jpg"
    }
}