{
    "recipe": {
        "title": "Conch Salad Cocktail ",
        "ingredients": [
            "3 pounds frozen, cleaned, and cooked conch",
            "1/4 cup olive oil",
            "2 tablespoons minced shallots, peeled and minced",
            "3 medium tomatoes, diced",
            "1 yellow or orange bell pepper, diced",
            "1 large jalapeño, seeded and minced",
            "1/4 cup coarsely chopped fresh flat-leaf parsley",
            "1/4 cup coarsely chopped fresh cilantro",
            "Juice of 4 limes, plus extra limes, cut into wedges, for serving",
            "1/4 cup red-wine vinegar",
            "1 tablespoon kosher salt",
            "2 teaspoons freshly ground black pepper",
            "1/2 teaspoon cayenne pepper",
            "Saltines or other white crackers for serving"
        ],
        "instructions": [
            "In a large bowl filled with cold water, thaw the conch. Drain the defrosted conch then chop the conch into roughly 1/2-inch pieces and transfer to a large bowl. In a small sauté pan over moderately high heat, heat the oil for 1 minute. Add the shallots and sauté, stirring constantly, until golden, 1 to 2 minutes. Let cool. When the oil is cool, drizzle over the conch. Add the tomatoes, bell pepper, jalapeño, parsley, cilantro, lime juice, vinegar, salt, black pepper, and cayenne pepper, and toss to combine. Cover and refrigerate at least 1 hour. DO AHEAD: The conch salad can be prepared ahead and stored, covered in the refrigerator, up to 1 day.",
            "In a large bowl filled with cold water, thaw the conch. Drain the defrosted conch then chop the conch into roughly 1/2-inch pieces and transfer to a large bowl.",
            "In a small sauté pan over moderately high heat, heat the oil for 1 minute. Add the shallots and sauté, stirring constantly, until golden, 1 to 2 minutes. Let cool.",
            "When the oil is cool, drizzle over the conch. Add the tomatoes, bell pepper, jalapeño, parsley, cilantro, lime juice, vinegar, salt, black pepper, and cayenne pepper, and toss to combine. Cover and refrigerate at least 1 hour. DO AHEAD: The conch salad can be prepared ahead and stored, covered in the refrigerator, up to 1 day.",
            "To Serve: Serve the chilled conch salad in cocktail glasses or fruit dishes, with lime wedges and white crackers alongside.",
            "Serve the chilled conch salad in cocktail glasses or fruit dishes, with lime wedges and white crackers alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b06309fca98987608b1c06/6:4/w_274%2Ch_169/51126850_conch-salad_1x1.jpg"
    }
}