{
    "recipe": {
        "title": "Confit Turkey Wings ",
        "ingredients": [
            "2 turkey wings from a 15-17-pound turkey",
            "2 garlic cloves, sliced",
            "2 bay leaves",
            "4 whole black peppercorns",
            "2 whole cloves",
            "1 tablespoon plus 1 1/2 teaspoons kosher salt",
            "1 cup ghee",
            "2 1/2 cups canola oil",
            "A 1-gallon resealable bag; a 9x5x2 3/4\" loaf pan"
        ],
        "instructions": [
            "Separate turkey drumettes and flats. Remove and reserve wing tips for stock. Place drumettes and flats in 1-gallon bag; add garlic, bay leaves, peppercorns, cloves, and salt. Press out air, seal bag, and rub outside of bag until spices are evenly distributed. Chill 24–36 hours. Preheat oven to 200°F. Remove turkey pieces from bag, rinse under water, and pat dry; discard spices and herbs. Place turkey in loaf pan. Pour in ghee, then add oil (pieces should be completely covered). Roast turkey until an instant-read thermometer inserted into drumette registers 190°F, 3 1/2–4 hours. Let cool completely in pan, then chill overnight. Remove turkey pieces from pan, letting any excess oil and ghee drip off, and transfer to a plate. Heat a large skillet over medium-high until hot but not smoking. Cook turkey pieces until browned on all sides and warmed through, 8–10 minutes. Serve warm.",
            "Separate turkey drumettes and flats. Remove and reserve wing tips for stock.",
            "Place drumettes and flats in 1-gallon bag; add garlic, bay leaves, peppercorns, cloves, and salt. Press out air, seal bag, and rub outside of bag until spices are evenly distributed. Chill 24–36 hours.",
            "Preheat oven to 200°F. Remove turkey pieces from bag, rinse under water, and pat dry; discard spices and herbs. Place turkey in loaf pan. Pour in ghee, then add oil (pieces should be completely covered).",
            "Roast turkey until an instant-read thermometer inserted into drumette registers 190°F, 3 1/2–4 hours. Let cool completely in pan, then chill overnight.",
            "Remove turkey pieces from pan, letting any excess oil and ghee drip off, and transfer to a plate. Heat a large skillet over medium-high until hot but not smoking. Cook turkey pieces until browned on all sides and warmed through, 8–10 minutes. Serve warm."
        ],
        "picture_link": null
    }
}