{
    "recipe": {
        "title": "Confit Chicken Thigh and Andouille Sausage Cassoulet ",
        "ingredients": [
            "1 1/2 pounds skin-on, bone-in chicken thighs",
            "Kosher salt, freshly ground pepper",
            "1 head garlic, halved crosswise",
            "2 large shallots, halved",
            "4 sprigs thyme",
            "2 bay leaves",
            "4 juniper berries",
            "1 cup olive oil",
            "1 large onion, chopped",
            "4 cloves garlic, chopped",
            "1/2 (14.5-ounce) can whole peeled tomatoes",
            "4 cups cooked large white beans (such as Tarbais; from 1 1/2 cups dried beans), plus 1 cup cooking liquid",
            "Kosher salt, freshly ground pepper",
            "2 large andouille or other smoked sausages",
            "1 slice thick sourdough bread"
        ],
        "instructions": [
            "Preheat oven to 225°F. Season chicken with salt and pepper and place in a small Dutch oven or other heavy pot. Arrange garlic, shallots, thyme, bay leaves, and juniper berries around chicken; drizzle oil over. Bring to a very low simmer over medium-low heat, cover, and transfer to oven. Cook until meat is very tender, 2–2 1/2 hours. Let cool in oil (preferably overnight).",
            "For the cassoulet: Preheat oven to 350°F. Heat 1/3 cup oil from chicken confit in a large skillet over medium. Add onion and garlic; cook, stirring occasionally, until very soft, 10–12 minutes. Squeeze garlic cloves from chicken confit from their skins into skillet and add tomatoes, crushing with your hands. Bring to a boil and cook, stirring occasionally, until liquid is evaporated, about 5 minutes. Add beans and their cooking liquid. Skim off remaining fat from chicken confit and pour juices (about 1/2 cup) into skillet (reheat fat in pot just enough to loosen juices underneath if needed). Bring to a simmer; season with salt and pepper. Transfer bean mixture to a 2–2 1/2-qt. baking dish. Nestle chicken into beans, leaving as much skin exposed as possible, then tuck sausage and shallots from confit chicken around. Cook until chicken skin is very crisp and cassoulet is nicely browned, about 2 hours. Pulse bread in a blender or food processor to medium-fine crumbs. Toss crumbs in a small bowl with 1 Tbsp. oil from confit chicken (use remaining oil for sautéeing vegetables); season lightly with salt. Top cassoulet with breadcrumbs and cook until they are golden brown, 20–25 minutes.",
            "Preheat oven to 350°F. Heat 1/3 cup oil from chicken confit in a large skillet over medium. Add onion and garlic; cook, stirring occasionally, until very soft, 10–12 minutes. Squeeze garlic cloves from chicken confit from their skins into skillet and add tomatoes, crushing with your hands. Bring to a boil and cook, stirring occasionally, until liquid is evaporated, about 5 minutes. Add beans and their cooking liquid. Skim off remaining fat from chicken confit and pour juices (about 1/2 cup) into skillet (reheat fat in pot just enough to loosen juices underneath if needed). Bring to a simmer; season with salt and pepper.",
            "Transfer bean mixture to a 2–2 1/2-qt. baking dish. Nestle chicken into beans, leaving as much skin exposed as possible, then tuck sausage and shallots from confit chicken around. Cook until chicken skin is very crisp and cassoulet is nicely browned, about 2 hours.",
            "Pulse bread in a blender or food processor to medium-fine crumbs. Toss crumbs in a small bowl with 1 Tbsp. oil from confit chicken (use remaining oil for sautéeing vegetables); season lightly with salt. Top cassoulet with breadcrumbs and cook until they are golden brown, 20–25 minutes.",
            "Do Ahead Chicken can be cooked 3 days ahead. Cover and chill.",
            "Chicken can be cooked 3 days ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56c79e7075c6fbaa4f7fa77b/6:4/w_274%2Ch_169/0216-BA-WBEA-02.jpg"
    }
}