{
    "recipe": {
        "title": "Coq au Vin ",
        "ingredients": [
            "2 tablespoons vegetable oil, divided",
            "5 skin-on, bone-in chicken legs (thigh and drumstick)",
            "Kosher salt and freshly ground black pepper",
            "N/A freshly ground black pepper",
            "12 ounces thick-cut bacon, cut crosswise into 1/3\" slices",
            "3 carrots, peeled, chopped",
            "3 celery stalks, minced",
            "1 onion, minced",
            "4 cups dry red wine, such as Burgundy, divided",
            "1/2 cup tomato paste",
            "1 quart low-sodium chicken broth",
            "12 sprigs thyme",
            "6 sprigs rosemary",
            "1 pound assorted wild mushrooms, such as oyster and maitake, cleaned, cut into bite-size pieces (about 8 cups)"
        ],
        "instructions": [
            "Preheat oven to 350°F. Heat 1 tablespoon oil in an ovenproof pot over medium-high heat. Season chicken with salt and pepper. Cook chicken in batches until browned, 5-6 minutes per side. Transfer to a plate.",
            "Add bacon to pot; cook until rendered. Add carrots, celery, and onion; cook until onion is translucent, 7-8 minutes. Stir in 1 cup wine and tomato paste; simmer for 2-3 minutes. Add remaining 3 cups wine. Boil until wine is reduced by half, 15-20 minutes. Return chicken to pot.",
            "Add broth. Tie thyme and rosemary sprigs together; add to pot. Bring to a boil and cover pot. Transfer pot to oven and braise until chicken is tender, about 1 1/4 hours.",
            "Meanwhile, heat 1 tablespoon oil in a large pot over medium-high heat. Add mushrooms; sauté until browned, about 5 minutes.",
            "Transfer chicken from sauce to pot with mushrooms; keep warm. Simmer sauce over medium heat until reduced by 1/3, about 20 minutes. Season with salt and pepper.",
            "Add mushrooms and chicken to sauce. DO AHEAD: Coq au vin can be made 3 days ahead. Chill uncovered until cold. Cover; keep chilled. Rewarm before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/578e75c21edb4f17303e3f21/6:4/w_274%2Ch_169/coq-au-vin.jpg",
        "color": 14514693
    }
}