{
    "recipe": {
        "title": "Cornbread-Stuffed Cornish Game Hens with Corn Maque Choux ",
        "ingredients": [
            "3 tablespoons butter",
            "1 cup chopped onion",
            "1/2 cup chopped celery",
            "1 1/2 cups diced peeled cored Granny Smith or Golden Delicious apples",
            "2 teaspoons chopped fresh sage",
            "1/2 teaspoon coarse kosher salt",
            "1/2 teaspoon freshly ground black pepper",
            "4 cups 1/2-inch cubes purchased cornbread or corn muffins (about 11 ounces)",
            "1 large egg, beaten to blend",
            "1/2 cup (packed) coarsely grated sharp cheddar cheese (about 2 ounces)",
            "6 tablespoons (about) fresh apple cider or fresh apple juice",
            "4 1 1/4- to 1 1/2-pound Cornish game hens, rinsed, patted dry",
            "1 tablespoon chopped fresh sage",
            "2 teaspoons coarse kosher salt",
            "1 teaspoon freshly ground black pepper",
            "1 tablespoon olive oil",
            "4 bacon slices, each halved crosswise",
            "Corn Maque Choux"
        ],
        "instructions": [
            "For stuffing: Melt butter in heavy large skillet over medium-high heat. Add onion and celery; sauté until beginning to color, about 5 minutes. Add apples; sauté until beginning to soften, about 3 minutes. Mix in sage, 1/2 teaspoon salt, and 1/2 teaspoon pepper; transfer to large bowl. Let stand until almost cool, about 10 minutes. Mix cornbread into vegetables. Add egg and toss to blend. Mix in cheese, then enough apple cider by tablespoonfuls to form stuffing that is moist but not wet.",
            "Melt butter in heavy large skillet over medium-high heat. Add onion and celery; sauté until beginning to color, about 5 minutes. Add apples; sauté until beginning to soften, about 3 minutes. Mix in sage, 1/2 teaspoon salt, and 1/2 teaspoon pepper; transfer to large bowl. Let stand until almost cool, about 10 minutes.",
            "Mix cornbread into vegetables. Add egg and toss to blend. Mix in cheese, then enough apple cider by tablespoonfuls to form stuffing that is moist but not wet.",
            "Game hens: Sprinkle cavity of each hen lightly with salt and pepper. Pack 1 cup stuffing into each (place any leftover stuffing into buttered ramekins and cover with foil). Skewer cavities closed with toothpicks or turkey lacers. Tuck wing tips under; tie legs together to hold shape. Mix sage, coarse salt, and pepper in small bowl; sprinkle over hens. Preheat oven to 400°F. Heat oil in large nonstick skillet over medium-high heat. Place 2 hens in skillet. Sauté until brown, turning often with wooden spoons (to prevent tearing skin), about 10 minutes. Transfer to rimmed baking sheet, breast side up. Repeat with remaining hens. Drape 2 bacon strip halves over breast of each hen. Using kitchen string, tie bacon strips in place. (Place any ramekins of stuffing on baking sheet with hens.) Place hens (and extra stuffing) in oven. Roast hens until cooked through and juices run clear when thigh is pierced, about 45 minutes. (Roast stuffing 30 minutes.) Cut strings off hens. Transfer hens to plates. Spoon maque choux around hens and serve with extra stuffing.",
            "Sprinkle cavity of each hen lightly with salt and pepper. Pack 1 cup stuffing into each (place any leftover stuffing into buttered ramekins and cover with foil). Skewer cavities closed with toothpicks or turkey lacers. Tuck wing tips under; tie legs together to hold shape. Mix sage, coarse salt, and pepper in small bowl; sprinkle over hens.",
            "Preheat oven to 400°F. Heat oil in large nonstick skillet over medium-high heat. Place 2 hens in skillet. Sauté until brown, turning often with wooden spoons (to prevent tearing skin), about 10 minutes. Transfer to rimmed baking sheet, breast side up. Repeat with remaining hens. Drape 2 bacon strip halves over breast of each hen. Using kitchen string, tie bacon strips in place. (Place any ramekins of stuffing on baking sheet with hens.)",
            "Place hens (and extra stuffing) in oven. Roast hens until cooked through and juices run clear when thigh is pierced, about 45 minutes. (Roast stuffing 30 minutes.) Cut strings off hens. Transfer hens to plates. Spoon maque choux around hens and serve with extra stuffing."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d790f7b55306961bf3555/6:4/w_274%2Ch_169/350112_hires.jpg"
    }
}