{
    "recipe": {
        "title": "Corned Beef Hash with Eggs ",
        "ingredients": [
            "6 dried red New Mexico hatch or guajillo chiles, stemmed, seeded",
            "1/4 medium red onion, chopped",
            "1 garlic clove",
            "2 tablespoons extra-virgin olive oil",
            "2 tablespoons white balsamic or white wine vinegar",
            "6 tablespoons (3/4 stick) unsalted butter",
            "1 medium red onion, thinly sliced",
            "6 garlic cloves, smashed",
            "2 cups thinly sliced green cabbage",
            "1 1/2 pound Yukon Gold potatoes (about 4 large), peeled, coarsely grated",
            "1 teaspoon Four Seasons Blend",
            "12 ounces cooked corned beef, cut into matchstick-size pieces",
            "6 large eggs",
            "1/4 cup chopped fresh flat-leaf parsley"
        ],
        "instructions": [
            "Dried chile salsa: Place chiles in a heatproof bowl and add boiling water to cover; let stand until soft, 15-20 minutes. Drain chiles, reserving soaking liquid. Blend chiles, onion, garlic, oil, vinegar, and 1/4 cup reserved soaking liquid in a blender, adding liquid by tablespoonfuls to thin until smooth.",
            "Place chiles in a heatproof bowl and add boiling water to cover; let stand until soft, 15-20 minutes. Drain chiles, reserving soaking liquid.",
            "Blend chiles, onion, garlic, oil, vinegar, and 1/4 cup reserved soaking liquid in a blender, adding liquid by tablespoonfuls to thin until smooth.",
            "Hash and eggs: Melt butter in a large heavy skillet over medium-high heat. Add onion, garlic, and cabbage; cook, stirring occasionally, until onion and cabbage are golden brown and crisping at edges, 15-20 minutes. Add potatoes and Four Seasons Blend; cook until potatoes are crisp, 20-25 minutes. Fold in corned beef and cook until crisp, about 5 minutes. Fold once more. Make 6 divots in hash. Crack 1 egg into each divot. Cover skillet, reduce heat to medium-low, and cook until egg whites are just set, 7-10 minutes (eggs will continue to cook off heat). Top with parsley and serve with salsa.",
            "Melt butter in a large heavy skillet over medium-high heat. Add onion, garlic, and cabbage; cook, stirring occasionally, until onion and cabbage are golden brown and crisping at edges, 15-20 minutes.",
            "Add potatoes and Four Seasons Blend; cook until potatoes are crisp, 20-25 minutes. Fold in corned beef and cook until crisp, about 5 minutes. Fold once more. Make 6 divots in hash. Crack 1 egg into each divot.",
            "Cover skillet, reduce heat to medium-low, and cook until egg whites are just set, 7-10 minutes (eggs will continue to cook off heat). Top with parsley and serve with salsa."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55fc501dcb84959337fd46c2/6:4/w_274%2Ch_169/51238210_corned-beef-hash.jpg"
    }
}