{
    "recipe": {
        "title": "Corned Beef with Crispy Roasted Potatoes and Cabbage ",
        "ingredients": [
            "1 (3–4-lb.) corned beef brisket",
            "2 lb. russet potatoes, scrubbed, quartered",
            "1 1/4 cups extra-virgin olive oil, divided",
            "Kosher salt, freshly ground pepper",
            "1 large green cabbage, cut through the core into 8 wedges",
            "4 whole cloves",
            "1 tsp. coriander seeds",
            "1 tsp. mustard seeds",
            "1 tsp. peppercorns",
            "1/2 tsp. crushed red pepper flakes",
            "2 garlic cloves, finely grated",
            "6 Tbsp. white wine vinegar",
            "1 Tbsp. honey",
            "1 cup finely chopped dill",
            "A mortar and pestle"
        ],
        "instructions": [
            "Place corned beef in a large pot. Add enough water to cover by 2\" and bring to a boil. Reduce heat to low, cover, and simmer until very tender, 3–3 1/2 hours.",
            "Once beef has been simmering for 2 1/2 hours, arrange racks in top and bottom thirds of oven; preheat to 375°F. Toss potatoes, 1/4 cup oil, 1 tsp. salt, and 1 tsp. pepper on a rimmed baking sheet. Rub cabbage wedges with 1/4 cup oil; season on all sides with 1 tsp. salt and 1 tsp. pepper. Arrange on another rimmed baking sheet. Roast, turning cabbage, tossing potatoes, and rotating sheets top to bottom halfway through, until golden brown and tender, 45–40 minutes. (The cabbage might be done before the potatoes.)",
            "Meanwhile, coarsely crush cloves, coriander seeds, mustard seeds, peppercorns, and red pepper flakes with mortar and pestle. Transfer to a small saucepan and cook over medium heat, swirling often, until fragrant, about 2 minutes. Add garlic and remaining 3/4 cup oil and cook, stirring, until garlic sizzles, about 1 minute. Transfer to a medium heatproof bowl. Stir in vinegar, honey, and 2 tsp. salt. Let cool, then stir in dill.",
            "Transfer beef to a cutting board and let sit 10 minutes. Trim off excess fat, then thinly slice against the grain. Serve alongside roasted cabbage and potatoes with dill sauce drizzled over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c86addd7233972d223482e6/6:4/w_274%2Ch_169/Sunday-Supper-Corned-Beef-Dinner-3-05032019.jpg",
        "color": 8126942
    }
}