{
    "recipe": {
        "title": "Corned Beef Hash ",
        "ingredients": [
            "2 pounds uncooked corned beef brisket (about 1 small), rinsed, trimmed if fatty, spice packet discarded if included",
            "4 sprigs flat-leaf parsley",
            "3 bay leaves, torn",
            "1 tablespoon black peppercorns",
            "1 tablespoon coriander seeds",
            "1 tablespoon yellow mustard seeds",
            "1 medium onion, peeled, halved through root",
            "1 large russet potato, peeled, halved crosswise",
            "1/4 cup chopped fresh flat-leaf parsley, plus more for serving",
            "Kosher salt, freshly ground pepper",
            "4 tablespoons unsalted butter",
            "1 teaspoon distilled white vinegar",
            "4 large eggs",
            "Chopped fresh chives (for serving)"
        ],
        "instructions": [
            "Place corned beef in a large Dutch oven or other heavy pot and add water to cover by 1\". Add parsley sprigs, bay leaves, peppercorns, coriander seeds, and mustard seeds. Bring to a boil; reduce heat, cover, and simmer, skimming surface often and adding more water to pot as needed to keep meat submerged, until corned beef is tender, 3 1/2–4 hours.",
            "Add onion and potato to corned beef in pot and cook until vegetables are very tender, 20–25 minutes. Remove onion and potato from pot. Let cool; wrap separately and chill. Let corned beef cool in cooking liquid. Transfer corned beef to an airtight container and add as much cooking liquid as will fit (at least 1 cup). Cover and chill. Discard any remaining aromatics and cooking liquid.",
            "DO AHEAD: Corned beef and vegetables can be cooked 2 days ahead; keep chilled until ready to use.",
            "For hash: Remove corned beef from cooking liquid and shred enough to measure 2 cups (reserve any remaining corned beef for sandwiches or snacking). Preheat oven to 200°F. Thinly slice cooked onion and cut cooked potato into 1/2\" pieces; toss in a large bowl with corned beef and 1/4 cup parsley. Moisten with cooking liquid if mixture is dry; season with salt and pepper. Heat 2 tablespoons butter in a medium nonstick skillet over medium heat. Add 1/2 of corned beef mixture and press into a pancake. Cook undisturbed until underside is brown and crisp, 6–8 minutes. Set a plate over pan and carefully invert pancake onto plate; slide back into pan, pressing back into shape if needed. Cook until second side is brown and crisp, 6–8 minutes. Transfer hash to a rimmed baking sheet (it may break up a little), tent with foil, and keep warm in oven until ready to serve. Repeat with remaining butter and corned beef mixture. Meanwhile, bring 2\" water to a boil in a large saucepan; reduce heat to a gentle simmer and add vinegar. Crack an egg into a small bowl and gently slide egg into water. Repeat with remaining eggs, waiting until whites are opaque before adding the next (about 30 seconds apart). Poach until whites are set and yolks are still runny, about 3 minutes. Using a slotted spoon, transfer eggs as they are done to paper towels. Serve eggs over hash, seasoned with salt and pepper and topped with chives and more parsley. DO AHEAD: Eggs can be poached 2 hours ahead; place in a bowl of ice water and chill. Reheat in barely simmering water 1 minute just before serving.",
            "Remove corned beef from cooking liquid and shred enough to measure 2 cups (reserve any remaining corned beef for sandwiches or snacking).",
            "Preheat oven to 200°F. Thinly slice cooked onion and cut cooked potato into 1/2\" pieces; toss in a large bowl with corned beef and 1/4 cup parsley. Moisten with cooking liquid if mixture is dry; season with salt and pepper.",
            "Heat 2 tablespoons butter in a medium nonstick skillet over medium heat. Add 1/2 of corned beef mixture and press into a pancake. Cook undisturbed until underside is brown and crisp, 6–8 minutes. Set a plate over pan and carefully invert pancake onto plate; slide back into pan, pressing back into shape if needed. Cook until second side is brown and crisp, 6–8 minutes. Transfer hash to a rimmed baking sheet (it may break up a little), tent with foil, and keep warm in oven until ready to serve. Repeat with remaining butter and corned beef mixture.",
            "Meanwhile, bring 2\" water to a boil in a large saucepan; reduce heat to a gentle simmer and add vinegar. Crack an egg into a small bowl and gently slide egg into water. Repeat with remaining eggs, waiting until whites are opaque before adding the next (about 30 seconds apart). Poach until whites are set and yolks are still runny, about 3 minutes. Using a slotted spoon, transfer eggs as they are done to paper towels.",
            "Serve eggs over hash, seasoned with salt and pepper and topped with chives and more parsley.",
            "DO AHEAD: Eggs can be poached 2 hours ahead; place in a bowl of ice water and chill. Reheat in barely simmering water 1 minute just before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58c2da3d5eadb2183663cb92/6:4/w_274%2Ch_169/corned-beef-hash-031017.jpg"
    }
}