{
    "recipe": {
        "title": "Cornbread Stuffing with Andouille, Fennel, and Bell Peppers ",
        "ingredients": [
            "1 1/2 pounds purchased cornbread, cut into 1-inch cubes",
            "5 tablespoons butter, divided",
            "12 ounces fully cooked andouille sausages (about 4), halved lengthwise, then cut crosswise into 1/2-inch-wide pieces",
            "1 medium fennel bulb, trimmed, cutinto 1/2-inch cubes",
            "1 medium onion, cut into 1/2-inch pieces",
            "1 medium red bell pepper, cut into 1/2-inch pieces",
            "2 tablespoons chopped fresh thyme",
            "1/4 teaspoon coarse kosher salt plus additional for sprinkling",
            "1/8 teaspoon freshly ground black pepper plus additional for sprinkling",
            "2 cups low-salt chicken broth",
            "1 large egg"
        ],
        "instructions": [
            "Position rack in center of oven; preheat to 350°F. Spread cornbread in single layer on large baking sheet. Bake until dry and lightly browned, 30 to 45 minutes. Let cool. DO AHEAD: Can be made 1 day ahead. Store in airtight container at room temperature. Melt 2 tablespoons butter in heavy large skillet over medium-high heat. Add sausage pieces; sauté until brown, about 4 minutes. Transfer sausage to large bowl. Melt remaining 3 tablespoons butter in same skillet over medium-high heat. Add fennel, onion, and bell pepper; sprinkle with coarse salt and pepper. Sautéuntil onion is golden, 10 to 12 minutes. Add to bowl with sausage. Preheat oven to 350°F. Add cornbread, thyme, 1/4 teaspoon salt, and 1/8 teaspoon pepper to vegetable-sausage mixture; mix gently. Whisk 2 cups broth and egg in medium bowl. Add broth mixture to cornbread mixture and toss. Transfer mixture to 13x9x2-inch glass baking dish. Bake stuffing uncovered until crisp on top, about 1 hour. Let stand 15 minutes.",
            "Position rack in center of oven; preheat to 350°F. Spread cornbread in single layer on large baking sheet. Bake until dry and lightly browned, 30 to 45 minutes. Let cool. DO AHEAD: Can be made 1 day ahead. Store in airtight container at room temperature.",
            "Melt 2 tablespoons butter in heavy large skillet over medium-high heat. Add sausage pieces; sauté until brown, about 4 minutes. Transfer sausage to large bowl.",
            "Melt remaining 3 tablespoons butter in same skillet over medium-high heat. Add fennel, onion, and bell pepper; sprinkle with coarse salt and pepper. Sautéuntil onion is golden, 10 to 12 minutes. Add to bowl with sausage.",
            "Preheat oven to 350°F. Add cornbread, thyme, 1/4 teaspoon salt, and 1/8 teaspoon pepper to vegetable-sausage mixture; mix gently. Whisk 2 cups broth and egg in medium bowl. Add broth mixture to cornbread mixture and toss. Transfer mixture to 13x9x2-inch glass baking dish.",
            "Bake stuffing uncovered until crisp on top, about 1 hour. Let stand 15 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a74c6a59cdb91b5ff697/6:4/w_274%2Ch_169/355797_hires.jpg"
    }
}