{
    "recipe": {
        "title": "Cornish Game Hens with Sweet-Potato Risotto and Cranberry Sauce ",
        "ingredients": [
            "1 cup sugar",
            "1 cup water",
            "1 cup cranberries",
            "1/4 cup ruby Port",
            "2 Cornish game hens, halved lengthwise",
            "2 tablespoons (1/4 stick) butter",
            "1 pound yams (red-skinned sweet potatoes), peeled, cut into 1/2-inch pieces",
            "1 onion, chopped",
            "1/4 teaspoon minced peeled fresh ginger",
            "2/3 cup arborio rice or medium-grain rice",
            "1/4 cup dry Riesling wine",
            "2/3 cup mascarpone cheese*",
            "1/4 cup walnuts, toasted, chopped",
            "1/4 cup chopped fresh parsley",
            "1 teaspoon grated orange peel"
        ],
        "instructions": [
            "Bring first 4 ingredients to simmer in heavy medium saucepan over medium-high heat, stirring until sugar dissolves. Boil until reduced to 1 cup, stirring frequently, about 20 minutes. Puree sauce in processor. Strain into small bowl. (Sauce can be made 1 day ahead. Cool, cover and chill.) Preheat oven to 400°F. Place game hens, cut side down, on small baking sheet. Sprinkle with salt and pepper. Bake 30 minutes. Increase oven temperature to 450°F. Continue baking until juices run clear when thickest part of thigh is pierced, about 20 minutes longer. Meanwhile, melt butter in heavy large skillet over medium-high heat. Add yams, onion and ginger; sauté until yams are tender, about 15 minutes. Remove from heat. Cook rice in small saucepan of boiling salted water until just tender but still firm to bite, stirring frequently, about 15 minutes. Drain rice. Add rice to yam mixture in skillet. Add Riesling and stir over low heat to blend. Add mascarpone and stir to melt. Season with salt and pepper. Rewarm sauce. Spoon risotto onto plates. Top with hen. Sprinkle with nuts, parsley and orange peel. Drizzle sauce around risotto.",
            "Bring first 4 ingredients to simmer in heavy medium saucepan over medium-high heat, stirring until sugar dissolves. Boil until reduced to 1 cup, stirring frequently, about 20 minutes. Puree sauce in processor. Strain into small bowl. (Sauce can be made 1 day ahead. Cool, cover and chill.)",
            "Preheat oven to 400°F. Place game hens, cut side down, on small baking sheet. Sprinkle with salt and pepper. Bake 30 minutes. Increase oven temperature to 450°F. Continue baking until juices run clear when thickest part of thigh is pierced, about 20 minutes longer.",
            "Meanwhile, melt butter in heavy large skillet over medium-high heat. Add yams, onion and ginger; sauté until yams are tender, about 15 minutes. Remove from heat. Cook rice in small saucepan of boiling salted water until just tender but still firm to bite, stirring frequently, about 15 minutes. Drain rice. Add rice to yam mixture in skillet. Add Riesling and stir over low heat to blend. Add mascarpone and stir to melt. Season with salt and pepper.",
            "Rewarm sauce. Spoon risotto onto plates. Top with hen. Sprinkle with nuts, parsley and orange peel. Drizzle sauce around risotto.",
            "*Italian cream cheese, available at Italian markets and many supermarkets. If unavailable, blend 8 ounces cream cheese with 1/4 cup whipping cream and 2 1/2 tablespoons sour cream. Use 2/3 cup mixture for the recipe.",
            "*Italian cream cheese, available at Italian markets and many supermarkets. If unavailable, blend 8 ounces cream cheese with 1/4 cup whipping cream and 2 1/2 tablespoons sour cream. Use 2/3 cup mixture for the recipe."
        ],
        "picture_link": null
    }
}