{
    "recipe": {
        "title": "Corn Flour Shortcakes with Blackberries and Whipped Cream ",
        "ingredients": [
            "1/2 cup (110 grams) granulated sugar, divided",
            "3 large egg yolks, at room temperature",
            "1/4 cup flavorless vegetable oil (such as corn or safflower)",
            "1/2 cup (70 grams) corn flour",
            "1/4 cup (40 grams) white rice flour (Bob's Red Mill makes a good one)",
            "1 teaspoon baking powder",
            "1/2 teaspoon salt",
            "4 large egg whites, at room temperature",
            "1/4 teaspoon cream of tartar",
            "2 cups (12 ounces) fresh blackberries",
            "2 tablespoons granulated sugar",
            "2 tablespoons lemon juice",
            "1 1/4 cups heavy cream",
            "1/4 cup sour cream",
            "Pinch of salt",
            "1/2 teaspoon granulated sugar",
            "Stand mixer with whisk attachment or handheld electric mixer, 9-inch square cake pan"
        ],
        "instructions": [
            "Position a rack in the lower third of the oven and preheat the oven to 325°F. Line the bottom of the pan with parchment paper but leave the sides unlined and ungreased.",
            "Set aside 2 tablespoons of the sugar for later (to stiffen the egg whites).",
            "Add the remaining sugar to a large mixing bowl with egg yolks, oil, corn flour, rice flour, baking powder, salt, and 1/4 cup water. Whisk to blend thoroughly. Set aside for 15 minutes to hydrate the corn flour while the oven is heating.",
            "In the bowl of a stand mixer fitted with the whisk attachment, combine the egg whites and cream of tartar and beat on medium-high speed until the mixture is creamy white and holds a soft shape. Slowly sprinkle in the reserved 2 tablespoons sugar, beating at high speed until the egg whites are stiff but not dry. Scrape half of the egg whites onto the corn batter and fold until partially blended. Add the remaining egg whites and fold just until the batter looks blended. Scrape the batter into the pan and spread it evenly.",
            "Bake until the top of the cake is golden brown and a toothpick inserted in the center comes out clean, 30 to 35 minutes.",
            "Set the pan on a cooling rack. Immediately, while the cake is still hot, slide a thin knife or spatula around the sides, pressing against the pan to avoid tearing the cake. Leave the cake in the pan to cool—it will settle at a bit and pull away from the edges of the pan.",
            "When cool, carefully invert the cake onto a cutting board. Cut the cake into 8 even rectangles, about 2x4-inches each.",
            "Make the blackberry sauce and whipped cream: In a medium bowl, mix together 1 1/2 cup of the blackberries with the and lemon juice. Let stand 30 minutes, then stir and mash with the back of a spoon to break up the berries. When ready to serve, stir in remaining 1/2 cup fresh blackberries. Meanwhile, pour heavy cream into the chilled bowl of stand mixer fitted with the whisk attachment and beat on high until soft peaks form. Turn speed to low and gently whisk in sour cream, salt, and sugar. Refrigerate until ready to serve.",
            "In a medium bowl, mix together 1 1/2 cup of the blackberries with the and lemon juice. Let stand 30 minutes, then stir and mash with the back of a spoon to break up the berries. When ready to serve, stir in remaining 1/2 cup fresh blackberries.",
            "Meanwhile, pour heavy cream into the chilled bowl of stand mixer fitted with the whisk attachment and beat on high until soft peaks form. Turn speed to low and gently whisk in sour cream, salt, and sugar. Refrigerate until ready to serve.",
            "Assemble the dessert: To serve, slice each rectangle in half horizontally. Top the bottom half with a spoonful (about 3 tablespoons) of blackberries and their sauce, and then garnish with a generous dollop of whipped cream and place the top half of the cake on top. Repeat to form remaining servings.",
            "To serve, slice each rectangle in half horizontally. Top the bottom half with a spoonful (about 3 tablespoons) of blackberries and their sauce, and then garnish with a generous dollop of whipped cream and place the top half of the cake on top. Repeat to form remaining servings."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54c949e31f13bb9b2edf4b5a/6:4/w_274%2Ch_169/51262520_corn-flour-shortcakes_1x1.jpg",
        "color": 6305781
    }
}