{
    "recipe": {
        "title": "Cornbread, Chorizo, Cherry, and Pecan Stuffing ",
        "ingredients": [
            "3/4 cup (1 1/2 sticks) unsalted butter, cut into pieces, divided, plus more",
            "1/4 cup white wine vinegar",
            "1/2 cup dried tart cherries",
            "10 cups coarsely crumbled cornbread, preferably homemade, dried out overnight",
            "1/3 cup coarsely chopped pecans",
            "1/4 cup olive oil",
            "1 pound fresh chorizo, casings removed",
            "2 medium onions, chopped",
            "4 celery stalks, chopped",
            "Kosher salt, freshly ground pepper",
            "2 garlic cloves, finely chopped",
            "2 tablespoons finely chopped fresh sage",
            "2 large eggs",
            "3 cups chicken stock or low-sodium chicken broth, divided",
            "1/4 cup finely chopped fresh parsley"
        ],
        "instructions": [
            "Preheat oven to 400°. Butter a shallow 3-quart baking dish and a sheet of foil. Bring vinegar and 2 tablespoons water to a boil in a small saucepan; remove from heat and add cherries. Let sit until cherries are plump, 15-20 minutes. Meanwhile, spread out cornbread on a rimmed baking sheet and toast until golden brown, 10–15 minutes. Let cool. Place in a very large bowl. Drain cherries, reserving soaking liquid, and add cherries to bowl with cornbread (do not mix). Reduce oven temperature to 350°. Toast pecans on a clean rimmed baking sheet, tossing once, until fragrant and slightly darkened, 8–10 minutes. Let cool; add to bowl. Meanwhile, heat oil in a large skillet over medium-high. Cook chorizo, stirring occasionally and breaking into small pieces with a spoon, until browned and cooked through, 8–10 minutes. Transfer to bowl with a slotted spoon. Add onions and celery to skillet, season with salt and pepper, and cook, stirring often, until onions are golden brown and soft, 10–12 minutes. Add garlic and sage; cook, stirring, until fragrant, about 2 minutes. Transfer to bowl. Reduce heat to medium and cook reserved cherry soaking liquid in skillet, scraping up any browned bits, until almost all evaporated, about 1 minute. Add 1/2 cup butter; cook, stirring, until melted. Drizzle over bread mixture. Whisk eggs and 2 cups stock in a medium bowl; pour over cornbread mixture. Add parsley, season with salt and pepper, and gently toss, adding more stock 1/4-cupful at a time as needed (you may not use it all), until combined and cornbread is hydrated. Mix carefully to avoid breaking cornbread into crumbs. Transfer to prepared dish and dot with remaining 1/4 cup butter. Cover with buttered foil; bake until a paring knife inserted into the center comes out hot, 30–35 minutes. Increase oven temperature to 450°. Uncover and bake until top is golden brown and crisp, 20–25 minutes. Let sit 10 minutes before serving. Do ahead: Stuffing can be assembled 1 day ahead. Cover and chill.",
            "Preheat oven to 400°. Butter a shallow 3-quart baking dish and a sheet of foil. Bring vinegar and 2 tablespoons water to a boil in a small saucepan; remove from heat and add cherries. Let sit until cherries are plump, 15-20 minutes.",
            "Meanwhile, spread out cornbread on a rimmed baking sheet and toast until golden brown, 10–15 minutes. Let cool. Place in a very large bowl.",
            "Drain cherries, reserving soaking liquid, and add cherries to bowl with cornbread (do not mix).",
            "Reduce oven temperature to 350°. Toast pecans on a clean rimmed baking sheet, tossing once, until fragrant and slightly darkened, 8–10 minutes. Let cool; add to bowl.",
            "Meanwhile, heat oil in a large skillet over medium-high. Cook chorizo, stirring occasionally and breaking into small pieces with a spoon, until browned and cooked through, 8–10 minutes. Transfer to bowl with a slotted spoon.",
            "Add onions and celery to skillet, season with salt and pepper, and cook, stirring often, until onions are golden brown and soft, 10–12 minutes. Add garlic and sage; cook, stirring, until fragrant, about 2 minutes. Transfer to bowl.",
            "Reduce heat to medium and cook reserved cherry soaking liquid in skillet, scraping up any browned bits, until almost all evaporated, about 1 minute. Add 1/2 cup butter; cook, stirring, until melted. Drizzle over bread mixture.",
            "Whisk eggs and 2 cups stock in a medium bowl; pour over cornbread mixture. Add parsley, season with salt and pepper, and gently toss, adding more stock 1/4-cupful at a time as needed (you may not use it all), until combined and cornbread is hydrated. Mix carefully to avoid breaking cornbread into crumbs. Transfer to prepared dish and dot with remaining 1/4 cup butter.",
            "Cover with buttered foil; bake until a paring knife inserted into the center comes out hot, 30–35 minutes. Increase oven temperature to 450°. Uncover and bake until top is golden brown and crisp, 20–25 minutes. Let sit 10 minutes before serving.",
            "Do ahead: Stuffing can be assembled 1 day ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ab04066529d92b2c0317c9/6:4/w_274%2Ch_169/51255140_cornbread-chorizo-pecan-stuffing_1x1.jpg"
    }
}