{
    "recipe": {
        "title": "Corn Boats with Zucchini and Pepper Jack Cheese ",
        "ingredients": [
            "4 ears corn, unhusked",
            "2 tablespoons olive oil",
            "1 medium zucchini, cut into 1/3-inch dice",
            "1 cup finely chopped red onion",
            "1 cup coarsely grated Monterey Jack cheese with hot peppers",
            "2 tablespoons finely crushed corn tortilla chips"
        ],
        "instructions": [
            "Pull a lengthwise strip of corn husk (about 1 to 1 1/2 inches wide) from each ear to expose a strip of kernels and discard husk strip. Carefully peel back remaining husks, keeping them attached to stem ends, and snap ears from stem ends. Discard silk from husks. Tear a thin strip from a tender, inner piece of each husk and use it to tie loose end of each husk together, forming a boat. Cut corn kernels from ears and discard cobs. In a large heavy skillet heat oil over moderately high heat until hot but not smoking and sauté zucchini, stirring occasionally, until browned lightly and just tender, 2 to 3 minutes. Transfer zucchini with slotted spoon to a bowl and season with salt. In oil remaining in skillet sauté corn kernels and onion with salt to taste over moderately high heat, stirring, 4 minutes and cook, covered, over low heat until corn is crisp-tender, 2 to 3 minutes. Add corn mixture to zucchini and season with salt. Cool filling and stir in cheese. Spoon filling into husk boats. (Corn boats may be prepared up to this point 1 day ahead and kept chilled, covered.) Preheat oven to 375°F. Arrange boats on a baking sheet and sprinkle filling with tortilla crumbs. Bake boats in upper third of oven until cheese is melted and filling is heated through, 15 to 20 minutes. Serve corn boats warm or at room temperature.",
            "Pull a lengthwise strip of corn husk (about 1 to 1 1/2 inches wide) from each ear to expose a strip of kernels and discard husk strip. Carefully peel back remaining husks, keeping them attached to stem ends, and snap ears from stem ends. Discard silk from husks. Tear a thin strip from a tender, inner piece of each husk and use it to tie loose end of each husk together, forming a boat. Cut corn kernels from ears and discard cobs.",
            "In a large heavy skillet heat oil over moderately high heat until hot but not smoking and sauté zucchini, stirring occasionally, until browned lightly and just tender, 2 to 3 minutes. Transfer zucchini with slotted spoon to a bowl and season with salt.",
            "In oil remaining in skillet sauté corn kernels and onion with salt to taste over moderately high heat, stirring, 4 minutes and cook, covered, over low heat until corn is crisp-tender, 2 to 3 minutes. Add corn mixture to zucchini and season with salt.",
            "Cool filling and stir in cheese. Spoon filling into husk boats. (Corn boats may be prepared up to this point 1 day ahead and kept chilled, covered.)",
            "Preheat oven to 375°F.",
            "Arrange boats on a baking sheet and sprinkle filling with tortilla crumbs. Bake boats in upper third of oven until cheese is melted and filling is heated through, 15 to 20 minutes.",
            "Serve corn boats warm or at room temperature."
        ],
        "picture_link": null
    }
}