{
    "recipe": {
        "title": "Cowboy Breakfast Casserole with Sausage and Spinach ",
        "ingredients": [
            "7 slices white sandwich bread",
            "1 pound bulk breakfast sausage",
            "Softened unsalted butter or nonstick vegetable cooking spray (for pan)",
            "4 scallions, white and pale green and dark green parts separated, thinly sliced",
            "1 (10-ounce) package frozen spinach, thawed, squeezed dry",
            "8 ounces cheddar cheese, shredded (about 2 cups)",
            "8 large eggs",
            "1 1/2 cups milk",
            "1/2 cup full-fat Greek yogurt",
            "1 teaspoon mustard powder",
            "1/2 teaspoon kosher salt",
            "1/2 teaspoon freshly ground black pepper",
            "1/4 teaspoon ground nutmeg"
        ],
        "instructions": [
            "Preheat oven to 425°F. Toast bread on a rimmed baking sheet until dry, 8–10 minutes.",
            "Meanwhile, heat a large skillet over medium-high. Add sausage and cook, breaking into pieces with a spatula, until browned, about 7 minutes.",
            "Butter a 3-quart baking dish. Arrange 6 bread slices in dish in one layer, covering bottom of pan completely and cutting slices to fit if needed. Tear remaining slice into smaller pieces to fill in any gaps.",
            "Using a slotted spoon, transfer sausage to baking dish, scattering over bread.",
            "Heat skillet over medium and add white and pale green scallion parts. Cook, stirring, until softened and just starting to take on color, about 3 minutes. Add spinach, stir to combine, and cook until warmed through, 1–2 minutes more. Top sausage with spinach mixture, then top spinach mixture with cheese.",
            "Whisk eggs, milk, yogurt, mustard powder, salt, pepper, and nutmeg in a large bowl. Gently pour over casserole. Cover and chill at least 4 hours or up to overnight.",
            "Uncover dish and transfer to a cold oven. Heat oven to 375°F and bake casserole until eggs are puffed and cheese is browned, about 40 minutes.",
            "Let casserole cool several minutes. Top with dark green scallion parts.",
            "Do Ahead Casserole can be assembled 1 day ahead. Tightly cover and chill.",
            "Casserole can be assembled 1 day ahead. Tightly cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a2ac2b149f7c631c109e24b/6:4/w_274%2Ch_169/Cowboy-Casserole-Christmas-Breakfast-HERO-29112017.jpg",
        "color": 9313167
    }
}