{
    "recipe": {
        "title": "Crab Salad with Wonton Crisps and Lime ",
        "ingredients": [
            "8 square wonton wrappers, thawed if frozen",
            "About 6 cups vegetable oil",
            "1 teaspoon finely grated fresh lime zest",
            "1 1/2 tablespoons fresh lime juice",
            "1/4 teaspoon salt",
            "1/4 teaspoon black pepper",
            "2 1/2 tablespoons olive oil",
            "1 lb jumbo lump crabmeat, picked over",
            "2 celery ribs, cut into 1/4-inch dice",
            "1/4 cup thinly sliced white and pale green parts of scallions (reserve dark green parts for jasmine rice with peanuts and scallions )",
            "Accompaniment: lime wedges",
            "a deep-fat thermometer"
        ],
        "instructions": [
            "Make wonton crisps: Halve each wonton wrapper to make 2 rectangles, then halve each rectangle diagonally to make 2 triangles. Heat 1 1/4 inches vegetable oil in a 4- to 5-quart heavy pot over moderately high heat until thermometer registers 360°F. Gently lay 4 triangles on oil (do not drop in, or triangles will lose their shape) and fry, turning over once, until just golden, 15 to 30 seconds total. Transfer with a slotted spoon to paper towels to drain and season with salt. Fry remaining triangles in same manner.",
            "Halve each wonton wrapper to make 2 rectangles, then halve each rectangle diagonally to make 2 triangles. Heat 1 1/4 inches vegetable oil in a 4- to 5-quart heavy pot over moderately high heat until thermometer registers 360°F. Gently lay 4 triangles on oil (do not drop in, or triangles will lose their shape) and fry, turning over once, until just golden, 15 to 30 seconds total. Transfer with a slotted spoon to paper towels to drain and season with salt. Fry remaining triangles in same manner.",
            "Make crab salad: Whisk together zest, juice, salt, and pepper in a bowl until salt is dissolved, then add olive oil, whisking until combined well. Add crab, celery, and scallions to dressing and toss gently to combine. Serve crab salad in glasses topped with wonton crisps.",
            "Whisk together zest, juice, salt, and pepper in a bowl until salt is dissolved, then add olive oil, whisking until combined well.",
            "Add crab, celery, and scallions to dressing and toss gently to combine.",
            "Serve crab salad in glasses topped with wonton crisps."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de571f9a84192308a7b95/6:4/w_274%2Ch_169/232143.jpg"
    }
}