{
    "recipe": {
        "title": "Crab and Chorizo Fritters ",
        "ingredients": [
            "1 cup water",
            "1/2 cup (1 stick) butter",
            "1 1/4 teaspoons salt",
            "1 cup all purpose flour",
            "1 teaspoon ground cumin",
            "4 large eggs",
            "1/2 cup finely chopped dry-cured link chorizo (about 2.2 ounces)",
            "2 tablespoons sofrito*",
            "1/2 pound lump crabmeat",
            "Canola oil (for frying)"
        ],
        "instructions": [
            "Bring 1 cup water, butter, and salt to boil in heavy medium saucepan, stirring until butter melts and salt dissolves. Add flour and cumin. Stir vigorously 3 minutes. Remove from heat. Mix in eggs 1 at a time, blending well after each addition. Stir in chopped chorizo and sofrito. Gently stir in crabmeat. Pour enough oil into heavy large saucepan to reach depth of 3 inches. Heat over medium heat to 375°F. Working in batches, spoon dough carefully into oil by tablespoonfuls, flattening slightly with back of metal spatula. Fry fritters until cooked through and brown on both sides, turning once, and adding more oil as needed, about 5 minutes total. Transfer fritters to paper towels to drain; serve.",
            "Bring 1 cup water, butter, and salt to boil in heavy medium saucepan, stirring until butter melts and salt dissolves. Add flour and cumin. Stir vigorously 3 minutes. Remove from heat. Mix in eggs 1 at a time, blending well after each addition. Stir in chopped chorizo and sofrito. Gently stir in crabmeat.",
            "Pour enough oil into heavy large saucepan to reach depth of 3 inches. Heat over medium heat to 375°F. Working in batches, spoon dough carefully into oil by tablespoonfuls, flattening slightly with back of metal spatula. Fry fritters until cooked through and brown on both sides, turning once, and adding more oil as needed, about 5 minutes total.",
            "Transfer fritters to paper towels to drain; serve.",
            "*A Caribbean cooking base usually made of tomato paste, onions, peppers, and spices; it's available at Cuban markets and at goya.com.",
            "*A Caribbean cooking base usually made of tomato paste, onions, peppers, and spices; it's available at Cuban markets and at goya.com."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd7507b55306961bfa9bb/6:4/w_274%2Ch_169/234777.jpg"
    }
}