{
    "recipe": {
        "title": "Crab Cakes with Chardonnay Cream Sauce ",
        "ingredients": [
            "1 3/4 cups Chardonnay or other dry white wine",
            "1/3 cup chopped shallots",
            "1 cup whipping cream",
            "1 1/2 pounds crabmeat, drained (about 4 cups)",
            "2 1/2 cups finely crushed potato chips",
            "1 1/4 cups fresh breadcrumbs made from French bread",
            "1 7.25-ounce jar roasted red peppers, drained, coarsely chopped",
            "1/2 cup thinly sliced green onions",
            "2 large eggs",
            "2 tablespoons chopped fresh dill",
            "1 tablespoon Dijon mustard",
            "1 tablespoon whole grain mustard",
            "1 tablespoon mayonnaise",
            "1/4 cup (about) vegetable oil"
        ],
        "instructions": [
            "Boil wine and shallots in heavy medium saucepan until mixture is reduced to 1/2 cup, about 10 minutes. Add cream and boil until liquid is reduced to sauce consistency, about 10 minutes. Season to taste with salt and pepper. Mix crabmeat, 1/2 cup crushed potato chips, breadcrumbs and next 7 ingredients in large bowl until well blended. Using 1/4 cupful crab mixture for each cake, form mixture into sixteen 2 1/2-inch-diameter cakes. (Can be prepared 6 hours ahead. Cover sauce and crab cakes separately and refrigerate. Rewarm sauce over medium-low heat, stirring occasionally, before serving.) Place remaining potato chips in shallow dish. Press each cake into chips, turning to coat evenly. Heat 2 tablespoons oil in heavy large skillet over medium-high heat. Working in batches, add crab cakes to skillet and cook until golden brown and heated through, adding more oil as necessary, about 5 minutes per side. Transfer crab cakes to paper-towel-lined plate to drain. Place 2 crab cakes on each plate; spoon sauce around crab cakes and then serve immediately.",
            "Boil wine and shallots in heavy medium saucepan until mixture is reduced to 1/2 cup, about 10 minutes. Add cream and boil until liquid is reduced to sauce consistency, about 10 minutes. Season to taste with salt and pepper.",
            "Mix crabmeat, 1/2 cup crushed potato chips, breadcrumbs and next 7 ingredients in large bowl until well blended. Using 1/4 cupful crab mixture for each cake, form mixture into sixteen 2 1/2-inch-diameter cakes. (Can be prepared 6 hours ahead. Cover sauce and crab cakes separately and refrigerate. Rewarm sauce over medium-low heat, stirring occasionally, before serving.) Place remaining potato chips in shallow dish. Press each cake into chips, turning to coat evenly.",
            "Heat 2 tablespoons oil in heavy large skillet over medium-high heat. Working in batches, add crab cakes to skillet and cook until golden brown and heated through, adding more oil as necessary, about 5 minutes per side. Transfer crab cakes to paper-towel-lined plate to drain.",
            "Place 2 crab cakes on each plate; spoon sauce around crab cakes and then serve immediately."
        ],
        "picture_link": null
    }
}