{
    "recipe": {
        "title": "Crab and Scallop Soup with Peppers and Peas ",
        "ingredients": [
            "1 1 1/2-pound cooked Dungeness crab",
            "5 quarts of water",
            "1 8-ounce bottle clam juice",
            "1 large onion, halved",
            "1 large carrot, peeled",
            "1/4 teaspoon dried thyme",
            "1/4 teaspoon cayenne pepper",
            "3 tablespoons butter",
            "1 large onion, chopped",
            "3 large garlic cloves, chopped",
            "1 1/2 teaspoons curry powder",
            "1/2 teaspoon ground turmeric",
            "4 cups peeled 1-inch pieces butternut squash (about 1 3/4 pounds)",
            "1 10-ounce potato, peeled, cut into 1-inch pieces",
            "1 red bell pepper, cut into 1/4-inch strips",
            "1 yellow bell pepper, cut into 1/4-inch strips",
            "1 green bell pepper, cut into 1/4-inch strips",
            "1 1/2 pounds bay scallops",
            "1 1/2 cups frozen green peas, thawed"
        ],
        "instructions": [
            "Clean crab and crack; remove meat. Reserve shells and crab butter (gray-green coating inside crab shell). Refrigerate crab meat. Place shells and crab butter in 8- to 10-quart stockpot. Add water, clam juice, onion halves, carrot, thyme and cayenne. Boil over medium heat until liquid is reduced to 9 cups, about 1 1/2 hours. Strain stock.",
            "Melt 2 tablespoons butter in heavy large Dutch oven over medium-high heat. Add chopped onion and garlic and sauté until tender, about 6 minutes. Add curry powder and ground turmeric and stir 1 minute. Add crab stock, butternut squash and potato. Simmer until vegetables are very tender, about 35 minutes. Transfer mixture to blender in batches and puree until smooth. Return to Dutch oven. Season to taste with salt and pepper. (Can be made 1 day ahead. Cover; chill. Rewarm before continuing.)",
            "Melt 1 tablespoon butter in large skillet. Add all bell peppers and sauté until crisp-tender, about 2 minutes. Add bay scallops and sauté until almost cooked through, about 3 minutes. Add reserved crab meat and green peas and cook until heated through, about 3 minutes. Season with salt and pepper.",
            "Ladle squash puree into bowls. Top with seafood mixture and serve."
        ],
        "picture_link": null,
        "color": 15345423
    }
}