{
    "recipe": {
        "title": "Crab Toast with Lemon Aioli ",
        "ingredients": [
            "1 large egg yolk",
            "1 garlic clove, finely grated",
            "1 teaspoon finely grated lemon zest",
            "2 tablespoons (or more) fresh lemon juice",
            "1 teaspoon Dijon mustard",
            "Kosher salt",
            "1 cup vegetable oil",
            "8 ounces lump crabmeat, picked over",
            "2 tablespoons chopped fennel fronds",
            "1-2 serrano chiles, seeded, finely chopped",
            "6 tablespoons extra-virgin olive oil, divided",
            "Kosher salt",
            "4 3/4\"-thick slices country-style sourdough bread",
            "Lemon wedges (for serving)"
        ],
        "instructions": [
            "Whisk egg yolk, garlic, lemon zest and juice, mustard, and a large pinch of salt in a medium bowl. Whisking constantly, slowly drizzle in oil, drop by drop at first, until aioli is thickened and smooth; season with salt and more lemon juice, if desired.",
            "DO AHEAD: Aioli can be made 1 day ahead. Cover and chill.",
            "For crab toast: Toss crabmeat, fennel fronds, 1 chile, and 2 tablespoons oil in a medium bowl. Season with salt; add more chile, if desired. Drizzle both sides of bread with remaining 4 tablespoons oil, and working in batches, toast in a large skillet over medium-high heat until golden brown, about 2 minutes per side. Spread each piece of toast with 1 tablespoon aioli. Top with crabmeat; cut each toast into 4 pieces. Place a small dab of aioli in center of each piece; serve with lemon wedges. (Extra aioli can be used for dressings or dips.) DO AHEAD: Crabmeat mixture can be made 2 days ahead. Cover and chill.",
            "Toss crabmeat, fennel fronds, 1 chile, and 2 tablespoons oil in a medium bowl. Season with salt; add more chile, if desired.",
            "Drizzle both sides of bread with remaining 4 tablespoons oil, and working in batches, toast in a large skillet over medium-high heat until golden brown, about 2 minutes per side.",
            "Spread each piece of toast with 1 tablespoon aioli. Top with crabmeat; cut each toast into 4 pieces. Place a small dab of aioli in center of each piece; serve with lemon wedges. (Extra aioli can be used for dressings or dips.)",
            "DO AHEAD: Crabmeat mixture can be made 2 days ahead. Cover and chill."
        ],
        "picture_link": null,
        "color": 14466266
    }
}