{
    "recipe": {
        "title": "Crab Fritters with Herb Salad and Meyer Lemon Aïoli ",
        "ingredients": [
            "1/2 cup mayonnaise",
            "2 tablespoons fresh Meyer lemon juice",
            "1 1/2 teaspoons finely grated Meyer lemon peel",
            "1 1/2 teaspoons Dijon mustard",
            "1 teaspoon Sherry wine vinegar",
            "1/4 cup extra-virgin olive oil",
            "2 large eggs, separated",
            "1 tablespoon crème fraîche or sour cream",
            "1 cup (packed) fresh crabmeat, picked over, broken into 1/2-inch pieces (about 6 ounces)",
            "2 tablespoons chopped fresh chives",
            "1 tablespoon finely chopped shallot",
            "1 tablespoon chopped fresh Italian parsley",
            "4 medium-size fresh shiitake mushrooms, stemmed, caps thinly sliced",
            "1 tablespoon butter",
            "2 tablespoons extra-virgin olive oil",
            "1 tablespoon fresh Meyer lemon juice",
            "1/2 cup (packed) small fresh basil leaves",
            "1/2 cup (packed) fresh Italian parsley leaves"
        ],
        "instructions": [
            "For aioli: Place mayonnaise in small bowl. Whisk in lemon juice, lemon peel, mustard, and vinegar. Gradually whisk in oil. Season to taste with salt and pepper. (Can be made 1 day ahead. Cover; chill. Bring to room temperature before serving.)",
            "Place mayonnaise in small bowl. Whisk in lemon juice, lemon peel, mustard, and vinegar. Gradually whisk in oil. Season to taste with salt and pepper. (Can be made 1 day ahead. Cover; chill. Bring to room temperature before serving.)",
            "For fritters and salad: Whisk egg yolks and crème fraîche in small bowl to blend. Combine crabmeat, chives, shallot, and chopped parsley in medium bowl. Gently mix in mushrooms and yolk mixture. (Can be made 2 hours ahead. Cover crab mixture and chill.) Beat egg whites in medium bowl until stiff but not dry; fold into crab mixture. Melt butter in heavy large skillet over medium heat. For each fritter, drop 1/4 of crab mixture (about 1/2 cup) into skillet, spacing mounds apart. Sprinkle each with salt and pepper and flatten slightly. Cook fritters until bottoms are brown, about 3 minutes. Turn fritters over. Cook until bottoms are brown and fritters are cooked through, about 3 minutes longer. Meanwhile, whisk oil and lemon juice in medium bowl to blend. Season with salt and pepper. Mix in herbs.",
            "Whisk egg yolks and crème fraîche in small bowl to blend. Combine crabmeat, chives, shallot, and chopped parsley in medium bowl. Gently mix in mushrooms and yolk mixture. (Can be made 2 hours ahead. Cover crab mixture and chill.)",
            "Beat egg whites in medium bowl until stiff but not dry; fold into crab mixture. Melt butter in heavy large skillet over medium heat. For each fritter, drop 1/4 of crab mixture (about 1/2 cup) into skillet, spacing mounds apart. Sprinkle each with salt and pepper and flatten slightly. Cook fritters until bottoms are brown, about 3 minutes. Turn fritters over. Cook until bottoms are brown and fritters are cooked through, about 3 minutes longer. Meanwhile, whisk oil and lemon juice in medium bowl to blend. Season with salt and pepper. Mix in herbs.",
            "Transfer fritters to plates. Top each fritter with dollop of aioli. Place herb salad alongside and serve.",
            "Transfer fritters to plates. Top each fritter with dollop of aioli. Place herb salad alongside and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df29af3a00aeb2f1d5d70/6:4/w_274%2Ch_169/230601.jpg"
    }
}