{
    "recipe": {
        "title": "Crab Bisque ",
        "ingredients": [
            "12 live or frozen uncooked blue crabs (3 to 3 1/2 pound), rinsed well",
            "2 tablespoons unsalted butter",
            "2 tablespoons vegetable oil",
            "1 medium onion, finely chopped",
            "1 medium carrot, finely chopped",
            "1 celery rib, finely chopped",
            "2 large garlic cloves, crushed",
            "1 Turkish or 1/2 California bay leaf",
            "4 large thyme sprigs",
            "1 whole clove",
            "1/4 teaspoon black peppercorns",
            "1/2 cup Cognac or other brandy",
            "1 cup dry white wine",
            "1 3/4 cups reduced-sodium chicken broth",
            "6 cups water",
            "1/3 cup long-grain white rice",
            "1 teaspoon finely chopped tarragon",
            "2 teaspoons fresh lemon juice",
            "Large pinch of cayenne",
            "1/2 pound lump crabmeat, at room temperature 30 minutes, picked over",
            "Equipment: an 8- to 10-qt pot with tight-fitting lid; a meat pounder or a rolling pin without handles",
            "Accompaniment: crab butter (optional)"
        ],
        "instructions": [
            "If using live crabs, add to pot of boiling water using tongs. Cover pot and cook over high heat until crab shells are red, 5 to 6 minutes. Drain crabs in a colander. Put crabs (cooked or frozen uncooked) into a large metal roasting pan. Cover with a clean kitchen towel and pound shells with meat pounder to crush (including claws). Heat butter and oil in same pot over medium-high heat until foam subsides, then cook onion, carrot, celery, and garlic with bay leaf, thyme, clove, peppercorns, and 1/2 teaspoon salt, stirring occasionally, until softened, about 5 minutes. Add Cognac, wine, and crushed crabs and bring to a boil. Add broth and water and return to a boil. Skim foam, then simmer, covered, stirring and skimming occasionally, 1 hour. Put colander in a large bowl, then drain crab broth, reserving solids for crab butter (if making). Transfer broth to a medium saucepan. Ladle out 2 cups broth and transfer to a 1-quart saucepan. Add rice and simmer, covered, until very tender, 15 to 20 minutes (not all of liquid will be absorbed). Blend together rice with cooking liquid and 1 cup more crab broth in a blender until smooth (use caution when blending hot liquids), then add to remaining broth in medium saucepan. Just before serving, reheat bisque over medium heat until hot, then stir in tarragon, lemon juice, cayenne, and 1/8 teaspoon pepper. Ladle bisque into bowls and spoon a little crabmeat into center, then drizzle with some of crab butter (if making).",
            "If using live crabs, add to pot of boiling water using tongs. Cover pot and cook over high heat until crab shells are red, 5 to 6 minutes. Drain crabs in a colander.",
            "Put crabs (cooked or frozen uncooked) into a large metal roasting pan. Cover with a clean kitchen towel and pound shells with meat pounder to crush (including claws).",
            "Heat butter and oil in same pot over medium-high heat until foam subsides, then cook onion, carrot, celery, and garlic with bay leaf, thyme, clove, peppercorns, and 1/2 teaspoon salt, stirring occasionally, until softened, about 5 minutes. Add Cognac, wine, and crushed crabs and bring to a boil. Add broth and water and return to a boil. Skim foam, then simmer, covered, stirring and skimming occasionally, 1 hour.",
            "Put colander in a large bowl, then drain crab broth, reserving solids for crab butter (if making). Transfer broth to a medium saucepan.",
            "Ladle out 2 cups broth and transfer to a 1-quart saucepan. Add rice and simmer, covered, until very tender, 15 to 20 minutes (not all of liquid will be absorbed).",
            "Blend together rice with cooking liquid and 1 cup more crab broth in a blender until smooth (use caution when blending hot liquids), then add to remaining broth in medium saucepan.",
            "Just before serving, reheat bisque over medium heat until hot, then stir in tarragon, lemon juice, cayenne, and 1/8 teaspoon pepper.",
            "Ladle bisque into bowls and spoon a little crabmeat into center, then drizzle with some of crab butter (if making)."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9ac4f3a00aeb2f1cf90e/6:4/w_274%2Ch_169/240979_hires.jpg"
    }
}