{
    "recipe": {
        "title": "Cracked Farro and Broccoli Salad ",
        "ingredients": [
            "1/2 cup semi-pearled farro",
            "Kosher salt",
            "1 large egg yolk",
            "3 drained oil-packed anchovy fillets",
            "2 tablespoons fresh lemon juice",
            "2 tablespoons white wine vinegar",
            "1/2 teaspoon sugar",
            "1/4 teaspoon Dijon mustard",
            "2 garlic cloves, peeled, divided",
            "1/4 cup vegetable oil",
            "6 tablespoons olive oil, divided",
            "1 teaspoon dried oregano",
            "Freshly ground black pepper",
            "1/2 head of broccoli, stem peeled and trimmed, very thinly sliced lengthwise on a mandoline",
            "1/2 small red onion, very thinly sliced, rinsed, patted dry",
            "1 Persian cucumber, sliced 1/4-inch thick",
            "2 Fresno chiles, thinly sliced",
            "1/4 cup oil-packed sun-dried tomatoes, chopped",
            "1 cup mint leaves",
            "5 radishes, thinly sliced",
            "2 ounces young Pecorino, shaved"
        ],
        "instructions": [
            "Pulse farro in a food processor until about half of the grains are cracked, about 1 minute. Cook farro in a medium pot of boiling salted water until al dente, 10–15 minutes. Drain and rinse under cold water. Spread out on a plate and chill. Meanwhile, blend egg yolk, anchovies, lemon juice, vinegar, sugar, mustard, and 1 garlic clove in a blender to combine. With motor running, gradually stream in vegetable oil and 4 Tbsp. olive oil and blend until dressing is emulsified and creamy, then add oregano. Season dressing with salt and pepper. Toss broccoli and remaining 2 Tbsp. olive oil in a large bowl. Finely grate remaining garlic clove; toss with broccoli. Let sit 15 minutes to let broccoli soften. Add onion, cucumber, chiles, sun-dried tomatoes, and cooled farro. Drizzle with 1/4 cup dressing and toss to coat; season with salt and pepper and add more dressing, if desired. Add mint and toss again. Serve salad topped with radishes and Pecorino.",
            "Pulse farro in a food processor until about half of the grains are cracked, about 1 minute. Cook farro in a medium pot of boiling salted water until al dente, 10–15 minutes. Drain and rinse under cold water. Spread out on a plate and chill.",
            "Meanwhile, blend egg yolk, anchovies, lemon juice, vinegar, sugar, mustard, and 1 garlic clove in a blender to combine. With motor running, gradually stream in vegetable oil and 4 Tbsp. olive oil and blend until dressing is emulsified and creamy, then add oregano. Season dressing with salt and pepper.",
            "Toss broccoli and remaining 2 Tbsp. olive oil in a large bowl. Finely grate remaining garlic clove; toss with broccoli. Let sit 15 minutes to let broccoli soften. Add onion, cucumber, chiles, sun-dried tomatoes, and cooled farro. Drizzle with 1/4 cup dressing and toss to coat; season with salt and pepper and add more dressing, if desired. Add mint and toss again.",
            "Serve salad topped with radishes and Pecorino.",
            "Do Ahead Dressing can be made 1 day ahead; cover and chill. Salad (without mint, radishes, and Pecorino) can be made 1 hour ahead; cover and chill.",
            "Dressing can be made 1 day ahead; cover and chill. Salad (without mint, radishes, and Pecorino) can be made 1 hour ahead; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/573e0f7ecc4ee1433d600ce7/6:4/w_274%2Ch_169/0516-RSVP-Cracked-Farro-Salad-with-Crunchy-Vegetables.jpg"
    }
}