{
    "recipe": {
        "title": "Cranberry Gingerbread with Brown Sugar Whipped Cream ",
        "ingredients": [
            "3 cups all purpose flour",
            "1 1/2 teaspoons baking powder",
            "1 1/2 teaspoons ground cinnamon",
            "1 1/2 teaspoons ground ginger",
            "3/4 teaspoons baking soda",
            "3/4 teaspoons salt",
            "3/4 teaspoons ground allspice",
            "1/4 teaspoon ground cloves",
            "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
            "3/4 cup firmly packed dark brown sugar",
            "2 large eggs",
            "1 cup plus 2 tablespoons unsulfured light molasses",
            "1 cup plus 2 tablespoons buttermilk",
            "2 1/2 cups cranberries, coarsely chopped in processor",
            "1/3 cup chopped crystalized ginger",
            "1 cup chilled whipping cream",
            "1/3 cup chilled sour cream",
            "1/3 cup packed dark brown sugar",
            "1 1/2 teaspoons vanilla extract",
            "Additional ground cinnamon"
        ],
        "instructions": [
            "For gingerbread: Preheat ovven to 350°F. Grease 13x9x2-inch galss baking dish; dust with flour. Sift first eight ingredients into medium bowl. Using electric mixer, beat butter in large bowl until light and fluffy. Add sugar and beat until fluffy. Beat in eggs 1 at a time. Beat in molasses. Mix in dry ingredients alternately with buttermilk, beginning and wndying with dry ingredients. Fold in cranberries and crystallized ginger. Spread batter in prepare pan. Bake until springy to touch, about 50 minutes. Cool cake in pan on rack. Serve warm or at room temperature with brown sugar cream and a sprinkling of cinnamon.",
            "Preheat ovven to 350°F. Grease 13x9x2-inch galss baking dish; dust with flour. Sift first eight ingredients into medium bowl. Using electric mixer, beat butter in large bowl until light and fluffy. Add sugar and beat until fluffy. Beat in eggs 1 at a time. Beat in molasses. Mix in dry ingredients alternately with buttermilk, beginning and wndying with dry ingredients. Fold in cranberries and crystallized ginger.",
            "Spread batter in prepare pan. Bake until springy to touch, about 50 minutes. Cool cake in pan on rack. Serve warm or at room temperature with brown sugar cream and a sprinkling of cinnamon.",
            "For brown sugar ceam: Combine all ingredients in large bowl. Beat until peaks form. (Can be prepared 4 hours ahead. Cover and refrigerate.)",
            "Combine all ingredients in large bowl. Beat until peaks form. (Can be prepared 4 hours ahead. Cover and refrigerate.)"
        ],
        "picture_link": null
    }
}