{
    "recipe": {
        "title": "Cranberry Eggnog Tart ",
        "ingredients": [
            "1 1/4 cups all-purpose flour",
            "1/4 cup sugar",
            "1/2 teaspoon salt",
            "7 tablespoons unsalted butter, softened",
            "1 large egg",
            "1 1/2 (8-oz) packages cream cheese, softened",
            "2 tablespoons crème fraîche or heavy cream",
            "1/2 cup plus 2 tablespoons sugar",
            "2 whole large eggs",
            "2 large egg yolks",
            "3 tablespoons bourbon",
            "1 teaspoon vanilla",
            "Scant 1/2 teaspoon freshly grated nutmeg",
            "Scant 1/4 teaspoon salt",
            "Cranberry jam",
            "1/4 cup water",
            "3 cups pie weights or raw rice",
            "1 pie shield",
            "1 small offset spatula",
            "Accompaniment: candied-orange and cranberry compote",
            "a 10-inch fluted metal quiche pan (2 inches deep) with a removable bottom; about 3 cups pie weights or raw rice; a pie shield (optional); a small offset spatula"
        ],
        "instructions": [
            "Make crust: Pulse together all crust ingredients in a food processor just until a dough forms. Press dough evenly onto bottom and up side of quiche pan with floured fingers. Chill shell until firm, about 30 minutes. Put oven rack in middle position and preheat oven to 350°F. Line shell with foil and fill with pie weights, then bake until edge is pale golden, 20 to 25 minutes. Carefully remove foil and pie weights and bake shell until edge is golden and bottom is pale golden, 15 to 20 minutes more. Cool completely in pan on a rack. Reduce oven temperature to 300°F.",
            "Pulse together all crust ingredients in a food processor just until a dough forms. Press dough evenly onto bottom and up side of quiche pan with floured fingers. Chill shell until firm, about 30 minutes.",
            "Put oven rack in middle position and preheat oven to 350°F.",
            "Line shell with foil and fill with pie weights, then bake until edge is pale golden, 20 to 25 minutes. Carefully remove foil and pie weights and bake shell until edge is golden and bottom is pale golden, 15 to 20 minutes more. Cool completely in pan on a rack.",
            "Reduce oven temperature to 300°F.",
            "Make filling: Blend cream cheese, crème fraîche, and sugar in cleaned food processor until creamy, about 1 minute. Add whole eggs, yolks, bourbon, vanilla, nutmeg, and salt and process until smooth. Melt jam with water in a small heavy saucepan over moderately low heat, stirring until smooth. Spread half of jam evenly over bottom of shell(reserving remaining jam in saucepan). Let layer of jam stand until set, about 5 minutes, then gently pour cream cheese mixture over it.",
            "Blend cream cheese, crème fraîche, and sugar in cleaned food processor until creamy, about 1 minute. Add whole eggs, yolks, bourbon, vanilla, nutmeg, and salt and process until smooth.",
            "Melt jam with water in a small heavy saucepan over moderately low heat, stirring until smooth. Spread half of jam evenly over bottom of shell(reserving remaining jam in saucepan). Let layer of jam stand until set, about 5 minutes, then gently pour cream cheese mixture over it.",
            "Bake tart: Cover edge of tart shell with pie shield or foil and bake until filling is set but still trembles slightly in center, 35 to 40 minutes (filling will continue to set as it cools). Cool tart completely in pan on a rack. Reheat remaining jam over low heat, stirring, until pourable, then pour over filling and spread evenly with offset spatula. Chill tart, uncovered, until cold, at least 2 hours. Just before serving, remove side of pan.",
            "Cover edge of tart shell with pie shield or foil and bake until filling is set but still trembles slightly in center, 35 to 40 minutes (filling will continue to set as it cools).",
            "Cool tart completely in pan on a rack. Reheat remaining jam over low heat, stirring, until pourable, then pour over filling and spread evenly with offset spatula. Chill tart, uncovered, until cold, at least 2 hours.",
            "Just before serving, remove side of pan."
        ],
        "picture_link": "https://assets.epicurious.com/photos/566f4267b3a328e70b746734/6:4/w_274%2Ch_169/1104-GT-ET08-08.jpg"
    }
}