{
    "recipe": {
        "title": "Cranberry Daiquiri ",
        "ingredients": [
            "1 1/2 cup sugar",
            "1 1/2 cup water",
            "2 cups cranberries",
            "2 cups simple syrup",
            "4 wide strips orange zest",
            "2 cinnamon sticks",
            "1/2 cup cranberries",
            "1/2 cup simple syrup",
            "2 wide strips orange zest",
            "1 cinnamon stick",
            "2 ounces Goslings rum",
            "1 ounce freshly squeezed lime juice",
            "1 ounce cranberry syrup"
        ],
        "instructions": [
            "Simple Syrup: Combine sugar & water in small saucepan. Warm to form simple syrup, swirling pan to dissolve sugar. Chill before using to make cocktail. The extra syrup will keep indefinitely in the refrigerator.",
            "Combine sugar & water in small saucepan. Warm to form simple syrup, swirling pan to dissolve sugar. Chill before using to make cocktail. The extra syrup will keep indefinitely in the refrigerator.",
            "Cranberry Syrup: Bring syrup to a boil with orange zest & cinnamon. Add cranberries, reduce heat to low-medium and cook until all berries have popped. Remove from heat and let steep for a half hour. Pass mixture through the strainer, pressing only gently on the solids with back of ladle or spoon (too much pressure turns the syrup into more of a jelly). Goal is clear, bright, dark pink syrup.",
            "Bring syrup to a boil with orange zest & cinnamon. Add cranberries, reduce heat to low-medium and cook until all berries have popped. Remove from heat and let steep for a half hour. Pass mixture through the strainer, pressing only gently on the solids with back of ladle or spoon (too much pressure turns the syrup into more of a jelly). Goal is clear, bright, dark pink syrup.",
            "Poached Cranberries: Follow procedure for syrup EXCEPT stop as soon as a couple of berries start to pop. Chill. Goal is to leave berries intact and just cooked enough to be edible (the remaining syrup is tasty but too weak in cranberry flavor to use in the cocktail).",
            "Follow procedure for syrup EXCEPT stop as soon as a couple of berries start to pop. Chill. Goal is to leave berries intact and just cooked enough to be edible (the remaining syrup is tasty but too weak in cranberry flavor to use in the cocktail).",
            "Cocktail: Fill a cocktail shaker with ice. Add rum, lime juice & cranberry syrup. Shake and serve up in a martini glass, garnished with poached cranberries.",
            "Fill a cocktail shaker with ice. Add rum, lime juice & cranberry syrup. Shake and serve up in a martini glass, garnished with poached cranberries."
        ],
        "picture_link": "https://assets.epicurious.com/photos/566884743801be1a25378005/6:4/w_274%2Ch_169/Cranberry-Daiquiri.jpg"
    }
}