{
    "recipe": {
        "title": "Cranberry Buckle with Vanilla Crumb ",
        "ingredients": [
            "1 tablespoon unsalted butter, at room temperature, for pan",
            "1 cup Vanilla Crumb",
            "1 3/4 cups (8 3/4 ounces) all-purpose flour",
            "2 teaspoons baking powder",
            "1/2 teaspoon fine sea salt",
            "1/2 cup (4 ounces) unsalted butter",
            "3/4 cup (5 1/4 ounces) granulated sugar",
            "Zest of 1 orange",
            "2 eggs",
            "1 tablespoon pure vanilla extract",
            "1/2 cup (5 ounces) sour cream",
            "2 cups (8 ounces) cranberries, fresh or frozen"
        ],
        "instructions": [
            "Preheat the oven to 350°F. Butter a 9-inch square baking pan. Sift the flour, baking powder, and salt together in a bowl. Using a handheld mixer with beaters or a stand mixer withthe paddle attachment, cream the butter, sugar, and orange zest together on medium-high speed for 3 to 5 minutes, until light and fluffy. Add the eggs one at a time, scraping down the sides of the bowl after each addition, then stir in the vanilla. Stir in the flour mixture in three additions alternating with the sour cream in two additions, beginning and ending with the flour mixture and scraping down the sides of the bowl occasionally. Fold in 1 cup of the cranberries. Spread the mixture into the prepared pan. Distribute the remaining 1 cup cranberries over the cake and sprinkle the crumb topping over the cranberries. Bake for 45 to 50 minutes, or until lightly golden and firm on top.",
            "Preheat the oven to 350°F. Butter a 9-inch square baking pan. Sift the flour, baking powder, and salt together in a bowl.",
            "Using a handheld mixer with beaters or a stand mixer withthe paddle attachment, cream the butter, sugar, and orange zest together on medium-high speed for 3 to 5 minutes, until light and fluffy. Add the eggs one at a time, scraping down the sides of the bowl after each addition, then stir in the vanilla. Stir in the flour mixture in three additions alternating with the sour cream in two additions, beginning and ending with the flour mixture and scraping down the sides of the bowl occasionally.",
            "Fold in 1 cup of the cranberries. Spread the mixture into the prepared pan.",
            "Distribute the remaining 1 cup cranberries over the cake and sprinkle the crumb topping over the cranberries. Bake for 45 to 50 minutes, or until lightly golden and firm on top."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56098ed76a59cdb91b5f782a/6:4/w_274%2Ch_169/358317.jpg"
    }
}