{
    "recipe": {
        "title": "Cranberry and Wild Blueberry Pie ",
        "ingredients": [
            "16 ounces frozen organic wild blueberries (do not thaw)",
            "12 ounces fresh or frozen cranberries (do not thaw; about 3 cups)",
            "1 1/4 cups sugar",
            "3 tablespoons cornstarch",
            "2 cinnamon sticks",
            "1 tablespoon fresh lemon juice",
            "1/2 teaspoon finely grated lemon peel",
            "2 Pie Crust dough disks",
            "Heavy whipping cream (for brushing)",
            "Freshly grated nutmeg (for sprinkling)"
        ],
        "instructions": [
            "For filling: Combine all ingredients in large saucepan. Cook over medium heat until mixture thickens and begins to boil, stirring occasionally, 12 to 14 minutes. Continue to boil 2 minutes, stirring constantly. Transfer berry mixture to glass or ceramic dish; cool completely (mixture will thicken). DO AHEAD: Can be made 3 days ahead. Cover; chill.",
            "Combine all ingredients in large saucepan. Cook over medium heat until mixture thickens and begins to boil, stirring occasionally, 12 to 14 minutes. Continue to boil 2 minutes, stirring constantly. Transfer berry mixture to glass or ceramic dish; cool completely (mixture will thicken). DO AHEAD: Can be made 3 days ahead. Cover; chill.",
            "For crust: Position rack in center of oven; preheat to 400°F. Roll out 1 dough disk on floured surface to 12-inch round. Transfer crust to 9-inch-diameter glass pie dish; trim dough overhang to 1 inch. Remove cinnamon sticks from filling; spoon into crust. Roll out second dough disk to 13x10- inch rectangle. Cut dough lengthwise into 3/4-inch-wide strips (11 to 12 strips). Arrange half of dough strips across top of filling, spacing evenly apart. Form lattice by arranging remaining dough strips at right angle to first dough strips and weaving strips, if desired. Trim off excess dough from strips. Brush edges of bottom crust lightly with whipping cream. Press dough strip ends to adhere to bottom crust edges. Fold edges of bottom crust up over strips, pinching to seal. Crimp edges decoratively. Brush edges and lattice lightly with cream. Sprinkle lattice strips lightly with nutmeg. Place pie on rimmed baking sheet and bake until crust is golden and filling is bubbling thickly, about 1 hour 10 minutes. Cool pie on rack. DO AHEAD: Can be made 8 hours ahead. Let stand at room temperature. Serve pie at room temperature.",
            "Position rack in center of oven; preheat to 400°F. Roll out 1 dough disk on floured surface to 12-inch round. Transfer crust to 9-inch-diameter glass pie dish; trim dough overhang to 1 inch. Remove cinnamon sticks from filling; spoon into crust. Roll out second dough disk to 13x10- inch rectangle. Cut dough lengthwise into 3/4-inch-wide strips (11 to 12 strips).",
            "Arrange half of dough strips across top of filling, spacing evenly apart. Form lattice by arranging remaining dough strips at right angle to first dough strips and weaving strips, if desired. Trim off excess dough from strips. Brush edges of bottom crust lightly with whipping cream. Press dough strip ends to adhere to bottom crust edges. Fold edges of bottom crust up over strips, pinching to seal. Crimp edges decoratively. Brush edges and lattice lightly with cream. Sprinkle lattice strips lightly with nutmeg. Place pie on rimmed baking sheet and bake until crust is golden and filling is bubbling thickly, about 1 hour 10 minutes. Cool pie on rack. DO AHEAD: Can be made 8 hours ahead. Let stand at room temperature.",
            "Serve pie at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b30e27460b4423363e90ea/6:4/w_274%2Ch_169/361837_cranberry-wild-blueberry-pie_1x1.jpg"
    }
}