{
    "recipe": {
        "title": "Cranberry and Tart-Cherry Compote ",
        "ingredients": [
            "1 lime",
            "1 1/2 cups cranberry juice cocktail",
            "1 1/2 cups fresh cranberries",
            "1 cup dried tart cherries",
            "1/2 cup dried cranberries (about 3 ounces)",
            "1 cinnamon stick",
            "1/4 teaspoon ground allspice",
            "1 cup currant jelly (about one 10-ounce jar)",
            "Pinch of coarse kosher salt"
        ],
        "instructions": [
            "Grate 1 1/2 teaspoons peel from lime; set aside. Cut off all peel and white pith from lime. Working over bowl, cut between membranes to release lime segments. Bring cranberry juice to boil in large saucepan. Add lime segments, fresh cranberries, and next 4 ingredients; bring to boil. Reduce heat to medium; simmer until mixture thickens, about 8 minutes. Add currant jelly. Simmer until jelly is melted, stirring occasionally, about 2 minutes. Remove from heat. Stir in lime peel and coarse salt. Transfer to small bowl. Cover; chill at least 4 hours. DO AHEAD: Can be made 1 week ahead. Keep chilled. Discard cinnamon stick before serving.",
            "Grate 1 1/2 teaspoons peel from lime; set aside. Cut off all peel and white pith from lime. Working over bowl, cut between membranes to release lime segments.",
            "Bring cranberry juice to boil in large saucepan. Add lime segments, fresh cranberries, and next 4 ingredients; bring to boil. Reduce heat to medium; simmer until mixture thickens, about 8 minutes. Add currant jelly. Simmer until jelly is melted, stirring occasionally, about 2 minutes. Remove from heat. Stir in lime peel and coarse salt. Transfer to small bowl. Cover; chill at least 4 hours. DO AHEAD: Can be made 1 week ahead. Keep chilled.",
            "Discard cinnamon stick before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d7935f9a841923089d86e/6:4/w_274%2Ch_169/350429_hires.jpg"
    }
}