{
    "recipe": {
        "title": "Cranberry-Pistachio Baked Alaska ",
        "ingredients": [
            "1/2 vanilla bean",
            "1 cup whole milk",
            "1 cup heavy cream",
            "1/3 cup sugar, divided",
            "2 large egg yolks",
            "1/4 cup well-stirred pistachio paste",
            "1/2 cup raw shelled pistachios, coarsely chopped",
            "2 cups fresh or frozen cranberries (7 oz)",
            "1 cup water",
            "1/2 cup sugar",
            "2 (3- by 1/2-inch) strips orange zest",
            "Citrus Pound Cake or 1 (1-lb) store-bought frozen all-butter pound cake, thawed",
            "3 large egg whites at room temperature",
            "1/2 cup sugar",
            "An 8 1/2- by 4 1/2-inch loaf pan; an ice cream maker"
        ],
        "instructions": [
            "Make pistachio custard for ice cream: Split vanilla bean lengthwise and scape seeds into a heavy medium saucepan using tip of a paring knife, then add pod. Add milk, cream, and half of sugar and bring to a boil, stirring until sugar has dissolved. Whisk yolks with remaining sugar in a large bowl. Slowly add hot milk mixture, whisking. Return mixture to saucepan and cook over medium-low heat, stirring constantly with a wooden spoon, until custard is slightly thickened and registers 170°F on an instant-read thermometer (do not let boil) Immediately strain through a fine-mesh sieve into a metal bowl, discarding vanilla bean. Whisk in pistachio paste. Chill custard at least 6 hours.",
            "Split vanilla bean lengthwise and scape seeds into a heavy medium saucepan using tip of a paring knife, then add pod. Add milk, cream, and half of sugar and bring to a boil, stirring until sugar has dissolved.",
            "Whisk yolks with remaining sugar in a large bowl. Slowly add hot milk mixture, whisking. Return mixture to saucepan and cook over medium-low heat, stirring constantly with a wooden spoon, until custard is slightly thickened and registers 170°F on an instant-read thermometer (do not let boil)",
            "Immediately strain through a fine-mesh sieve into a metal bowl, discarding vanilla bean. Whisk in pistachio paste. Chill custard at least 6 hours.",
            "Make cranberry base for sorbet: Bring cranberries, water, sugar, and zest to a boil in a medium saucepan, then simmer, stirring occasionally, until most of the cranberries have burst, about 5 minutes. Purée in a blender (use caution when blending hot liquids), then force through a fine-mesh sieve into a bowl. Chill at least 6 hours.",
            "Bring cranberries, water, sugar, and zest to a boil in a medium saucepan, then simmer, stirring occasionally, until most of the cranberries have burst, about 5 minutes. Purée in a blender (use caution when blending hot liquids), then force through a fine-mesh sieve into a bowl. Chill at least 6 hours.",
            "Prepare cake layer: Line loaf pan with a large sheet of plastic wrap, leaving a 4-inch overhang on all sides. Trim off top of cake and cut 2 (1/2-inch-thick) long horizontal slices from cake, reserving remainder for another use. Place 1 layer in bottom of pan, trimming to fit, and put in freezer. Cover remaining cake layer with plastic wrap to keep moist.",
            "Line loaf pan with a large sheet of plastic wrap, leaving a 4-inch overhang on all sides. Trim off top of cake and cut 2 (1/2-inch-thick) long horizontal slices from cake, reserving remainder for another use. Place 1 layer in bottom of pan, trimming to fit, and put in freezer. Cover remaining cake layer with plastic wrap to keep moist.",
            "Make sorbet: Freeze sorbet base in ice cream maker, then transfer to loaf pan, smoothing evenly over cake layer. Freeze 1 hour.",
            "Freeze sorbet base in ice cream maker, then transfer to loaf pan, smoothing evenly over cake layer. Freeze 1 hour.",
            "Make ice cream, and assemble: Freeze custard in cleaned ice cream maker, then fold in chopped pistachios, spread ice cream over cranberry sorbet, smoothing top, then top with remaining cake layer, pressing it flat. Wrap cake with overhang and freeze until firm, at least 6 hours.",
            "Freeze custard in cleaned ice cream maker, then fold in chopped pistachios, spread ice cream over cranberry sorbet, smoothing top, then top with remaining cake layer, pressing it flat. Wrap cake with overhang and freeze until firm, at least 6 hours.",
            "Make meringue: Preheat oven to 450°F with rack in middle. Beat egg whites with an electric mixer at medium-high speed until foamy. Gradually beat in sugar, then beat until whites hold stiff peaks. Invert cake onto a parchment-lined baking sheet and discard plastic wrap. Spread meringue over top and sides of cake. Bake until meringue is tipped with brown, 3 to 5 minutes. Serve immediately.",
            "Preheat oven to 450°F with rack in middle.",
            "Beat egg whites with an electric mixer at medium-high speed until foamy. Gradually beat in sugar, then beat until whites hold stiff peaks. Invert cake onto a parchment-lined baking sheet and discard plastic wrap. Spread meringue over top and sides of cake. Bake until meringue is tipped with brown, 3 to 5 minutes. Serve immediately.",
            "Do Ahead Assembled cake (without meringue) can be frozen, wrapped tightly with plastic wrap, up to 4 days. Cake can be covered with meringue (but not baked) 4 hours ahead and frozen, uncovered.",
            "Assembled cake (without meringue) can be frozen, wrapped tightly with plastic wrap, up to 4 days. Cake can be covered with meringue (but not baked) 4 hours ahead and frozen, uncovered."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c0997ed4c751936404124bd/6:4/w_274%2Ch_169/Gourmet-Christmas-Cranberry-Pistachio-Baked-Alaska-Recipe-14112018.jpg"
    }
}