{
    "recipe": {
        "title": "Cranberry Hand Pies ",
        "ingredients": [
            "3 2/3 cups unbleached all-purpose flour",
            "1 cup sugar",
            "1 1/2 teaspoons kosher salt",
            "1 1/2 cups (3 sticks) plus 3 tablespoons unsalted butter, cut into 1/2\" cubes, frozen",
            "1 pound fresh (or frozen, thawed) cranberries (about 4 cups)",
            "1 1/2 cups sugar",
            "1 teaspoon finely grated orange zest",
            "2 tablespoons fresh orange juice",
            "1/2 teaspoon instant tapioca (not starch)",
            "1/2 vanilla bean, split lengthwise",
            "1 large egg, beaten to blend",
            "Raw sugar",
            "A 3\"-diameter cookie cutter or biscuit cutter"
        ],
        "instructions": [
            "Pulse flour, sugar, and salt in a food processor to combine. Add butter; pulse until mixture resembles coarse cornmeal (no big pieces of butter should remain). With motor running, slowly drizzle 1/2 cup ice water through feed tube. Pulse until dough just begins to come together.",
            "Divide dough in half. Form each half into a ball; flatten into disks. Wrap each disk tightly in plastic. Chill for at least 2 hours. DO AHEAD: Dough can be made 2 days ahead. Keep chilled. Let stand at room temperature for 15 minutes to soften slightly before rolling out.",
            "For filling and assembly: Combine cranberries, sugar, orange zest and juice, and tapioca in a medium saucepan. Scrape in seeds from vanilla bean; add bean. Let stand for juices to accumulate, about 10 minutes, then cook over medium heat until mixture comes to a simmer and begins to thicken, 5-6 minutes. (Some cranberries will have burst.) Let cool completely. DO AHEAD: Cranberry filling can be made 5 days ahead. Cover and chill. Line two baking sheets with parchment paper; set aside. Working with 1 disk at a time, roll out dough on a lightly floured surface until very thin, about 1/16\" thick. Using cookie cutter, cut out 16 circles. Brush edges of 8 circles with beaten egg. Place 1 heaping tablespoon filling in center of each egg-washed circle. Top with remaining circles to form 8 pies. Using a fork, crimp 1/4\" around edges to seal. If desired, use cookie cutter to clean edges. Repeat with remaining dough, egg, and filling. Divide pies between prepared sheets; chill for 45 minutes. DO AHEAD: Pies can be made 2 hours ahead. Cover; keep chilled. Preheat oven to 425°F. Working with 1 baking sheet of pies at a time, score dough, forming a small X in the center of each pie. Brush tops of pies with beaten egg and sprinkle with raw sugar. Bake pies until crust is golden brown and filling bubbles out of Xs, 17-20 minutes. Let cool on baking sheet for 5 minutes; transfer to a wire rack and let cool completely. Repeat with remaining baking sheet of pies.",
            "Combine cranberries, sugar, orange zest and juice, and tapioca in a medium saucepan. Scrape in seeds from vanilla bean; add bean. Let stand for juices to accumulate, about 10 minutes, then cook over medium heat until mixture comes to a simmer and begins to thicken, 5-6 minutes. (Some cranberries will have burst.) Let cool completely. DO AHEAD: Cranberry filling can be made 5 days ahead. Cover and chill.",
            "Line two baking sheets with parchment paper; set aside. Working with 1 disk at a time, roll out dough on a lightly floured surface until very thin, about 1/16\" thick. Using cookie cutter, cut out 16 circles.",
            "Brush edges of 8 circles with beaten egg. Place 1 heaping tablespoon filling in center of each egg-washed circle. Top with remaining circles to form 8 pies. Using a fork, crimp 1/4\" around edges to seal. If desired, use cookie cutter to clean edges. Repeat with remaining dough, egg, and filling.",
            "Divide pies between prepared sheets; chill for 45 minutes. DO AHEAD: Pies can be made 2 hours ahead. Cover; keep chilled.",
            "Preheat oven to 425°F. Working with 1 baking sheet of pies at a time, score dough, forming a small X in the center of each pie. Brush tops of pies with beaten egg and sprinkle with raw sugar.",
            "Bake pies until crust is golden brown and filling bubbles out of Xs, 17-20 minutes. Let cool on baking sheet for 5 minutes; transfer to a wire rack and let cool completely. Repeat with remaining baking sheet of pies."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b05b1afca98987608b0979/6:4/w_274%2Ch_169/51123100_hires_1x1.jpg"
    }
}