{
    "recipe": {
        "title": "Creamy Hummus with Cumin ",
        "ingredients": [
            "3/4 cup dried chickpeas",
            "1/2 teaspoon baking soda",
            "3 garlic cloves, 2 smashed, 1 finely grated",
            "1 dried red chile (such as chile de árbol)",
            "1 bay leaf",
            "1/3 cup (or more) fresh lemon juice",
            "Kosher salt",
            "1 cup tahini",
            "1/3 cup olive oil",
            "1 teaspoon ground cumin"
        ],
        "instructions": [
            "Combine chickpeas and baking soda in a medium bowl and pour in cold water to cover by 2\". Cover and let sit 8–12 hours.",
            "Drain chickpeas, rinse, and place in a large saucepan along with smashed garlic, chile, and bay leaf. Pour in cold water to cover by 2\". Bring to a boil over medium-high heat; reduce heat and simmer gently, skimming foam occasionally from surface, until chickpeas are falling apart, 35–45 minutes. Drain, reserving about 1 cup cooking liquid. Pluck out and discard garlic, chile, and bay leaf.",
            "Combine grated garlic, lemon juice, and a pinch of salt in a food processor and let sit until the bite in garlic mellows, about 5 minutes. Add tahini and 1/2 cup ice water and process until smooth. With the motor running, slowly stream in oil. Season with another large pinch of salt. Add chickpeas and cumin and process until hummus is very smooth, light, and creamy, about 2 minutes. It will tighten up as it cools, so it should be loose to the point of being pourable at this stage. If it looks thick, thin with chickpea cooking liquid, pulsing in by the tablespoonful until you reach the right consistency. Taste hummus and season with salt and more lemon juice if needed.",
            "Do Ahead Hummus can be made 1 week ahead. Cover and chill. Bring to room temperature before serving.",
            "Hummus can be made 1 week ahead. Cover and chill. Bring to room temperature before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/596939236c42213eb20a2b3d/6:4/w_274%2Ch_169/creamy-hummus-with-cumin-recipe-BA-071417.jpg"
    }
}