{
    "recipe": {
        "title": "Creamy Leek Soup ",
        "ingredients": [
            "8 medium leeks (3 pound), trimmed, leaving white and pale green parts only, and chopped",
            "1 medium onion, chopped",
            "1 large carrot, chopped",
            "2 celery ribs, chopped",
            "1 teaspoon salt",
            "1/2 teaspoon black pepper",
            "1 stick (1/2 cup) unsalted butter",
            "1 small boiling potato (6 ounces)",
            "1/2 cup dry white wine",
            "3 cups chicken stock or reduced-sodium chicken broth (24 fluid ounces)",
            "3 cups water",
            "1 Turkish bay leaf or 1/2 California",
            "1 1/2 cups fresh flat-leaf parsley leaves",
            "1/4 cup all-purpose flour",
            "1/2 cup chilled heavy cream"
        ],
        "instructions": [
            "Wash sliced leeks in a large bowl of cold water, agitating them, then lift out and drain well in a colander.",
            "Cook leeks, onion, carrot, celery, salt, and pepper in 4 tablespoons butter in a 5- to 6-quart heavy pot over moderate heat, stirring occasionally, until softened, about 8 minutes. Peel potato and cut into 1/2-inch cubes, then add to onion mixture along with wine, stock, water, and bay leaf. Bring to a boil, then reduce heat and simmer, partially covered, until vegetables are tender, about 15 minutes.",
            "Stir in parsley and simmer soup, uncovered, 5 minutes. Discard bay leaf and keep soup at a bare simmer.",
            "Melt remaining 4 tablespoons butter in a 1-quart heavy saucepan over moderate heat, then add flour and cook roux, whisking, until golden, about 3 minutes. Remove from heat and add 2 cups simmering stock (from soup), whisking vigorously (mixture will be thick), then whisk mixture into remaining soup and return to a simmer, whisking.",
            "Blend soup in 4 batches in a blender until smooth (use caution when blending hot liquids), about 1 minute per batch, transferring to a 3- to 4-quart saucepan. Reheat if necessary, then season with salt and pepper.",
            "Beat cream in a bowl with an electric mixer at medium speed until it almost forms soft peaks. Serve soup topped with cream."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d99aef9a84192308a1a7c/6:4/w_274%2Ch_169/238442.jpg",
        "color": 16726834
    }
}