{
    "recipe": {
        "title": "Creamy SauerKraut Gratin with Duck Confit ",
        "ingredients": [
            "1/4 cup plain fine dry bread crumbs",
            "1 large onion, finely chopped",
            "1 Turkish or 1/2 California bay leaf",
            "1/4 teaspoon juniper berries (see cooks' note, below), crushed",
            "2 tablespoons unsalted butter",
            "2 pounds sauerkraut, drained and chopped",
            "3 Confit Duck Legs at room temperature",
            "2 cups heavy cream",
            "1 cup whole milk",
            "4 large eggs",
            "1/4 teaspoon grated nutmeg",
            "a 2-quart shallow gratin"
        ],
        "instructions": [
            "Preheat oven to 375°F with rack in middle. Butter baking dish and coat with bread crumbs. Chill until ready to use. Cook onion with bay leaf and juniper berries in butter in a 12-inch heavy skillet over medium heat, stirring occasionally, until well browned, 8 to 10 minutes. Add sauerkraut and cook, stirring occasionally, until heated through and liquid has evaporated, about 2 minutes. Discard bay leaf. Meanwhile, remove skin and bones from duck legs, reserving skin and discarding bones. Tear meat into 1-inch pieces and stir into sauerkraut. Transfer to baking dish. Whisk together cream, milk, eggs, nutmeg, 1/2 teaspoon salt, and 1/4 teaspoon pepper, then pour over sauerkraut. Bake until custard is set and edges are lightly browned, 45 to 50 minutes. Meanwhile, remove skin and bones from duck legs, reserving skin and discarding bones. Tear meat into 1-inch pieces and stir into sauerkraut. Transfer to baking dish. Whisk together cream, milk, eggs, nutmeg, 1/2 teaspoon salt, and 1/4 teaspoon pepper, then pour over sauerkraut. Bake until custard is set and edges are lightly browned, 45 to 50 minutes. While custard bakes, thinly slice reserved skin, then season lightly with salt and pepper. Cook in a dry medium nonstick skillet over low heat, stirring to separate, until fat is rendered and skin is crisp, 6 to 8 minutes. Serve gratin with crisp skin scattered on top.",
            "Preheat oven to 375°F with rack in middle.",
            "Butter baking dish and coat with bread crumbs. Chill until ready to use.",
            "Cook onion with bay leaf and juniper berries in butter in a 12-inch heavy skillet over medium heat, stirring occasionally, until well browned, 8 to 10 minutes. Add sauerkraut and cook, stirring occasionally, until heated through and liquid has evaporated, about 2 minutes. Discard bay leaf.",
            "Meanwhile, remove skin and bones from duck legs, reserving skin and discarding bones. Tear meat into 1-inch pieces and stir into sauerkraut. Transfer to baking dish.",
            "Whisk together cream, milk, eggs, nutmeg, 1/2 teaspoon salt, and 1/4 teaspoon pepper, then pour over sauerkraut. Bake until custard is set and edges are lightly browned, 45 to 50 minutes.",
            "Meanwhile, remove skin and bones from duck legs, reserving skin and discarding bones. Tear meat into 1-inch pieces and stir into sauerkraut. Transfer to baking dish. Whisk together cream, milk, eggs, nutmeg, 1/2 teaspoon salt, and 1/4 teaspoon pepper, then pour over sauerkraut. Bake until custard is set and edges are lightly browned, 45 to 50 minutes. While custard bakes, thinly slice reserved skin, then season lightly with salt and pepper. Cook in a dry medium nonstick skillet over low heat, stirring to separate, until fat is rendered and skin is crisp, 6 to 8 minutes. Serve gratin with crisp skin scattered on top."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d78fcf3a00aeb2f1cb6c0/6:4/w_274%2Ch_169/243547_hires.jpg"
    }
}