{
    "recipe": {
        "title": "Creamy Tahini Sauce, Three Ways ",
        "ingredients": [
            "2 garlic cloves, coarsely chopped",
            "1 teaspoon kosher salt",
            "1 cup tahini",
            "1/2 cup chopped fresh parsley",
            "1/2 cup fresh lemon juice",
            "1/4 cup extra-virgin olive oil",
            "1/4 teaspoon cayenne pepper",
            "2 ripe avocados, cubed",
            "1/2 cup plain Greek yogurt",
            "2 tablespoons fresh lemon juice",
            "1/2 teaspoon kosher salt",
            "1/4 teaspoon cumin",
            "1 cup coarsely chopped English hothouse cucumber",
            "1/4 cup buttermilk",
            "1/4 cup sour cream",
            "2 tablespoons fresh lemon juice",
            "1/2 teaspoon kosher salt",
            "1/4 cup fresh dill fronds"
        ],
        "instructions": [
            "Make the Creamy Tahini Sauce: Sprinkle garlic with salt on a cutting board, then use the side of a knife to smash into a paste. Transfer to a large bowl. Add tahini and 1 cup warm water. Whisk until smooth. Add parsley, lemon juice, oil, and cayenne and whisk to combine.",
            "Sprinkle garlic with salt on a cutting board, then use the side of a knife to smash into a paste. Transfer to a large bowl. Add tahini and 1 cup warm water. Whisk until smooth. Add parsley, lemon juice, oil, and cayenne and whisk to combine.",
            "For the Creamy Tahini Dip with Avocado: Combine avocado, yogurt, lemon juice, salt, cumin, and 1/2 cup Creamy Tahini Sauce in a large bowl, then mash with a fork until smooth. For a smoother texture, purée in a blender.",
            "Combine avocado, yogurt, lemon juice, salt, cumin, and 1/2 cup Creamy Tahini Sauce in a large bowl, then mash with a fork until smooth. For a smoother texture, purée in a blender.",
            "For the Creamy Tahini Dressing with Cucumber and Dill: Purée cucumber, buttermilk, sour cream, lemon juice, salt, and 1/2 cup Creamy Tahini Sauce in a blender until smooth. Add dill and pulse a few more times to combine.",
            "Purée cucumber, buttermilk, sour cream, lemon juice, salt, and 1/2 cup Creamy Tahini Sauce in a blender until smooth. Add dill and pulse a few more times to combine.",
            "Do Ahead Creamy Tahini Sauce can be stored in an airtight container and chilled for up to 7 days.",
            "Creamy Tahini Sauce can be stored in an airtight container and chilled for up to 7 days."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5579abfa74cbe9ed7c20a7fb/6:4/w_274%2Ch_169/EP_06092015_creamy_threedishes_6x4.jpg"
    }
}