{
    "recipe": {
        "title": "Cream Cheese Flan with Quince Compote ",
        "ingredients": [
            "1/2 cup sugar",
            "2 sticks cinnamon",
            "3 large quinces (about 1 3/4 pounds), peeled, cored, and cut into 1/2-inch cubes",
            "1 1/2 cups sugar",
            "8 ounces cream cheese, softened",
            "2 tablespoons vanilla extract",
            "1/4 teaspoon kosher salt",
            "6 large eggs",
            "1 1/2 cups heavy cream",
            "1 (14-ounce) can sweetened condensed milk",
            "10- by 2-inch round cake pan, large roasting pan"
        ],
        "instructions": [
            "In large saucepan over high heat, combine 4 cups water, sugar, and cinnamon sticks, stirring until sugar dissolves. Bring to boil, then add quince, reduce heat to moderate, and simmer, uncovered, stirring occasionally, until tender, about 45 minutes. Refrigerate quince (in poaching liquid) until cool. (Compote can be made up to 3 days ahead and refrigerated.)",
            "Make flan: In large heavy saucepan over moderately high heat, stir together 1 cup sugar and 1/4 cup water. Cook, occasionally stirring gently with wooden spoon or rubber spatula, until sugar melts and caramel turns dark amber. Working quickly and carefully, immediately pour hot caramel into cake pan, tilting to cover bottom and halfway up sides of pan. Let cool. Preheat oven to 325°F. In large bowl, using electric mixer, beat together cream cheese, remaining 1/2 cup sugar, vanilla, and salt until smooth and very creamy, about 3 minutes. Add eggs, cream, and condensed milk and beat until smooth, about 2 minutes more. Pour mixture into prepared cake pan. Transfer pan to large roasting pan and fill roasting pan with enough hot water to come halfway up sides of cake pan. Cover roasting pan loosely with foil and pierce foil several times with fork. Transfer roasting pan to oven and bake 1 hour. Remove foil and continue to bake until edge of flan is set but center jiggles slightly when gently shaken, about 1 hour more. Remove cake pan from water and cool flan in pan on rack, then transfer to refrigerator to chill overnight. When ready to serve, run thin knife around inside edge of pan to loosen flan. Shake pan gently from side to side and, when flan moves freely in pan, invert large plate over pan. Holding pan and plate securely together, quickly invert and turn out flan onto plate. (Caramel will pour out over and around flan.) Serve with quince compote.",
            "In large heavy saucepan over moderately high heat, stir together 1 cup sugar and 1/4 cup water. Cook, occasionally stirring gently with wooden spoon or rubber spatula, until sugar melts and caramel turns dark amber. Working quickly and carefully, immediately pour hot caramel into cake pan, tilting to cover bottom and halfway up sides of pan. Let cool.",
            "Preheat oven to 325°F.",
            "In large bowl, using electric mixer, beat together cream cheese, remaining 1/2 cup sugar, vanilla, and salt until smooth and very creamy, about 3 minutes. Add eggs, cream, and condensed milk and beat until smooth, about 2 minutes more. Pour mixture into prepared cake pan.",
            "Transfer pan to large roasting pan and fill roasting pan with enough hot water to come halfway up sides of cake pan. Cover roasting pan loosely with foil and pierce foil several times with fork.",
            "Transfer roasting pan to oven and bake 1 hour. Remove foil and continue to bake until edge of flan is set but center jiggles slightly when gently shaken, about 1 hour more. Remove cake pan from water and cool flan in pan on rack, then transfer to refrigerator to chill overnight.",
            "When ready to serve, run thin knife around inside edge of pan to loosen flan. Shake pan gently from side to side and, when flan moves freely in pan, invert large plate over pan. Holding pan and plate securely together, quickly invert and turn out flan onto plate. (Caramel will pour out over and around flan.) Serve with quince compote."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a76f9a84192308a1c7c/6:4/w_274%2Ch_169/240464_hires.jpg",
        "color": 117294
    }
}