{
    "recipe": {
        "title": "Creamy Chinese Celery Soup ",
        "ingredients": [
            "1 medium leek (white and pale green parts only), chopped",
            "1 medium russet (baking) potato",
            "1/2 cup chopped shallot",
            "2 tablespoons unsalted butter",
            "1 tablespoon olive oil",
            "2 bunches Chinese celery (1 1/2 lb total), top leaves discarded and stalks cut into 2-inch pieces",
            "1/2 cup dry white wine",
            "4 cups chicken stock or low-sodium chicken broth (32 fl oz)",
            "1/2 cup heavy cream",
            "1/2 teaspoon salt",
            "1/4 teaspoon black pepper",
            "6 (1/4-inch-thick) diagonal baguette slices",
            "1/4 cup extra-virgin olive oil",
            "Kosher salt to taste",
            "Garnish: fresh Chinese parsley leaves or flat-leaf parsley leaves"
        ],
        "instructions": [
            "Wash leek well in a bowl of cold water, then lift out and drain well. Peel and chop potato. Cook shallot in butter and oil in a 3-quart heavy saucepan over moderate heat, stirring, until softened, about 2 minutes. Add leek and cook, stirring, until softened, about 5 minutes. Add celery and potato and cook, stirring, 2 minutes. Add wine and boil 1 minute. Add broth and simmer, covered, until celery is very tender, about 1 hour.",
            "Purée soup in batches in a blender until very smooth (use caution when blending hot liquids), then pour through a large medium-mesh sieve into a bowl, pressing hard on solids. Discard solids. Transfer soup to cleaned saucepan, then stir in cream, salt, and pepper and heat over low heat until hot. Thin with water if desired.",
            "Make croutons while soup simmers: Preheat oven to 350°F. Brush baguette slices with oil and season generously with kosher salt and pepper. Arrange in 1 layer on a baking sheet, then bake in middle of oven until golden brown and crisp, 12 to 15 minutes.",
            "Preheat oven to 350°F.",
            "Brush baguette slices with oil and season generously with kosher salt and pepper. Arrange in 1 layer on a baking sheet, then bake in middle of oven until golden brown and crisp, 12 to 15 minutes.",
            "Serve soup topped with croutons.",
            "Serve soup topped with croutons."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df8777b55306961bfe711/6:4/w_274%2Ch_169/107735.jpg",
        "color": 916857
    }
}