{
    "recipe": {
        "title": "Creamed Turnips ",
        "ingredients": [
            "3 pounds medium turnips (about 9)",
            "4 shallots",
            "4 cups milk",
            "1/2 cup heavy cream",
            "3 tablespoons unsalted butter",
            "1 tablespoon fresh thyme leaves or 1/2 teaspoon dried thyme, crumbled",
            "3/4 teaspoon salt",
            "6 black peppercorns",
            "6 whole cloves",
            "2 bay leaves",
            "3 tablespoons all-purpose flour",
            "white pepper",
            "freshly grated nutmeg",
            "Garnish: chopped fresh parsley leaves"
        ],
        "instructions": [
            "Peel and quarter turnips. In a large saucepan of boiling salted water cook turnips until tender, 15 to 20 minutes, and drain in a colander. Chop shallots. In a heavy saucepan bring milk and cream just to a simmer and keep hot over low heat. In a 4-quart heavy kettle cook shallots in butter over moderately low heat, stirring, until softened. Add thyme, salt, peppercorns, cloves, and bay leaves and cook, stirring, 1 minute. Add flour and cook roux, stirring, 3 minutes. Whisk in hot milk mixture all at once and bring to a boil over moderately high heat, whisking constantly to prevent lumps. Reduce heat to moderately low and simmer sauce, whisking occasionally, 15 minutes. Pour sauce through a sieve into a large heavy saucepan and discard solids. Into sauce stir white pepper, nutmeg, and salt to taste. Turnips and sauce may be made up to this point 1 day ahead and kept separately in bowls, covered and chilled. Return sauce to a simmer and add turnips. Cook mixture, covered, over moderately low heat, stirring occasionally, until turnips are heated through.",
            "Peel and quarter turnips. In a large saucepan of boiling salted water cook turnips until tender, 15 to 20 minutes, and drain in a colander. Chop shallots.",
            "In a heavy saucepan bring milk and cream just to a simmer and keep hot over low heat. In a 4-quart heavy kettle cook shallots in butter over moderately low heat, stirring, until softened. Add thyme, salt, peppercorns, cloves, and bay leaves and cook, stirring, 1 minute. Add flour and cook roux, stirring, 3 minutes. Whisk in hot milk mixture all at once and bring to a boil over moderately high heat, whisking constantly to prevent lumps. Reduce heat to moderately low and simmer sauce, whisking occasionally, 15 minutes. Pour sauce through a sieve into a large heavy saucepan and discard solids. Into sauce stir white pepper, nutmeg, and salt to taste. Turnips and sauce may be made up to this point 1 day ahead and kept separately in bowls, covered and chilled.",
            "Return sauce to a simmer and add turnips. Cook mixture, covered, over moderately low heat, stirring occasionally, until turnips are heated through.",
            "Garnish turnips with parsley.",
            "Garnish turnips with parsley."
        ],
        "picture_link": null
    }
}