{
    "recipe": {
        "title": "Creamy One-Pot Pasta with Sausage and Squash ",
        "ingredients": [
            "3 Tbsp. extra-virgin olive oil",
            "12 oz. Italian sausage (about 3 links), casings removed",
            "1 Tbsp. all-purpose flour",
            "2 cups milk",
            "1 cup heavy cream",
            "1 1/2 cups finely grated Parmesan, divided",
            "1/2 large butternut squash (about 1 lb.), peeled, seeded, chopped into 1/2\" pieces",
            "1/2 lb. fusilli",
            "1 garlic clove, finely grated",
            "1 sprig sage",
            "2 1/2 tsp. kosher salt",
            "1/4 tsp. freshly grated nutmeg",
            "Freshly ground black pepper"
        ],
        "instructions": [
            "Heat oil in a medium heavy pot over medium-high. Cook sausage, breaking up into about 1\" pieces with a wooden spoon, until well browned, 5–7 minutes. Add flour and cook, stirring constantly, until evenly distributed, about 1 minute. Combine milk, cream, and 2 cups water in a large bowl or glass measuring cup. Stirring sausage mixture constantly, slowly stream in milk mixture; bring to a simmer. Add 1 1/4 cups Parmesan and cook, stirring constantly, until cheese is melted. Add squash, pasta, garlic, sage, salt, and nutmeg and toss to combine, making sure pasta is covered with liquid. Bring to a boil, then reduce heat to low and bring to a bare simmer. Cook, stirring occasionally, until pasta is cooked through, squash is beginning to break down, and sauce is reduced and glossy, about 20 minutes. Pluck out and discard sage. Transfer pasta to a platter. Top with remaining 1/4 cup Parmesan and a few cranks of pepper.",
            "Heat oil in a medium heavy pot over medium-high. Cook sausage, breaking up into about 1\" pieces with a wooden spoon, until well browned, 5–7 minutes. Add flour and cook, stirring constantly, until evenly distributed, about 1 minute.",
            "Combine milk, cream, and 2 cups water in a large bowl or glass measuring cup. Stirring sausage mixture constantly, slowly stream in milk mixture; bring to a simmer. Add 1 1/4 cups Parmesan and cook, stirring constantly, until cheese is melted. Add squash, pasta, garlic, sage, salt, and nutmeg and toss to combine, making sure pasta is covered with liquid. Bring to a boil, then reduce heat to low and bring to a bare simmer. Cook, stirring occasionally, until pasta is cooked through, squash is beginning to break down, and sauce is reduced and glossy, about 20 minutes.",
            "Pluck out and discard sage. Transfer pasta to a platter. Top with remaining 1/4 cup Parmesan and a few cranks of pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c4204d2b71f4e481cb4c05e/6:4/w_274%2Ch_169/Small-Plates-No-Boil-Baked-Pasta-inset-in-pot-11012019.jpg"
    }
}