{
    "recipe": {
        "title": "Creamy Potato and Leek Gratin ",
        "ingredients": [
            "9 medium leeks ( about 3 lb; white and pale green parts only)",
            "3 Tbsp unsalted butter",
            "2 lb russet (baking) potatoes",
            "1 1/2 cups heavy cream",
            "1 cup whole milk",
            "2 tsp thyme leaves",
            "An adjustable-blade slicer"
        ],
        "instructions": [
            "Preheat oven to 400°F with rack in middle. Generously butter a 3-qt shallow baking dish. Cut a round of parchment paper to fit just inside a 12-inch heavy skillet, then set parchment aside. Halve leeks lengthwise, then cut crosswise into 1 1/2-inch pieces (you should have about 8 cups). Wash leeks. Cook leeks in butter with 1/2 tsp salt and 1/4 tsp pepper, covered with parchment round, in skillet over medium heat, stirring occasionally, until tender, 10 to 12 minutes. Meanwhile, peel potatoes and slice crosswise 1/16 inch thick with slicer. Transfer to a large heavy pot with cream, milk, thyme, 1 tsp salt, and 1/2 tsp pepper and bring to a boil over medium heat, stirring occasionally (liquid will thicken). Stir in leeks, then transfer to baking dish. Bake, uncovered, until potatoes are tender, 45 minutes to 1 hour. Let stand 10 minutes before serving.",
            "Preheat oven to 400°F with rack in middle. Generously butter a 3-qt shallow baking dish. Cut a round of parchment paper to fit just inside a 12-inch heavy skillet, then set parchment aside.",
            "Halve leeks lengthwise, then cut crosswise into 1 1/2-inch pieces (you should have about 8 cups). Wash leeks.",
            "Cook leeks in butter with 1/2 tsp salt and 1/4 tsp pepper, covered with parchment round, in skillet over medium heat, stirring occasionally, until tender, 10 to 12 minutes.",
            "Meanwhile, peel potatoes and slice crosswise 1/16 inch thick with slicer. Transfer to a large heavy pot with cream, milk, thyme, 1 tsp salt, and 1/2 tsp pepper and bring to a boil over medium heat, stirring occasionally (liquid will thicken). Stir in leeks, then transfer to baking dish.",
            "Bake, uncovered, until potatoes are tender, 45 minutes to 1 hour. Let stand 10 minutes before serving.",
            "Do Ahead Gratin can be baked 2 days ahead and chilled. Let stand at room temperature 30 minutes, then reheat, covered, in a 350°F oven until hot, about 30 minutes.",
            "Gratin can be baked 2 days ahead and chilled. Let stand at room temperature 30 minutes, then reheat, covered, in a 350°F oven until hot, about 30 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c09992d0899e22c8f5b4990/6:4/w_274%2Ch_169/Gourmet-Christmas-Creamy-Potato-and-leek-Gratin-Recipe-13112018.jpg"
    }
}