{
    "recipe": {
        "title": "Creamy White Onion Soup ",
        "ingredients": [
            "2 shallots, thinly sliced into rounds",
            "1/4 cup apple cider vinegar",
            "1/4 cup white wine vinegar",
            "1/4 cup sugar",
            "1 tablespoon olive oil",
            "1 medium red onion, thinly sliced",
            "Kosher salt",
            "1/2 cup red wine",
            "1/4 cup red wine vinegar",
            "1 tablespoon sugar",
            "1/4 cinnamon stick",
            "1/2 star anise pod",
            "1/8 teaspoon crushed red pepper flakes",
            "1/8 teaspoon ground allspice",
            "1/4 cup olive oil",
            "4 large white onions, thinly sliced",
            "1 leek, white and pale-green parts only, thinly sliced",
            "2 celery stalks, chopped",
            "4 garlic cloves",
            "1 serrano chile, seeded, chopped",
            "2 tablespoons chopped peeled ginger",
            "Kosher salt",
            "1/2 cup dry white wine",
            "1/2 cup mirin",
            "1 cup heavy cream",
            "2 tablespoons unsalted butter",
            "2 slices brioche, quartered",
            "4 ounces Fontina cheese, grated",
            "1 tablespoon chopped fresh chives"
        ],
        "instructions": [
            "Place shallots in a small nonreactive bowl. Bring vinegars, sugar, and 1 cup water to a boil in a small saucepan, stirring to dissolve sugar. Pour over shallots; chill.",
            "DO AHEAD: Shallots can be pickled 5 days ahead. Cover and keep chilled.",
            "For red onion jam: Heat oil in a medium skillet over medium-high heat. Add onion, season with salt, and cook, stirring often, until soft, 5-7 minutes. Add wine, vinegar, sugar, cinnamon, star anise, red pepper flakes, and allspice. Bring to a boil, reduce heat, and simmer, stirring occasionally, until liquid is thickened and syrupy, 40-45 minutes. DO AHEAD: Jam can be made 5 days ahead. Cover and chill.",
            "Heat oil in a medium skillet over medium-high heat. Add onion, season with salt, and cook, stirring often, until soft, 5-7 minutes. Add wine, vinegar, sugar, cinnamon, star anise, red pepper flakes, and allspice. Bring to a boil, reduce heat, and simmer, stirring occasionally, until liquid is thickened and syrupy, 40-45 minutes.",
            "DO AHEAD: Jam can be made 5 days ahead. Cover and chill.",
            "For white onion soup: Heat oil in a large pot over medium-high heat. Add onions, leek, celery, garlic, chile, and ginger; season with salt. Cook, stirring often, until soft (do not let brown), 10-12 minutes. Add wine and mirin to pot, bring to a boil, and cook until reduced by half, about 4 minutes. Reduce heat to medium, cover, and cook, stirring occasionally, until onions are soft and translucent, 25-30 minutes. Let cool slightly, then purée in a blender until smooth. Strain into a large bowl and stir in cream (thin with water, if needed); season with salt. Reheat soup in a clean pot. DO AHEAD: Soup can be made 2 days ahead. Let cool; cover and chill.",
            "Heat oil in a large pot over medium-high heat. Add onions, leek, celery, garlic, chile, and ginger; season with salt. Cook, stirring often, until soft (do not let brown), 10-12 minutes.",
            "Add wine and mirin to pot, bring to a boil, and cook until reduced by half, about 4 minutes. Reduce heat to medium, cover, and cook, stirring occasionally, until onions are soft and translucent, 25-30 minutes. Let cool slightly, then purée in a blender until smooth. Strain into a large bowl and stir in cream (thin with water, if needed); season with salt. Reheat soup in a clean pot.",
            "DO AHEAD: Soup can be made 2 days ahead. Let cool; cover and chill.",
            "For fontina toast and assembly: Heat butter in a large skillet over medium heat. Cook bread until golden, about 3 minutes (you'll have 2 extra). Flip, top with cheese, cover, and cook until cheese is melted, about 4 minutes. Top toasts with pickled shallots and chives. Spoon some jam into each bowl, pour soup around, and top with toasts.",
            "Heat butter in a large skillet over medium heat. Cook bread until golden, about 3 minutes (you'll have 2 extra). Flip, top with cheese, cover, and cook until cheese is melted, about 4 minutes. Top toasts with pickled shallots and chives.",
            "Spoon some jam into each bowl, pour soup around, and top with toasts."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad74756529d92b2c04771a/6:4/w_274%2Ch_169/51187190_onion-soup_1x1.jpg"
    }
}