{
    "recipe": {
        "title": "Creamy Soft Polenta with Meat Ragù ",
        "ingredients": [
            "3/4 pound dried porcini mushrooms, roughly chopped",
            "1 cup dry white wine",
            "2 cups olive oil",
            "1 pound bulk hot Italian sausage",
            "1 pound pork butt, cut into 1-inch pieces",
            "1 pound beef chuck, cut into 1-inch pieces",
            "Kosher salt and cracked black pepper",
            "1/2 pound Spanish onions, cut into 1-inch dice",
            "1 1/2 tablespoons minced garlic",
            "2 cups chicken stock",
            "Two 14-ounce cans Italian plum tomatoes, roughly chopped, juice reserved",
            "1/2 cup roughly chopped fresh basil",
            "1 tablespoon dried oregano",
            "1 teaspoon freshly ground fennel seed",
            "1 bay leaf",
            "2 cups chicken stock or water",
            "2 cups heavy cream",
            "1 cup yellow polenta or cornmeal",
            "1/2 cup freshly grated Parmigiano-Reggiano cheese, plus more for serving",
            "2 tablespoons unsalted butter",
            "Torn fresh basil",
            "Chopped fresh flat-leaf parsley"
        ],
        "instructions": [
            "1. To make the ragu: Put the mushrooms in a small bowl and pour the wine over them. Set aside to soak and hydrate for 20 to 30 minutes. Drain, reserving both the mushrooms and the wine. Strain the wine through a fine-mesh sieve or chinois.",
            "2. In a large, heavy saucepan, heat the olive oil over medium-high heat. Add the sausage and cook, breaking it into pieces with a wooden spoon, for about 5 minutes, until lightly browned and much of the fat is rendered. Using a slotted spoon, lift the sausage from the pan and set aside. Add the pork and beef to the fat in the pan and cook for about 10 minutes, until browned. Season with salt and pepper. Using a slotted spoon, lift the meat from the pan and add it to the sausage. Leave the fat in the pan.",
            "3. Add the onions and garlic to the pan and sauté for 2 to 3 minutes, or until lightly browned. Add the reserved wine, bring to a boil, reduce the heat, and simmer briskly for about 3 minutes or until reduced by half.",
            "4. Return the meat to the pan, season again with salt and pepper, and add the stock, tomatoes, basil, oregano, fennel, bay leaf, and reserved mushrooms. Simmer gently for approximately 1 hour, or until the meat is tender. Skim any fat that rises to the top of the pan during cooking. Cover to keep warm and set aside.",
            "5. To make the polenta: Put the stock and the cream in a saucepan over medium-high heat and bring to a boil. Slowly pour the polenta into the hot liquid, whisking briskly to prevent clumping. Reduce the heat to low and cook, whisking constantly, for about 10 minutes, or until the liquid is absorbed.",
            "6. Add the cheese and butter, stirring gently until incorporated.",
            "7. Spoon a mound of soft polenta on each of 4 or 6 plates or shallow bowls. Ladle the ragu over the polenta and garnish with basil, parsley, and grated Parmesan."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9ac8f9a84192308a1d50/6:4/w_274%2Ch_169/241043_hires.jpg",
        "color": 3387348
    }
}