{
    "recipe": {
        "title": "Creamed Corn with Garam Masala Butter ",
        "ingredients": [
            "1 tablespoon cumin seeds",
            "1 tablespoon coriander seeds",
            "2 1/4 teaspoons whole black peppercorns",
            "1/4 teaspoon (heaping) whole cloves",
            "1 bay leaf",
            "1 1/4 teaspoons ground cardamom",
            "3/4 teaspoon ground cinnamon",
            "1/8 teaspoon ground mace",
            "10 large ears of corn, husked",
            "8 tablespoons (1 stick) unsalted butter, divided",
            "1/2 cup finely chopped onion",
            "3 garlic cloves, minced",
            "1 teaspoon kosher salt plus more",
            "A spice mill"
        ],
        "instructions": [
            "Toast cumin and coriander seeds, peppercorns, and cloves in a small skillet over medium heat, stirring constantly, until aromatic, about 2 minutes. Let cool. Transfer to spice mill. Crumble bay leaf and add to mill. Finely grind and transfer to a container. Stir in cardamom, cinnamon, and mace; cover.",
            "For creamed corn: Cut kernels from cobs into a large bowl (you should have about 8 cups). Scrape cobs with the back of a large knife to release juices into bowl. Combine half of kernels with juices (4 cups) and 1/2 cup water in a blender; purée until smooth. Melt 2 tablespoons butter in a large saucepan over low heat. Stir in onion, garlic, and 1 teaspoon salt. Cover and cook, stirring often and adding water by tablespoonfuls if dry, until onion is soft and translucent (do not brown), about 10 minutes. Add puréed corn and remaining corn kernels and cook, stirring constantly, until corn is tender, about 10 minutes. Stir in 2 tablespoons butter. Season with salt. Spoon into a large wide bowl. Heat remaining 4 tablespoons butter in a small saucepan over medium heat. Add 1 1/2 tablespoons garam masala and a pinch of salt. Whisk until fragrant, about 15 seconds. Drizzle over creamed corn.",
            "Cut kernels from cobs into a large bowl (you should have about 8 cups). Scrape cobs with the back of a large knife to release juices into bowl. Combine half of kernels with juices (4 cups) and 1/2 cup water in a blender; purée until smooth.",
            "Melt 2 tablespoons butter in a large saucepan over low heat. Stir in onion, garlic, and 1 teaspoon salt. Cover and cook, stirring often and adding water by tablespoonfuls if dry, until onion is soft and translucent (do not brown), about 10 minutes. Add puréed corn and remaining corn kernels and cook, stirring constantly, until corn is tender, about 10 minutes. Stir in 2 tablespoons butter. Season with salt. Spoon into a large wide bowl.",
            "Heat remaining 4 tablespoons butter in a small saucepan over medium heat. Add 1 1/2 tablespoons garam masala and a pinch of salt. Whisk until fragrant, about 15 seconds. Drizzle over creamed corn."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b09a7c1cc76a014cfac402/6:4/w_274%2Ch_169/51108360_creamed-corn_1x1.jpg"
    }
}