{
    "recipe": {
        "title": "Crisp Cocoa-Pecan Cookies ",
        "ingredients": [
            "1 1/3 cups all purpose flour",
            "3 tablespoons natural unsweetened cocoa powder (scooped into measuring spoon, then leveled)",
            "1/2 teaspoon baking soda",
            "10 tablespoons (1 1/4 sticks) unsalted butter, melted, cooled",
            "1/3 cup (packed) golden brown sugar",
            "1/3 cup sugar",
            "2 tablespoons plus 2 teaspoons light corn syrup",
            "2 tablespoons whole milk",
            "1 teaspoon vanilla extract",
            "1 cup chopped pecans or walnuts",
            "1/2 cup bittersweet chocolate chips"
        ],
        "instructions": [
            "Whisk flour, cocoa, baking soda, and 1/2 teaspoon (generous) salt in medium bowl. Stir butter and next 5 ingredients in another medium bowl until smooth. Stir in flour mixture, then nuts. Cover and chill until firm enough to scoop, at least 4 hours. DO AHEAD: Can be made 1 day ahead. Keep chilled.",
            "Position 1 rack in top third and 1 rack in bottom third of oven; preheat to 325°F. Line 3 large baking sheets with parchment. Measure 2 level tablespoonfuls dough; roll between palms into ball. Place on prepared sheet. Using fingers, spread out dough to 3-inch-diameter disk. Repeat with remaining dough, spacing 5 inches apart.",
            "Bake cookies 8 minutes; reverse sheets. Bake cookies until flat and beginning to darken around edges, about 10 minutes. Transfer cookies on parchment to rack (cookies will crisp as they cool). DO AHEAD: Can be made 4 days ahead. Store airtight at room temperature.",
            "Place rack inside rimmed baking sheet. Place chocolate chips in small microwave- safe bowl. Heat chips in microwave in 15-second intervals until smooth, stirring occasionally. Place cookies on rack. Drizzle melted chocolate over cookies. Let stand until chocolate sets, about 30 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b424ae2413537c0d45cb9c/6:4/w_274%2Ch_169/363726_cocoa-pecan-cookies_1x1.jpg",
        "color": 12341866
    }
}