{
    "recipe": {
        "title": "Crisp Pork Medallions with Creamy Caper Sauce ",
        "ingredients": [
            "2/3 cup plain yogurt (6 ounces; preferably whole-milk)",
            "3 tablespoons mayonnaise",
            "2 tablespoons drained bottled capers, finely chopped",
            "1 tablespoon finely chopped fresh flat-leaf parsley",
            "1/8 teaspoon black pepper",
            "1 1/2 to 1 3/4 lb pork tenderloin",
            "3/4 cup all-purpose flour",
            "1 teaspoon salt",
            "1/4 teaspoon black pepper",
            "2 large eggs",
            "1 cup fine dry bread crumbs",
            "About 1 cup vegetable oil for panfrying",
            "Accompaniment: lemon wedges; watercress or other baby greens",
            "an instant-read thermometer"
        ],
        "instructions": [
            "Stir together all sauce ingredients in a bowl until combined, then chill, covered, until ready to use.",
            "Cook pork: Put oven rack in middle position and preheat oven to 350°F. Cut pork crosswise into 1 1/4-inch-thick slices (medallions). Whisk together flour, salt, and pepper in a shallow bowl. Whisk together eggs with a pinch of salt in another shallow bowl and put bread crumbs in a third shallow bowl. Working with 1 medallion at a time, dredge medallions in flour, shaking off excess, and dip in egg, letting excess drip off, then coat with crumbs, pressing to help them adhere. Arrange pork in 1 layer on a baking sheet. Heat 1/4 inch oil in a 12-inch heavy skillet over moderate heat until hot but not smoking, then panfry medallions, turning over once, until golden brown, 6 to 8 minutes total. Transfer to a clean baking sheet and roast in oven until thermometer inserted horizontally into center of meat registers 145 to 150°F, 6 to 7 minutes.",
            "Put oven rack in middle position and preheat oven to 350°F.",
            "Cut pork crosswise into 1 1/4-inch-thick slices (medallions).",
            "Whisk together flour, salt, and pepper in a shallow bowl.",
            "Whisk together eggs with a pinch of salt in another shallow bowl and put bread crumbs in a third shallow bowl.",
            "Working with 1 medallion at a time, dredge medallions in flour, shaking off excess, and dip in egg, letting excess drip off, then coat with crumbs, pressing to help them adhere. Arrange pork in 1 layer on a baking sheet.",
            "Heat 1/4 inch oil in a 12-inch heavy skillet over moderate heat until hot but not smoking, then panfry medallions, turning over once, until golden brown, 6 to 8 minutes total. Transfer to a clean baking sheet and roast in oven until thermometer inserted horizontally into center of meat registers 145 to 150°F, 6 to 7 minutes.",
            "Serve pork with sauce, lemon wedges, and watercress.",
            "Serve pork with sauce, lemon wedges, and watercress."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d99667b55306961bf75e5/6:4/w_274%2Ch_169/237595.jpg"
    }
}