{
    "recipe": {
        "title": "Crispy Onion Rings ",
        "ingredients": [
            "1 large sweet, vidalia or maui onion",
            "3/4 cup buttermilk",
            "2 teaspoons salt, divided",
            "1 1/2 cup plain breadcrumbs (i used whole wheat)",
            "Canola oil spray"
        ],
        "instructions": [
            "Preheat oven to 425 degrees. Cut onions into 1/2 inch rounds and separate into rings. Whisk buttermilk and 1 tsp salt into a bowl. Place breadcrumbs in a separate bowl and add another tsp salt. Dip onion rings in buttermilk mixture and then dredge in breadcrumb mixture covering both sides of the onion completely (make sure to use one hand for wet dipping and one hand for dry dipping so you don't get soggy, clumpy breadcrumbs and messy fingers). Place onion rings on a oil sprayed baking sheet (I lined the cookie sheet with foil for easier clean up). Lightly spray the onion rings with oil cooking spray. Bake for 20-25 minutes, turning once halfway through, until lightly browned. Serve.",
            "Preheat oven to 425 degrees.",
            "Cut onions into 1/2 inch rounds and separate into rings.",
            "Whisk buttermilk and 1 tsp salt into a bowl.",
            "Place breadcrumbs in a separate bowl and add another tsp salt.",
            "Dip onion rings in buttermilk mixture and then dredge in breadcrumb mixture covering both sides of the onion completely (make sure to use one hand for wet dipping and one hand for dry dipping so you don't get soggy, clumpy breadcrumbs and messy fingers).",
            "Place onion rings on a oil sprayed baking sheet (I lined the cookie sheet with foil for easier clean up).",
            "Lightly spray the onion rings with oil cooking spray.",
            "Bake for 20-25 minutes, turning once halfway through, until lightly browned.",
            "Serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54cadb22c252103035d3aeb9/6:4/w_274%2Ch_169/51262850_crispy-onion-rings_1x1.jpg"
    }
}