{
    "recipe": {
        "title": "Crispy Whole Wheat Graham Crackers ",
        "ingredients": [
            "3/4 cup (5 1/2 ounces) sugar",
            "1 1/2 teaspoons baking soda",
            "1/2 teaspoon Diamond Crystal kosher salt (half as much if iodized)",
            "1/4 teaspoon ground cinnamon",
            "1 tablespoon vanilla extract",
            "1/4 cup (3 ounces) golden syrup, such as Lyle’s, sorghum, unsulfured molasses (not blackstrap), or honey",
            "1 1/2 sticks (6 ounces) unsalted butter, solid but creamy—about 70°F",
            "2 1/2 cups (12 ounces) whole wheat flour (not stone-ground or white whole wheat), plus more for dusting"
        ],
        "instructions": [
            "Combine sugar, baking soda, salt, cinnamon, vanilla, golden syrup, and butter in the bowl of a stand mixer fitted with a paddle attachment. Mix on low speed to moisten, then increase to medium and beat until somewhat light, about 3 minutes. Reduce speed to low, add whole wheat flour, and mix to form a soft dough.",
            "Scrape dough onto a work surface and knead gently to form a ball. Divide in half. Use immediately or wrap in plastic and refrigerate for up to 1 week; soften for 30 minutes at room temperature, then knead on a bare work surface until pliable and smooth.",
            "Roll and bake the dough: Adjust oven rack to middle position and preheat to 350°F. Generously flour a large sheet of parchment and place one portion of dough in the center. Pat into a 5-by-6-inch rectangle, sprinkle with flour, flip, and dust again. Working from the center out and adding more flour as needed, roll the dough until roughly 15-by-11 inches and very thin. Slide onto an aluminum baking sheet and brush away excess flour. Repeat with remaining dough. For grocery store look-alikes, score each sheet of dough into twelve 2 1/4-by-4 3/4-inch rectangles and dock with a bamboo skewer or the narrow end of a chopstick (a strictly cosmetic procedure). Otherwise, leave the dough uncut. Bake until crackers are tawny brown and firm, though your fingertip may leave a faint indentation, about 20 minutes. Immediately cut along the pre-scored lines with a knife, or cut into free-form shapes using a pizza wheel. Cool to room temperature directly on the baking sheets. Enjoy scrap pieces as a snack, or pulverize into crumbs. The grahams can be stored in an airtight container for up to 3 weeks at room temperature or frozen for up to 3 months.",
            "Adjust oven rack to middle position and preheat to 350°F. Generously flour a large sheet of parchment and place one portion of dough in the center. Pat into a 5-by-6-inch rectangle, sprinkle with flour, flip, and dust again. Working from the center out and adding more flour as needed, roll the dough until roughly 15-by-11 inches and very thin. Slide onto an aluminum baking sheet and brush away excess flour. Repeat with remaining dough.",
            "For grocery store look-alikes, score each sheet of dough into twelve 2 1/4-by-4 3/4-inch rectangles and dock with a bamboo skewer or the narrow end of a chopstick (a strictly cosmetic procedure). Otherwise, leave the dough uncut.",
            "Bake until crackers are tawny brown and firm, though your fingertip may leave a faint indentation, about 20 minutes. Immediately cut along the pre-scored lines with a knife, or cut into free-form shapes using a pizza wheel. Cool to room temperature directly on the baking sheets. Enjoy scrap pieces as a snack, or pulverize into crumbs. The grahams can be stored in an airtight container for up to 3 weeks at room temperature or frozen for up to 3 months.",
            "Mix it up! Chocolate: My mom used to sandwich chocolate graham crackers with peanut butter for an after-school snack, a combo I re-create by reducing the whole wheat flour to 10 ounces (21/4 cups), sifted with 1 ounce (1/3 cup) natural or Dutch-process cocoa powder. To retain their deep cocoa color, roll the dough in sifted cocoa powder. Serve with generous smears of peanut butter and a tall glass of milk. Cinnamon Sugar: We rarely had sugar-coated grahams in our pantry when I was a kid, but they were always at my best friend’s house, and seemed all the more special for their rarity. For the dough, increase the cinnamon to ½ teaspoon. Before docking, dust each sheet of dough with a half batch of Cinnamon Sugar (page 44), or any Sugar Sprinkle (page 46). Otherwise, dock and bake as directed. After the crackers cool, gently tap each against the baking sheet to knock off any excess sugar. Coconut (vegan): Replace the butter with 5 1/2 ounces (3/4 cup) virgin coconut oil (solid but creamy—about 70°F) and add 1 teaspoon pure coconut extract along with the vanilla. Gingerbread: This variation has all the spicy complexity of a Christmas cookie, with the unique flavor and crunch of a classic graham. Make the dough with sorghum or unsulfured molasses (not blackstrap) and increase the cinnamon to 1 teaspoon. Along with the sugar, add 1 tablespoon orange zest, 2 teaspoons ground ginger, 1/8 teaspoon ground cloves, and a few cracks of black pepper. Graham Cracker Crumb Crust: Combine 9 ounces (2 cups) finely ground graham cracker crumbs with 2 ounces (4 tablespoons) melted unsalted butter. Scatter into a 9-by-1 1/4-inch glass or ceramic pie plate and press into an even layer over the bottom and up the sides. Bake at 350°F until firm, about 18 minutes. Cool to room temperature for immediate use in your favorite recipe, or wrap tightly in plastic and refrigerate for up to 1 week. Gluten-Free: Replace the whole wheat flour with 6 ounces (11/4 cups) white rice flour, 4 ounces (1 cup plus 2 tablespoons) oat flour, and 1/2 ounce (1 tablespoon) kinako.",
            "Chocolate: My mom used to sandwich chocolate graham crackers with peanut butter for an after-school snack, a combo I re-create by reducing the whole wheat flour to 10 ounces (21/4 cups), sifted with 1 ounce (1/3 cup) natural or Dutch-process cocoa powder. To retain their deep cocoa color, roll the dough in sifted cocoa powder. Serve with generous smears of peanut butter and a tall glass of milk.",
            "Cinnamon Sugar: We rarely had sugar-coated grahams in our pantry when I was a kid, but they were always at my best friend’s house, and seemed all the more special for their rarity. For the dough, increase the cinnamon to ½ teaspoon. Before docking, dust each sheet of dough with a half batch of Cinnamon Sugar (page 44), or any Sugar Sprinkle (page 46). Otherwise, dock and bake as directed. After the crackers cool, gently tap each against the baking sheet to knock off any excess sugar.",
            "Coconut (vegan): Replace the butter with 5 1/2 ounces (3/4 cup) virgin coconut oil (solid but creamy—about 70°F) and add 1 teaspoon pure coconut extract along with the vanilla.",
            "Gingerbread: This variation has all the spicy complexity of a Christmas cookie, with the unique flavor and crunch of a classic graham. Make the dough with sorghum or unsulfured molasses (not blackstrap) and increase the cinnamon to 1 teaspoon. Along with the sugar, add 1 tablespoon orange zest, 2 teaspoons ground ginger, 1/8 teaspoon ground cloves, and a few cracks of black pepper.",
            "Graham Cracker Crumb Crust: Combine 9 ounces (2 cups) finely ground graham cracker crumbs with 2 ounces (4 tablespoons) melted unsalted butter. Scatter into a 9-by-1 1/4-inch glass or ceramic pie plate and press into an even layer over the bottom and up the sides. Bake at 350°F until firm, about 18 minutes. Cool to room temperature for immediate use in your favorite recipe, or wrap tightly in plastic and refrigerate for up to 1 week.",
            "Gluten-Free: Replace the whole wheat flour with 6 ounces (11/4 cups) white rice flour, 4 ounces (1 cup plus 2 tablespoons) oat flour, and 1/2 ounce (1 tablespoon) kinako."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a14b22712e91f623e761438/6:4/w_274%2Ch_169/whole-wheat-graham-crackers-recipe-112117.jpg",
        "color": 12958402
    }
}