{
    "recipe": {
        "title": "Crispy Scallop Salad ",
        "ingredients": [
            "1/2 cup cornstarch",
            "1/2 cup fine-grind yellow cornmeal",
            "2 tsp. Old Bay seasoning",
            "1/2 tsp. baking powder",
            "3 tsp. kosher salt, divided, plus more",
            "1 tsp. freshly ground black pepper",
            "2 large eggs",
            "1 lb. sea scallops (about 16), side muscle removed, patted dry",
            "Vegetable oil (for frying; about 2 cups)",
            "1/4 cup extra-virgin olive oil",
            "1/2 tsp. finely grated orange zest",
            "1/4 cup fresh orange juice",
            "2 Tbsp. white wine vinegar",
            "1 garlic clove, finely grated",
            "3 small or 2 large Belgian endive, root trimmed, leaves separated",
            "3 small or 2 large oranges, peel and pith removed, cut into segments",
            "1 avocado, sliced",
            "1/2 cup basil leaves"
        ],
        "instructions": [
            "Whisk cornstarch, cornmeal, Old Bay, baking powder, 1 tsp. salt, and 1/2 tsp. pepper in a medium bowl. Whisk eggs in another medium bowl. Season scallops with 1 tsp. salt, then use your hands to toss in cornmeal mixture until coated. Lift, shaking off excess cornmeal mixture, and transfer to egg mixture. Turn to coat, then lift, shaking off excess egg. Toss scallops to coat again in cornmeal mixture, then let them sit in mixture until ready to cook.",
            "Pour vegetable oil into a large heavy skillet to a depth of 1/4\". Heat over medium-high until it sizzles when a pinch of cornmeal is added. Working in batches if needed, cook scallops until just cooked through and coating is golden brown, 1–2 minutes per side. Transfer to paper towels to drain. Season with salt.",
            "Whisk olive oil, orange zest, orange juice, vinegar, garlic, and remaining 1 tsp. salt and 1/2 tsp. pepper in a large bowl. Add endive, oranges, avocado, and basil and use your hands to very gently toss to coat with dressing.",
            "Divide salad among plates. Arrange scallops on top of salad, then pour remaining dressing over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c61a910d843834ac1a6c9c7/6:4/w_274%2Ch_169/Crunchy-Scallops-on-a-Winter-Salad-recipe-30012019.jpg",
        "color": 11655840
    }
}