{
    "recipe": {
        "title": "Crispy Chicken Thighs With Bacon and Wilted Escarole ",
        "ingredients": [
            "4 large skin-on, bone-in chicken thighs (about 1 1/2 pounds total)",
            "Kosher salt, freshly ground pepper",
            "1 tablespoon vegetable oil",
            "4 slices bacon, coarsely chopped",
            "1 shallot, finely chopped",
            "1/2 teaspoon crushed red pepper flakes, plus more for serving",
            "1 head of escarole, torn into large pieces",
            "1 lemon, quartered"
        ],
        "instructions": [
            "Season chicken with salt and pepper. Heat oil in a large skillet over medium. Place chicken thighs, skin side down, in skillet and cook, pouring off excess fat from time to time, until skin is browned and crisp, 10–12 minutes. Turn chicken over and cook until cooked through, 8–10 minutes longer. Transfer thighs to a cutting board or large plate. Pour off fat from skillet (no need to wipe it out) and increase heat to medium-high. Cook bacon, stirring occasionally, until browned and crisp, about 5 minutes. Add shallot and 1/2 tsp. red pepper flakes and toss to coat. Add escarole in large handfuls, letting it wilt slightly before adding more. After the last handful goes in, remove pan from heat and toss greens to coat (some will be tender, some a little crunchier). Divide escarole among plates and top with chicken. Squeeze lemon over and top with more red pepper flakes.",
            "Season chicken with salt and pepper. Heat oil in a large skillet over medium. Place chicken thighs, skin side down, in skillet and cook, pouring off excess fat from time to time, until skin is browned and crisp, 10–12 minutes. Turn chicken over and cook until cooked through, 8–10 minutes longer. Transfer thighs to a cutting board or large plate.",
            "Pour off fat from skillet (no need to wipe it out) and increase heat to medium-high. Cook bacon, stirring occasionally, until browned and crisp, about 5 minutes. Add shallot and 1/2 tsp. red pepper flakes and toss to coat. Add escarole in large handfuls, letting it wilt slightly before adding more. After the last handful goes in, remove pan from heat and toss greens to coat (some will be tender, some a little crunchier).",
            "Divide escarole among plates and top with chicken. Squeeze lemon over and top with more red pepper flakes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/568abc2a2e3d7397230d88dc/6:4/w_274%2Ch_169/Crispy-Chicken-Thighs-With-Bacon.jpg"
    }
}