{
    "recipe": {
        "title": "Crispy Spring Rolls (Cha Gio) ",
        "ingredients": [
            "1 ounce dried bean thread noodles, soaked in hot water for 30 minutes, drained, and cut into 1/2-inch pieces with a scissors (about 2/3 cup)",
            "1 tablespoon dried tree ear mushrooms, soaked in hot water for 30 minutes, drained, and stems trimmed and chopped with a scissors",
            "2/3 cup finely minced yellow onion",
            "2 carrots, grated",
            "3 green onions, thinly sliced",
            "2 eggs",
            "2 tablespoons fish sauce",
            "1/2 tablespoon minced garlic",
            "1/4 teaspoon salt",
            "2 teaspoons sugar",
            "1/2 teaspoon ground black pepper",
            "1/2 pound ground chicken",
            "1/2 pound ground pork",
            "2 tablespoons cornstarch",
            "1/3 cup water",
            "15 thin spring roll wrappers such as Menlo brand",
            "Oil for frying",
            "Table Salad",
            "Vietnamese Dipping Sauce"
        ],
        "instructions": [
            "Combine the bean thread noodles, mushrooms, onion, carrots, and green onions in a mixing bowl. Set aside.",
            "Beat the eggs in a large bowl. Mix in the fish sauce, garlic, salt, sugar, and black pepper. Add the chicken and pork and using a fork, break up the meat, so it is thoroughly mixed with the seasonings. Add the noodle mixture and mix well. Set aside.",
            "Combine the cornstarch and water in a small saucepan. Bring to a boil over low heat and stir often to prevent sticking. If mixture seems too thick, add more water. This will be the \"glue\" to seal the edges of the wrapper.",
            "Cut the wrappers in half diagonally. You will have two equal triangles. Starting with the longest side toward you, place about 2 tablespoons of filling on the bottom area of the triangle. Using your fingers, mold the filling into a cylinder 2 inches long and 1 inch wide. Fold the two pointed ends of the wrapper in and roll to enclose. Dab a little cornstarch mixture along the edges (do not use too much \"glue\") and seal the roll. Set aside while you finish making the remaining rolls. Do not stack them.",
            "To fry, preheat a large wok or fry pan. When hot, pour enough oil in to completely cover the spring rolls. Heat to about 325 degrees. Carefully place the rolls into the oil. Do not crowd the pan or place the rolls on top of each other. Fry the spring rolls until filling is cooked, about 5 to 6 minutes on each side, turning often until they are nicely brown and crisp. If they brown too quickly, reduce the heat as the oil is too hot. Remove the cooked spring rolls from the pan and drain on paper towels. Serve immediately with dipping sauce and table salad .",
            "To enjoy a spring roll the Vietnamese way, put it on a lettuce leaf, top with cucumber and mint, and wrap it up. Then dip in Vietnamese dipping sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b6c5f6a4e722a4f20884ab6/6:4/w_274%2Ch_169/vietnamese-spring-rolls-recipe-080918.jpg",
        "color": 6675888
    }
}