{
    "recipe": {
        "title": "Crispy Brussels Sprouts With Chile Caramel ",
        "ingredients": [
            "1 tablespoon vegetable oil, plus more for frying (about 8 cups)",
            "1 small shallot, coarsely chopped",
            "6 garlic cloves, peeled",
            "1 red or green Thai chile, halved",
            "1 lemongrass stalk, tough outer layers removed, cut into 1\" pieces",
            "1 1\" piece ginger, peeled, thinly sliced into rounds 1/2 cup fish sauce",
            "1/2 cup sugar",
            "1 pound brussels sprouts, trimmed, quartered",
            "Lemon wedges (for serving)",
            "A deep-fry thermometer"
        ],
        "instructions": [
            "Heat 1 tablespoon oil in a medium skillet over medium-high. Add shallot, garlic, chile, lemongrass, and ginger and cook, stirring occasionally, until browned, 6–8 minutes. Stir in fish sauce, scraping up any brown bits. Stir in sugar and 1/2 cup water and bring to a boil; cook, stirring occasionally, until reduced by half, 12–15 minutes. Strain sauce into a medium bowl; discard solids. Let cool. Pour oil into a large heavy pot to come 3\" up sides. Fit pot with thermometer and heat oil over medium-high until thermometer registers 350°F. Working in batches, fry brussels sprouts until brown and crisp, about 3 minutes. Using a slotted spoon, transfer to paper towels to drain. Arrange brussels sprouts on a platter, drizzle with 1/4 cup sauce, and toss to coat, adding more sauce if needed. Serve with lemon wedges for squeezing over.",
            "Heat 1 tablespoon oil in a medium skillet over medium-high. Add shallot, garlic, chile, lemongrass, and ginger and cook, stirring occasionally, until browned, 6–8 minutes. Stir in fish sauce, scraping up any brown bits. Stir in sugar and 1/2 cup water and bring to a boil; cook, stirring occasionally, until reduced by half, 12–15 minutes. Strain sauce into a medium bowl; discard solids. Let cool.",
            "Pour oil into a large heavy pot to come 3\" up sides. Fit pot with thermometer and heat oil over medium-high until thermometer registers 350°F. Working in batches, fry brussels sprouts until brown and crisp, about 3 minutes. Using a slotted spoon, transfer to paper towels to drain.",
            "Arrange brussels sprouts on a platter, drizzle with 1/4 cup sauce, and toss to coat, adding more sauce if needed. Serve with lemon wedges for squeezing over."
        ],
        "picture_link": null
    }
}