{
    "recipe": {
        "title": "Crispy Chicken Thighs with Kale, Apricots, and Olives ",
        "ingredients": [
            "8 small bone-in, skin-on chicken thighs (about 2 pounds total)",
            "1 1/2 teaspoons kosher salt, divided",
            "1/2 teaspoon freshly ground black pepper",
            "2 tablespoons extra-virgin olive oil",
            "1 cup dried apricots, halved lengthwise",
            "1/4 cup white wine vinegar",
            "4 garlic cloves, thinly sliced",
            "2 bunches curly kale, stems removed, leaves torn into pieces",
            "1 cup mild green olives, such as Castelvetrano, crushed, pitted, torn in half",
            "1/4 teaspoon crushed red pepper flakes (optional)",
            "1/2 cup dry white wine"
        ],
        "instructions": [
            "Place a rack in top of oven; preheat to 400°F. Season chicken on both sides with 1 tsp. salt and 1/2 tsp. pepper. Pour oil into a large braising pan or deep-sided skillet. Arrange chicken skin side down in an even layer in cold pan, then place over medium heat and cook until skin is golden brown, 12–15 minutes. Transfer to a plate skin side up. Remove pan from heat, reserving fat.",
            "Meanwhile, combine apricots, vinegar, and 2 Tbsp. water in a small saucepan and cook over high heat, stirring occasionally, until liquid is boiling. Remove from heat.",
            "Stir garlic into hot fat remaining in pan. Working in batches, add kale and toss with tongs until all kale is coated and just beginning to wilt, about 3 minutes. (Make sure your kale is dry; otherwise, the fat will spatter.)",
            "Add apricot mixture, olives, red pepper, if using, and remaining 1/2 tsp. salt to kale mixture and toss to combine. Nestle chicken skin side up into kale mixture, fluffing kale up between chicken pieces so it has a chance to crisp in the oven. Pour wine around chicken. Roast until chicken is cooked through, about 15 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a4fa75e85989f731cfc711a/6:4/w_274%2Ch_169/Cook-This-Now-January--Braised-Chicken-Thighs-03012018.jpg"
    }
}