{
    "recipe": {
        "title": "Crispy Creamy Rock Shrimp with Sweet Chile Aioli and Apple Slaw ",
        "ingredients": [
            "1 cup mayonnaise",
            "1 tablespoon white miso (also called shiro miso)",
            "Juice of 1/2 lime",
            "1 tablespoon sambal ulek",
            "2 tablespoons Thai sweet chile sauce",
            "2 teaspoons fresh cilantro, finely chopped",
            "1 medium Fuji apple, peeled, cored, and cut into julienne",
            "1 celery heart, stalks cut crosswise into 1-inch pieces then cut into julienne, and tender leaves, coarsely chopped",
            "1/2 cup fresh cilantro, coarsely chopped",
            "1/2 cup micro greens such as arugula, coarsely chopped",
            "Juice of 1/2 lime",
            "1/4 teaspoon fine sea salt",
            "1/8 teaspoon freshly ground black pepper",
            "About 10 cups vegetable oil",
            "1/2 cup all-purpose flour",
            "1/4 teaspoon fine sea salt",
            "1/8 teaspoon freshly ground black pepper",
            "16 ounces Asahi Super Dry Beer",
            "3 cups tempura mix*",
            "1/2 pound fresh rock shrimp, peeled and deveined",
            "*Available at Asian markets or in the Asian section of the supermarket",
            "Deep-fat thermometer"
        ],
        "instructions": [
            "Make the sweet chile aioli: In a small bowl, whisk together all of the aioli ingredients. DO AHEAD: Can be made 2 days ahead. Cover and chill.",
            "In a small bowl, whisk together all of the aioli ingredients. DO AHEAD: Can be made 2 days ahead. Cover and chill.",
            "Make the apple slaw: In a small bowl, toss together all of the slaw ingredients, cover, and keep chilled until ready to serve.",
            "In a small bowl, toss together all of the slaw ingredients, cover, and keep chilled until ready to serve.",
            "Batter and fry the shrimp: Line a baking sheet with 2 layers of paper towels. In a heavy large pot, heat 3 inches of oil until a deep-fat thermometer registers 350°F. In a small bowl, whisk together flour, salt, and pepper. In a medium bowl, stir together beer and tempura mix—the mixture should be about as thick as pancake batter. Lightly coat the shrimp in the seasoned flour, shaking off any excess, then dip in the tempura batter. Working in batches, fry the shrimp until light golden brown, about 3 minutes per batch. Transfer as done to the prepared baking sheet and return oil to 350°F between batches. Transfer the fried shrimp to a small bowl, add sweet chile aioli, and gently toss to coat.",
            "Line a baking sheet with 2 layers of paper towels.",
            "In a heavy large pot, heat 3 inches of oil until a deep-fat thermometer registers 350°F.",
            "In a small bowl, whisk together flour, salt, and pepper.",
            "In a medium bowl, stir together beer and tempura mix—the mixture should be about as thick as pancake batter.",
            "Lightly coat the shrimp in the seasoned flour, shaking off any excess, then dip in the tempura batter. Working in batches, fry the shrimp until light golden brown, about 3 minutes per batch. Transfer as done to the prepared baking sheet and return oil to 350°F between batches.",
            "Transfer the fried shrimp to a small bowl, add sweet chile aioli, and gently toss to coat.",
            "To serve: Divide the apple slaw among 6 small appetizer plates. Arrange about 6 shrimp on each plate and serve immediately.",
            "Divide the apple slaw among 6 small appetizer plates. Arrange about 6 shrimp on each plate and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b273aea801766f773f5665/6:4/w_274%2Ch_169/363589_rock-shrimp_1x1.jpg"
    }
}