{
    "recipe": {
        "title": "Crispy Fish Sandwich ",
        "ingredients": [
            "1 small red onion, thinly sliced into rounds",
            "4 oz. bread-and-butter pickles, plus 1/2 cup brine",
            "3/4 cup mayonnaise",
            "1/3 cup chopped dill",
            "2 tsp. hot sauce",
            "1 tsp. freshly ground black pepper",
            "2 tsp. fresh lemon juice, plus wedges for serving",
            "1 Tbsp. kosher salt, divided",
            "2 large eggs, lightly beaten",
            "1 1/2 cups panko (Japanese breadcrumbs)",
            "1/2 cup all-purpose flour",
            "2 flounder fillets (about 2/3 lb. total), cut in half crosswise on a diagonal",
            "2/3 cup vegetable oil",
            "3 cups shredded iceberg lettuce",
            "8 slices Pullman bread",
            "1 cup potato chips, plus more for serving"
        ],
        "instructions": [
            "Combine onion, pickles, and pickle brine in a small bowl. Mix mayonnaise, dill, hot sauce, pepper, 2 tsp. lemon juice, and 1/2 tsp. salt in another small bowl. Place eggs, panko, and flour in 3 separate shallow medium bowls. Season each fish fillet with 1/2 tsp. salt. Working one at a time, dredge fish in flour, shaking off excess. Coat evenly with egg, allowing excess to drip back into bowl. Coat with panko, pressing to adhere. Transfer fish to a plate. Heat oil in a large skillet over medium. Cook fish until breading is golden brown and cooked through, 2–3 minutes per side. Transfer fish to a paper towel-lined plate. Season fillets with 1/2 tsp. salt total. Spread 1 heaping Tbsp. mayonnaise mixture on one side of each slice of bread. Pile each bottom slice with 3/4 cup lettuce, 1 fish fillet, a small handful of potato chips, and 1/4 cup onion mixture. Close sandwich with second slice of bread, mayo side down, and push down lightly to crush potato chips. Transfer to a platter. Repeat with remaining sandwiches. Serve with lemon wedges and more potato chips alongside. Do Ahead: Pickled onions and dill sauce can be made 1 day ahead. Cover and chill.",
            "Combine onion, pickles, and pickle brine in a small bowl.",
            "Mix mayonnaise, dill, hot sauce, pepper, 2 tsp. lemon juice, and 1/2 tsp. salt in another small bowl.",
            "Place eggs, panko, and flour in 3 separate shallow medium bowls. Season each fish fillet with 1/2 tsp. salt. Working one at a time, dredge fish in flour, shaking off excess. Coat evenly with egg, allowing excess to drip back into bowl. Coat with panko, pressing to adhere. Transfer fish to a plate.",
            "Heat oil in a large skillet over medium. Cook fish until breading is golden brown and cooked through, 2–3 minutes per side. Transfer fish to a paper towel-lined plate. Season fillets with 1/2 tsp. salt total.",
            "Spread 1 heaping Tbsp. mayonnaise mixture on one side of each slice of bread. Pile each bottom slice with 3/4 cup lettuce, 1 fish fillet, a small handful of potato chips, and 1/4 cup onion mixture. Close sandwich with second slice of bread, mayo side down, and push down lightly to crush potato chips. Transfer to a platter. Repeat with remaining sandwiches. Serve with lemon wedges and more potato chips alongside.",
            "Do Ahead: Pickled onions and dill sauce can be made 1 day ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5af1b6634692b76178e65769/6:4/w_274%2Ch_169/Crispy-Fish-Sandwich-03052018.jpg"
    }
}