{
    "recipe": {
        "title": "Crispy Jerusalem Artichokes with Aged Balsamic ",
        "ingredients": [
            "2 tablespoons olive oil",
            "2 pounds small Jerusalem artichokes (sunchokes), scrubbed, quartered",
            "Kosher salt, freshly ground pepper",
            "4 sprigs rosemary",
            "1/4 cup (1/2 stick) unsalted butter",
            "3 tablespoons aged balsamic vinegar"
        ],
        "instructions": [
            "Heat oil in a large skillet, preferably cast iron (you'll need a lid), over mediumhigh heat. Add Jerusalem artichokes and 1/4 cup water and season with salt and pepper. Cover and cook, stirring occasionally, until Jerusalem artichokes are fork-tender, 8–10 minutes. Uncover skillet and cook, stirring occasionally, until water is evaporated and Jerusalem artichokes begin to brown and crisp, 8–10 minutes longer; transfer to a platter. Add rosemary and butter to skillet and cook, stirring often, until butter foams, then browns, about 4 minutes. Remove skillet from heat and stir in vinegar, scraping up any browned bits. Spoon brown butter sauce and rosemary over Jerusalem artichokes.",
            "Heat oil in a large skillet, preferably cast iron (you'll need a lid), over mediumhigh heat. Add Jerusalem artichokes and 1/4 cup water and season with salt and pepper. Cover and cook, stirring occasionally, until Jerusalem artichokes are fork-tender, 8–10 minutes.",
            "Uncover skillet and cook, stirring occasionally, until water is evaporated and Jerusalem artichokes begin to brown and crisp, 8–10 minutes longer; transfer to a platter.",
            "Add rosemary and butter to skillet and cook, stirring often, until butter foams, then browns, about 4 minutes.",
            "Remove skillet from heat and stir in vinegar, scraping up any browned bits. Spoon brown butter sauce and rosemary over Jerusalem artichokes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54aaf8536529d92b2c03042c/6:4/w_274%2Ch_169/51255110_jerusalem-artichokes_1x1.jpg"
    }
}