{
    "recipe": {
        "title": "Crispy Pancetta, Burrata, and Tomato Sandwiches ",
        "ingredients": [
            "4 (3-ounce) packages thinly sliced pancetta (Italian bacon)",
            "6 (3- to 4-inch-diameter, 3/4-inch-thick) slices ripe Costoluto Genovese tomatoes or other ripe red heirloom tomatoes",
            "1/2 cup (packed) coarsely torn fresh basil leaves",
            "6 tablespoons extra-virgin olive oil",
            "2 teaspoons dried oregano",
            "1/2 teaspoon fleur de sel or coarse kosher salt",
            "Freshly ground black pepper",
            "12 (4 x 4 x 1/2-inch) slices egg bread or brioche, lightly toasted",
            "18 ounces burrata cheese",
            "4 cups (about) baby arugula or mixed microgreens"
        ],
        "instructions": [
            "Working in batches, cook pancetta in heavy large skillet over medium heat until brown and crisp, about 6 minutes per batch. Transfer to paper towels to drain. DO AHEAD Can be made 2 hours ahead. Let stand at room temperature. Place tomato slices in shallow baking dish. Add basil, olive oil, oregano, and fleur de sel. Sprinkle with ground black pepper and turn to coat. Let stand at least 30 minutes and up to 1 hour. Place 6 toasted bread slices on work surface. Divide burrata among bread slices and spread to edges. Top each with 1 tomato slice, then pancetta slices, dividing equally. Top with arugula. Cover with remaining 6 toasted bread slices, and press each slightly to adhere. Cut each sandwich in half and serve.",
            "Working in batches, cook pancetta in heavy large skillet over medium heat until brown and crisp, about 6 minutes per batch. Transfer to paper towels to drain. DO AHEAD Can be made 2 hours ahead. Let stand at room temperature.",
            "Place tomato slices in shallow baking dish. Add basil, olive oil, oregano, and fleur de sel. Sprinkle with ground black pepper and turn to coat. Let stand at least 30 minutes and up to 1 hour.",
            "Place 6 toasted bread slices on work surface. Divide burrata among bread slices and spread to edges. Top each with 1 tomato slice, then pancetta slices, dividing equally. Top with arugula. Cover with remaining 6 toasted bread slices, and press each slightly to adhere. Cut each sandwich in half and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d99f7f3a00aeb2f1cf6e6/6:4/w_274%2Ch_169/239108.jpg"
    }
}