{
    "recipe": {
        "title": "Croissant Bread and Butter Pudding ",
        "ingredients": [
            "70g (5 tbsp) softened butter, for greasing",
            "6–8 croissants (crescent rolls), cut into large pieces",
            "50g (1/3 cup) raisins",
            "300ml (1 1/4 cups) double (heavy) cream",
            "300ml (1 1/4 cups) milk",
            "4 eggs",
            "1/2 tsp ground cinnamon",
            "70g (1/3 cup) caster (superfine) sugar"
        ],
        "instructions": [
            "Generously butter an ovenproof dish that measures about 20 x 30cm (8 x 12 inches).",
            "Arrange a single layer of croissant chunks, slightly overlapping, in the bottom of the dish. Scatter over some of the raisins, place another layer of croissant chunks on top and scatter over the remaining raisins. Press down gently with a fish slice or spatula.",
            "To make the custard, heat the cream and milk in a saucepan until the mixture comes almost to the boil. Remove from the heat. Meanwhile, whisk together the eggs, ground cinnamon and sugar in a large heatproof bowl set over a saucepan of simmering water until the mixture is thickened and the whisk or beaters leave a trail when lifted. Remove from the heat and beat in the cream mixture until well combined.",
            "Pour two-thirds of the custard over the croissants and leave to stand for about 30 minutes or until they have soaked up all the liquid. Preheat the oven to 180°C/350°F/gas mark 4.",
            "Pour the remaining custard over the soaked croissants and press down firmly with a fish slice or spatula so that the custard reaches halfway up the croissants. Place the dish in a roasting pan and pour in enough water to come a third of the way up the side of the dish. Bake for 30–35 minutes until the custard is just set and the top is golden brown. Serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3facb21388ef838b10e00/6:4/w_274%2Ch_169/51225030_croissant-bread-butter-pudding_1x1.jpg",
        "color": 35963
    }
}