{
    "recipe": {
        "title": "Crudites and Dips ",
        "ingredients": [
            "2/3 cup sour cream",
            "2 scallions, finely chopped",
            "1 tablespoon lemon juice",
            "2 ripe avocados, cut in half and chopped",
            "2 tablespoons mayonnaise",
            "1 teaspoon finely chopped fresh cilantro leaves",
            "2 tablespoons sour cream",
            "1 (15-oz.) can organic chickpeas, drained",
            "Juice of one lemon",
            "1/3 cup light tahini paste",
            "2 tablespoons light olive oil, plus extra for drizzling",
            "1 garlic clove, peeled and crushed",
            "2 tablespoons boiling water",
            "Sea salt, to taste",
            "11 oz (about 2-3 medium) very ripe tomatoes",
            "1 scallion, finely chopped",
            "1 garlic clove, peeled and crushed (optional)",
            "1 tablespoon extra virgin olive oil",
            "1 tablespoon chopped fresh basil leaves",
            "1 tablespoon tomato ketchup",
            "A little ground black pepper, to taste",
            "Carrot sticks",
            "Cucumber sticks",
            "Red bell pepper sticks",
            "Celery sticks",
            "Cherry tomatoes",
            "Blanched sugar snap peas or asparagus (cover with boiling water for 2 minutes, then drain under cold running water)",
            "Radishes",
            "Breadsticks, small or large",
            "Tortilla chips (\"cool\" flavor or the blue corn variety)",
            "Beet, carrot, and parsnip vegetable chips",
            "Mini oat crackers or mini rice cakes",
            "Toasted pita bread sliced into strips",
            "Bagel chips (Slice 2 organic bagels widthwise into 4 thin slices. Brush with olive oil, and then bake at 150°F for 10 minutes. Break into pieces)",
            "Tortilla chips (Cut 1 large tortilla into 8 slices. Place on a baking sheet and cook at 350°F for 10 minutes.)",
            "Sweet potato wedges (Peel and cut 2 lbs sweet potatoes into wedges. Place them in a roasting pan, toss in a tablespoon of olive oil, and sprinkle with a teaspoon of paprika. Cook for 35-40 minutes at 400°F, turning a few times. These are great with the sour cream dip.)"
        ],
        "instructions": [
            "Lightly mix together all the ingredients. Don't over-stir, as the dip becomes runny quite quickly. This can be prepared the day before the party and kept in the fridge.",
            "Make kid's guacamole Put the avocado, mayonnaise, and cilantro in a food processor and whiz until smooth. Turn into a serving bowl and stir in the sour cream. Push the avocado pits into the mixture to prevent discoloration, Remove before serving. This will keep in the fridge for up to a day.",
            "Put the avocado, mayonnaise, and cilantro in a food processor and whiz until smooth. Turn into a serving bowl and stir in the sour cream. Push the avocado pits into the mixture to prevent discoloration, Remove before serving. This will keep in the fridge for up to a day.",
            "Make hummus Put the chickpeas and lemon juice in a blender and work to a smooth purée. Add the tahini paste, olive oil, and garlic and blend until smooth. Scrape down the sides and add the boiling water. The consistency should be fairly loose and light. Taste and adjust seasoning if necessary, spoon into bowls and drizzle with a little olive oil. Will keep in the fridge for a couple of days.",
            "Put the chickpeas and lemon juice in a blender and work to a smooth purée. Add the tahini paste, olive oil, and garlic and blend until smooth. Scrape down the sides and add the boiling water. The consistency should be fairly loose and light. Taste and adjust seasoning if necessary, spoon into bowls and drizzle with a little olive oil. Will keep in the fridge for a couple of days.",
            "Make tomato salsa Quarter and core the tomatoes and remove the seeds. Finely chop the tomatoes and put into a bowl. Add all the remaining ingredients and combine. Keep at room temperature until ready to serve. This will keep in the fridge for up to 3 days.",
            "Quarter and core the tomatoes and remove the seeds. Finely chop the tomatoes and put into a bowl. Add all the remaining ingredients and combine. Keep at room temperature until ready to serve. This will keep in the fridge for up to 3 days."
        ],
        "picture_link": null,
        "color": 3983004
    }
}