{
    "recipe": {
        "title": "Crunchy Meringue Cookies ",
        "ingredients": [
            "5 large egg whites",
            "1/8 teaspoon cream of tartar",
            "3/4 cup granulated sugar (150 grams)",
            "1 1/2 cups confectioners' sugar (180 grams)"
        ],
        "instructions": [
            "Preheat the oven to 200°F. Line 2 baking sheets with parchment paper.",
            "Put the egg whites, cream of tartar, and 1/4 cup of the granulated sugar in the bowl of a standing mixer with the whisk and turn the mixer on to medium. Whip until the whites are foamy and then slightly increase the speed. Continue whipping until the whites have tripled in volume and are fluffy but still soft. The whites should just be starting to hold the trail of the whisk along the sides of the bowl.",
            "With the motor running, very slowly sprinkle another 1/4 cup of the granulated sugar onto the whites between the bowl and the edge of the whisk. Slightly increase the mixer speed and whip until the whites start to turn glossy but are still soft. Slowly sprinkle in the remaining 1/4 cup granulated sugar and increase the heat to medium-high. Whip for 2 to 3 minutes longer, until very stiff and glossy but not dry. Transfer the whites to a very large mixing bowl.",
            "Put the confectioners' sugar into a fine-mesh strainer. Sift about one quarter of it onto the whipped whites. Using the largest rubber spatula you have, gently fold the sugar into the meringue, drawing the spatula through the meringue and pulling it up and over itself from the sides of the bowl in. Move slowly and precisely so you don't knock the air out of the whites. Continue sifting and folding in the sugar in 2 or 3 more additions. Once the whites are smooth with no lumps of confectioners' sugar, they are ready.",
            "The meringue can be transferred to a pastry bag with a star tip or into a resealable plastic food bag with the corner snipped and used to pipe stars, circles, or any shape you like onto the lined baking sheets. You can make the cookies as small as dimes to sprinkle over ice cream or large enough to sandwich ice cream between them. Or use 2 spoons to mound the meringue into pillows.",
            "Bake for 1 hour, rotating and switching the pans halfway through. Baking time may vary depending on the size of the meringues; the cookies should feel dry, light, and hollow and have no give when you press on them. If they still feel soft, bake for 15 minutes longer and test again. Turn the oven off and let the meringues cool completely in the oven. Store the cooled meringues in an airtight container for up to 2 weeks."
        ],
        "picture_link": null
    }
}