{
    "recipe": {
        "title": "Crunchy Quinoa Salad ",
        "ingredients": [
            "1 cup uncooked quinoa",
            "2 cups vegetable broth",
            "3 (2-inch) strips of lemon zest (see hints below)",
            "1 1/2 cups asparagus, sliced into 1/2-inch pieces",
            "1 cup snow peas, cut in half",
            "1/2 cup kohlrabi, peeled and sliced into thin strips",
            "1/3 cup radishes, thinly sliced",
            "3 tablespoons lemon juice",
            "2 tablespoons chopped fresh chives",
            "2 tablespoons chopped fresh parsley",
            "1 tablespoon chopped fresh cilantro (optional)",
            "1 teaspoon chopped fresh mint",
            "Freshly ground pepper",
            "Dash sea salt"
        ],
        "instructions": [
            "Rinse the quinoa well and place it in a pot with the vegetable broth and bring to a boil. Reduce the heat, stir in the pieces of lemon zest, cover, and cook for 15 minutes. Remove from the heat, stir, and remove and discard the pieces of lemon zest. Allow the quinoa to cool slightly. Meanwhile, put a large pot of water on the stove to boil, drop the asparagus and snow peas into the boiling water, and cook for 2 to 3 minutes, until crisp-tender (do not overcook; the vegetables should still be slightly firm). Remove from the pot with a slotted spoon and drop into a bowl of ice water. Drain. Combine the cooked quinoa, asparagus, snow peas, kohlrabi, and radishes in a large bowl. Add the remaining ingredients and mix well. Season with freshly ground black pepper and sea salt, if desired. Chill for 1 to 2 hours before serving to allow flavors to mingle.",
            "Rinse the quinoa well and place it in a pot with the vegetable broth and bring to a boil. Reduce the heat, stir in the pieces of lemon zest, cover, and cook for 15 minutes. Remove from the heat, stir, and remove and discard the pieces of lemon zest. Allow the quinoa to cool slightly.",
            "Meanwhile, put a large pot of water on the stove to boil, drop the asparagus and snow peas into the boiling water, and cook for 2 to 3 minutes, until crisp-tender (do not overcook; the vegetables should still be slightly firm). Remove from the pot with a slotted spoon and drop into a bowl of ice water. Drain. Combine the cooked quinoa, asparagus, snow peas, kohlrabi, and radishes in a large bowl. Add the remaining ingredients and mix well. Season with freshly ground black pepper and sea salt, if desired. Chill for 1 to 2 hours before serving to allow flavors to mingle."
        ],
        "picture_link": "https://assets.epicurious.com/photos/595d02e387ee53228621df60/6:4/w_274%2Ch_169/crunchy-quinoa-radish-salad-recipe-HC-070517.jpg"
    }
}