{
    "recipe": {
        "title": "Crushed Beets with Lemon Vinaigrette ",
        "ingredients": [
            "2 pounds mixed small or medium beets (such as Chioggia, red, and/or golden), scrubbed",
            "6 tablespoons olive oil, divided, plus more",
            "Kosher salt, freshly ground pepper",
            "2 tablespoons finely grated lemon zest",
            "2 tablespoons fresh lemon juice",
            "1/4 cup (lightly packed) fresh mint leaves, plus more",
            "2 tablespoons torn fresh dill, plus more",
            "1/2 cup labneh (Lebanese strained yogurt) or plain Greek yogurt",
            "Flaky sea salt (such as Maldon)"
        ],
        "instructions": [
            "Preheat oven to 400°. Divide beets between 2 large sheets of foil. Drizzle beets on each sheet with 1/2 tablespoon oil; season with kosher salt and pepper and wrap up foil around beets. Roast on a rimmed baking sheet until tender, 40-50 minutes. Let cool slightly, then, using a paper towel, rub skins from beets (they should slip off easily). Crush beets with the bottom of a small bowl (it's alright if they fall apart). Meanwhile, whisk lemon zest, lemon juice, and 2 tablespoons oil in a large bowl; set vinaigrette aside. Heat 3 tablespoons oil in a large skillet over medium-high heat. Add beets, season with kosher salt and pepper, and cook until browned, about 4 minutes per side. Transfer to bowl with vinaigrette, add 1/4 cup mint and 2 tablespoons dill, and toss to coat. Serve beets and dollops of labneh drizzled with more oil, topped with more herbs, and seasoned with pepper and sea salt.",
            "Preheat oven to 400°. Divide beets between 2 large sheets of foil. Drizzle beets on each sheet with 1/2 tablespoon oil; season with kosher salt and pepper and wrap up foil around beets. Roast on a rimmed baking sheet until tender, 40-50 minutes. Let cool slightly, then, using a paper towel, rub skins from beets (they should slip off easily). Crush beets with the bottom of a small bowl (it's alright if they fall apart).",
            "Meanwhile, whisk lemon zest, lemon juice, and 2 tablespoons oil in a large bowl; set vinaigrette aside.",
            "Heat 3 tablespoons oil in a large skillet over medium-high heat. Add beets, season with kosher salt and pepper, and cook until browned, about 4 minutes per side. Transfer to bowl with vinaigrette, add 1/4 cup mint and 2 tablespoons dill, and toss to coat. Serve beets and dollops of labneh drizzled with more oil, topped with more herbs, and seasoned with pepper and sea salt."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac24bc6529d92b2c038765/6:4/w_274%2Ch_169/51235850_crushed-beets_1x1.jpg"
    }
}