{
    "recipe": {
        "title": "Crushed Potatoes with Oyster Bar Butter ",
        "ingredients": [
            "1/2 cup (1 stick) unsalted butter, room temperature",
            "4 garlic cloves, finely grated",
            "2 teaspoons finely grated lemon zest",
            "2 tablespoons fresh lemon juice",
            "2 teaspoons hot sauce",
            "2 teaspoons Worcestershire sauce",
            "5 tablespoons olive oil, divided",
            "1/3 cup chopped parsley",
            "1/4 cup chopped chives",
            "1 tablespoon chopped dill",
            "2 teaspoons chopped tarragon",
            "Kosher salt, freshly ground pepper",
            "3 pounds baby Yukon Gold or new potatoes, scrubbed",
            "1 bay leaf"
        ],
        "instructions": [
            "Mix butter, garlic, lemon zest, lemon juice, hot sauce, Worcestershire sauce, and 1 Tbsp. oil in a large bowl with a rubber spatula until smooth. Gently mix in parsley, chives, dill, and tarragon; season with salt and pepper.",
            "Place potatoes and bay leaf in a large pot and pour in cold water to cover by 2\"; season generously with salt. Bring to a boil, then reduce heat and simmer until potatoes are tender, 15–20 minutes. Drain, discard bay leaf, and let potatoes cool slightly. Using the flat side of a chef’s knife or the heel of your hand, smash potatoes lightly to flatten.",
            "Heat 2 Tbsp. oil in a large skillet over medium-high. Add half of potatoes and cook in a single layer, turning once, until brown and crisp, about 5 minutes. Transfer potatoes to bowl with herb butter. Wipe out skillet, repeat process with remaining 2 Tbsp. oil and remaining potatoes. Toss potatoes in butter until they are all well coated (the warm potatoes should melt the butter).",
            "Do Ahead Herb butter can be made 2 days ahead; cover and chill. Potatoes can be boiled and smashed 1 day ahead; let cool, then cover and chill. Pat dry before frying.",
            "Herb butter can be made 2 days ahead; cover and chill. Potatoes can be boiled and smashed 1 day ahead; let cool, then cover and chill. Pat dry before frying."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59233d7ff0fad567624a161a/6:4/w_274%2Ch_169/crushed-potatoes-with-oyster-bar-butter-BA-052217.jpg",
        "color": 5992330
    }
}