{
    "recipe": {
        "title": "Crushed Peas with Feta and Scallions ",
        "ingredients": [
            "2 1/4 pounds peas in the pod, or 1 1/2 cups frozen organic peas or petit pois",
            "2 to 4 tablespoons fruity olive oil",
            "1/2 pound sheep's-milk feta, drained",
            "1/2 pound Greek-style yogurt",
            "1 garlic clove, peeled and minced with a little coarse salt",
            "a bunch of scallions, trimmed and finely sliced",
            "a large handful of mint leaves, shredded",
            "juice of 1 lemon",
            "coarse salt and black pepper"
        ],
        "instructions": [
            "If using fresh peas, shell them and cook briefly in boiling water until al dente, then drain well and place in a large bowl. Sprinkle with 2 tablespoons olive oil and crush them coarsely with a potato masher. If you are using frozen peas, blanch them briefly, drain exceptionally well, and crush before adding the oil, pouring off any more excess water at this stage; add the oil bit by bit and less liberally. Mash the feta and yogurt together in a shallow bowl. While the peas are still hot, add the feta and toss to combine. This is all about texture, not smoothness, as for a dip. Add the minced garlic. Now add the scallions and 2 tablespoons shredded mint. Stir in the juice of half a lemon to start with. Season with pepper and a little salt, if you think it is needed; feta is pretty salty. Taste and adjust the seasoning, adding more lemon juice, mint, or olive oil if you like. Serve in a shallow dish with a mound of warm, grilled pita bread.",
            "If using fresh peas, shell them and cook briefly in boiling water until al dente, then drain well and place in a large bowl. Sprinkle with 2 tablespoons olive oil and crush them coarsely with a potato masher.",
            "If you are using frozen peas, blanch them briefly, drain exceptionally well, and crush before adding the oil, pouring off any more excess water at this stage; add the oil bit by bit and less liberally.",
            "Mash the feta and yogurt together in a shallow bowl. While the peas are still hot, add the feta and toss to combine. This is all about texture, not smoothness, as for a dip. Add the minced garlic.",
            "Now add the scallions and 2 tablespoons shredded mint. Stir in the juice of half a lemon to start with. Season with pepper and a little salt, if you think it is needed; feta is pretty salty. Taste and adjust the seasoning, adding more lemon juice, mint, or olive oil if you like.",
            "Serve in a shallow dish with a mound of warm, grilled pita bread."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b32a28460b4423363efab6/6:4/w_274%2Ch_169/358562_crushed-peas-feta_1x1.jpg"
    }
}