{
    "recipe": {
        "title": "Cucumber Gazpacho with Shrimp and Melon ",
        "ingredients": [
            "1 3/4 large cucumbers, peeled, seeded, and coarsely chopped (about 3 1/4 cup), plus 1/4 large cucumber, peeled, seeded, and cut into small dice for garnish (about 1/4 cup)",
            "2 scallions (white and green parts), coarsely chopped",
            "1/2 cup (loosely packed) assorted fresh herbs, such as basil, chives, and mint, coarsely chopped, plus ¼ cup finely chopped (for garnish)",
            "1 (1/2-inch) piece fresh ginger, coarsely chopped",
            "1 small clove garlic, coarsely chopped",
            "3 tablespoons extra-virgin olive oil",
            "1/4 cup plain low-fat yogurt",
            "3/4 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "1/4 teaspoon hot sauce",
            "1/4 pound large shrimp (31 to 40 count per pound) peeled, cooked, and cut into medium dice (about 8 shrimp)",
            "1/2 cup seedless watermelon or cantaloupe, cut into small dice"
        ],
        "instructions": [
            "In blender or food processor, combine coarsely chopped cucumber, scallions, coarsely chopped herbs, ginger, garlic, olive oil, and yogurt and process until smooth, about 1 minute. Stir in 1/2 teaspoon salt, pepper, and hot sauce, then transfer to large airtight container and refrigerate 1 hour or up to 4 hours. In small bowl, stir together shrimp and remaining cucumbers, herbs, and salt. Fold watermelon or cantaloupe into soup. Divide soup evenly among 4 chilled bowls and top each with dollop of shrimp mixture. Serve immediately.",
            "In blender or food processor, combine coarsely chopped cucumber, scallions, coarsely chopped herbs, ginger, garlic, olive oil, and yogurt and process until smooth, about 1 minute. Stir in 1/2 teaspoon salt, pepper, and hot sauce, then transfer to large airtight container and refrigerate 1 hour or up to 4 hours.",
            "In small bowl, stir together shrimp and remaining cucumbers, herbs, and salt.",
            "Fold watermelon or cantaloupe into soup. Divide soup evenly among 4 chilled bowls and top each with dollop of shrimp mixture. Serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a55a62fa7a9917c25880/6:4/w_274%2Ch_169/352829.jpg"
    }
}