{
    "recipe": {
        "title": "Cured Arctic Char ",
        "ingredients": [
            "1 whole large skin-on arctic char, (1-1 1/2 pound), bones removed",
            "1/3 cup kosher salt",
            "1/3 cup sugar",
            "2 teaspoons mustard seeds",
            "2 teaspoons finely grated orange zest",
            "1 teaspoon finely grated lemon zest",
            "2/3 cup finely chopped fresh dill",
            "2 tablespoons aquavit",
            "1/4 small red onion, chopped",
            "1/4 cup apple cider vinegar",
            "2 teaspoons sugar",
            "1/2 teaspoons kosher salt",
            "Lefse",
            "Creme fraiche and dill sprigs (for serving)",
            "Flaky sea salt (such as Maldon)"
        ],
        "instructions": [
            "Cured char: Rinse char under cold running water; pat dry with paper towels. Mix salt, sugar, mustard seeds, orange zest, and lemon zest in a small bowl, then massage into char. Place skin side down in a baking dish; top with dill and drizzle with aquavit. Cover tightly with plastic wrap, pressing directly onto fish. Chill, turning 2–3 times and pouring off any accumulated liquid each time, until flesh is very firm and almost translucent, 2–4 days (it will get saltier and firmer the longer it sits). Thoroughly rinse char and pat dry with paper towels. DO AHEAD: Char can be cured (and rinsed) 1 week ahead. Cover and chill.",
            "Rinse char under cold running water; pat dry with paper towels. Mix salt, sugar, mustard seeds, orange zest, and lemon zest in a small bowl, then massage into char. Place skin side down in a baking dish; top with dill and drizzle with aquavit. Cover tightly with plastic wrap, pressing directly onto fish. Chill, turning 2–3 times and pouring off any accumulated liquid each time, until flesh is very firm and almost translucent, 2–4 days (it will get saltier and firmer the longer it sits). Thoroughly rinse char and pat dry with paper towels.",
            "DO AHEAD: Char can be cured (and rinsed) 1 week ahead. Cover and chill.",
            "Pickled onion and assembly: Place onion in a small heatproof jar. Bring vinegar, sugar, kosher salt, and 2 tablespoons water to a simmer in a small saucepan, stirring to dissolve. Pour over onion. Cover and chill until onion is bright pink, at least 8 hours and up to 2 days. Thinly slice char and serve on lefse topped with crème fraîche, dill, pickled onion, and sea salt.",
            "Place onion in a small heatproof jar. Bring vinegar, sugar, kosher salt, and 2 tablespoons water to a simmer in a small saucepan, stirring to dissolve. Pour over onion. Cover and chill until onion is bright pink, at least 8 hours and up to 2 days.",
            "Thinly slice char and serve on lefse topped with crème fraîche, dill, pickled onion, and sea salt."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54aadbe06529d92b2c02e4e2/6:4/w_274%2Ch_169/51259650_arctic-char_1x1.jpg"
    }
}