{
    "recipe": {
        "title": "Curried Chickpea and Lentil Dal ",
        "ingredients": [
            "1/4 cup extra-virgin olive oil",
            "2 Tbsp. mustard seeds",
            "1/2 tsp. ground turmeric",
            "Pinch of cayenne pepper",
            "Kosher salt",
            "1 small shallot, finely chopped",
            "3 Tbsp. chopped golden raisins",
            "2 Tbsp. finely chopped cilantro stems",
            "1 Tbsp. fresh lime juice",
            "1 Tbsp. extra-virgin olive oil",
            "Kosher salt, freshly ground pepper",
            "3 Tbsp. virgin coconut oil",
            "2 medium onions, coarsely chopped",
            "2 heads of garlic, halved crosswise",
            "1 (3\") piece ginger, peeled, thinly sliced",
            "1 Tbsp. curry powder",
            "1/2 tsp. cayenne pepper",
            "1 1/2 cups dried chickpeas, soaked overnight, drained",
            "2 (13.5-oz.) cans unsweetened coconut milk",
            "1 1/2 cups split red lentils",
            "Store-bought unsweetened toasted coconut flakes, thinly sliced Fresno or serrano chiles, and/or cilantro leaves (for serving; optional)"
        ],
        "instructions": [
            "Cook oil and mustard seeds in a small saucepan over medium-low, swirling often, until mustard seeds start to pop. Remove from heat and stir in turmeric and cayenne. Season with salt; let cool.",
            "Cilantro-Raisin Chutney: Mix shallot, raisins, cilantro stems, lime juice, and oil in a small bowl. Season with salt and pepper.",
            "Mix shallot, raisins, cilantro stems, lime juice, and oil in a small bowl. Season with salt and pepper.",
            "Stew and assembly: Heat oil in a large Dutch oven or other heavy pot over medium. Cook onions and garlic, cut side down, and ginger, stirring onions and ginger occasionally, until onions are translucent and garlic is golden brown, 5–7 minutes. Add curry powder and cayenne and cook, stirring constantly, until very fragrant, about 1 minute. Add chickpeas and 5 cups water, stirring to release any bits stuck on bottom of pot; season with several pinches of salt. Bring to a simmer; cover with a lid, leaving slightly askew so steam can escape. Cook, adjusting heat to maintain a very gentle simmer and skimming foam from surface as needed, until chickpeas have swelled about 50 percent in size but are still crunchy, 25–30 minutes. Add coconut milk and lentils to pot; season with more salt. Return to a simmer and cook, partially covered, until chickpeas are tender and lentils have broken down to form a thick broth, 30–35 minutes. Taste and season with more salt if needed. Ladle dal into bowls and serve with toasted Mustard Seed and Turmeric Oil, Cilantro-Raisin Chutney, coconut, chiles, and/or cilantro as desired.",
            "Heat oil in a large Dutch oven or other heavy pot over medium. Cook onions and garlic, cut side down, and ginger, stirring onions and ginger occasionally, until onions are translucent and garlic is golden brown, 5–7 minutes. Add curry powder and cayenne and cook, stirring constantly, until very fragrant, about 1 minute. Add chickpeas and 5 cups water, stirring to release any bits stuck on bottom of pot; season with several pinches of salt. Bring to a simmer; cover with a lid, leaving slightly askew so steam can escape. Cook, adjusting heat to maintain a very gentle simmer and skimming foam from surface as needed, until chickpeas have swelled about 50 percent in size but are still crunchy, 25–30 minutes.",
            "Add coconut milk and lentils to pot; season with more salt. Return to a simmer and cook, partially covered, until chickpeas are tender and lentils have broken down to form a thick broth, 30–35 minutes. Taste and season with more salt if needed. Ladle dal into bowls and serve with toasted Mustard Seed and Turmeric Oil, Cilantro-Raisin Chutney, coconut, chiles, and/or cilantro as desired.",
            "Do Ahead Oil can be made 1 day ahead. Store tightly covered at room temperature. Chutney can be made 1 day ahead. Cover and chill. Dal can be made 3 days ahead. Let cool; cover and chill.",
            "Oil can be made 1 day ahead. Store tightly covered at room temperature. Chutney can be made 1 day ahead. Cover and chill. Dal can be made 3 days ahead. Let cool; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5bc4da275a41832ce2229850/6:4/w_274%2Ch_169/curried-chickpea-lentil-dal-bowl-recipe-BA-101518.jpg",
        "color": 16364869
    }
}