{
    "recipe": {
        "title": "Curried Corn and Zucchini Salsa ",
        "ingredients": [
            "1 fresh jalapeño chile",
            "3 ears corn",
            "3 large zucchini (about 1 1/4 pounds total)",
            "1 tablespoon curry powder",
            "3/4 cup chicken broth",
            "5 scallions",
            "1 tablespoon fresh lime juice"
        ],
        "instructions": [
            "Wearing rubber gloves, finely chop jalapeño with seeds. With a sharp knife cut enough corn from cobs to measure 1 1/2 cups. Remove peel in 1/4-inch-thick strips from 2 zucchini and cut peel into 1/4-inch dice. Coarsely chop cores and remaining zucchini. In a large nonstick skillet cook jalapeño, chopped zucchini (not dice), curry powder, and broth over moderate heat until zucchini is tender, about 5 minutes. In a blender or food processor puree mixture until smooth (use caution when blending hot liquids). Transfer mixture to skillet and add corn and zucchini dice. Cook salsa over moderate heat, stirring, until corn is just tender, about 5 minutes. Thinly slice scallions and stir into salsa with lime juice, tossing to combine. Season salsa with salt and pepper and serve warm.",
            "Wearing rubber gloves, finely chop jalapeño with seeds. With a sharp knife cut enough corn from cobs to measure 1 1/2 cups. Remove peel in 1/4-inch-thick strips from 2 zucchini and cut peel into 1/4-inch dice. Coarsely chop cores and remaining zucchini.",
            "In a large nonstick skillet cook jalapeño, chopped zucchini (not dice), curry powder, and broth over moderate heat until zucchini is tender, about 5 minutes. In a blender or food processor puree mixture until smooth (use caution when blending hot liquids).",
            "Transfer mixture to skillet and add corn and zucchini dice. Cook salsa over moderate heat, stirring, until corn is just tender, about 5 minutes. Thinly slice scallions and stir into salsa with lime juice, tossing to combine. Season salsa with salt and pepper and serve warm."
        ],
        "picture_link": null
    }
}