{
    "recipe": {
        "title": "Curried Spelt Salad ",
        "ingredients": [
            "2 cups spelt, semi-pearled farro, or whole wheat berries, rinsed",
            "1 teaspoon kosher salt plus more for seasoning",
            "2 tablespoons vegetable oil",
            "2 1/2 teaspoons curry powder (such as Madras)",
            "2 teaspoons yellow mustard seeds",
            "3/4 teaspoon ground cardamom",
            "3/4 teaspoon ground coriander",
            "6 small carrots, peeled, cut into 1/4\" dice",
            "Freshly ground black pepper",
            "1/4 cup apple cider vinegar",
            "1 cup thinly sliced red onion (about 1/2 large onion)",
            "1/2 lemon cut lengthwise, ends removed, finely chopped with peel (about 1/2 cup)",
            "3 cups shredded cooked chicken (from 1 rotisserie chicken; optional)",
            "2 cups baby or wild arugula",
            "2 cups (packed) cilantro sprigs with tender stems plus more for garnish",
            "2 tablespoons extra-virgin olive oil"
        ],
        "instructions": [
            "Place spelt and 1 teaspoon kosher salt in a medium pot. Add water to cover by 1 1/2\". Bring to a boil; reduce heat to medium-low and simmer, uncovered, until spelt is tender and water is mostly absorbed, about 1 hour (or 12-15 minutes if using semi-pearled farro). Drain; place in a large bowl.",
            "Meanwhile, heat vegetable oil in a medium saucepan over medium heat. Add curry, mustard seeds, cardamom, and coriander; cook, stirring often, until spices are fragrant and mustard seeds begin to pop, 2-3 minutes. Stir in carrots and season with salt and pepper. Cook, stirring often, until carrots are crisp-tender, 5-6 minutes.",
            "Add vinegar and stir until evaporated, 1-2 minutes. Stir in onion and lemon. Remove pan from heat and stir until onion is wilted, 1-2 minutes. Add vegetable mixture to bowl with spelt. Season to taste with salt and pepper. Let cool. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
            "Add chicken (if using), arugula, 2 cups cilantro, and olive oil to spelt mixture; toss to combine. Transfer salad to a large platter. Garnish with cilantro sprigs."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b0b4a71cc76a014cfaf005/6:4/w_274%2Ch_169/395916_curried-spelt-salad_1x1.jpg",
        "color": 13252975
    }
}