{
    "recipe": {
        "title": "Curried Chicken Drumsticks ",
        "ingredients": [
            "3 tablespoons ghee or virgin coconut oil",
            "8 chicken drumsticks",
            "Kosher salt, freshly ground pepper",
            "2 large onions, chopped",
            "4 garlic cloves, thinly sliced",
            "1 lemongrass stalk, crushed (optional)",
            "3 tablespoons vadouvan or any yellow curry powder",
            "1/4 teaspoon cayenne pepper",
            "2 cups low-sodium chicken broth",
            "1 (13.5-ounce) can unsweetened coconut milk",
            "Juice of 1 lime, plus wedges for serving",
            "1 cup cilantro leaves with tender stems, divided",
            "1 (14-ounce) package rice noodles",
            "Crispy shallots or onions (for serving)"
        ],
        "instructions": [
            "Heat ghee in a large skillet, preferably cast iron, over medium-high. Season chicken with salt and pepper and cook, turning occasionally, until skin is golden brown and crisp, 8–10 minutes. Transfer to a plate (it will not be cooked through).",
            "Add onions to same skillet and cook, stirring occasionally, until softened and golden, 6–8 minutes. Add garlic, lemongrass (if using), vadouvan, and cayenne and cook, stirring often, until fragrant, about 2 minutes. Add broth, coconut milk, lime juice, and 1/2 cup cilantro, then return chicken to skillet and gently push down into liquid. Bring to a boil, then reduce heat and simmer, uncovered, until chicken is tender and cooked through and sauce is thickened, 40–45 minutes. Be sure to turn chicken a couple of times while it’s cooking so all sides get exposed to the curry sauce.",
            "Just before chicken is done, cook noodles according to package directions. Rinse noodles under warm water, then toss in a large bowl with a little bit of the curry sauce. This will help to prevent them from sticking.",
            "Divide noodles among shallow bowls. Place drumsticks on top and ladle curry sauce over. Top with crispy shallots and remaining 1/2 cup cilantro. Serve with lime wedges for squeezing over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59e91acc221413460f260ca2/6:4/w_274%2Ch_169/curried-chicken-drumsticks.jpg",
        "color": 14887454
    }
}