{
    "recipe": {
        "title": "Curried Chicken Sandwich ",
        "ingredients": [
            "2 skinless, boneless chicken breasts (about 1 pound), halved horizontally",
            "1/4 recipe Curry Brine",
            "4 stalks celery, thinly sliced",
            "1/2 small fennel bulb, thinly sliced",
            "1 tablespoon plain whole-milk yogurt",
            "1 teaspoon fresh lemon juice",
            "3/4 teaspoon celery seeds",
            "1 tablespoon mayonnaise plus more for serving",
            "Kosher salt, freshly ground pepper",
            "freshly ground pepper",
            "4 large or 8 small slices country-style bread",
            "1/4 cup olive oil",
            "1/2 small red onion, thinly sliced",
            "1/2 cup picked dill with tender stems"
        ],
        "instructions": [
            "Combine chicken and Curry Brine in a large resealable plastic bag, seal, and turn to coat. Chill at least 4 hours. Prepare grill for medium-high heat. Combine celery, fennel, yogurt, lemon juice, celery seeds, and 1 tablespoon mayonnaise in a medium bowl; season with salt and pepper and toss to combine. Set slaw aside. Grill chicken until cooked through, 5-7 minutes per side. Brush bread on both sides with oil and grill until toasted, about 2 minutes per side; spread with mayonnaise. Build sandwiches with bread, chicken, slaw, onion, and dill. DO AHEAD: Chicken can be brined 1 day ahead. Keep chilled.",
            "Combine chicken and Curry Brine in a large resealable plastic bag, seal, and turn to coat. Chill at least 4 hours. Prepare grill for medium-high heat.",
            "Combine celery, fennel, yogurt, lemon juice, celery seeds, and 1 tablespoon mayonnaise in a medium bowl; season with salt and pepper and toss to combine. Set slaw aside.",
            "Grill chicken until cooked through, 5-7 minutes per side. Brush bread on both sides with oil and grill until toasted, about 2 minutes per side; spread with mayonnaise. Build sandwiches with bread, chicken, slaw, onion, and dill.",
            "DO AHEAD: Chicken can be brined 1 day ahead. Keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57a351cfc9298e54495918a1/6:4/w_274%2Ch_169/curried-chicken-sandwich-04082016.jpg"
    }
}