{
    "recipe": {
        "title": "Custard Tart with Cream and Fresh Fruit ",
        "ingredients": [
            "Unsalted butter, room temperature (for pan)",
            "3/4 cup plus 2 Tbsp. sugar; plus more for pan",
            "8 large egg yolks",
            "2 large eggs",
            "2/3 cup cornstarch",
            "1/2 tsp. kosher salt",
            "3 cups whole milk",
            "1 1/2 cups chilled heavy cream, divided",
            "1 vanilla bean, split lengthwise, or 1 1/2 tsp. vanilla extract or paste",
            "1 lb. stone fruit, cut into wedges, blueberries and/or blackberries"
        ],
        "instructions": [
            "Butter a 9\"-diameter cake pan. Line bottom with a round of parchment paper; smooth out. Coat sides with sugar, tapping out excess. Gently whisk egg yolks, eggs, cornstarch, salt, and 3/4 cup sugar in a large saucepan until smooth, then whisk vigorously until lightened in color, 1–2 minutes. Whisking constantly, gradually stream in milk, followed by 1 cup cream; scrape sides of pan. Scrape in vanilla seeds; discard pod. Cook mixture over medium heat, whisking constantly, until it starts to thicken, then whisk vigorously until it holds marks of whisk, 6–10 minutes. Immediately remove custard from heat (do not let boil); let cool slightly.",
            "Using a rubber spatula, press custard through a fine-mesh sieve into prepared pan. Chill, uncovered, 20 minutes (it should be warm but not hot). Place a rack in middle of oven and preheat to 400°F.",
            "Bake custard until top is deeply browned in spots, 40–50 minutes (it will still be wobbly in the center). Let cool.",
            "Toss fruit with remaining 2 Tbsp. sugar in a medium bowl. Let sit 15 minutes.",
            "Slide a knife around sides of custard to loosen and place a plate upside down over custard; invert onto plate. Peel away parchment and invert again onto another plate. Whisk remaining 1/2 cup cream in a medium bowl until soft peaks form. Serve slices of custard topped with fruit and whipped cream.",
            "Do Ahead Custard can be baked 1 day ahead. Cover and chill.",
            "Custard can be baked 1 day ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ba00b2f4a8ab74f5514fed8/6:4/w_274%2Ch_169/custard-tart-with-cream-and-fresh-fruit-recipe-BA-091718.jpg",
        "color": 5740772
    }
}