{
    "recipe": {
        "title": "Daddy's Birthday Cake (aka Franny's Sunshine Cake) ",
        "ingredients": [
            "8 eggs, separated",
            "1 teaspoon cream of tartar",
            "1 1/3 cups sugar",
            "1/4 teaspoon salt",
            "1/2 cup orange juice",
            "1 cup plus 2 tablespoons sifted cake flour",
            "1 teaspoon vanilla extract",
            "1 teaspoon almond extract",
            "1 can mandarin orange slices, drained",
            "1 quart fresh berries, sliced",
            "3/4 cup sugar",
            "1 egg",
            "2 1/2 tablespoons all-purpose flour",
            "Juice and grated zest of 1 orange",
            "2 cups heavy cream",
            "Unsalted butter, for greasing the foil",
            "1/2 cup sugar",
            "1 cup sliced almonds"
        ],
        "instructions": [
            "1. Preheat the oven to 350°F. 2. In a standing electric mixer, use the whisk attachment to whip the egg whites with the cream of tartar. When they start to double in size, slowly add in 2/3 cup of the sugar. Whip until you have stiff peaks. Set aside. 3. In a large mixing bowl, whisk together the egg yolks, salt, and the remaining 2/3 cup sugar. Gradually add the orange juice and continue to beat until light and fluffy. 4. Combine the two mixtures: Spoon a little whipped egg whites into the yolks and stir. Then fold the rest of the whites into the mixture in two additions. 5. Deftly fold in the flour, vanilla extract, and almond extract. 6. Pour the batter into an ungreased 9-inch angel food cake pan and bake for 35 to 40 minutes or until a cake tester comes out clean. 7. Remove the pan from the oven and place it upside down. Leave it like that until the cake is cool. 8. Once it has cooled, run a sharp knife around the edge of the cake to separate it from the pan. Invert the pan over a serving plate, and let gravity do its thing. 9. Carefully cut the cake in half horizontally with a large serrated knife. 10. Frost the top of the bottom half with some of the orange filling (see below), and then layer some of the mandarin orange slices and berries on top of the frosting. 11. Place the top half over the bottom half, and then frost the top and sides of the cake with the remaining orange filling. Place the remaining mandarin oranges and berries on top of the cake. 12. Sprinkle the topping (see below) over the cake and enjoy.",
            "1. Preheat the oven to 350°F.",
            "2. In a standing electric mixer, use the whisk attachment to whip the egg whites with the cream of tartar. When they start to double in size, slowly add in 2/3 cup of the sugar. Whip until you have stiff peaks. Set aside.",
            "3. In a large mixing bowl, whisk together the egg yolks, salt, and the remaining 2/3 cup sugar. Gradually add the orange juice and continue to beat until light and fluffy.",
            "4. Combine the two mixtures: Spoon a little whipped egg whites into the yolks and stir. Then fold the rest of the whites into the mixture in two additions.",
            "5. Deftly fold in the flour, vanilla extract, and almond extract.",
            "6. Pour the batter into an ungreased 9-inch angel food cake pan and bake for 35 to 40 minutes or until a cake tester comes out clean.",
            "7. Remove the pan from the oven and place it upside down. Leave it like that until the cake is cool.",
            "8. Once it has cooled, run a sharp knife around the edge of the cake to separate it from the pan. Invert the pan over a serving plate, and let gravity do its thing.",
            "9. Carefully cut the cake in half horizontally with a large serrated knife.",
            "10. Frost the top of the bottom half with some of the orange filling (see below), and then layer some of the mandarin orange slices and berries on top of the frosting.",
            "11. Place the top half over the bottom half, and then frost the top and sides of the cake with the remaining orange filling. Place the remaining mandarin oranges and berries on top of the cake.",
            "12. Sprinkle the topping (see below) over the cake and enjoy.",
            "To Make the Orange Filling 1. Combine the sugar, egg, flour, orange juice, and orange zest in a double boiler and cook over simmering water until thick, about 5 to 8 minutes. Cool to room temperature. 2. Whip the cream till almost stiff. Fold in the cooled orange mixture. Whisk until you have stiff peaks.",
            "1. Combine the sugar, egg, flour, orange juice, and orange zest in a double boiler and cook over simmering water until thick, about 5 to 8 minutes. Cool to room temperature.",
            "2. Whip the cream till almost stiff. Fold in the cooled orange mixture. Whisk until you have stiff peaks.",
            "To Make the Topping 1. Butter a piece of aluminum foil. 2. In a heavy skillet over high heat, cook the sugar until it is caramelized (turns a medium brown color). Swirl the pan carefully to get all of the sugar to caramelize evenly. 3. Pour the sliced almonds over the caramelized sugar and stir with a wooden spoon to coat the almonds. Spread the almonds out on the piece of buttered foil, and let them cool. 4. When they are cool, crush or chop the nuts.",
            "1. Butter a piece of aluminum foil.",
            "2. In a heavy skillet over high heat, cook the sugar until it is caramelized (turns a medium brown color). Swirl the pan carefully to get all of the sugar to caramelize evenly.",
            "3. Pour the sliced almonds over the caramelized sugar and stir with a wooden spoon to coat the almonds. Spread the almonds out on the piece of buttered foil, and let them cool.",
            "4. When they are cool, crush or chop the nuts."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54af5583c4a891cc44cce8eb/6:4/w_274%2Ch_169/51173210_birthday-cake_1x1.jpg"
    }
}