{
    "recipe": {
        "title": "Dan Dan Noodles ",
        "ingredients": [
            "8 ounces Shanghai-style noodles (cu mian) or udon",
            "2 tablespoons vegetable oil",
            "12 ounces ground pork",
            "Kosher salt and freshly ground black pepper",
            "2 tablespoons chopped peeled ginger",
            "3/4 cup chicken stock",
            "2 tablespoons or less chili oil",
            "2 tablespoons red wine vinegar",
            "2 tablespoons soy sauce",
            "4 teaspoon tahini (sesame seed paste)",
            "1 teaspoon Sichuan peppercorns",
            "Pinch of sugar",
            "2 tablespoons chopped roasted peanuts",
            "2 tablespoons thinly sliced scallions",
            "Ingredient info: Shanghai-style noodles, udon, and chili oil can be found at better supermarkets and at Asian markets. Sichuan peppercorns are available at some specialty foods stores and at Asian markets. Tahini is available at better supermarkets and Middle Eastern markets."
        ],
        "instructions": [
            "Cook noodles in a large pot of boiling water until just tender but still firm to the bite. Drain; transfer to a large bowl of ice water and let stand until cold. Drain well and divide between 2 bowls. Heat vegetable oil in a medium skillet over medium heat. Add pork, season with salt and pepper, and stir, breaking up pork with a spoon, until halfway cooked, about 2 minutes. Add ginger; cook until pork is cooked through and lightly browned, about 2 minutes. Stir in chicken stock and next 6 ingredients; simmer until sauce thickens, about 7 minutes. Pour pork mixture over noodles; garnish with peanuts and scallions.",
            "Cook noodles in a large pot of boiling water until just tender but still firm to the bite. Drain; transfer to a large bowl of ice water and let stand until cold. Drain well and divide between 2 bowls.",
            "Heat vegetable oil in a medium skillet over medium heat. Add pork, season with salt and pepper, and stir, breaking up pork with a spoon, until halfway cooked, about 2 minutes. Add ginger; cook until pork is cooked through and lightly browned, about 2 minutes. Stir in chicken stock and next 6 ingredients; simmer until sauce thickens, about 7 minutes. Pour pork mixture over noodles; garnish with peanuts and scallions."
        ],
        "picture_link": null
    }
}