{
    "recipe": {
        "title": "Date Night Pork Chop ",
        "ingredients": [
            "1 (1-lb.) bone-in pork loin chop (1\"–1 1/2\" thick)",
            "Kosher salt",
            "Freshly ground black pepper",
            "3 tsp. honey, divided",
            "5 Tbsp. extra-virgin olive oil, divided",
            "3 Tbsp. skin-on hazelnuts, crushed",
            "1 medium shallot, finely chopped",
            "1 lemon, halved",
            "1 small Pink Lady apple",
            "1 large or 2 small endive, leaves separated",
            "1 oz. Parmesan, shaved, broken into small pieces"
        ],
        "instructions": [
            "Pat pork chop dry with paper towels; season generously with salt and pepper. Let sit at room temperature 1 hour.",
            "Heat a medium skillet, preferably cast iron, over medium. Drizzle 1/2 tsp. honey over 1 side of pork chop, then drizzle with 1 Tbsp. oil. Rub all over; repeat on the other side. Cook until deeply browned, about 3 minutes per side. Turn upright onto fat cap and hold with tongs; cook until browned, about 2 minutes. Reduce heat to low; cook 1 more minute on each side (an instant-read thermometer inserted about ½\" from bone should register 130°F; cook another minute if needed). Transfer to a cutting board and let rest 10 minutes.",
            "Add hazelnuts and 2 Tbsp. oil to same skillet; cook over medium-low heat, tossing, until nuts are golden, about 3 minutes. Add shallot; season with salt and pepper. Cook, stirring often, until shallot is softened and browned, about 2 minutes. Add remaining 2 tsp. honey and squeeze in juice from a lemon half; toss well. Remove from heat.",
            "Cut around apple core to remove flesh in 3 lobes. Thinly slice 2 lobes (do as you will with remaining apple). Toss apple slices, endive, and Parmesan in a medium bowl; season with salt and pepper. Drizzle with remaining 1 Tbsp. oil, squeeze in juice from remaining lemon half, and toss again.",
            "Cut bone away from pork chop and slice meat 1/2\" thick. Arrange on a plate and drizzle juices over. Mound salad alongside and spoon hazelnut mixture over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c89140fc0596b6e36add2c4/6:4/w_274%2Ch_169/pork-chop-with-endive-apple-salad-recipe-BA-030419.jpg",
        "color": 6683332
    }
}