{
    "recipe": {
        "title": "David's No Mistakin' Bacon Key Lime Pie ",
        "ingredients": [
            "1 pound applewood-smoked bacon",
            "1 1/4 cups graham cracker crumbs from about 10 (2 1/4-inch by 4 3/4-inch) crackers",
            "1/4 cup packed light brown sugar",
            "7 tablespoons unsalted butter, melted",
            "4 egg yolks",
            "1 (14-ounce) can sweetened condensed milk",
            "1/2 cup fresh or bottled Key lime juice",
            "3 tablespoons graham cracker crumbs from about 2 (2 1/4-inch by 4 3/4-inch) crackers",
            "1 cup heavy cream",
            "1/2 cup pure maple syrup",
            "Zest of 2 Key limes",
            "9-inch pie plate, nonstick vegetable-oil spray"
        ],
        "instructions": [
            "Spray a 9-inch pie plate liberally with nonstick vegetable-oil spray.",
            "In a large heavy skillet over moderate heat, cook the bacon, turning occasionally, until crisp. Transfer the bacon to a paper towel–lined plate to drain, reserving the fat in the skillet. Strain the bacon fat through a fine-mesh sieve, measure 4 tablespoons for the filling, and discard the rest.",
            "Finely chop the bacon. Reserve 3 tablespoons of bacon for the garnish and place the rest in a medium bowl. Add the graham cracker crumbs and brown sugar and stir to combine. Drizzle with melted butter and stir until well combined. Press the mixture evenly onto the bottom and up the sides of the prepared pie plate and refrigerate for 30 minutes.",
            "Make the filling: Arrange a rack in the middle of the oven and preheat to 350°F. In a large bowl, whisk together the egg yolks, sweetened condensed milk, Key lime juice, and the 4 tablespoons of reserved bacon fat. Pour into the unbaked graham cracker and bacon crust and bake until just set in the center, about 12 minutes. Transfer to a wire rack to cool completely then freeze for at least 1 hour. DO AHEAD: The pie can be baked and stored, covered, in the freezer, up to 3 days.",
            "Arrange a rack in the middle of the oven and preheat to 350°F.",
            "In a large bowl, whisk together the egg yolks, sweetened condensed milk, Key lime juice, and the 4 tablespoons of reserved bacon fat. Pour into the unbaked graham cracker and bacon crust and bake until just set in the center, about 12 minutes. Transfer to a wire rack to cool completely then freeze for at least 1 hour. DO AHEAD: The pie can be baked and stored, covered, in the freezer, up to 3 days.",
            "Garnish and serve: Remove the pie from the freezer and thaw in the refrigerator for 20 minutes prior to serving. In a small bowl, stir together the graham cracker crumbs and the reserved 3 tablespoons of bacon. In a medium bowl, whisk the heavy cream until soft peaks form. Gently mound the cream on top of the pie then drizzle with the maple syrup and sprinkle with the lime zest and bacon and graham cracker garnish.",
            "Remove the pie from the freezer and thaw in the refrigerator for 20 minutes prior to serving.",
            "In a small bowl, stir together the graham cracker crumbs and the reserved 3 tablespoons of bacon.",
            "In a medium bowl, whisk the heavy cream until soft peaks form. Gently mound the cream on top of the pie then drizzle with the maple syrup and sprinkle with the lime zest and bacon and graham cracker garnish."
        ],
        "picture_link": null
    }
}