{
    "recipe": {
        "title": "Deep-Dish Peach Pie with Pecan Streusel Topping ",
        "ingredients": [
            "1/2 cup plus 2 tablespoons unbleached all purpose flour",
            "1/2 cup old-fashioned oats",
            "1/3 cup (packed) golden brown sugar",
            "1/2 teaspoon salt",
            "6 tablespoons (3/4 stick) chilled unsalted butter, diced",
            "3/4 cup pecans, coarsely chopped",
            "1 1/2 cups unbleached all purpose flour",
            "1 tablespoon sugar",
            "1/2 teaspoon salt",
            "6 tablespoons (3/4 stick) chilled unsalted butter, diced",
            "1/3 cup non-hydrogenated vegetable shortening, frozen, diced",
            "3 1/2 tablespoons (or more) ice water",
            "3/4 cup sugar",
            "2 tablespoons quick-cooking tapioca",
            "3/4 teaspoon ground cinnamon",
            "1/4 teaspoon ground cardamom",
            "1/4 teaspoon ground nutmeg",
            "1 1/2 teaspoons fresh lemon juice",
            "3 3/4 to 4 pounds peaches, peeled with vegetable peeler, halved, pitted, cut into 1-inch wedges",
            "9- to 9 1/2-inch-diameter ceramic deep-dish pie plate"
        ],
        "instructions": [
            "Stir flour, oats, sugar, and salt in medium bowl. Add butter; rub in with fingertips until mixture holds together in moist clumps. Mix in pecans. DO AHEAD: Can be made 1 day ahead. Cover; chill.",
            "For crust: Blend flour, sugar, and salt in processor 5 seconds. Add butter and shortening. Using on/off turns, blend until mixture resembles very coarse meal. Drizzle 3 1/2 tablespoons water over. Blend until moist clumps form, adding more water by teaspoonfuls if dry. Gather dough into ball; flatten into disk. Wrap; chill at least 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled. If necessary, soften dough slightly at room temperature before rolling out. Roll out dough on floured work surface to 14-inch round; transfer to 9-inch deep-dish pie plate. Cut off all but 1/2 inch overhang. Fold overhang in; crimp edge. Chill crust.",
            "Blend flour, sugar, and salt in processor 5 seconds. Add butter and shortening. Using on/off turns, blend until mixture resembles very coarse meal. Drizzle 3 1/2 tablespoons water over. Blend until moist clumps form, adding more water by teaspoonfuls if dry. Gather dough into ball; flatten into disk. Wrap; chill at least 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled. If necessary, soften dough slightly at room temperature before rolling out.",
            "Roll out dough on floured work surface to 14-inch round; transfer to 9-inch deep-dish pie plate. Cut off all but 1/2 inch overhang. Fold overhang in; crimp edge. Chill crust.",
            "For filling: Stir sugar and next 4 ingredients in large bowl. Mix in lemon juice, then peaches; toss. Let stand at least 20 minutes, tossing occasionally. Set rack at lowest position in oven. Slide foil-lined baking sheet under rack onto oven floor (to catch any drips). Preheat oven to 400°F. Spoon filling into crust. Scatter topping over, breaking up large clumps. Bake pie 30 minutes. Reduce oven to 350°F; bake until juices bubble thickly and topping is golden, covering edges with foil if browning too quickly, about 1 hour. Cool on rack at least 1 1/2 hours. Serve warm or at room temperature.",
            "Stir sugar and next 4 ingredients in large bowl. Mix in lemon juice, then peaches; toss. Let stand at least 20 minutes, tossing occasionally.",
            "Set rack at lowest position in oven. Slide foil-lined baking sheet under rack onto oven floor (to catch any drips). Preheat oven to 400°F. Spoon filling into crust. Scatter topping over, breaking up large clumps.",
            "Bake pie 30 minutes. Reduce oven to 350°F; bake until juices bubble thickly and topping is golden, covering edges with foil if browning too quickly, about 1 hour. Cool on rack at least 1 1/2 hours. Serve warm or at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56098ef96a59cdb91b5f7872/6:4/w_274%2Ch_169/359813_hires.jpg",
        "color": 10738773
    }
}