{
    "recipe": {
        "title": "Deep Dark Chocolate Cheesecake ",
        "ingredients": [
            "24 chocolate wafer cookies (from one 9-ounce package)",
            "1 tablespoon sugar",
            "1/4 cup (1/2 stick) butter, melted",
            "1 9.7-ounce bar Scharffen Berger 70% Cocoa Bittersweet Chocolate,* chopped",
            "4 (8-ounce) packages cream cheese, room temperature",
            "1 1/4 cups plus 2 tablespoons sugar",
            "1/4 cup unsweetened cocoa powder (preferably Scharffen Berger)",
            "4 large eggs",
            "3/4 cup whipping cream",
            "6 ounces Scharffen Berger 70% Cocoa Bittersweet Chocolate,* chopped",
            "1 tablespoon sugar",
            "Bittersweet chocolate curls",
            "*If unavailable, substitute another high-quality bittersweet chocolate."
        ],
        "instructions": [
            "For crust: Preheat oven to 350°F. Butter 9-inch-diameter springform pan with 3-inch-high sides. Blend cookies in processor until finely ground; blend in sugar. Add melted butter and process until well blended. Press crumbs evenly onto bottom (not sides) of prepared pan. Bake just until set, about 5 minutes. Cool while preparing filling. Maintain oven temperature.",
            "Preheat oven to 350°F. Butter 9-inch-diameter springform pan with 3-inch-high sides. Blend cookies in processor until finely ground; blend in sugar. Add melted butter and process until well blended. Press crumbs evenly onto bottom (not sides) of prepared pan. Bake just until set, about 5 minutes. Cool while preparing filling. Maintain oven temperature.",
            "For filling: Stir chopped chocolate in metal bowl set over saucepan of simmering water until melted and smooth. Remove bowl from over water; cool chocolate until lukewarm but still pourable. Blend cream cheese, sugar, and cocoa powder in processor until smooth. Blend in eggs 1 at a time. Mix in lukewarm chocolate. Pour filling over crust; smooth top. Bake until center is just set and just appears dry, about 1 hour. Cool 5 minutes. Run knife around sides of cake to loosen. Chill overnight.",
            "Stir chopped chocolate in metal bowl set over saucepan of simmering water until melted and smooth. Remove bowl from over water; cool chocolate until lukewarm but still pourable. Blend cream cheese, sugar, and cocoa powder in processor until smooth. Blend in eggs 1 at a time. Mix in lukewarm chocolate. Pour filling over crust; smooth top. Bake until center is just set and just appears dry, about 1 hour. Cool 5 minutes. Run knife around sides of cake to loosen. Chill overnight.",
            "For topping: Stir cream, 6 ounces chocolate, and sugar in heavy medium saucepan over low heat until smooth. Cool slightly. Pour over center of cheesecake, spreading to within 1/2 inch of edge and filling any cracks. Chill until topping is set, about 1 hour. Do ahead: Can be made 3 days ahead. Cover with foil and keep refrigerated.",
            "Stir cream, 6 ounces chocolate, and sugar in heavy medium saucepan over low heat until smooth. Cool slightly. Pour over center of cheesecake, spreading to within 1/2 inch of edge and filling any cracks. Chill until topping is set, about 1 hour. Do ahead: Can be made 3 days ahead. Cover with foil and keep refrigerated.",
            "Release pan sides. Transfer cheesecake to platter. Top with chocolate curls. Let stand 2 hours at room temperature before serving.",
            "Release pan sides. Transfer cheesecake to platter. Top with chocolate curls. Let stand 2 hours at room temperature before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd7b97b55306961bfaae7/6:4/w_274%2Ch_169/236209.jpg"
    }
}