{
    "recipe": {
        "title": "Dense Chocolate Fudge Cake ",
        "ingredients": [
            "1 3/4 cups all-purpose flour",
            "1/3 cup unsweetened cocoa powder",
            "1 3/4 teaspoons baking powder",
            "1/2 teaspoon baking soda",
            "Slightly rounded 1/4 teaspoon salt",
            "8 ounces bittersweet chocolate (60% cacao), finely chopped",
            "1 1/2 sticks unsalted butter",
            "3 large eggs, lightly beaten",
            "1 cup water",
            "1 1/2 cups sugar",
            "4 ounces bittersweet chocolate (60% cacao), finely chopped",
            "1 tablespoon unsalted butter, cut into bits",
            "1 tablespoon light corn syrup",
            "Equipment: a 9-inch springform pan",
            "Accompaniment: vanilla ice cream"
        ],
        "instructions": [
            "Preheat oven to 325°F with rack in middle. Flip bottom of springform pan so lip is facing down, then lock in place. Butter bottom and side of pan, then dust bottom with flour, knocking out excess.",
            "Whisk flour, cocoa, baking powder, baking soda, and salt in a large bowl.",
            "Melt chocolate with butter in a 3-quart heavy saucepan over low heat, stirring. Remove from heat and whisk in eggs and water until smooth. Whisk into flour mixture, then whisk in sugar until smooth. Pour into pan and rap on counter to eliminate any air bubbles.",
            "Bake until cake is just starting to pull away from side of pan and a wooden pick inserted into center comes out clean, 1 1/4 to 1 1/2 hours.",
            "Cool cake in pan 20 minutes, then remove side of pan and cool completely, at least 1 hour.",
            "Make glaze: Melt chocolate in a small metal bowl set over simmering water, stirring until smooth. Stir in butter and corn syrup. Cool slightly, then spread just over top of cooled cake.",
            "Melt chocolate in a small metal bowl set over simmering water, stirring until smooth. Stir in butter and corn syrup. Cool slightly, then spread just over top of cooled cake."
        ],
        "picture_link": null
    }
}