{
    "recipe": {
        "title": "Detroit-Style Pizza ",
        "ingredients": [
            "1 cup (230g) Water, 100°F [38°C]",
            "1 tsp sea salt",
            "2 cups plus 1 Tbsp (290g) all-purpose flour",
            "3/4 tsp instant yeast",
            "1 (28-oz/795g) can crushed tomatoes",
            "3 Tbsp (44g) granulated sugar",
            "1 tsp dried oregano, crushed",
            "1 Tbsp dried basil, crushed",
            "1 1/2 tsp finely minced garlic",
            "1 tsp sea salt",
            "1/2 tsp ground black pepper",
            "1/4 cup (45g) shredded Parmesan cheese",
            "8 slices pepperoni (optional)",
            "2 cups (230g) shredded mozzarella cheese",
            "2 cups (230g) shredded brick cheese (or mozzarella)",
            "1 pinch dried oregano",
            "1 pinch sea salt",
            "1 cup (230g) pizza sauce, warm"
        ],
        "instructions": [
            "In the bowl of a stand mixer, add the water and sea salt and stir to dissolve the salt. Add the flour and yeast and mix with a wooden spoon until the dough becomes a shaggy mass. Make sure that all of the flour is hydrated. Using the dough hook attachment, mix on medium-low speed for 4 minutes. Scrape the sides of the bowl and release the dough from the hook. Mix for an additional 4 minutes. It will now hold a round shape.",
            "Spray a bowl with nonstick cooking spray or brush lightly with olive oil. Place the dough into the bowl and cover with plastic. Let the dough relax for 15 minutes, and then shape the dough.",
            "Shape the dough: Lightly oil or butter the inside surfaces of a 9-by-13-in [23-by-33-cm] baking pan or Detroit pizza pan. Place the dough into the pan and use your fingertips to spread the dough out to the corners and sides of the pan. The dough will be sticky, so lightly dip your fingertips in oil to make stretching it easier. Set the pan aside, cover with plastic, and let rise in a warm area for1 1/2 to 2 hours, or until the dough is approximately 1/2 to 3/4 in [1.5 to 2 cm] tall in the pan.",
            "Lightly oil or butter the inside surfaces of a 9-by-13-in [23-by-33-cm] baking pan or Detroit pizza pan.",
            "Place the dough into the pan and use your fingertips to spread the dough out to the corners and sides of the pan. The dough will be sticky, so lightly dip your fingertips in oil to make stretching it easier. Set the pan aside, cover with plastic, and let rise in a warm area for1 1/2 to 2 hours, or until the dough is approximately 1/2 to 3/4 in [1.5 to 2 cm] tall in the pan.",
            "Make the sauce: Combine the tomatoes, sugar, oregano, basil, garlic, salt, and pepper and stir together in a medium saucepan. Bring to a simmer over medium heat, stirring periodically. Using an immersion blender or food processor, purée the sauce until smooth. Place it back over medium heat. Simmer the puréed sauce until slightly thickened, 5 to 10 minutes, stirring periodically. Keep the sauce warm for ladling over the pizza, or cool and refrigerate for up to a week. This recipe makes about 3 cups [710 ml] of sauce and it can also be frozen for up to 3 months, if desired. You will have more sauce than you need for one pizza.",
            "Combine the tomatoes, sugar, oregano, basil, garlic, salt, and pepper and stir together in a medium saucepan. Bring to a simmer over medium heat, stirring periodically. Using an immersion blender or food processor, purée the sauce until smooth. Place it back over medium heat. Simmer the puréed sauce until slightly thickened, 5 to 10 minutes, stirring periodically.",
            "Keep the sauce warm for ladling over the pizza, or cool and refrigerate for up to a week. This recipe makes about 3 cups [710 ml] of sauce and it can also be frozen for up to 3 months, if desired. You will have more sauce than you need for one pizza.",
            "Top and bake the pizza: Preheat the oven to 475°F [240°C]. Sprinkle the Parmesan cheese around the edge of the pizza where the dough touches the sides of the pan. This cheese will form a crispy, caramelized edge on the crust. If desired, place pepperoni in two rows of four down the length of the pizza, directly on top of the dough. Gently push the pepperoni into the dough. Sprinkle the mozzarella and brick cheeses over the surface of the pizza, spreading them all the way to the edges where the dough meets the sides of the pan. This cheese will also contribute to the crispy, caramelized edge on the crust. Season the top of the pizza with a pinch each of oregano and salt. Place in the oven and bake for 15 minutes. Look for an amber-colored top and crispy edges. After removing the pizza from the oven, use a small offset spatula or knife to loosen the sides of the crust from the pan. Slide the pizza out of the pan onto a cooling rack. At this point, if a crispier bottom is desired, you can put the pizza (out of the pan) directly onto the oven rack or a sheet tray and bake for an extra 5 minutes for a slightly more browned finish on the bottom of the crust. After you remove the pizza from the oven, top it with the warm sauce. Traditionally, it is ladled into two rows down the length of the pizza. Serve warm.",
            "Preheat the oven to 475°F [240°C].",
            "Sprinkle the Parmesan cheese around the edge of the pizza where the dough touches the sides of the pan. This cheese will form a crispy, caramelized edge on the crust. If desired, place pepperoni in two rows of four down the length of the pizza, directly on top of the dough. Gently push the pepperoni into the dough.",
            "Sprinkle the mozzarella and brick cheeses over the surface of the pizza, spreading them all the way to the edges where the dough meets the sides of the pan. This cheese will also contribute to the crispy, caramelized edge on the crust. Season the top of the pizza with a pinch each of oregano and salt.",
            "Place in the oven and bake for 15 minutes. Look for an amber-colored top and crispy edges.",
            "After removing the pizza from the oven, use a small offset spatula or knife to loosen the sides of the crust from the pan. Slide the pizza out of the pan onto a cooling rack. At this point, if a crispier bottom is desired, you can put the pizza (out of the pan) directly onto the oven rack or a sheet tray and bake for an extra 5 minutes for a slightly more browned finish on the bottom of the crust.",
            "After you remove the pizza from the oven, top it with the warm sauce. Traditionally, it is ladled into two rows down the length of the pizza. Serve warm.",
            "Do Ahead: This pizza can be kept in the refrigerator for up to 3 days and reheated on a lightly oiled sheet tray at 475°F [240°C].",
            "This pizza can be kept in the refrigerator for up to 3 days and reheated on a lightly oiled sheet tray at 475°F [240°C]."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59c2baf0c7319519e1cf1c1c/6:4/w_274%2Ch_169/zingermans_detroit_pizza_recipe-092017.jpg"
    }
}