{
    "recipe": {
        "title": "Devilish Green Eggs and Ham ",
        "ingredients": [
            "1 dozen hard-cooked eggs",
            "3 tablespoons mayonnaise",
            "3/4 teaspoon Dijon mustard",
            "1 teaspoon minced fresh garlic",
            "6 tablespoons purchased basil pesto",
            "2 tablespoons very thinly sliced green onion",
            "Salt",
            "4 ounces very thinly sliced prosciutto, cut into short, thin strips",
            "2 tablespoons finely chopped fresh basil",
            "1 teaspoon extra-virgin olive oil"
        ],
        "instructions": [
            "Halve the eggs lengthwise and transfer the yolks to a mixing bowl. Set the egg white halves on a platter, cover, and refrigerate. With a fork, mash the yolks to a smooth consistency. Add the mayonnaise, mustard, garlic, and pesto, and mix until smooth. (You can also do this using an electric mixer with a whip attachment.) Stir in the green onion. Taste the egg mixture and add a little salt if needed; pestos differ in salt content. Spoon the mixture into a pastry bag fitted with a plain or large star tip, then pipe the mixture evenly into the egg white halves. Or fill the eggs with a spoon, dividing the filling evenly. To make the topping, in a small bowl, mix together the prosciutto and basil. Drizzle with the oil and toss to coat. Top each egg half with about 1 heaping teaspoon of the mixture.",
            "Halve the eggs lengthwise and transfer the yolks to a mixing bowl. Set the egg white halves on a platter, cover, and refrigerate.",
            "With a fork, mash the yolks to a smooth consistency. Add the mayonnaise, mustard, garlic, and pesto, and mix until smooth. (You can also do this using an electric mixer with a whip attachment.) Stir in the green onion. Taste the egg mixture and add a little salt if needed; pestos differ in salt content.",
            "Spoon the mixture into a pastry bag fitted with a plain or large star tip, then pipe the mixture evenly into the egg white halves. Or fill the eggs with a spoon, dividing the filling evenly.",
            "To make the topping, in a small bowl, mix together the prosciutto and basil. Drizzle with the oil and toss to coat. Top each egg half with about 1 heaping teaspoon of the mixture."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56005afe8bed7b35040ac4cc/6:4/w_274%2Ch_169/51158200_devilish-green-eggs-ham.jpg"
    }
}