{
    "recipe": {
        "title": "Dilly Rolls ",
        "ingredients": [
            "1/2 cup whole milk",
            "2 tablespoons sugar",
            "1 1/4-ounce envelope active dry yeast (about 2 1/4 teaspoon)",
            "1/2 cup buttermilk",
            "1/2 small onion, finely chopped",
            "2 tablespoons finely chopped fresh dill",
            "2 teaspoons dill seeds",
            "1 1/2 teaspoon kosher salt",
            "2 1/2 cups all-purpose flour plus more",
            "4 tablespoons (1/2 stick) unsalted butter, melted, divided, plus more for bowl and parchment paper"
        ],
        "instructions": [
            "Gently heat milk until warm to the touch (an instant-read thermometer should register 120°F–130°F). Add sugar and yeast and whisk to combine. Add buttermilk; let sit until yeast starts to foam, 5–10 minutes. Combine onion, fresh dill, dill seeds, salt, and 2 1/2 cups flour in a large bowl. Stir in milk mixture and 2 tablespoons butter, adding more flour as needed (dough will initially be fairly wet), until a sticky dough forms. Turn out onto a lightly floured surface and knead until dough is smooth and elastic, about 5 minutes. Transfer dough to a lightly buttered bowl and cover with plastic wrap. Let rise in a warm, draft-free area until doubled in size, about 1 hour. Punch down dough and let rise until doubled again, about 1 hour. Punch down dough and, using a pastry scraper or a sharp knife, divide into 12 pieces. Line a baking sheet with parchment paper and lightly butter top. Cupping your hand over and using your palm, roll each piece of dough on work surface into a ball and place on prepared baking sheet, spacing at least 2\" apart (you need to leave enough room so that they're not touching after they've risen). Brush tops with remaining 2 tablespoons butter and cover loosely with plastic wrap; let rise until almost doubled in size, 20–30 minutes. Meanwhile, preheat oven to 400°F. Bake rolls until puffed and deep golden brown on the tops and bottoms, 15–20 minutes. Transfer to a wire rack and let cool slightly before serving. DO AHEAD: Rolls can be made 3 hours ahead. Reheat before serving, if desired.",
            "Gently heat milk until warm to the touch (an instant-read thermometer should register 120°F–130°F). Add sugar and yeast and whisk to combine. Add buttermilk; let sit until yeast starts to foam, 5–10 minutes.",
            "Combine onion, fresh dill, dill seeds, salt, and 2 1/2 cups flour in a large bowl. Stir in milk mixture and 2 tablespoons butter, adding more flour as needed (dough will initially be fairly wet), until a sticky dough forms. Turn out onto a lightly floured surface and knead until dough is smooth and elastic, about 5 minutes.",
            "Transfer dough to a lightly buttered bowl and cover with plastic wrap. Let rise in a warm, draft-free area until doubled in size, about 1 hour. Punch down dough and let rise until doubled again, about 1 hour. Punch down dough and, using a pastry scraper or a sharp knife, divide into 12 pieces.",
            "Line a baking sheet with parchment paper and lightly butter top. Cupping your hand over and using your palm, roll each piece of dough on work surface into a ball and place on prepared baking sheet, spacing at least 2\" apart (you need to leave enough room so that they're not touching after they've risen). Brush tops with remaining 2 tablespoons butter and cover loosely with plastic wrap; let rise until almost doubled in size, 20–30 minutes.",
            "Meanwhile, preheat oven to 400°F.",
            "Bake rolls until puffed and deep golden brown on the tops and bottoms, 15–20 minutes. Transfer to a wire rack and let cool slightly before serving.",
            "DO AHEAD: Rolls can be made 3 hours ahead. Reheat before serving, if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad58e66529d92b2c044cc6/6:4/w_274%2Ch_169/51198770_dilly-rolls_1x1.jpg"
    }
}