{
    "recipe": {
        "title": "Dinner Salad with Radicchio and Roasted Sweet Potatoes ",
        "ingredients": [
            "1/2 cup salted, roasted cashews",
            "1/4 cup vegetable oil",
            "3 Tbsp. unseasoned rice vinegar",
            "3/4 tsp. crushed red pepper flakes",
            "3/4 tsp. fish sauce",
            "3/4 tsp. honey",
            "1 garlic clove",
            "Kosher salt",
            "4 small sweet potatoes (about 1 1/2 lb. total), scrubbed, halved lengthwise",
            "2 Tbsp. extra-virgin olive oil",
            "4 large eggs",
            "2 heads of radicchio (about 1 lb. total), quartered, cores removed, leaves separated",
            "1 small fennel bulb, quartered lengthwise, thinly sliced lengthwise",
            "2 Tbsp. unseasoned rice vinegar",
            "1/2 cup crushed salted, roasted cashews",
            "1/2 cup cilantro leaves with tender stems",
            "Kosher salt"
        ],
        "instructions": [
            "Blend cashews, oil, vinegar, red pepper flakes, fish sauce, honey, garlic, and 1/3 cup warm water in a blender until very creamy, smooth, and pourable. Taste dressing and season with salt.",
            "Do Ahead: Dressing can be made 3 days ahead. Cover and chill.",
            "For the salad: Place a rack in middle of oven; preheat to 425°F. Place sweet potatoes on a rimmed baking sheet, drizzle with oil, and season with kosher salt; turn to coat. Arrange cut side down; roast until tender and cut sides are browned, 20–25 minutes. Let cool. Bring a medium pot of water to a boil. Carefully lower eggs into water and cook 8 minutes. Transfer eggs to a bowl of ice water and let cool. Remove eggs from ice water, pat dry, and peel. Toss radicchio, fennel, and vinegar in a large bowl; season with sea salt. Drizzle 1/2 cup dressing down sides of bowl. Using your hands, fold salad, working from the bottom out toward the sides of the bowl, until evenly coated in dressing. Transfer salad to a platter. Tear sweet potatoes and eggs into 1 1/2\" pieces and nestle into salad. Season egg yolks with sea salt. Drizzle more dressing over and top with cashews and cilantro. Serve with remaining dressing alongside.",
            "Place a rack in middle of oven; preheat to 425°F. Place sweet potatoes on a rimmed baking sheet, drizzle with oil, and season with kosher salt; turn to coat. Arrange cut side down; roast until tender and cut sides are browned, 20–25 minutes. Let cool.",
            "Bring a medium pot of water to a boil. Carefully lower eggs into water and cook 8 minutes. Transfer eggs to a bowl of ice water and let cool. Remove eggs from ice water, pat dry, and peel.",
            "Toss radicchio, fennel, and vinegar in a large bowl; season with sea salt. Drizzle 1/2 cup dressing down sides of bowl. Using your hands, fold salad, working from the bottom out toward the sides of the bowl, until evenly coated in dressing.",
            "Transfer salad to a platter. Tear sweet potatoes and eggs into 1 1/2\" pieces and nestle into salad. Season egg yolks with sea salt. Drizzle more dressing over and top with cashews and cilantro. Serve with remaining dressing alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5cb9deb0a025aa30f7e127fb/6:4/w_274%2Ch_169/dinner-salad-with-radicchio-and-roasted-sweet-potatoes-recipe-BA-040519.jpg",
        "color": 16682344
    }
}