{
    "recipe": {
        "title": "Double RL Ranch Burger ",
        "ingredients": [
            "1/2 cup mayonnaise (preferably Hellmann's or Best Foods)",
            "1/3 cup ketchup (preferably Heinz)",
            "2 tablespoons sweet relish",
            "1 tablespoon finely chopped cornichons",
            "1 tablespoon finely chopped red onion",
            "1 teaspoon Worcestershire sauce",
            "1/2 teaspoon garlic powder",
            "1/2 teaspoon onion powder",
            "1/4 teaspoon hot sauce (preferably Tabasco)",
            "Kosher salt, freshly ground pepper",
            "3 pounds ground beef chuck (20% fat)",
            "Kosher salt",
            "8 ounces clothbound cheddar (such as Cabot), thinly sliced",
            "8 sesame buns, toasted",
            "16 slices bacon, cooked",
            "Green leaf lettuce, sliced tomato, sliced red onion, and sliced pickles (for serving)"
        ],
        "instructions": [
            "Mix mayonnaise, ketchup, relish, cornichons, onion, Worcestershire sauce, garlic powder, onion powder, and hot sauce in a small bowl; season sauce with salt and pepper.",
            "Do Ahead Sauce can be made 2 days ahead. Cover and chill.",
            "Sauce can be made 2 days ahead. Cover and chill.",
            "Burgers: Prepare grill for medium-high heat. Divide beef into 8 portions (about 6 ounces each). Working with 1 portion at a time, cup your hands around the meat and begin to gently shape it into a round patty, being careful not to pack the meat too tightly. Lightly press down on patty to flatten, then press a slight indentation into the center with your thumb (this will prevent patties from bulging when cooked). Generously season both sides of patties with salt and grill 5 minutes. Turn and top with cheese. Cover grill and cook until cheese is melted and patties are medium-rare, about 5 minutes more. Transfer to a platter and let rest 5 minutes. Build burgers with buns, patties, bacon, lettuce, tomato, onion, pickles, and special sauce.",
            "Prepare grill for medium-high heat. Divide beef into 8 portions (about 6 ounces each). Working with 1 portion at a time, cup your hands around the meat and begin to gently shape it into a round patty, being careful not to pack the meat too tightly. Lightly press down on patty to flatten, then press a slight indentation into the center with your thumb (this will prevent patties from bulging when cooked).",
            "Generously season both sides of patties with salt and grill 5 minutes. Turn and top with cheese. Cover grill and cook until cheese is melted and patties are medium-rare, about 5 minutes more. Transfer to a platter and let rest 5 minutes.",
            "Build burgers with buns, patties, bacon, lettuce, tomato, onion, pickles, and special sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5580664481ac1e502367643f/6:4/w_274%2Ch_169/56389654_double-rl-ranch-burger_1x1.jpg",
        "color": 15282974
    }
}