{
    "recipe": {
        "title": "Double Ginger Sticky Toffee Pudding ",
        "ingredients": [
            "1/2 cup (1 stick) unsalted butter, room temperature, plus more for pan",
            "2 cups all-purpose flour, plus more for pan",
            "10 ounces Medjool dates, chopped (about 2 cups)",
            "1 teaspoon baking soda",
            "2 teaspoons baking powder",
            "1/2 teaspoon kosher salt",
            "1 cup (packed) dark brown sugar",
            "2 teaspoons finely grated peeled ginger",
            "3 large eggs, room temperature",
            "1/2 cup chopped crystallized ginger",
            "1 cup (packed) dark brown sugar",
            "1 cup heavy cream",
            "3/4 cup (1 1/2 sticks) unsalted butter",
            "1 teaspoon kosher salt",
            "Demerara sugar (for serving)",
            "A 9-cup Bundt pan"
        ],
        "instructions": [
            "Cake: Preheat oven to 350°F. Thoroughly butter and flour pan, making sure to get into all curved or detailed places. Toss dates and baking soda in a small bowl to coat, then pour in 1 cup boiling water. Let mixture sit until dates are very soft, 10–15 minutes. Mash dates lightly with a fork (mixture will be thick but not smooth and homogenous). While dates are soaking, whisk baking powder, salt, and remaining 2 cups flour in a medium bowl. Using an electric mixer on high speed, beat brown sugar, fresh ginger, and remaining 1/2 cup butter in a large bowl until light and fluffy, about 4 minutes. Add eggs one at a time, beating to blend after each addition before adding the next. Then alternating, add dry ingredients and date mixture in 2 additions each, starting with dry ingredients and ending with date mixture. Fold in crystallized ginger. Scrape batter into prepared pan and smooth surface. Bake cake until top is firm and springs back when gently pressed with your fingers and a tester inserted into the center comes out clean, 35–45 minutes. Transfer pan to a wire rack set inside a rimmed baking sheet. Let cake cool in pan 10 minutes before turning out onto rack, then let cool another 20 minutes (cake should still be warm).",
            "Preheat oven to 350°F. Thoroughly butter and flour pan, making sure to get into all curved or detailed places. Toss dates and baking soda in a small bowl to coat, then pour in 1 cup boiling water. Let mixture sit until dates are very soft, 10–15 minutes. Mash dates lightly with a fork (mixture will be thick but not smooth and homogenous).",
            "While dates are soaking, whisk baking powder, salt, and remaining 2 cups flour in a medium bowl.",
            "Using an electric mixer on high speed, beat brown sugar, fresh ginger, and remaining 1/2 cup butter in a large bowl until light and fluffy, about 4 minutes. Add eggs one at a time, beating to blend after each addition before adding the next. Then alternating, add dry ingredients and date mixture in 2 additions each, starting with dry ingredients and ending with date mixture. Fold in crystallized ginger. Scrape batter into prepared pan and smooth surface.",
            "Bake cake until top is firm and springs back when gently pressed with your fingers and a tester inserted into the center comes out clean, 35–45 minutes. Transfer pan to a wire rack set inside a rimmed baking sheet. Let cake cool in pan 10 minutes before turning out onto rack, then let cool another 20 minutes (cake should still be warm).",
            "Toffee sauce and assembly: Bring brown sugar, cream, butter, salt, and 2 tablespoons water to a boil in a small saucepan over medium-low heat, stirring to melt butter. Cook, stirring, until mixture is thick enough to coat a spoon, 5–8 minutes. Let cool slightly. Poke holes all over warm cake with a toothpick. Wipe out Bundt pan; pour a third of sauce into pan. Carefully invert cake back into pan. Poke holes in bottom of cake and pour more sauce over. Let sit until cake absorbs sauce, 15–20 minutes. Turn cake out onto rack (it may not come out at first but will eventually release) and sprinkle with demerara sugar. Serve cake with remaining toffee sauce. If the sauce has cooled by the time you're ready to serve, gently reheat just to warm through.",
            "Bring brown sugar, cream, butter, salt, and 2 tablespoons water to a boil in a small saucepan over medium-low heat, stirring to melt butter. Cook, stirring, until mixture is thick enough to coat a spoon, 5–8 minutes. Let cool slightly.",
            "Poke holes all over warm cake with a toothpick. Wipe out Bundt pan; pour a third of sauce into pan. Carefully invert cake back into pan. Poke holes in bottom of cake and pour more sauce over. Let sit until cake absorbs sauce, 15–20 minutes.",
            "Turn cake out onto rack (it may not come out at first but will eventually release) and sprinkle with demerara sugar. Serve cake with remaining toffee sauce. If the sauce has cooled by the time you're ready to serve, gently reheat just to warm through.",
            "Do Ahead Cake can be made 1 day ahead; store tightly covered at room temperature. Cover and chill leftover sauce. Gently reheat before serving.",
            "Cake can be made 1 day ahead; store tightly covered at room temperature. Cover and chill leftover sauce. Gently reheat before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5626772b53de6d0d5cdfb078/6:4/w_274%2Ch_169/56390054_double-ginger-sticky-toffee-pudding.jpg"
    }
}