{
    "recipe": {
        "title": "Double Chocolate Pudding Parfait ",
        "ingredients": [
            "2 tablespoons cornstarch",
            "1/4 cup plus 2 tablespoons sugar, divided",
            "1/4 cup plus 1 tablespoon unsweetened cocoa powder, divided, plus additional for garnish",
            "2 cups whole milk",
            "4 ounces fine-quality semisweet chocolate (no more than 54% cacao if marked), finely chopped",
            "1 tablespoon unsalted butter",
            "1 cup chilled heavy cream",
            "1/4 teaspoon pure vanilla extract"
        ],
        "instructions": [
            "Whisk together cornstarch, 1/4 cup sugar, 1/4 cup cocoa, and a pinch of salt in a heavy medium saucepan, then gradually whisk in milk. Bring to a boil, whisking constantly, then boil, whisking, until thickened, about 3 minutes. Remove from heat and whisk in chopped chocolate and butter until melted. Transfer pudding to a metal bowl and quick-chill by setting in an ice bath and stirring occasionally, about 10 minutes. Meanwhile, beat cream with vanilla and remaining 2 tablespoons sugar and 1 tablespoon cocoa until it just holds stiff peaks. Layer pudding and cream in 8-ounce glasses. Serve dusted with cocoa.",
            "Whisk together cornstarch, 1/4 cup sugar, 1/4 cup cocoa, and a pinch of salt in a heavy medium saucepan, then gradually whisk in milk. Bring to a boil, whisking constantly, then boil, whisking, until thickened, about 3 minutes. Remove from heat and whisk in chopped chocolate and butter until melted. Transfer pudding to a metal bowl and quick-chill by setting in an ice bath and stirring occasionally, about 10 minutes.",
            "Meanwhile, beat cream with vanilla and remaining 2 tablespoons sugar and 1 tablespoon cocoa until it just holds stiff peaks. Layer pudding and cream in 8-ounce glasses. Serve dusted with cocoa."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d77e5f9a841923089d532/6:4/w_274%2Ch_169/241472_hires.jpg"
    }
}