{
    "recipe": {
        "title": "Double-Corn Fritters With Dungeness Crab Crème Fraîche ",
        "ingredients": [
            "2/3 cup yellow cornmeal",
            "3 tablespoons all-purpose flour",
            "1 teaspoon sugar",
            "1/8 teaspoon baking soda",
            "1/8 teaspoon salt",
            "1/2 cup buttermilk",
            "1 large egg",
            "2/3 cup fresh corn kernels",
            "1/2 cup diced red onion",
            "1/2 cup diced red bell pepper",
            "Corn oil (for frying)",
            "6 ounces Dungeness crabmeat, picked over, patted dry, flaked",
            "1/2 cup crème fraîche or sour cream",
            "1/4 cup finely chopped fresh chives plus additional chives for garnish",
            "1/4 teaspoon ground white pepper",
            "Pinch of cayenne pepper"
        ],
        "instructions": [
            "Mix first 5 ingredients in medium bowl. Whisk buttermilk and egg in small bowl to blend. Stir egg mixture into dry ingredients, then stir in corn kernels, onion, and bell pepper (do not overmix).",
            "Pour enough oil into large skillet to coat bottom. Heat oil over medium heat. Working in batches, drop 1 scant tablespoon batter for each fritter into hot skillet; spread each to 2-inch round. Fry until golden, about 2 minutes per side. Transfer to baking sheet. (Can be made ahead. Let stand at room temperature up to 2 hours or cover and chill overnight. Bake uncovered in 350°F oven until heated through, 6 to 8 minutes.)",
            "For crème fraîche: Place crabmeat in medium bowl. Fold in crème fraîche, 1/4 cup chives, white pepper, and cayenne. Season with salt. (Can be made 2 hours ahead. Cover; chill. Stir before using.)",
            "Place crabmeat in medium bowl. Fold in crème fraîche, 1/4 cup chives, white pepper, and cayenne. Season with salt. (Can be made 2 hours ahead. Cover; chill. Stir before using.)",
            "Arrange warm fritters on platter. Top with crab mixture and garnish with additional chives.",
            "Arrange warm fritters on platter. Top with crab mixture and garnish with additional chives."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57a8de0dde966cd27ad748f9/6:4/w_274%2Ch_169/corn-fritters-with-crab-salad-080816.jpg"
    }
}