{
    "recipe": {
        "title": "Double-Dutch Mac and Cheese with Chard ",
        "ingredients": [
            "6 tablespoons (3/4 stick) butter, divided",
            "1 cup chopped onion",
            "2 garlic cloves, minced",
            "1/4 cup unbleached all purpose flour",
            "3 cups reduced-fat (2%) milk",
            "2 cups (packed) coarsely grated aged Gouda cheese plus 1/2 cup finely grated (about 10 ounces total)",
            "2 cups (packed) coarsely grated Edam cheese, divided",
            "1/4 teaspoon cayenne pepper",
            "1/8 teaspoon ground nutmeg",
            "1 1/2 pounds Swiss chard, stems and center ribs removed",
            "12 ounces elbow macaroni",
            "1 cup fresh breadcrumbs made from crustless sourdough bread",
            "1 teaspoon cumin seeds (optional)"
        ],
        "instructions": [
            "Melt 3 tablespoons butter in large pot over medium heat. Add onion; sauté until translucent, about 5 minutes. Stir in garlic, then flour; stir constantly 1 minute. Gradually whisk in milk. Cook, whisking occasionally, until mixture begins to boil, about 5 minutes. Add 2 cups coarsely grated Gouda and 1 cup Edam. Stir until cheeses melt, about 2 minutes. Stir in cayenne and nutmeg. Season sauce with salt and pepper.",
            "Preheat oven to 350°F. Butter 13x9x2- inch baking dish. Cook chard in large pot of boiling salted water until tender, about 1 minute. Using slotted spoon, transfer chard to plate; cool. Reserve pot with water. Squeeze water from chard; chop finely.",
            "Return water in pot to boil. Add macaroni; cook until tender but still firm to bite, stirring occasionally. Drain. Stir macaroni into warm cheese sauce. Place half of macaroni in dish; smooth top. Top with 1 cup Edam cheese, then chard. Top with remaining macaroni mixture; spread evenly.",
            "Melt 3 tablespoons butter. Place breadcrumbs in medium bowl. Drizzle butter over; toss. Add 1/2 cup finely grated Gouda and sprinkle with salt and pepper; toss. Sprinkle breadcrumb mixture over mac and cheese. Sprinkle cumin seeds over, if desired.",
            "Bake mac and cheese until breadcrumbs are golden and edges are bubbling, about 40 minutes. Let stand 10 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a552e0acd286555db7ce/6:4/w_274%2Ch_169/352670_hires.jpg"
    }
}