{
    "recipe": {
        "title": "Double Chocolate Cake with Peppermint-Chocolate Frosting ",
        "ingredients": [
            "Nonstick vegetable cooking spray",
            "1/2 cup unsweetened applesauce",
            "1 1/4 teaspoons baking powder, divided",
            "2 ounces bittersweet or semisweet chocolate, chopped",
            "2/3 cup unsweetened cocoa powder",
            "2 3/4 cups all-purpose flour",
            "1 1/4 teaspoons baking soda",
            "1/2 teaspoon kosher salt",
            "1 1/3 cups mayonnaise",
            "1 cup granulated sugar",
            "1 cup (packed) dark brown sugar",
            "1 teaspoon vanilla extract",
            "1 pound, 3 ounces bittersweet chocolate, chopped",
            "1 cup refined coconut oil",
            "1 teaspoon vanilla extract",
            "1/4 teaspoon kosher salt",
            "1/4 teaspoon peppermint extract",
            "1 pound, 5 ounces bittersweet chocolate, coarsely chopped",
            "2 candy canes, lightly crushed",
            "2 (9\") round cake pans; a 1\" pastry brush"
        ],
        "instructions": [
            "Position a rack in center of oven; preheat to 350°F. Lightly coat cake pans with nonstick spray. Line bottom of pans with parchment paper; lightly coat parchment with nonstick spray.",
            "Whisk applesauce and 1 tsp. baking powder in a small bowl. Mix chocolate and cocoa powder in a medium bowl. Pour 1 3/4 cups boiling water over and whisk until chocolate is melted. Sift flour, baking soda, salt, and remaining 1/4 tsp. baking powder into another medium bowl.",
            "Using an electric mixer on medium speed, beat mayonnaise, granulated sugar, and brown sugar in a large bowl (or use a stand mixer fitted with the paddle attachment) until well blended, about 3 minutes. Add half of applesauce mixture and beat to blend. Add remaining applesauce mixture, then beat in vanilla. Add dry ingredients in 3 additions, alternating with chocolate mixture in 2 additions, beginning and ending with dry ingredients, beating to blend after each addition and occasionally scraping down sides of bowl. Divide batter among prepared pans; smooth top.",
            "Bake cakes, rotating pans halfway through, until center is set and a tester inserted into the center comes out clean, 40–45 minutes. Transfer pans to a wire rack and let cakes cool 10 minutes. Run a knife around sides of cakes and invert onto wire rack; remove parchment. Let cool.",
            "For the frosting: Heat chocolate, coconut oil, vanilla, and salt in a medium heatproof bowl set over a medium pot of barely simmering water (bottom of bowl should not touch water), stirring occasionally, or in short bursts in the microwave, stirring in between bursts, until chocolate is melted and smooth. Whisk in peppermint extract and 1/4 cup water. Chill, stirring every 5 minutes, until frosting thickens, about 25 minutes. If frosting gets too thick, gently reheat over pot of simmering water.",
            "Heat chocolate, coconut oil, vanilla, and salt in a medium heatproof bowl set over a medium pot of barely simmering water (bottom of bowl should not touch water), stirring occasionally, or in short bursts in the microwave, stirring in between bursts, until chocolate is melted and smooth. Whisk in peppermint extract and 1/4 cup water. Chill, stirring every 5 minutes, until frosting thickens, about 25 minutes. If frosting gets too thick, gently reheat over pot of simmering water.",
            "For the chocolate petals: Heat chocolate in a medium heatproof bowl set over a medium pot of barely simmering water (bottom of bowl should not touch water), stirring occasionally, or in short bursts in the microwave, stirring in between bursts, until chocolate is melted and smooth. Dip clean, dry pastry brush into melted chocolate. Brush a stripe of chocolate about 3\" long and 1/8\" thick on a parchment-lined baking sheet. Chill. Repeat process on second parchment-lined baking sheet. Swap trays and go over original brush strokes, repeating and chilling in between coatings and gently reheating chocolate if needed, until stems are 1/4\" thick. When stems are thick enough, sprinkle one end with crushed candy canes. Chill until set, about 10 minutes.",
            "Heat chocolate in a medium heatproof bowl set over a medium pot of barely simmering water (bottom of bowl should not touch water), stirring occasionally, or in short bursts in the microwave, stirring in between bursts, until chocolate is melted and smooth.",
            "Dip clean, dry pastry brush into melted chocolate. Brush a stripe of chocolate about 3\" long and 1/8\" thick on a parchment-lined baking sheet. Chill. Repeat process on second parchment-lined baking sheet. Swap trays and go over original brush strokes, repeating and chilling in between coatings and gently reheating chocolate if needed, until stems are 1/4\" thick.",
            "When stems are thick enough, sprinkle one end with crushed candy canes. Chill until set, about 10 minutes.",
            "For assembly: Spread 1 Tbsp. frosting in the center of a platter. Place 1 cake layer, domed side down, on platter. Spread 1 1/2 cups frosting evenly over top. Place remaining cake layer, domed side down, over frosting. Spread top and sides of cake with remaining 2 cups frosting, swirling top decoratively. Press chocolate stems into frosting on sides of cake. Serve at room temperature.",
            "Spread 1 Tbsp. frosting in the center of a platter. Place 1 cake layer, domed side down, on platter. Spread 1 1/2 cups frosting evenly over top. Place remaining cake layer, domed side down, over frosting.",
            "Spread top and sides of cake with remaining 2 cups frosting, swirling top decoratively. Press chocolate stems into frosting on sides of cake. Serve at room temperature.",
            "Do Ahead Cake can be made 3 days ahead; wrap tightly in plastic and chill, or freeze up to 2 weeks. Frosting can be made 5 days ahead; chill, or freeze up to 1 month. Gently reheat over pot of simmering water or in short bursts in the microwave, stirring in between bursts. Chocolate stems can be made 3 days ahead; keep chilled.",
            "Cake can be made 3 days ahead; wrap tightly in plastic and chill, or freeze up to 2 weeks. Frosting can be made 5 days ahead; chill, or freeze up to 1 month. Gently reheat over pot of simmering water or in short bursts in the microwave, stirring in between bursts. Chocolate stems can be made 3 days ahead; keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a049a8bcb1af4273373684d/6:4/w_274%2Ch_169/google-express-Peppermint-Chocolate-Cake-110317.jpg",
        "color": 4239858
    }
}