{
    "recipe": {
        "title": "Doughnut-Hole Croquembouche ",
        "ingredients": [
            "About 70 doughnut holes of any flavor",
            "Assorted candy decorations such as M&M's, Red Hots, licorice balls, and silver dragées",
            "1/4 cup corn syrup with 1 teaspoon water stirred in",
            "Purchased or homemade chocolate or caramel sauce (optional)",
            "Clear tape, 18-inch-tall Styrofoam cone (available at floral shops and craft stores), waxed or parchment paper or aluminum foil in color similar to doughnuts, cake-decorating turntable (optional), about 70 toothpicks, thimble, cloth leaves (available at floral shops and craft stores)"
        ],
        "instructions": [
            "Using tape, cover cone with paper. Place cone on turntable if using. Arrange 1 ring doughnut holes around base of cone, placing as closely together as possible. Insert toothpick through each doughnut hole into cone to attach doughnut hole to cone, leaving end of toothpick sticking out (you'll push it in later with thimble). Attach second ring of doughnut holes above first, again packing tightly and staggering so doughnut holes in second ring are not directly above doughnut holes in first ring. Continue in same manner to attach remaining doughnut holes. For top tiers, if desired, slice off small amount of each doughnut hole on side facing toward cone to make shape more tapering. Finish covering cone with 1 doughnut hole attached to top of cone. Using thimble, push in toothpicks until not visible. Decorate by pushing candies and leaves into gaps between doughnut holes. If candies won't adhere, dip in corn syrup-water mixtur before attaching. If desired, drizzle with chocolate or caramel sauce. Croquembouche keeps, covered loosely with aluminum foil and refrigerated, 2 to 3 days.",
            "Using tape, cover cone with paper. Place cone on turntable if using.",
            "Arrange 1 ring doughnut holes around base of cone, placing as closely together as possible. Insert toothpick through each doughnut hole into cone to attach doughnut hole to cone, leaving end of toothpick sticking out (you'll push it in later with thimble).",
            "Attach second ring of doughnut holes above first, again packing tightly and staggering so doughnut holes in second ring are not directly above doughnut holes in first ring.",
            "Continue in same manner to attach remaining doughnut holes. For top tiers, if desired, slice off small amount of each doughnut hole on side facing toward cone to make shape more tapering. Finish covering cone with 1 doughnut hole attached to top of cone.",
            "Using thimble, push in toothpicks until not visible.",
            "Decorate by pushing candies and leaves into gaps between doughnut holes. If candies won't adhere, dip in corn syrup-water mixtur before attaching.",
            "If desired, drizzle with chocolate or caramel sauce. Croquembouche keeps, covered loosely with aluminum foil and refrigerated, 2 to 3 days."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9ab4f3a00aeb2f1cf8ee/6:4/w_274%2Ch_169/240924_hires.jpg"
    }
}