{
    "recipe": {
        "title": "Dried Tomato and Fennel Stuffing ",
        "ingredients": [
            "10 cups 1/4-inch dice crusty country-style bread (about 1 pound)",
            "1 1/2 pounds fennel bulbs (sometimes called anise; about 4 medium)",
            "1 stick (1/2 cup) unsalted butter",
            "1/2 cup drained oil-packed dried tomatoes (about 4 ounces)",
            "3 cups chicken broth",
            "2 tablespoons balsamic vinegar",
            "1 teaspoon dried basil",
            "1/2 teaspoon dried oregano"
        ],
        "instructions": [
            "Preheat oven to 325° F.",
            "In a large shallow baking pan toast bread in middle of oven until just dry, 15 to 20 minutes. Trim fennel stalks flush with bulbs, reserving fronds, and discard stalks. Cut bulbs into 1/4-inch dice and chop reserved fronds. In a large skillet cook fennel bulb and fronds in butter over moderate heat, stirring occasionally, until bulb is tender, 15 to 20 minutes.",
            "While fennel is cooking, cut tomatoes into 1/4-inch dice and in a small saucepan simmer in broth 10 minutes. In a large bowl toss together bread, fennel, tomato mixture, vinegar, herbs, and salt and pepper to taste and cool completely. (Stuffing may be made up to this point 1 day ahead and chilled, covered. Bring stuffing to room temperature before proceeding.)",
            "For cooking stuffing inside poultry: Any frozen poultry destined for stuffing should be completely thawed, and the stuffing itself brought to room temperature before it's put into the turkey. Do not stuff your bird the night before you cook it; such a seeming time-saver can have dangerous results. Instead, it is best to loosely fill the bird's neck and body cavities immediately before roasting. And always use a meat or instant-read thermometer: The meat is done when the temperature of the thickest part of the thigh (be careful not to touch the bones) reaches 180°F.; the stuffing baked inside the bird is done at 160°-165°F. After roasting, let your stuffed poultry stand 15 to 20 minutes, a double assurance that the requisite temperatures for food safety have been reached.",
            "Any frozen poultry destined for stuffing should be completely thawed, and the stuffing itself brought to room temperature before it's put into the turkey. Do not stuff your bird the night before you cook it; such a seeming time-saver can have dangerous results. Instead, it is best to loosely fill the bird's neck and body cavities immediately before roasting. And always use a meat or instant-read thermometer: The meat is done when the temperature of the thickest part of the thigh (be careful not to touch the bones) reaches 180°F.; the stuffing baked inside the bird is done at 160°-165°F. After roasting, let your stuffed poultry stand 15 to 20 minutes, a double assurance that the requisite temperatures for food safety have been reached.",
            "For cooking all or part of stuffing outside poultry: In a shallow baking dish bake stuffing in preheated 325° F oven 40 minutes (for moist stuffing, bake it covered entire time; for less moist stuffing that has a slightly crisp top, uncover it after 10 minutes).",
            "In a shallow baking dish bake stuffing in preheated 325° F oven 40 minutes (for moist stuffing, bake it covered entire time; for less moist stuffing that has a slightly crisp top, uncover it after 10 minutes)."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56133116ce6afd7f7565590d/6:4/w_274%2Ch_169/14486.jpg",
        "color": 16648667
    }
}