{
    "recipe": {
        "title": "Dublin Coddle ",
        "ingredients": [
            "2kg (4 1/2lb) potatoes, peeled",
            "500ml (1 pint) boiled water",
            "1 ham, chicken or beef stock cube (optional)",
            "450g (1lb) good quality pork sausages",
            "450g (1lb) piece thick-cut bacon",
            "2 large onions, sliced",
            "1 tablespoon finely chopped fresh parsley",
            "salt and coarse ground pepper to serve",
            "fresh soda bread"
        ],
        "instructions": [
            "1. Preheat oven to 150°C/300°F/Gas 2. 2. Cut any larger potatoes into three or four pieces, leaving smaller ones whole so that they will cook evenly. Dissolve the stock cube in the boiled water, if using. 3. Grill the sausages and bacon long enough to colour them but taking care not to dry them out. Drain on paper towels and chop the bacon into 2 1/2cm (1in) pieces. You can chop the sausages into bite-sized pieces, though some prefer to leave them whole. 4. In a large ovenproof casserole dish with a tight lid, layer the onions, bacon, sausages and potatoes, seasoning each layer liberally with pepper and parsley. Continue until the ingredients are used up and pour the hot water or bouillon mixture over the top. 5. On the stove, bring the liquid to a boil. Immediately reduce heat and cover the pot. You may like to put a layer of foil underneath the pot lid to help seal it. 6. Place the covered pot in preheated oven and cook for at least three hours (up to four or five hours will not hurt it). After two hours, check liquid levels and add more water if necessary. There should be about an inch of liquid at the bottom of the pot at all times. 7. Serve hot with fresh soda bread to mop up the lovely gravy.",
            "1. Preheat oven to 150°C/300°F/Gas 2.",
            "2. Cut any larger potatoes into three or four pieces, leaving smaller ones whole so that they will cook evenly. Dissolve the stock cube in the boiled water, if using.",
            "3. Grill the sausages and bacon long enough to colour them but taking care not to dry them out. Drain on paper towels and chop the bacon into 2 1/2cm (1in) pieces. You can chop the sausages into bite-sized pieces, though some prefer to leave them whole.",
            "4. In a large ovenproof casserole dish with a tight lid, layer the onions, bacon, sausages and potatoes, seasoning each layer liberally with pepper and parsley. Continue until the ingredients are used up and pour the hot water or bouillon mixture over the top.",
            "5. On the stove, bring the liquid to a boil. Immediately reduce heat and cover the pot. You may like to put a layer of foil underneath the pot lid to help seal it.",
            "6. Place the covered pot in preheated oven and cook for at least three hours (up to four or five hours will not hurt it). After two hours, check liquid levels and add more water if necessary. There should be about an inch of liquid at the bottom of the pot at all times.",
            "7. Serve hot with fresh soda bread to mop up the lovely gravy."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3f9dc21388ef838b10b56/6:4/w_274%2Ch_169/51224810_dublin-coddle_1x1.jpg"
    }
}