{
    "recipe": {
        "title": "Duck Confit with Spicy Pickled Raisins ",
        "ingredients": [
            "8 skin-on, bone-in duck legs",
            "4 garlic cloves, thinly sliced",
            "1 teaspoon freshly ground black pepper, plus more freshly cracked",
            "2 tablespoons plus 1 teaspoon kosher salt",
            "9 sprigs thyme, divided",
            "6 dried chiles de árbol, crushed, or 1 1/2 teaspoons crushed red pepper flakes, divided",
            "1/2 cup white wine vinegar",
            "1/4 cup sugar",
            "2 teaspoons brown mustard seeds",
            "1 sprig rosemary",
            "1 1/2 cups golden raisins"
        ],
        "instructions": [
            "Using the tip of a knife or the sharp tines of a carving fork, prick duck leg skin all over. Rub with garlic (slices should stick to skin) and season with 1 teaspoon ground pepper and 2 tablespoons salt.",
            "Preheat oven to 250°F. Arrange duck skin side down in a roasting pan or large Dutch oven and add 8 thyme sprigs, 4 chiles (or 1 teaspoon red pepper flakes), and 1/2 cup water. Cover pan with foil or lid and cook until fat is rendered (don't be surprised: there will be lots), about 2 hours. Turn duck skin side up and nestle it into rendered fat. Cover pan and continue to cook until meat is very tender and bones easily wiggle when pulled, 2–2 1/2 hours longer.",
            "Meanwhile, bring vinegar, sugar, mustard seeds, rosemary sprig, remaining thyme sprig, 2 chiles (or 1/2 teaspoons red pepper flakes), 1 teaspoon salt, and 1 cup water to a boil in a medium saucepan. Reduce heat and simmer, stirring occasionally, until sugar is dissolved, about 3 minutes. Mix in raisins, remove from heat, and let cool at least 1 hour.",
            "Increase oven temperature to 400°F. Remove duck from fat and place, skin side up, on a rimmed baking sheet; reserve fat for another use (it will keep 3 weeks in refrigerator or 3 months in freezer; reheat and strain before using). Season duck with cracked pepper and roast until skin is brown and crisp, 30–35 minutes. Serve duck with pickled raisins.",
            "DO AHEAD: Raisins can be pickled 1 week ahead. Cover and chill; bring to room temperature before serving. Duck can be cooked 1 week ahead. Pack duck in fat in an airtight container and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad6a2b6529d92b2c04692b/6:4/w_274%2Ch_169/51193810_hires_1x1.jpg"
    }
}