{
    "recipe": {
        "title": "Dulce de Leche and Chocolate Chunk Bread Pudding ",
        "ingredients": [
            "8 1/2-inch-thick slices egg bread (about 4 x 5 inches), crusts trimmed, cut into 3/4- to 1-inch cubes",
            "4 tablespoons (1/2 stick) unsalted butter, melted, divided",
            "1 1/2 cups heavy whipping cream",
            "1 cup purchased dulce de leche ice cream topping or butterscotch-caramel sauce plus more for serving",
            "4 large eggs",
            "2 large egg yolks",
            "2 tablespoons dark rum",
            "1 teaspoon vanilla extract",
            "Pinch of salt",
            "1/2 cup (about 3 ounces) bittersweet chocolate chips",
            "2 tablespoons sugar",
            "Powdered sugar"
        ],
        "instructions": [
            "Preheat oven to 350°F. Place bread in large bowl. Drizzle with 3 tablespoons melted butter; toss. Transfer to rimmed baking sheet. Bake until bread begins to color, stirring occasionally, about 12 minutes. Cool. Brush 11x7x2-inch glass baking dish with 1 tablespoon melted butter. Stir whipping cream and 1 cup dulce de leche in medium saucepan over medium heat until blended and bubbling. Remove from heat. Whisk eggs and yolks in large bowl. Add rum, vanilla, and salt; gradually whisk in warm dulce de leche mixture. Stir in bread cubes. Let soak 30 minutes, stirring occasionally. Mix chocolate chips into custard mixture. Pour into prepared dish. Sprinkle with 2 tablespoons sugar. Bake pudding until puffed and set in center, about 35 minutes. Let cool 15 minutes. Dust with powdered sugar. Serve warm, passing more dulce de leche topping alongside.",
            "Preheat oven to 350°F. Place bread in large bowl. Drizzle with 3 tablespoons melted butter; toss. Transfer to rimmed baking sheet. Bake until bread begins to color, stirring occasionally, about 12 minutes. Cool. Brush 11x7x2-inch glass baking dish with 1 tablespoon melted butter.",
            "Stir whipping cream and 1 cup dulce de leche in medium saucepan over medium heat until blended and bubbling. Remove from heat. Whisk eggs and yolks in large bowl. Add rum, vanilla, and salt; gradually whisk in warm dulce de leche mixture. Stir in bread cubes. Let soak 30 minutes, stirring occasionally.",
            "Mix chocolate chips into custard mixture. Pour into prepared dish. Sprinkle with 2 tablespoons sugar. Bake pudding until puffed and set in center, about 35 minutes. Let cool 15 minutes. Dust with powdered sugar. Serve warm, passing more dulce de leche topping alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5589b69b81ac1e502367a38b/6:4/w_274%2Ch_169/241630_hires_6x4.jpg"
    }
}