{
    "recipe": {
        "title": "Dundee Cake with Hot Marmalade Sauce ",
        "ingredients": [
            "1 3/4 cups all purpose flour",
            "1 teaspoon baking powder",
            "3/4 teaspoon salt",
            "1/8 teaspoon pumpkin pie spice",
            "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
            "3/4 cup plus 2 tablespoons sugar",
            "1 tablespoon whisky",
            "1 1/2 teaspoons grated orange peel",
            "3 large eggs",
            "3/4 cup golden raisins",
            "3/4 cup dark raisins",
            "3/4 cup dried currants",
            "1/3 cup chopped candied orange peel",
            "2 tablespoons orange marmalade",
            "Whole blanched almonds",
            "2/3 cup orange marmalade",
            "3 tablespoons whisky",
            "4 oranges",
            "Sweetened whipped cream"
        ],
        "instructions": [
            "For cake: Preheat oven to 300°F. Butter 8-inch-diameter cake pan with 2-inch-high sides; line bottom with parchment paper. Sift flour, baking powder, salt, and spice into medium bowl. Using electric mixer, beat butter, sugar, whisky, and grated orange peel in large bowl until fluffy. Beat in eggs 1 at a time. Stir in dry ingredients, then all dried fruits and candied peel. Transfer batter to prepared pan. Bake cake 1 hour. Remove cake from oven. Brush top with 2 tablespoons marmalade. Arrange almonds around edge, pressing lightly to adhere. Bake cake until tester inserted into center comes out clean, about 20 minutes longer. Cool cake completely in pan on rack. (Can be made 3 days ahead. Cover; store at room temperature.) Turn cake out of pan; peel off parchment. Place upright on plate.",
            "Preheat oven to 300°F. Butter 8-inch-diameter cake pan with 2-inch-high sides; line bottom with parchment paper. Sift flour, baking powder, salt, and spice into medium bowl. Using electric mixer, beat butter, sugar, whisky, and grated orange peel in large bowl until fluffy. Beat in eggs 1 at a time. Stir in dry ingredients, then all dried fruits and candied peel. Transfer batter to prepared pan.",
            "Bake cake 1 hour. Remove cake from oven. Brush top with 2 tablespoons marmalade. Arrange almonds around edge, pressing lightly to adhere. Bake cake until tester inserted into center comes out clean, about 20 minutes longer. Cool cake completely in pan on rack. (Can be made 3 days ahead. Cover; store at room temperature.) Turn cake out of pan; peel off parchment. Place upright on plate.",
            "For sauce: Combine marmalade and whisky in medium saucepan. Cut all peel and white pith from oranges. Working over bowl to catch juices, cut between membranes, releasing orange segments. Add 2 tablespoons orange juice from bowl to saucepan. Stir over medium-low heat until marmalade melts and sauce is heated through, about 5 minutes. Transfer sauce to serving bowl.",
            "Combine marmalade and whisky in medium saucepan. Cut all peel and white pith from oranges. Working over bowl to catch juices, cut between membranes, releasing orange segments. Add 2 tablespoons orange juice from bowl to saucepan. Stir over medium-low heat until marmalade melts and sauce is heated through, about 5 minutes. Transfer sauce to serving bowl.",
            "Serve cake with warm sauce, orange segments, and whipped cream.",
            "Serve cake with warm sauce, orange segments, and whipped cream."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df232f3a00aeb2f1d5c90/6:4/w_274%2Ch_169/109494.jpg"
    }
}