{
    "recipe": {
        "title": "Earl Grey Doughnuts with Brown Butter Glaze ",
        "ingredients": [
            "1/2 cup (125ml) sparkling clear lemonade",
            "1 teaspoon earl grey tea leaves",
            "1 teaspoon vanilla bean paste or vanilla extract",
            "2 1/4 cups (335g) plain (all-purpose) flour, plus extra for dusting",
            "1/3 cup (75g) caster (superfine) sugar",
            "2 teaspoons dry yeast",
            "4 egg yolks",
            "50g (4 tablespoons) unsalted butter, softened",
            "1/4 cup (60ml) heavy cream",
            "2 tablespoons coffee sugar or Demerara sugar",
            "40g (about 3 tablespoons) unsalted butter, chopped",
            "2 cups (320g) icing (confectioner’s) sugar, sifted",
            "1/4 cup (60ml) boiling water"
        ],
        "instructions": [
            "Place the lemonade, tea and vanilla in a small saucepan over medium heat until just warm. Place the flour, caster sugar and yeast in the bowl of an electric mixer fitted with a dough hook and beat on medium speed until combined. Add the warm lemonade mixture and egg yolks and beat until just combined. Add the butter and cream and beat on medium speed for 6–8 minutes or until a smooth dough forms. Place the dough in a lightly greased bowl, cover with a clean damp tea towel and set aside in a warm place for 1 hour–1 hour 30 minutes or until doubled in size. Line a baking tray with non-stick baking paper. Roll out the dough on a lightly floured surface to 1.5cm (about 1/2-inch) thick. Using an 8.5cm (3.5-inch) round cookie cutter, lightly dusted in flour, cut 6 rounds from the dough. Place on the tray, allowing room to spread. Using a 4cm (1.5-inch) round cutter, lightly dusted in flour, cut and remove the center of each round. Set aside at room temperature for 30 minutes or until risen. Preheat oven to 180°C (350°F). Bake the doughnuts for 8–10 minutes or until golden brown and puffed. While the doughnuts are baking, make the brown butter glaze. Place the butter in a small non-stick frying pan over medium heat and stir until melted. Cook for 3 minutes or until golden brown with a nutty fragrance. Transfer to a medium bowl, add the sugar and water and mix to combine. While the doughnuts are still warm, dip the top half of each doughnut into the glaze and place on a wire rack. Sprinkle with the coffee sugar and allow to stand for 10 minutes or until set, before serving.",
            "Place the lemonade, tea and vanilla in a small saucepan over medium heat until just warm. Place the flour, caster sugar and yeast in the bowl of an electric mixer fitted with a dough hook and beat on medium speed until combined. Add the warm lemonade mixture and egg yolks and beat until just combined. Add the butter and cream and beat on medium speed for 6–8 minutes or until a smooth dough forms. Place the dough in a lightly greased bowl, cover with a clean damp tea towel and set aside in a warm place for 1 hour–1 hour 30 minutes or until doubled in size.",
            "Line a baking tray with non-stick baking paper. Roll out the dough on a lightly floured surface to 1.5cm (about 1/2-inch) thick. Using an 8.5cm (3.5-inch) round cookie cutter, lightly dusted in flour, cut 6 rounds from the dough. Place on the tray, allowing room to spread. Using a 4cm (1.5-inch) round cutter, lightly dusted in flour, cut and remove the center of each round. Set aside at room temperature for 30 minutes or until risen.",
            "Preheat oven to 180°C (350°F). Bake the doughnuts for 8–10 minutes or until golden brown and puffed.",
            "While the doughnuts are baking, make the brown butter glaze. Place the butter in a small non-stick frying pan over medium heat and stir until melted. Cook for 3 minutes or until golden brown with a nutty fragrance. Transfer to a medium bowl, add the sugar and water and mix to combine.",
            "While the doughnuts are still warm, dip the top half of each doughnut into the glaze and place on a wire rack. Sprinkle with the coffee sugar and allow to stand for 10 minutes or until set, before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c620decfa13de700e28a2dc/6:4/w_274%2Ch_169/earl-grey-doughnuts-brown-butter-glaze-recipe-HC-021119.jpg"
    }
}