{
    "recipe": {
        "title": "Easter Egg Cake with Strawberry Frosting ",
        "ingredients": [
            "3/4 cup (1 1/2 sticks) unsalted butter, cubed, room temperature, plus more for pans",
            "2 1/4 cups cake flour, plus more for pans",
            "5 large egg whites",
            "1 cup milk",
            "1/4 cup malted milk powder",
            "2 teaspoons vanilla extract",
            "2 teaspoons baking powder",
            "1 teaspoon kosher salt",
            "1 1/2 cups sugar",
            "1 1/2 cups sliced strawberries (about 8 strawberries)",
            "Pinch of kosher salt",
            "1 cup plus 2 tablespoons sugar, divided",
            "3 tablespoons malted milk powder",
            "1 teaspoon vanilla extract",
            "4 large egg whites",
            "1 1/2 cups (3 sticks) unsalted butter, cut into 1/2-inch cubes, softened",
            "2–3 drops red food coloring (optional)",
            "1 (3-ounce) bar white chocolate",
            "2 cups thinly sliced strawberries (about 16 strawberries)",
            "Pastel-colored candy-coated chocolate eggs",
            "Two (8-inch) round cake pans"
        ],
        "instructions": [
            "Place a rack in middle of oven; preheat to 350°F. Butter and flour cake pans. Mix egg whites, milk, malted milk powder, and vanilla in a medium bowl. Whisk baking powder, salt, and remaining 2 1/4 cups flour in another medium bowl.",
            "Using an electric mixer on medium-high speed, beat sugar and remaining 3/4 cup butter in a large bowl until light and fluffy, 3–4 minutes. Reduce mixer speed to low. Add milk mixture in 3 additions, alternating with dry ingredients in 2 additions, beginning and ending with milk mixture.",
            "Divide batter between prepared pans. Bake cakes until a tester inserted into the center comes out clean, 45–50 minutes. Let cool in pans 5 minutes. Run a sharp knife around edges of cakes and invert on a wire rack. Let cool completely before frosting, at least 3 hours.",
            "Make the frosting: Preheat oven to 300°F. Toss strawberries, salt, 2 Tbsp. sugar, and 2 tsp. water in a small baking dish. Bake until sugar is dissolved and strawberries are bubbling and roasted, 12–15 minutes. Let cool 10 minutes. Transfer to a blender and pulse until smooth. Strain through a fine-mesh sieve into a small bowl (you should have about 1/2 cup). Whisk in malted milk powder and vanilla until smooth. Lightly whisk egg whites and remaining 1 cup sugar in a medium heatproof bowl set over a saucepan of barely simmering water until hot to the touch or a candy thermometer registers 140°F. Pour hot egg white mixture into bowl of a stand mixer fitted with the whisk attachment. Beat on medium-high speed until very fluffy, 5–7 minutes. Fit stand mixer with paddle attachment. Reduce mixer speed to medium-low and beat, adding butter 1 cube at a time, until mixture is smooth and glossy. Continue to beat until mixture begins to look light and fluffy. Add 1/2 cup strawberry purée and food coloring, if using, and stir to combine.",
            "Preheat oven to 300°F. Toss strawberries, salt, 2 Tbsp. sugar, and 2 tsp. water in a small baking dish. Bake until sugar is dissolved and strawberries are bubbling and roasted, 12–15 minutes. Let cool 10 minutes.",
            "Transfer to a blender and pulse until smooth. Strain through a fine-mesh sieve into a small bowl (you should have about 1/2 cup). Whisk in malted milk powder and vanilla until smooth.",
            "Lightly whisk egg whites and remaining 1 cup sugar in a medium heatproof bowl set over a saucepan of barely simmering water until hot to the touch or a candy thermometer registers 140°F.",
            "Pour hot egg white mixture into bowl of a stand mixer fitted with the whisk attachment. Beat on medium-high speed until very fluffy, 5–7 minutes. Fit stand mixer with paddle attachment. Reduce mixer speed to medium-low and beat, adding butter 1 cube at a time, until mixture is smooth and glossy. Continue to beat until mixture begins to look light and fluffy.",
            "Add 1/2 cup strawberry purée and food coloring, if using, and stir to combine.",
            "Assemble the cake: Using a sharp knife, cut chocolate into thin shards, then chill until ready to use. Place 1 cake layer on a cake stand or platter. Using an offset spatula, spread 1/2 cup frosting evenly over top. Arrange an even layer of sliced strawberries on top, pressing to adhere. Place remaining cake, domed side down, on top. Spread top and sides with 1 1/2 cups frosting; chill 10 minutes. Spread remaining frosting over top and sides of cake, smoothing evenly. Chill at least 15 minutes or up to overnight to let frosting set. Arrange white chocolate shards in a round, nest-like shape on top of cake. Place chocolate eggs in center of nest. Slice and serve.",
            "Using a sharp knife, cut chocolate into thin shards, then chill until ready to use.",
            "Place 1 cake layer on a cake stand or platter. Using an offset spatula, spread 1/2 cup frosting evenly over top. Arrange an even layer of sliced strawberries on top, pressing to adhere. Place remaining cake, domed side down, on top. Spread top and sides with 1 1/2 cups frosting; chill 10 minutes.",
            "Spread remaining frosting over top and sides of cake, smoothing evenly. Chill at least 15 minutes or up to overnight to let frosting set.",
            "Arrange white chocolate shards in a round, nest-like shape on top of cake. Place chocolate eggs in center of nest. Slice and serve.",
            "Do Ahead Cake can be made 3 days ahead; wrap tightly in plastic and chill, or freeze up to 2 weeks.",
            "Cake can be made 3 days ahead; wrap tightly in plastic and chill, or freeze up to 2 weeks."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58d2961045d58f3111d7ad67/6:4/w_274%2Ch_169/Strawberry-Malted-Easter-Nest-Cake-SLICED-PLATED-22032017.jpg"
    }
}