{
    "recipe": {
        "title": "Easy Chicken Nuggets ",
        "ingredients": [
            "1 pound chicken breasts, boneless & skinless cut into chunks",
            "1/4 cup old fashioned oats (also known as 5 minute oats)",
            "1/4 teaspoon dried parsley",
            "1/2 teaspoon garlic powder",
            "1/4 teaspoon onion powder",
            "1/2 teaspoon kosher salt",
            "3/4 cup panko bread crumbs",
            "1 tablespoon parmesan cheese, grated"
        ],
        "instructions": [
            "Preheat oven to 375° F. Place the first 6 ingredients in a food processor until chicken is finely chopped and ingredients are combined. Place the bread crumbs and parmesan cheese in a shallow bowl or on a plate and stir to combine. With moistened hands, roll 1 tablespoon of chicken mixture between your palms and flatten it into a \"nugget\" shape. Gently press nuggets into bread crumbs to evenly coat them. Place nuggets on a cooling rack. Place cooling rack over a foil-lined baking sheet. Lightly spray nuggets with cooking spray. Bake for 15 minutes and serve. To freeze, place nuggets on a sheet tray after this step and freeze for one hour. Place nuggets in labeled freezer bags for up to 3 months. When ready to cook, follow the directions starting with step #6. ** If you want your nuggets to be golden brown, place under the broiler for 2 minutes after cooking.",
            "Preheat oven to 375° F.",
            "Place the first 6 ingredients in a food processor until chicken is finely chopped and ingredients are combined.",
            "Place the bread crumbs and parmesan cheese in a shallow bowl or on a plate and stir to combine.",
            "With moistened hands, roll 1 tablespoon of chicken mixture between your palms and flatten it into a \"nugget\" shape.",
            "Gently press nuggets into bread crumbs to evenly coat them.",
            "Place nuggets on a cooling rack. Place cooling rack over a foil-lined baking sheet.",
            "Lightly spray nuggets with cooking spray.",
            "Bake for 15 minutes and serve.",
            "To freeze, place nuggets on a sheet tray after this step and freeze for one hour. Place nuggets in labeled freezer bags for up to 3 months. When ready to cook, follow the directions starting with step #6.",
            "To freeze, place nuggets on a sheet tray after this step and freeze for one hour. Place nuggets in labeled freezer bags for up to 3 months. When ready to cook, follow the directions starting with step #6.",
            "** If you want your nuggets to be golden brown, place under the broiler for 2 minutes after cooking."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54cada531f13bb9b2edf9d13/6:4/w_274%2Ch_169/51261930_easy-chicken-nuggets_1x1.jpg"
    }
}