{
    "recipe": {
        "title": "Easy General Tso's Chicken ",
        "ingredients": [
            "1 pound green beans, trimmed",
            "7 tablespoons vegetable oil, divided",
            "2 1/4 teaspoons kosher salt, divided",
            "1 teaspoon freshly ground black pepper, divided",
            "1/4 cup plus 2 tablespoons cornstarch",
            "2 pounds boneless, skinless chicken thighs, breasts, or a mix, patted dry, cut into 1\" chunks",
            "1/4 cup plus 1 tablespoon honey",
            "1/4 cup low-sodium soy sauce",
            "1 large garlic clove, finely grated",
            "3 tablespoons unseasoned rice vinegar",
            "1 tablespoon Sriracha",
            "1 tablespoon tomato paste",
            "1 teaspoon finely grated ginger",
            "6 (or more) dried whole red chiles, such as chiles de árbol",
            "1 scallion, thinly sliced",
            "Cooked rice (for serving)"
        ],
        "instructions": [
            "Preheat oven to 425°F. Toss green beans with 1 Tbsp. oil, 1/2 tsp. salt, and 1/4 tsp. pepper on a rimmed baking sheet. Roast, tossing once halfway through, until crisp-tender and blackened in spots, 12-15 minutes.",
            "Whisk cornstarch, 1 1/2 tsp. salt, and 1/2 tsp. pepper in a large bowl. Heat 3 Tbsp. oil in a large skillet over high. Add chicken to cornstarch mixture and toss to coat. Cook half of chicken, turning occasionally, until chicken is cooked through and a light brown crust forms, 5–7 minutes.",
            "Meanwhile, mix honey, soy sauce, garlic, vinegar, Sriracha, tomato paste, ginger, 3 Tbsp. water, and remaining 1/4 tsp. salt and 1/4 tsp. pepper in a medium bowl.",
            "Transfer chicken to a plate. Heat remaining 3 Tbsp. oil in skillet over high. Cook remaining chicken 5 minutes, then add chiles (you can add a few more depending on your heat preference) and cook, stirring and making sure chiles make contact with bottom of pan, until chicken is cooked through and chiles have toasted and puffed, about 1 minute more. Stir in honey mixture. Return first batch of chicken to skillet, toss to coat, and cook until sauce is reduced and thickened, about 2 minutes.",
            "Divide chicken and green beans among plates. Top with scallions. Serve with rice alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58bdb2110fb6781b3fb1b815/6:4/w_274%2Ch_169/Easy-General-Tso's-Chicken-6x4-03022017.jpg"
    }
}