{
    "recipe": {
        "title": "Easy Fruit Tart with Pecan Cookie Crust ",
        "ingredients": [
            "3 1/2 cups vanilla wafer cookies (about 55)",
            "1 cup pecans",
            "1/3 cup sugar",
            "1/2 teaspoon kosher salt, divided",
            "6 tablespoons unsalted butter, melted, cooled slightly",
            "1 1/2 cups heavy cream",
            "2/3 cup homemade or store-bought lemon curd",
            "Berries, mango, and other fresh fruit (for serving)",
            "A 10\" fluted tart pan"
        ],
        "instructions": [
            "Preheat oven to 350°F. Pulse cookies, pecans, sugar, and 1/4 tsp. salt in a food processor until finely ground. Add butter and pulse until dough sticks together when squeezed with your fingertips. Transfer dough to pan and press into bottom and up sides of pan. Chill until set, about 15 minutes. Transfer pan to a rimmed baking sheet and bake shell until golden, 18-20 minutes. Let cool. Using an electric mixer on high speed, whip cream in a large bowl until soft peaks form. Fold in lemon curd and remaining 1/4 tsp. salt, then whip on medium-high speed until medium peaks form. Spoon lemon curd mixture into tart shell and top with fruit. Chill 15 minutes to set, then serve.",
            "Preheat oven to 350°F. Pulse cookies, pecans, sugar, and 1/4 tsp. salt in a food processor until finely ground. Add butter and pulse until dough sticks together when squeezed with your fingertips. Transfer dough to pan and press into bottom and up sides of pan. Chill until set, about 15 minutes.",
            "Transfer pan to a rimmed baking sheet and bake shell until golden, 18-20 minutes. Let cool.",
            "Using an electric mixer on high speed, whip cream in a large bowl until soft peaks form. Fold in lemon curd and remaining 1/4 tsp. salt, then whip on medium-high speed until medium peaks form.",
            "Spoon lemon curd mixture into tart shell and top with fruit. Chill 15 minutes to set, then serve.",
            "Do Ahead Tart shell can be baked 3 days ahead. Let cool, tightly wrap with plastic, and store at room temperature.",
            "Tart shell can be baked 3 days ahead. Let cool, tightly wrap with plastic, and store at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58f9179acd963f15a263e4a3/6:4/w_274%2Ch_169/Fruity-Lemon-Tart-with-Pecan-Cookie-Crust-hero-6x4-20042017.jpg"
    }
}