{
    "recipe": {
        "title": "Easy Canned Chickpea Hummus ",
        "ingredients": [
            "2 (15-oz.) cans chickpeas, drained, rinsed",
            "2 garlic cloves",
            "6 Tbsp. fresh lemon juice",
            "6 Tbsp. tahini",
            "1 1/2 tsp. kosher salt",
            "1/4 cup extra-virgin olive oil, plus more for serving"
        ],
        "instructions": [
            "Place chickpeas in a medium pot and cover with water by 1\". Bring to a boil over high heat, then reduce heat to medium-low and simmer, undisturbed, until chickpeas start falling apart, about 20 minutes. Reserve 1 cup cooking liquid, then drain chickpeas. Transfer chickpeas to a food processor. Add garlic, lemon juice, tahini, salt, and 2 Tbsp. reserved cooking liquid and process for a full 5 minutes (set a timer for this) until creamy and smooth. If at any point the hummus appears dry or very thick, add cooking liquid 1 Tbsp. at a time. With the motor running, stream in oil and process just until combined. Transfer to a medium bowl and drizzle with more oil. Do Ahead: Hummus can be made 5 days ahead. Let cool, then cover and chill.",
            "Place chickpeas in a medium pot and cover with water by 1\". Bring to a boil over high heat, then reduce heat to medium-low and simmer, undisturbed, until chickpeas start falling apart, about 20 minutes. Reserve 1 cup cooking liquid, then drain chickpeas.",
            "Transfer chickpeas to a food processor. Add garlic, lemon juice, tahini, salt, and 2 Tbsp. reserved cooking liquid and process for a full 5 minutes (set a timer for this) until creamy and smooth. If at any point the hummus appears dry or very thick, add cooking liquid 1 Tbsp. at a time. With the motor running, stream in oil and process just until combined. Transfer to a medium bowl and drizzle with more oil.",
            "Do Ahead: Hummus can be made 5 days ahead. Let cool, then cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b589185ef515b603bc72fdb/6:4/w_274%2Ch_169/Hummus-Bowls-with-Beef-and-Tomatoes-recipe-2-11072018.jpg"
    }
}