{
    "recipe": {
        "title": "Egg Shop Fried Chicken ",
        "ingredients": [
            "6 cups water",
            "1/4 cup kosher salt",
            "1/4 cup packed brown sugar",
            "4 garlic cloves, smashed",
            "2 tablespoons red chile flakes",
            "4 to 6 boneless, skinless chicken thighs (about 2 pounds)",
            "2 cups buttermilk",
            "1 teaspoon celery salt",
            "1/2 teaspoon cayenne pepper",
            "1/2 teaspoon smoked paprika",
            "1 egg",
            "3 to 4 cups canola oil, for frying (at least 2 inches deep)",
            "2 cups all-purpose flour",
            "2 tablespoons freshly ground black pepper",
            "Wildflower honey and coarse sea salt, for serving"
        ],
        "instructions": [
            "To make the brine, in a large saucepan, combine the water, salt, brown sugar, garlic, and chile flakes and bring to a boil over medium heat. Set aside to cool completely. Add the chicken to the brine and soak for 24 hours in the fridge, or at least overnight. Drain the chicken from the brine. At least 1 hour before you’re ready to fry the chicken (and up to 24 hours ahead), in a large bowl make the marinade. Whisk together the buttermilk, celery salt, cayenne, paprika, and egg. Add the chicken and marinate it in the fridge. To fry the chicken, in a large, heavy-bottomed saucepan or Dutch oven, heat the canola oil over medium-high heat (be careful) to 350°F. Set up a cooling rack or some paper towels on a baking sheet to drain the chicken. As the oil comes to temperature, combine the flour and black pepper in a shallow bowl (this will affectionately be referred to as “Judge Dredge”). When the oil is hot, remove one chicken thigh at a time from the marinade and dip in Judge Dredge to coat it fully. Shake off any excess flour. Then repeat to dip each piece back in the marinade and then the dredge to ensure an even, crispy coating. Fry the chicken, one or two pieces at a time, taking care not to overcrowd your makeshift deep-fryer. The chicken should be fully covered by the hot oil. It’s fully cooked when it reaches 165°F at its thickest part, 5 to 7 minutes. If you don’t have a well-calibrated thermometer handy, it’s okay to cut into the chicken slightly and check for doneness—no more pink. The chicken will stay juicy because we did all the work of properly brining . . . phew! Remove the chicken to the cooling rack or paper towels. You can keep the chicken warm and crispy in a 200°F oven or serve immediately. Just before serving, drizzle the chicken with your favorite local wildflower honey and garnish with a pinch of coarse sea salt.",
            "To make the brine, in a large saucepan, combine the water, salt, brown sugar, garlic, and chile flakes and bring to a boil over medium heat. Set aside to cool completely.",
            "Add the chicken to the brine and soak for 24 hours in the fridge, or at least overnight. Drain the chicken from the brine.",
            "At least 1 hour before you’re ready to fry the chicken (and up to 24 hours ahead), in a large bowl make the marinade. Whisk together the buttermilk, celery salt, cayenne, paprika, and egg. Add the chicken and marinate it in the fridge.",
            "To fry the chicken, in a large, heavy-bottomed saucepan or Dutch oven, heat the canola oil over medium-high heat (be careful) to 350°F. Set up a cooling rack or some paper towels on a baking sheet to drain the chicken.",
            "As the oil comes to temperature, combine the flour and black pepper in a shallow bowl (this will affectionately be referred to as “Judge Dredge”). When the oil is hot, remove one chicken thigh at a time from the marinade and dip in Judge Dredge to coat it fully. Shake off any excess flour. Then repeat to dip each piece back in the marinade and then the dredge to ensure an even, crispy coating.",
            "Fry the chicken, one or two pieces at a time, taking care not to overcrowd your makeshift deep-fryer. The chicken should be fully covered by the hot oil. It’s fully cooked when it reaches 165°F at its thickest part, 5 to 7 minutes. If you don’t have a well-calibrated thermometer handy, it’s okay to cut into the chicken slightly and check for doneness—no more pink. The chicken will stay juicy because we did all the work of properly brining . . . phew!",
            "Remove the chicken to the cooling rack or paper towels. You can keep the chicken warm and crispy in a 200°F oven or serve immediately. Just before serving, drizzle the chicken with your favorite local wildflower honey and garnish with a pinch of coarse sea salt."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58dd7f348ef81549b163abef/6:4/w_274%2Ch_169/egg-shop-fried-chicken-HC-033017.jpg"
    }
}