{
    "recipe": {
        "title": "Egg Sandwich with Bologna, Gherkin Mayo, and Crispy Onions ",
        "ingredients": [
            "1/2 cup mayonnaise, such as Hellman's",
            "1 tablespoon whole-grain mustard",
            "2 1/2 tablespoons prepared horseradish, drained",
            "2 tablespoons minced gherkins",
            "1 tablespoon lemon juice",
            "1/2 teaspoon minced garlic",
            "1/4 teaspoon kosher salt",
            "1/8 teaspoon black pepper",
            "2 tablespoons all-purpose flour",
            "Kosher salt",
            "Black pepper",
            "1/3 cup thinly sliced red onion rings",
            "Vegetable oil",
            "2 small Kaiser or ciabatta rolls or brioche buns, split",
            "1 tablespoon butter",
            "6 thin slices Lancaster county sweet beef bologna, kosher beef salami, or summer sausage",
            "1 tablespoon vegetable oil",
            "2 large eggs",
            "Kosher salt and black pepper, to taste",
            "2 slices smoked white cheddar",
            "Several dashes green hot sauce, such as Tabasco Green Pepper Sauce, to taste"
        ],
        "instructions": [
            "Mix together all mayo ingredients in a medium bowl and set aside.",
            "Fry the onions (if making): Fry the onions (if making): Season the flour with salt and pepper and toss the onions in the flour. Fill a small pot with oil to a depth of 1/2-inch and heat the oil over medium heat. Fry the onions, turning occasionally, until crispy and golden brown, 3 to 4 minutes. Drain on a paper towel lined plate and season with salt and pepper.",
            "Fry the onions (if making): Season the flour with salt and pepper and toss the onions in the flour. Fill a small pot with oil to a depth of 1/2-inch and heat the oil over medium heat. Fry the onions, turning occasionally, until crispy and golden brown, 3 to 4 minutes. Drain on a paper towel lined plate and season with salt and pepper.",
            "Assemble the sandwich: Heat a medium skillet over medium-high heat. Spread the cut sides of the rolls or buns with butter, and toast in the skillet over medium heat until golden brown; set aside. Add the meat slices to the skillet and warm until slightly crisped, 2 to 3 minutes per side; set aside. Add oil to skillet and gently fry eggs over medium-low heat, until egg white has set but yolk is still soft, 3 to 4 minutes. Season the eggs with salt and pepper. Place the meat on the bottom bun, followed by the egg, cheese, crispy onions, and hot sauce, if using. Spread the top buns with 1 to 2 tablespoons gherkin mayo and close the sandwiches. Serve immediately.",
            "Heat a medium skillet over medium-high heat. Spread the cut sides of the rolls or buns with butter, and toast in the skillet over medium heat until golden brown; set aside. Add the meat slices to the skillet and warm until slightly crisped, 2 to 3 minutes per side; set aside. Add oil to skillet and gently fry eggs over medium-low heat, until egg white has set but yolk is still soft, 3 to 4 minutes. Season the eggs with salt and pepper. Place the meat on the bottom bun, followed by the egg, cheese, crispy onions, and hot sauce, if using. Spread the top buns with 1 to 2 tablespoons gherkin mayo and close the sandwiches. Serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54babad2e231becc7f3d257e/6:4/w_274%2Ch_169/egg-sandwich-bologna-gherkin-mayo-6x4.jpg"
    }
}