{
    "recipe": {
        "title": "Eggplant Wraps ",
        "ingredients": [
            "2 medium/large eggplants",
            "2 tablespoons sunflower oil or light olive oil",
            "1 tablespoon dried mixed herbs",
            "14 ounces spinach",
            "16 sundried tomato pieces, marinated in olive oil",
            "3 tablespoons pine nuts, lightly toasted in a hot frying pan (no oil needed)",
            "5 ounces sharp Cheddar, cut into 16 slices",
            "pinch sea salt",
            "black pepper, to taste"
        ],
        "instructions": [
            "Preheat the oven to 350°F. You will need a large non-stick baking sheet.",
            "Cut the woody top off each eggplant and discard. Slice each eggplant lengthwise into 8 pieces (16 in all) about 1/2 inch thick.",
            "Mix the oil and the herbs together in a small bowl or cup. Lightly brush each slice of eggplant with the herby oil on both sides. Heat a large frying pan over medium heat and lay as many pieces of the eggplant in the pan as will comfortably fit. Fry each side until golden brown and softened, which should be about 3 minutes per side. When all the slices are cooked, set them aside.",
            "Wash the spinach well in cold running water, then toss it in a hot medium saucepan (using just the water that is clinging to the leaves) until wilted, and drain off the excess liquid.",
            "Now, assemble each wrap by taking 1 slice of the cooked eggplant and placing a little of the wilted spinach on one side. Then lay a piece of sundried tomato on top, sprinkle a few toasted pine nuts over it, and top with a slice of Cheddar. Fold the eggplant over to form the wrap, then place it on a large non-stick baking sheet.",
            "Repeat this until all 16 wraps are assembled and placed side by side on the baking sheet. Sprinkle with a pinch of sea salt and a grind of fresh black pepper.",
            "Bake in the oven for 15 minutes, until the cheese has melted and is bubbling, and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b02825cae54b670340fa49/6:4/w_274%2Ch_169/51159000_eggplant-wraps_1x1.jpg",
        "color": 11076493
    }
}