{
    "recipe": {
        "title": "Eggplant Fries ",
        "ingredients": [
            "1 cup plain low-fat yogurt",
            "1 tablespoon chopped kosher pickle or pickle relish",
            "2 teaspoons finely grated lemon zest",
            "2 teaspoons chopped fresh oregano",
            "Kosher salt",
            "freshly ground black pepper",
            "1 1-pound eggplant, cut crosswise into 1/2\" rounds, then into 1/2\"-thick strips",
            "Vegetable oil (for frying)",
            "1 cup rice flour",
            "2 tablespoons finely grated lemon zest",
            "1 tablespoon fresh lemon juice",
            "1 1/2 tablespoons za'atar",
            "1 tablespoon garlic powder",
            "1 teaspoon fine sea salt plus more for seasoning",
            "**Ingredient Info:**Za'atar is a Middle Eastern spice blend that includes sumac, herbs, and sesame seeds. It's available at specialty foods stores, Middle Eastern markets, and igourmet.com"
        ],
        "instructions": [
            "Whisk yogurt, chopped pickle, lemon zest, and oregano in a small bowl to blend. Season sauce to taste with salt and pepper.",
            "For fries: Place eggplant in a large bowl. Add 2 cups ice and enough water to cover. Place a plate on top of eggplant to weigh it down. Cover and chill for at least 2 hours and up to 12 hours. Pour oil into a large deep pot to a depth of 2\". Attach a deep-fry thermometer to the side of pot and heat oil over medium heat to 325°F. Meanwhile, whisk rice flour, lemon zest, za'atar, garlic powder, and 1 teaspoon sea salt in a medium bowl to blend. Drain eggplant. Working in batches, toss damp eggplant in flour mixture to coat. Working in batches, fry eggplant, turning occasionally, until golden brown, 3-4 minutes per batch. (Reheat oil to 325°F between batches.) Transfer to paper towels to drain. Season with lemon juice and sea salt. Serve immediately with dipping sauce.",
            "Place eggplant in a large bowl. Add 2 cups ice and enough water to cover. Place a plate on top of eggplant to weigh it down. Cover and chill for at least 2 hours and up to 12 hours.",
            "Pour oil into a large deep pot to a depth of 2\". Attach a deep-fry thermometer to the side of pot and heat oil over medium heat to 325°F.",
            "Meanwhile, whisk rice flour, lemon zest, za'atar, garlic powder, and 1 teaspoon sea salt in a medium bowl to blend. Drain eggplant. Working in batches, toss damp eggplant in flour mixture to coat.",
            "Working in batches, fry eggplant, turning occasionally, until golden brown, 3-4 minutes per batch. (Reheat oil to 325°F between batches.) Transfer to paper towels to drain. Season with lemon juice and sea salt. Serve immediately with dipping sauce."
        ],
        "picture_link": null,
        "color": 11645242
    }
}