{
    "recipe": {
        "title": "Eggplant and Mushroom Tahcheen ",
        "ingredients": [
            "2 1/4 cups white basmati rice",
            "1 1/4 tsp saffron strands",
            "A pinch of sugar",
            "3 tbsp freshly boiled water",
            "3 medium eggplants (around 1 1/4 lb), cut lengthways into 1-inch slices",
            "Sea salt and black pepper",
            "Sunflower oil",
            "3 tbsp butter",
            "1 medium onion, finely chopped",
            "3 garlic cloves, crushed",
            "4 Portobello mushrooms, sliced into large chunks",
            "1/2 tsp turmeric",
            "1/2 tsp allspice",
            "1/4 tsp cinnamon",
            "1/4 tsp cayenne pepper",
            "1/2 tsp cumin seeds",
            "2 egg yolks",
            "Scant cup Greek yogurt",
            "1 tbsp butter",
            "2 tbsp barberries (see Cooks' Note)",
            "1/4 cup + 1 tbsp pistachios, roughly chopped",
            "1 tbsp sugar"
        ],
        "instructions": [
            "Pre-heat your grill to medium-high.",
            "Rinse the rice in several changes of cold water until the water runs clear, then leave to soak in a large bowl of water for 15 minutes. Drain and set aside.",
            "Bring a large pot of water to the boil and add 2 tablespoons of salt. (Don’t worry about the large amount of salt here, the rice has a very short time to absorb the water and the final result won’t be too salty.) Add the rice and cook for 4–5 minutes over a medium heat. Taste to test; the rice should be soft on the outside but still hard and firm in the middle. Drain, then rinse with tepid water to stop it cooking any further and set aside.",
            "Make a saffron liquid by using a pestle and mortar to grind the saffron strands with a pinch of sugar and then add the boiled water. Leave to steep.",
            "Drizzle the eggplant slices with some sunflower oil and season generously with salt. Grill for 10–15 minutes, turning occasionally, until the eggplants are cooked through.",
            "Meanwhile, make the rest of your filling. Heat 2 tablespoons of sunflower oil with 1 tablespoon of the butter in a large saucepan and fry the onion for about 10 minutes, until soft. Add the garlic and fry for a further 2 minutes. Add the mushrooms to the pan along with the turmeric, allspice, cinnamon, cayenne pepper, 1 teaspoon of salt and 1/4 teaspoon of pepper.",
            "Lightly toast the cumin seeds in a small pan for a minute and then crush them with a pestle and mortar or a spice grinder, and add them too. Cook until the mushrooms are soft and then take off the heat.",
            "Pre-heat the oven to 375°F. In a large bowl, beat the egg yolks with the yogurt, saffron liquid, 1 1/2 teaspoons of salt, and 1 teaspoon of pepper. Fold the rice in until it is evenly coated with the yogurt and saffron.",
            "Rub 1 tablespoon butter over the base and sides of a 10-cup ovenproof glass dish. Spoon half of the rice into the dish and press it down evenly. Add a layer of eggplants and mushrooms and finish with a final layer of rice.",
            "Dot with the remaining butter, cover the dish tightly with foil, and bake for 1 1/2–2 hours or until the base of the tahcheen is crisp and golden brown.",
            "When the tahcheen is ready, remove from the oven and leave to cool slightly while you make your topping. Melt the butter in a small frying pan and fry the barberries, pistachios, and sugar for 2 minutes until the sugar has melted and the dried fruit has plumped up.",
            "To serve, run a butter knife around the sides of the tahcheen to separate it from the dish. Place a large board over the top and quickly invert the whole thing. Garnish with a sprinkling of the barberry and pistachio topping."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5900b92afb98ea70e40f7db7/6:4/w_274%2Ch_169/eggplant-mushroom-tahcheen-042617.jpg",
        "color": 8793332
    }
}