{
    "recipe": {
        "title": "Eggplant with Buttermilk Sauce ",
        "ingredients": [
            "2 large and long eggplants",
            "1/3 cup olive oil",
            "1 1/2 tsp lemon thyme leaves, plus a few whole sprigs to garnish",
            "Maldon sea salt and black pepper",
            "1 pomegranate",
            "1 tsp za'atar",
            "9 tbsp buttermilk",
            "1/2 cup Greek yogurt",
            "1 1/2 tbsp olive oil, plus a drizzle to finish",
            "1 small garlic clove, crushed",
            "Pinch of salt"
        ],
        "instructions": [
            "Preheat the oven to 200°F. Cut the eggplants in half lengthways, cutting straight through the green stalk (the stalk is for the look; don't eat it). Use a small sharp knife to make three or four parallel incisions in the cut side of each eggplant half, without cutting through to the skin. Repeat at a 45-degree angle to get a diamond-shaped pattern.",
            "Place the eggplant halves, cut-side up, on a baking sheet lined with parchment paper. Brush them with olive oil—keep on brushing until all of the oil has been absorbed by the flesh. Sprinkle with the lemon thyme leaves and some salt and pepper. Roast for 35 to 40 minutes, at which point the flesh should be soft, flavorful and nicely browned. Remove from the oven and allow to cool down completely.",
            "While the eggplants are in the oven, cut the pomegranate into two horizontally. Hold one half over a bowl, with the cut side against your palm, and use the back of a wooden spoon or a rolling pin to gently knock on the pomegranate skin. Continue beating with increasing power until the seeds start coming out naturally and falling through your fingers into the bowl. Once all are there, sift through the seeds to remove any bits of white skin or membrane.",
            "To make the sauce. Whisk together all of the ingredients. Taste for seasoning, then keep cold until needed.",
            "To serve, spoon plenty of buttermilk sauce over the eggplant halves without covering the stalks. Sprinkle za'atar and plenty of pomegranate seeds on top and garnish with lemon thyme. Finish with a drizzle of olive oil."
        ],
        "picture_link": "https://assets.epicurious.com/photos/559eb8d92165ea177986b559/6:4/w_274%2Ch_169/365110_hires_6x4.jpg"
    }
}