{
    "recipe": {
        "title": "Eggs Benedict with Asparagus and Brie ",
        "ingredients": [
            "24 medium- thick asparagus spears",
            "2 teaspoons fresh lemon juice",
            "Salt",
            "8 large farm-fresh eggs",
            "Splash of white wine vinegar",
            "4 English muffins, split and toasted",
            "4 1/2 ounces Brie cheese, cut into thin strips",
            "Hollandaise Sauce",
            "Freshly cracked black pepper"
        ],
        "instructions": [
            "Preheat the oven to 350°F. Bring a large saucepan of water to a boil. Cut off and discard the woody ends from the asparagus and boil the spears for 5 minutes, or until fork- tender but still firm. Drain, transfer to a dish, and sprinkle the lemon juice on top. Heat a wide 3-quart saucepan of water over medium heat and add a pinch of salt. Poach the eggs. Place the English muffins on a baking sheet lined with parchment paper. Top each muffins half with 3 asparagus spears and 2 slices of Brie. Bake for 5 minutes, or until the cheese is melted and bubbling. Top each muffins half with a poached egg and 1 tablespoon of the Hollandaise sauce and season with a pinch each of salt and pepper. Serve immediately.",
            "Preheat the oven to 350°F.",
            "Bring a large saucepan of water to a boil. Cut off and discard the woody ends from the asparagus and boil the spears for 5 minutes, or until fork- tender but still firm. Drain, transfer to a dish, and sprinkle the lemon juice on top.",
            "Heat a wide 3-quart saucepan of water over medium heat and add a pinch of salt. Poach the eggs.",
            "Place the English muffins on a baking sheet lined with parchment paper. Top each muffins half with 3 asparagus spears and 2 slices of Brie. Bake for 5 minutes, or until the cheese is melted and bubbling.",
            "Top each muffins half with a poached egg and 1 tablespoon of the Hollandaise sauce and season with a pinch each of salt and pepper. Serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59d3b24e16ab900b7d04d02e/6:4/w_274%2Ch_169/eggs-benedict-with-asparagus-and-brie-100317.jpg"
    }
}