{
    "recipe": {
        "title": "Eggy Potato Salad with Pickles ",
        "ingredients": [
            "2 3/4 pounds medium red-skinned potatoes, peeled (about 8)",
            "1 1/4 teaspoons kosher salt plus more",
            "1/2 cup mayonnaise",
            "1/4 cup sweet pickle juice from jar",
            "8-10 sweet-pickle chips",
            "1 1/2 tablespoons Dijon mustard",
            "1 teaspoon sugar",
            "1/4 teaspoon freshly ground black pepper plus more",
            "5 large hard-boiled egg yolks",
            "2 tablespoons chopped red onion",
            "2 tablespoons chopped flat-leaf parsley",
            "Paprika"
        ],
        "instructions": [
            "Place potatoes in a large pot. Add water to cover by 2\", season with salt, and bring to a boil. Reduce heat to medium and cook until potatoes are tender when pierced with a knife, 20-30 minutes. Drain. Place potatoes in a large bowl and let cool slightly. Meanwhile, whisk mayonnaise, pickle juice, Dijon mustard, sugar, 1/4 teaspoon pepper, and 1 1/4 teaspoons salt in a small bowl for dressing. Using a large wooden spoon, coarsely smash potatoes, leaving some larger pieces mixed with some well-mashed pieces. Add dressing and egg yolks to potatoes and toss to coat, coarsely smashing egg yolks. Add onion and parsley; gently mix to incorporate. Season to taste with more salt and pepper, if desired. DO AHEAD: Can be made 1 day ahead. Cover and chill. Divide potato salad among small paper cups or bowls; dust with paprika. Top each serving with a pickle chip.",
            "Place potatoes in a large pot. Add water to cover by 2\", season with salt, and bring to a boil. Reduce heat to medium and cook until potatoes are tender when pierced with a knife, 20-30 minutes. Drain. Place potatoes in a large bowl and let cool slightly.",
            "Meanwhile, whisk mayonnaise, pickle juice, Dijon mustard, sugar, 1/4 teaspoon pepper, and 1 1/4 teaspoons salt in a small bowl for dressing.",
            "Using a large wooden spoon, coarsely smash potatoes, leaving some larger pieces mixed with some well-mashed pieces.",
            "Add dressing and egg yolks to potatoes and toss to coat, coarsely smashing egg yolks. Add onion and parsley; gently mix to incorporate. Season to taste with more salt and pepper, if desired. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
            "Divide potato salad among small paper cups or bowls; dust with paprika. Top each serving with a pickle chip."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b173df1cc76a014cfafd04/6:4/w_274%2Ch_169/395434_potato-salad_1x1.jpg"
    }
}