{
    "recipe": {
        "title": "Ellen Levine's Vegetarian \"Chopped Liver\" a la Dragon ",
        "ingredients": [
            "Vegetable oil cooking spray",
            "1/4 cup olive oil, walnut oil, or a mild vegetable oil such as corn, canola, or peanut",
            "2 large onions, chopped",
            "3 cloves garlic, peeled and quartered",
            "1/4 pound mushrooms, tough ends trimmed and discarded, chopped (about 1 slightly heaping cup)",
            "1 1/2 cups fresh green beans, cooked to tenderness, cooking water reserved",
            "1 1/2 cups lentils, cooked to tenderness",
            "4 hard-boiled eggs, quartered",
            "1 1/2 cups walnuts, toasted",
            "1 tablespoon tomato paste (optional; Ellen doesn't use it, I do more often than not)",
            "1 tablespoon mayonnaise",
            "Salt and freshly ground black pepper",
            "2 to 3 tablespoons minced onion (optional)",
            "Minced fresh parsley, for garnish",
            "Paprika, for garnish"
        ],
        "instructions": [
            "1. Spray a large skillet with oil and place it over medium heat. Add 2 tablespoons of the oil, and when the oil thins, add the onions and cook slowly, stirring often. You want them caramelized and golden, so allow 8 to 10 minutes. Lower the heat, add the garlic, and sauté until fragrant, another 2 to 3 minutes. Transfer the onion mixture to a food processor.",
            "2. Heat the remaining 2 tablespoons of oil in the same skillet over medium heat. Add the mushrooms and sauté until they are just limp, about 4 minutes. Transfer them, too, to the processor, along with the green beans, lentils, hard-boiled eggs, toasted walnuts, tomato paste, if using, mayonnaise, and salt and pepper to taste.",
            "3. Buzz the heck out of the mixture, pausing to scrape down the sides of the processor. Taste the mixture and season it again, if needed. If you like, stir in the minced onion.",
            "4. Transfer the spread to a serving bowl, cover it tightly, and let it rest in the fridge for at least 2 hours or overnight. About an hour before serving, remove the spread from the refrigerator and let it come to room temperature. Garnish with minced parsley and paprika, and serve."
        ],
        "picture_link": null,
        "color": 14066163
    }
}