{
    "recipe": {
        "title": "Ember-Roasted Squash Hummus ",
        "ingredients": [
            "1 medium autumn squash (2 to 3 pounds)",
            "1 cup tahini (sesame paste; available in most grocery stores)",
            "Juice of 2 lemons",
            "1 clove garlic, grated on a Microplane or very finely minced (optional)",
            "Kosher salt",
            "2 to 3 cups extra-virgin olive oil",
            "Freshly grated nutmeg",
            "Espelette pepper or crushed red pepper",
            "1 small baguette, sliced on the bias 1/2 inch thick"
        ],
        "instructions": [
            "Place the entire squash in the embers of a medium charcoal and wood fire after you have finished cooking another meal, or set up a small charcoal fire, place the squash on the grill grate rack directly above it, and cover the grill. The squash, depending on its size, will cook in 45 minutes to 1 1/2 hours. It is done when the skin is charred and the squash deflates a little with light pressure. Let it cool for 20 minutes.",
            "Cut the squash in half, then scoop out and discard the seeds, being careful not to remove too much of the flesh when you do this. Remove the flesh from the skin—scrape right down to the skin, because that is where all the sweet, awesome smoke flavor is! If some charred flakes get mixed in, that's fine.",
            "Place the flesh in a food processor. Add the tahini, lemon juice, and garlic if using. Purée the mixture until it is relatively smooth but there are still a few chunks. Season with a few pinches of salt and then, with the machine running, add the olive oil in a slow, steady stream through the feed tube. The mixture will begin to change color as the olive oil is incorporated. After you have added about 1 cup of the oil, stop the machine, scrape down the side, and taste the hummus. If you think it needs a little more salt, then go ahead and add it. The mixture should be thick at this point, close to a mayonnaise in texture. Turn the machine back on and add another cup of oil, then taste again. The hummus should have a balanced, sweet-sour-smoky-rich flavor. If it seems not quite right, or too thick, continue to add as much of the remaining oil as you need to get the right consistency.",
            "This is best if it is left to chill for a couple of hours before serving, but it can be served right away. Before presenting it to your guests, check the flavor balance one more time and adjust if necessary with more salt and/or lemon juice.",
            "Spoon the hummus into a large bowl and garnish it with a few gratings of nutmeg using a Microplane or nutmeg grater and a pinch of the pepper. Serve with baguette slices."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54af58574074bdfd0683a653/6:4/w_274%2Ch_169/51170410_squash-hummus_1x1.jpg"
    }
}