{
    "recipe": {
        "title": "Enchiladas Divorciadas ",
        "ingredients": [
            "1 Tbsp. vegetable oil",
            "1/2 white onion, coarsely chopped",
            "4 garlic cloves, crushed",
            "3 small serrano chiles, halved lengthwise, seeds removed if desired",
            "12 oz. tomatillos (6–7), husks removed, rinsed, halved",
            "1 cup cilantro leaves with tender stems",
            "Kosher salt",
            "1 Tbsp. vegetable oil",
            "1/4 white onion, coarsely chopped",
            "1 garlic clove, crushed",
            "3 guajillo chiles, seeds removed",
            "2 dried chiles de árbol (optional; omit for a milder sauce)",
            "3 plum tomatoes, quartered",
            "Kosher salt",
            "1 (3 1/2–4-lb.) chicken",
            "6 bay leaves",
            "1 tsp. allspice berries",
            "Kosher salt",
            "1/2 cup crème fraîche",
            "1/3 cup crumbled queso fresco",
            "1/2 cup vegetable oil",
            "12 (6\") corn tortillas",
            "Sliced white onion (for serving)"
        ],
        "instructions": [
            "Heat oil in a large saucepan over medium. Cook onion and garlic, stirring occasionally, until starting to soften, about 5 minutes. Add chiles and cook, stirring occasionally, until onion is lightly browned and vegetables are soft, about 5 minutes. Add tomatillos and cook, stirring occasionally, just until starting to soften, about 3 minutes. Add cilantro and 1 1/2 cups water. Bring to a boil, reduce heat, and simmer until tomatillos soften, 20–25 minutes. Let cool slightly; transfer to a blender. Purée until smooth; season with salt. Return salsa verde to saucepan and keep warm until ready to use.",
            "Salsa Roja: Heat oil in a large saucepan over medium. Cook onion and garlic, stirring occasionally, until starting to soften, about 5 minutes. Add both chiles, tomatoes, and 1 1/2 cups water. Bring to a boil, reduce heat, and simmer until tomatoes and chiles soften, 20–25 minutes. Let cool slightly; transfer to a blender. Purée until smooth; season with salt. Return salsa roja to saucepan and keep warm until ready to use.",
            "Heat oil in a large saucepan over medium. Cook onion and garlic, stirring occasionally, until starting to soften, about 5 minutes. Add both chiles, tomatoes, and 1 1/2 cups water. Bring to a boil, reduce heat, and simmer until tomatoes and chiles soften, 20–25 minutes. Let cool slightly; transfer to a blender. Purée until smooth; season with salt. Return salsa roja to saucepan and keep warm until ready to use.",
            "Enchilada assembly: Place chicken, bay leaves, and allspice in a small pot and pour in water to cover by 1\"; season lightly with salt. Bring to a boil, reduce heat, and simmer gently until chicken is nearly cooked through (an instant-read thermometer inserted into the thickest part of chicken should register 145°F–150°F), 20–25 minutes from the time water starts simmering. Let chicken cool at least 1 hour (it should be just warm). If you have the time, cover and chill up to 12 hours. Remove chicken from broth. Pull meat from bones and shred; discard skin and bones. Place meat in a large saucepan and pour in just enough broth to cover. Set aside any remaining broth for another use. Gently reheat chicken over medium-low; season with salt. Meanwhile, mix crème fraîche and queso fresco in a small bowl to combine. Heat oil in a small skillet over medium-high until hot but not smoking. Submerge each tortilla in oil long enough to soften but not so long that they fall apart, 5–10 seconds each. Transfer to a rimmed baking sheet lined with paper towels to drain. Working one at a time, fill each tortilla with about 1/3 cup shredded chicken and roll up tightly. Place 3 tortillas each, seam side down, into bowls. Ladle 1/2 cup of each sauce on opposite ends of enchiladas. Top with a big spoonful of crème fraîche mixture and scatter onion over.",
            "Place chicken, bay leaves, and allspice in a small pot and pour in water to cover by 1\"; season lightly with salt. Bring to a boil, reduce heat, and simmer gently until chicken is nearly cooked through (an instant-read thermometer inserted into the thickest part of chicken should register 145°F–150°F), 20–25 minutes from the time water starts simmering. Let chicken cool at least 1 hour (it should be just warm). If you have the time, cover and chill up to 12 hours.",
            "Remove chicken from broth. Pull meat from bones and shred; discard skin and bones. Place meat in a large saucepan and pour in just enough broth to cover. Set aside any remaining broth for another use. Gently reheat chicken over medium-low; season with salt.",
            "Meanwhile, mix crème fraîche and queso fresco in a small bowl to combine.",
            "Heat oil in a small skillet over medium-high until hot but not smoking. Submerge each tortilla in oil long enough to soften but not so long that they fall apart, 5–10 seconds each. Transfer to a rimmed baking sheet lined with paper towels to drain.",
            "Working one at a time, fill each tortilla with about 1/3 cup shredded chicken and roll up tightly. Place 3 tortillas each, seam side down, into bowls. Ladle 1/2 cup of each sauce on opposite ends of enchiladas. Top with a big spoonful of crème fraîche mixture and scatter onion over.",
            "Do Ahead Chicken can be poached and shredded 3 days ahead. Place in a small bowl and pour in broth to submerge; cover and chill.",
            "Chicken can be poached and shredded 3 days ahead. Place in a small bowl and pour in broth to submerge; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c6442e7a1db506e15f3b5f7/6:4/w_274%2Ch_169/enchiladas-divorciadas-recipe-BA-010819.jpg",
        "color": 12382532
    }
}