{
    "recipe": {
        "title": "Epi Classic Blueberry Muffins ",
        "ingredients": [
            "2 1/2 cups all-purpose flour",
            "1 1/4 cups granulated sugar",
            "2 teaspoons baking powder",
            "1/2 teaspoon kosher salt",
            "2 large eggs",
            "1 cup sour cream",
            "1/2 cup whole milk",
            "1 teaspoon vanilla extract",
            "3/4 cup (1 1/2 sticks) unsalted butter, melted",
            "1 1/2 cups blueberries (about 8 ounces)",
            "3 tablespoons coarse sugar",
            "A standard 12-cup muffin pan"
        ],
        "instructions": [
            "Preheat oven to 375°F. Line muffin pan with liners. Whisk flour, granulated sugar, baking powder, and salt in a large bowl. Whisk eggs, sour cream, milk, and vanilla in a medium bowl. Mix egg mixture into dry ingredients, then stir in butter. Fold in blueberries. Divide batter among muffin cups, filling to the brim (about 1/2 cup batter per muffin). Sprinkle with coarse sugar. Bake muffins, rotating pan halfway through, until golden brown and a tester inserted into the center comes out clean, 28–33 minutes. Let cool in pan 5 minutes, then transfer muffins to a wire rack and let cool completely.",
            "Preheat oven to 375°F. Line muffin pan with liners. Whisk flour, granulated sugar, baking powder, and salt in a large bowl.",
            "Whisk eggs, sour cream, milk, and vanilla in a medium bowl.",
            "Mix egg mixture into dry ingredients, then stir in butter. Fold in blueberries.",
            "Divide batter among muffin cups, filling to the brim (about 1/2 cup batter per muffin). Sprinkle with coarse sugar.",
            "Bake muffins, rotating pan halfway through, until golden brown and a tester inserted into the center comes out clean, 28–33 minutes.",
            "Let cool in pan 5 minutes, then transfer muffins to a wire rack and let cool completely.",
            "Do Ahead Muffins can be made 3 days ahead. Transfer to an airtight container and store at room temperature, or freeze up to 2 months.",
            "Muffins can be made 3 days ahead. Transfer to an airtight container and store at room temperature, or freeze up to 2 months."
        ],
        "picture_link": "https://assets.epicurious.com/photos/596d13496c42213eb20a2b5f/6:4/w_274%2Ch_169/How-To-Make-Blueberry-Muffins-071220171887.jpg"
    }
}