{
    "recipe": {
        "title": "Escarole with Cannellini Beans ",
        "ingredients": [
            "1 sweet onion, halved",
            "1 head of garlic, halved crosswise",
            "1 medium carrot, scrubbed",
            "2 sprigs parsley",
            "2 (3-inch) sprigs rosemary",
            "2 sprigs sage",
            "2 cups dried cannellini beans, soaked overnight, drained",
            "1/2 teaspoon freshly cracked black pepper",
            "6 tablespoons olive oil, divided",
            "2 garlic cloves, thinly sliced",
            "2 bay leaves",
            "1 tablespoon chopped parsley",
            "1/2 teaspoon crushed red pepper flakes",
            "1 head of escarole, leaves torn",
            "1 ounce finely grated Parmesan"
        ],
        "instructions": [
            "Beans: Bring onion, garlic, carrot, parsley, rosemary, sage, beans, pepper, and 8 cups water to a boil in a large saucepan, skimming foam as needed from surface. Reduce heat and simmer gently, stirring occasionally and adding water as needed to keep beans submerged, until beans are tender, 75–90 minutes. Season generously with salt and let beans cool in their liquid. Discard vegetables and herbs.",
            "Bring onion, garlic, carrot, parsley, rosemary, sage, beans, pepper, and 8 cups water to a boil in a large saucepan, skimming foam as needed from surface. Reduce heat and simmer gently, stirring occasionally and adding water as needed to keep beans submerged, until beans are tender, 75–90 minutes. Season generously with salt and let beans cool in their liquid. Discard vegetables and herbs.",
            "Escarole and assembly: Heat 4 Tbsp. oil in a large pot over medium. Cook garlic, stirring occasionally, until softened and beginning to brown around edges, about 3 minutes. Add bay leaves, parsley, and red pepper flakes; cook, stirring constantly, until fragrant, about 30 seconds. Stir in escarole a handful at a time, letting wilt before adding the next batch, until all the escarole is wilted, about 5 minutes. Add 1/2 cup water and bring to a simmer. Reduce heat, cover pot, and cook, stirring occasionally and maintaining a gentle simmer, until escarole is very tender, 20–25 minutes. Add 2 cups beans and 1 cup bean cooking liquid. Bring to a simmer; season with salt and pepper. Stir in Parmesan a bit at a time, followed by remaining 2 Tbsp. oil. Divide among bowls.",
            "Heat 4 Tbsp. oil in a large pot over medium. Cook garlic, stirring occasionally, until softened and beginning to brown around edges, about 3 minutes. Add bay leaves, parsley, and red pepper flakes; cook, stirring constantly, until fragrant, about 30 seconds. Stir in escarole a handful at a time, letting wilt before adding the next batch, until all the escarole is wilted, about 5 minutes. Add 1/2 cup water and bring to a simmer. Reduce heat, cover pot, and cook, stirring occasionally and maintaining a gentle simmer, until escarole is very tender, 20–25 minutes. Add 2 cups beans and 1 cup bean cooking liquid. Bring to a simmer; season with salt and pepper. Stir in Parmesan a bit at a time, followed by remaining 2 Tbsp. oil. Divide among bowls.",
            "Do Ahead Beans can be cooked 4 days ahead. Cover and chill.",
            "Beans can be cooked 4 days ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59c2f04839e8bb56a9326cbf/6:4/w_274%2Ch_169/braised-escarole-with-cannellini-beans-recipe-091117.jpg"
    }
}