{
    "recipe": {
        "title": "Escarole and Little Meatball Soup ",
        "ingredients": [
            "1/2 head escarole (about 1/2 pound)",
            "1 1/2 large carrots, chopped",
            "12 cups chicken stock, preferably homemade",
            "4 ounces ditalini or tubetti, or spaghetti broken into bite-size pieces",
            "Freshly grated Parmigiano-Reggiano cheese",
            "1/2 pound ground veal or beef",
            "1/2 cup plain bread crumbs",
            "1/2 cup freshly grated Parmigiano-Reggiano cheese",
            "1/4 cup very finely minced onion",
            "1 large egg",
            "1/2 teaspoon salt",
            "Freshly ground pepper, to taste"
        ],
        "instructions": [
            "Trim the escarole and discard any bruised leaves. Cut off the stem ends. Separate the leaves and wash well in cool water, especially the center of the leaves where soil collects. Stack the leaves and cut them crosswise into 1-inch strips. You should have about 4 cups. Combine the escarole, carrots, and stock in a large pot. Bring to a simmer and cook until the escarole is almost tender, about 30 minutes.",
            "Trim the escarole and discard any bruised leaves. Cut off the stem ends. Separate the leaves and wash well in cool water, especially the center of the leaves where soil collects. Stack the leaves and cut them crosswise into 1-inch strips. You should have about 4 cups.",
            "Combine the escarole, carrots, and stock in a large pot. Bring to a simmer and cook until the escarole is almost tender, about 30 minutes.",
            "To make the meatballs Meanwhile, combine the ground meat, bread crumbs, cheese, onion, egg, salt, and pepper in a medium bowl. Shape the mixture into tiny balls, less than 1 inch in diameter.",
            "Meanwhile, combine the ground meat, bread crumbs, cheese, onion, egg, salt, and pepper in a medium bowl. Shape the mixture into tiny balls, less than 1 inch in diameter.",
            "To assemble When the escarole is almost tender, stir in the pasta and return the soup to the simmer. Drop the meatballs into the soup. Cook over low heat, stirring gently, until the meatballs and pasta are cooked, about 20 minutes. Taste for seasoning. Serve hot with grated Parmigiano-Reggiano.",
            "When the escarole is almost tender, stir in the pasta and return the soup to the simmer. Drop the meatballs into the soup. Cook over low heat, stirring gently, until the meatballs and pasta are cooked, about 20 minutes. Taste for seasoning. Serve hot with grated Parmigiano-Reggiano."
        ],
        "picture_link": null
    }
}