{
    "recipe": {
        "title": "Espesado de Lunes ",
        "ingredients": [
            "2 pounds fresh or frozen corn kernels (choclo)",
            "1/2 cup Zapallo or butternut squash, cut into 1/4-inch dice",
            "6 sprigs fresh cilantro, sliced",
            "6 garlic cloves, sliced",
            "1 small onion, sliced (1/4 cup)",
            "2/3 cup water",
            "4 cups (1 quart) water",
            "2 pounds boneless beef brisket or chuck, cut into 16 pieces",
            "1 teaspoon salt, or to taste",
            "1/2 pound yuca, peeled and cut into 1/4-inch dice",
            "1/2 pound shelled fresh fava beans (optional, but traditional)"
        ],
        "instructions": [
            "1. To make the mush: Process all the ingredients together in a food processor into a fine paste or mush. Set aside.",
            "2. To prepare the meat: bring the water to a boil in a large pan. Add the beef, salt, yuca, and fava beans (if used) and simmer, covered, over low heat until the meat is tender, about 45 minutes.",
            "3. Add the mush, mix well, and cook for 15 to 20 minutes. (This results in a thick and substantial dish, perhaps even too thick, in which case 1/2 to 1 cup water may be added.) Mix well and adjust the salt to taste.",
            "Serve warm, with a side dish of Ceviche.",
            "Extra! Tips from Epicurious: • This recipe is from the region of Chiclayo in northern Peru. The use of corn, squash, and beans reflects some of the country’s earliest food exchanges, when those ingredients were brought down from Central America and became important staples. • Zapallo is the Peruvian name for calabaza, a large, round, pumpkinlike squash. Wedges of calabaza are sold at Latin and Caribbean markets, but butternut is equally good here.",
            "• This recipe is from the region of Chiclayo in northern Peru. The use of corn, squash, and beans reflects some of the country’s earliest food exchanges, when those ingredients were brought down from Central America and became important staples.",
            "• Zapallo is the Peruvian name for calabaza, a large, round, pumpkinlike squash. Wedges of calabaza are sold at Latin and Caribbean markets, but butternut is equally good here."
        ],
        "picture_link": null,
        "color": 2850432
    }
}