{
    "recipe": {
        "title": "Eula Mae's Chicken and Ham Jambalaya ",
        "ingredients": [
            "1 fryer chicken (about 3 pounds), boned, skinned, and cut into 1-inch cubes, or 1 1/2 pounds skinless, boneless breasts and thighs, cut into 1-inch cubes",
            "1 teaspoon salt",
            "1/8 teaspoon freshly ground black pepper",
            "1/8 teaspoon cayenne",
            "2 tablespoons vegetable oil",
            "1/2 pound cooked ham, cut into 1/2-inch cubes",
            "2 cups chopped yellow onions",
            "1 cup seeded and chopped green bell peppers",
            "1 cup chopped celery",
            "4 garlic cloves, peeled",
            "3 cups chicken broth",
            "One 16-ounce can whole tomatoes, chopped, liquid reserved",
            "1/2 cup chopped green onions (green part only)",
            "2 tablespoons chopped fresh parsley leaves",
            "2 pounds medium-size shrimp, peeled and deveined",
            "1 teaspoon Tabasco brand pepper sauce",
            "2 cups long-grain white rice, rinsed and drained"
        ],
        "instructions": [
            "Sprinkle the chicken with the salt, black pepper, and cayenne. Heat the oil in a large, heavy pot or Dutch oven over medium heat. Add the chicken and cook, stirring, until browned on all sides, 8 to 10 minutes. Transfer the chicken to a large mixing bowl. Add the ham to the pot and cook, stirring, until lightly browned, about 5 minutes. Add the ham to the chicken in the bowl. Add the onions, bell peppers, celery, and garlic to the pot and cook, scraping the bottom of the pot to loosen any browned bits. Return the chicken and ham to the pot, reduce the heat to low, cover, and cook for 25 minutes, stirring occasionally. Add the chicken broth and reserved tomato juice, cover, and simmer for 45 minutes. Mash the cooked garlic against the side of the pot and blend into the mixture. Add the tomatoes, green onions, parsley, shrimp, and Tabasco and adjust the seasonings to taste. Add the rice, cover the pot, and bring to a boil. Reduce the heat to medium-low and simmer, covered, stirring occasionally, until the rice is tender and fluffy and the liquid is absorbed, about 25 minutes. Serve warm.",
            "Sprinkle the chicken with the salt, black pepper, and cayenne. Heat the oil in a large, heavy pot or Dutch oven over medium heat. Add the chicken and cook, stirring, until browned on all sides, 8 to 10 minutes. Transfer the chicken to a large mixing bowl.",
            "Add the ham to the pot and cook, stirring, until lightly browned, about 5 minutes. Add the ham to the chicken in the bowl.",
            "Add the onions, bell peppers, celery, and garlic to the pot and cook, scraping the bottom of the pot to loosen any browned bits. Return the chicken and ham to the pot, reduce the heat to low, cover, and cook for 25 minutes, stirring occasionally.",
            "Add the chicken broth and reserved tomato juice, cover, and simmer for 45 minutes.",
            "Mash the cooked garlic against the side of the pot and blend into the mixture. Add the tomatoes, green onions, parsley, shrimp, and Tabasco and adjust the seasonings to taste. Add the rice, cover the pot, and bring to a boil. Reduce the heat to medium-low and simmer, covered, stirring occasionally, until the rice is tender and fluffy and the liquid is absorbed, about 25 minutes. Serve warm."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d78bff3a00aeb2f1cb634/6:4/w_274%2Ch_169/242927.jpg"
    }
}