{
    "recipe": {
        "title": "Falafel with Hummus ",
        "ingredients": [
            "1 15-ounce can garbanzo beans (chickpeas), drained",
            "1/4 cup chopped onion",
            "3 tablespoons all purpose flour plus more for dredging",
            "2 1/2 teaspoons salt-free garlic pepper spice blend",
            "1 teaspoon ground cumin",
            "1 teaspoon baking powder",
            "1/2 teaspoon salt",
            "2 tablespoons (packed) chopped fresh Italian parsley",
            "Vegetable oil (for frying)",
            "Purchased hummus"
        ],
        "instructions": [
            "Puree canned garbanzo beans, chopped onion, 3 tablespoons all purpose flour, garlic pepper spice blend, ground cumin, baking powder, and salt in processor until coarse puree forms. Add chopped Italian parsley; process just to blend. Generously sprinkle plate with all purpose flour. Roll level tablespoonfuls garbanzo bean mixture into balls; transfer balls to plate. Roll falafel in flour to coat generously; flatten balls slightly. Pour enough vegetable oil into heavy large skillet to reach depth of 1/2 inch. Heat oil to 375°F. Working in 2 batches, fry falafel patties until deep brown, turning once, about 3 minutes. Transfer falafel patties to paper towels to drain. Serve falafel with hummus.",
            "Puree canned garbanzo beans, chopped onion, 3 tablespoons all purpose flour, garlic pepper spice blend, ground cumin, baking powder, and salt in processor until coarse puree forms. Add chopped Italian parsley; process just to blend. Generously sprinkle plate with all purpose flour. Roll level tablespoonfuls garbanzo bean mixture into balls; transfer balls to plate. Roll falafel in flour to coat generously; flatten balls slightly.",
            "Pour enough vegetable oil into heavy large skillet to reach depth of 1/2 inch. Heat oil to 375°F. Working in 2 batches, fry falafel patties until deep brown, turning once, about 3 minutes. Transfer falafel patties to paper towels to drain. Serve falafel with hummus."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56098eb562fa7a9917c1d852/6:4/w_274%2Ch_169/357351_hires.jpg"
    }
}