{
    "recipe": {
        "title": "Falafel Mushroom Loaf ",
        "ingredients": [
            "Nonstick vegetable cooking spray",
            "2 1/2 pounds mixed wild mushrooms, trimmed",
            "1 medium onion, coarsely chopped",
            "1 garlic clove, peeled, smashed",
            "1 teaspoon ground coriander",
            "1 teaspoon ground cumin",
            "1/2 teaspoon ground cardamom",
            "2 tablespoons vegetable oil, divided",
            "1 (15-ounce) can chickpeas, rinsed, drained",
            "1 large egg",
            "3/4 cup chickpea flour",
            "3/4 cup coarsely chopped cilantro",
            "1/2 cup coarsely chopped parsley",
            "2 teaspoons kosher salt",
            "1 garlic clove, peeled",
            "1/2 cup tahini",
            "5 tablespoons fresh lemon juice (from about 2 lemons)",
            "1 teaspoon kosher salt",
            "1 pomegranate, seeds reserved",
            "2 tablespoons coarsely chopped mint",
            "2 tablespoons coarsely chopped parsley"
        ],
        "instructions": [
            "Preheat oven to 350°F. Lightly coat a 8 1/2\" x 4 1/2\" x 2 1/2\" loaf pan with cooking spray.",
            "Working in batches, pulse mushrooms, onion, garlic, coriander, cumin, and cardamom in a food processor, scraping down sides as needed, until coarsely chopped, 30-45 seconds; transfer to a large bowl.",
            "Heat oil in a large skillet over medium-high. Add half of the mushroom mixture and cook, stirring occasionally, until the edges begin to crisp, about 5 minutes. Transfer to another large bowl; repeat with remaining mushroom mixture.",
            "Meanwhile, pulse chickpeas in food processor until coarsely chopped; add to bowl with cooked mushroom mixture. Add egg, chickpea flour, cilantro, parsley, and salt and gently stir to combine, being careful not to mash mixture too much. Spoon mixture into prepared loaf pan and bake until edges are browned and center is completely set, 75–90 minutes. Transfer pan to a wire rack and let cool 30 minutes, then invert onto a cutting board.",
            "Make the Tahini Sauce: While meatloaf cools, purée garlic, tahini, lemon juice, salt, and 1/2 cup water in food processer until very smooth.",
            "While meatloaf cools, purée garlic, tahini, lemon juice, salt, and 1/2 cup water in food processer until very smooth.",
            "Serve the meatloaf: Slice meatloaf into 2\" pieces and transfer to a platter. Top with Tahini Sauce, pomegranate seeds, mint, and parsley.",
            "Slice meatloaf into 2\" pieces and transfer to a platter. Top with Tahini Sauce, pomegranate seeds, mint, and parsley.",
            "Do ahead Loaf can be made 3 days ahead; Tahini Sauce can be made 1 day ahead. Keep both chilled.",
            "Loaf can be made 3 days ahead; Tahini Sauce can be made 1 day ahead. Keep both chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5643c34f9978979816f02f96/6:4/w_274%2Ch_169/EP_11032015_mushroom_meatloaf.jpg"
    }
}