{
    "recipe": {
        "title": "Fall Squash and Leek Bread Pudding ",
        "ingredients": [
            "4 tablespoons unsalted butter, plus more for pan",
            "12 cups (1\" pieces) brioche (from about 2 loaves)",
            "1 small butternut squash (about 1 1/2 lb.), peeled, seeds removed, cut into 1/2\" pieces",
            "2 large leeks, white and pale green parts only, halved lengthwise, cut into 1/2\" pieces",
            "1 teaspoon thyme leaves",
            "2 teaspoons kosher salt, plus more",
            "4 large eggs",
            "3 cups heavy cream",
            "3 cups whole milk",
            "1 teaspoon sugar",
            "1 1/2 cups coarsely grated Emmenthal cheese, Comté, and/or aged Gouda, divided",
            "Crème fraîche and fennel fronds (for serving)"
        ],
        "instructions": [
            "Preheat oven to 350°F. Butter a 13x9\" glass or ceramic baking dish; set aside. Spread out brioche on a large rimmed baking sheet and bake, tossing halfway through, until golden brown and crisp, 25–30 minutes. Let cool, then transfer to a large bowl.",
            "Heat remaining 4 Tbsp. butter in a large skillet over medium. Cook squash, leeks, and thyme, stirring occasionally until squash is tender, 10–12 minutes. Mix in a pinch of cayenne; season with salt. Transfer to bowl with brioche.",
            "Whisk eggs, cream, milk, sugar, 2 tsp. salt, and a pinch of cayenne in a large bowl to combine.",
            "Add 1 cup cheese to bowl with brioche and toss to evenly distribute. Transfer to prepared baking dish and pour 5 cups egg mixture over; gently press bread into liquid to coat. Pour remaining egg mixture over and let sit 15 minutes.",
            "Scatter remaining 1/2 cup cheese over bread pudding and bake until puffed and custard is set in the center, 60–75 minutes. Let cool at least 10 minutes before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a05db0bf819553e017bd989/6:4/w_274%2Ch_169/butternut-squash-leek-bread-pudding-recipe-BA-111017.jpg"
    }
}