{
    "recipe": {
        "title": "Fancy Dirt Cake ",
        "ingredients": [
            "1 batch chocolate shortbread cookies",
            "1 quart whole milk",
            "1 vanilla bean, split lengthwise",
            "4 large eggs",
            "1 cup sugar",
            "1/2 cup cornstarch",
            "1/2 teaspoon kosher salt",
            "1 cup unsalted butter (2 sticks), room temperature, divided",
            "12 ounces cream cheese, room temperature",
            "1 cup heavy cream",
            "Gummy worms and flowers (for decorating)",
            "A 3.5-quart (or 8-inch) clean plastic or terra cotta flower pot or trifle bowl"
        ],
        "instructions": [
            "Pulse cookies in a food processor until coarse crumbs form (or place in a plastic bag and pound with a rolling pin); set aside. Pour milk into a medium saucepan; scrape in vanilla seeds and add pod. Heat over medium until just before boiling. Whisk eggs, sugar, cornstarch, and salt in a large bowl. Whisking constantly, pour half of milk mixture into egg mixture. (Putting a wet towel underneath bowl will help stabilize it.) Add egg and milk mixture to remaining milk mixture in saucepan. Cook over medium heat, whisking constantly, until custard is thick and bubbles just a bit, about 7 minutes, then continue to cook 1 minute more. Strain custard through a fine-mesh sieve into a clean bowl; discard vanilla pod. Add 1/4 cup butter and whisk to combine. Cover with plastic wrap, pressing directly on surface of custard, and chill until cold, about 3 hours. Using an electric mixer on medium-high speed, beat cream cheese and remaining 3/4 cup butter in a large bowl until smooth. Add chilled custard and beat until combined. Using electric mixer on medium-high speed, whip cream in a medium bowl until medium peaks form. Using a rubber spatula, gently fold whipped cream into custard to combine. Layer custard and cookie crumbs alternately in flower pot, inserting gummy worms at random, ending with crumbs. Stick a flower or two into cake to decorate, adding more worms on top of \"soil\" if desired.",
            "Pulse cookies in a food processor until coarse crumbs form (or place in a plastic bag and pound with a rolling pin); set aside.",
            "Pour milk into a medium saucepan; scrape in vanilla seeds and add pod. Heat over medium until just before boiling.",
            "Whisk eggs, sugar, cornstarch, and salt in a large bowl. Whisking constantly, pour half of milk mixture into egg mixture. (Putting a wet towel underneath bowl will help stabilize it.) Add egg and milk mixture to remaining milk mixture in saucepan. Cook over medium heat, whisking constantly, until custard is thick and bubbles just a bit, about 7 minutes, then continue to cook 1 minute more.",
            "Strain custard through a fine-mesh sieve into a clean bowl; discard vanilla pod. Add 1/4 cup butter and whisk to combine. Cover with plastic wrap, pressing directly on surface of custard, and chill until cold, about 3 hours.",
            "Using an electric mixer on medium-high speed, beat cream cheese and remaining 3/4 cup butter in a large bowl until smooth. Add chilled custard and beat until combined.",
            "Using electric mixer on medium-high speed, whip cream in a medium bowl until medium peaks form. Using a rubber spatula, gently fold whipped cream into custard to combine.",
            "Layer custard and cookie crumbs alternately in flower pot, inserting gummy worms at random, ending with crumbs. Stick a flower or two into cake to decorate, adding more worms on top of \"soil\" if desired.",
            "Do Ahead Custard can be made 1 day ahead; keep chilled.",
            "Custard can be made 1 day ahead; keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57c999f6ca59d0ba78ef7078/6:4/w_274%2Ch_169/dirt-cake-31082016.jpg"
    }
}