{
    "recipe": {
        "title": "Farmhouse Cheese and Caraway Soda Bread Puddings ",
        "ingredients": [
            "2 cups all-purpose flour, plus more for dusting",
            "3/4 teaspoon baking soda",
            "1/2 teaspoon salt",
            "1 tablespoon caraway seeds",
            "1 cup well-shaken buttermilk",
            "2 tablespoons unsalted butter, melted",
            "3 ounces sharp white Cheddar cheese, coarsely grated (1 1/4 cups)",
            "1/4 cup grated Parmigiano-Reggiano",
            "4 large eggs",
            "2 1/2 cups whole milk",
            "8 (6-ounce) ramekins or a 2-quart shallow gratin or baking dish"
        ],
        "instructions": [
            "Preheat oven to 375°F with rack in middle.",
            "Whisk together flour, baking soda, salt, and caraway in a large bowl. Add buttermilk and butter. Stir just until dough is evenly moistened but still lumpy.",
            "Transfer dough to a well-floured surface and turn dough to coat with flour. Gently knead with floured hands about 8 times to form a soft but slightly less sticky dough.",
            "Form into a domed 6-inch round and put on an ungreased baking sheet. Cut a 1/2-inch-deep \"X\" across top of each loaf with a sharp knife. Using a small sieve, dust 1 tablespoon of additional flour over loaf.",
            "Bake in middle of oven until golden brown and bottom sounds hollow when tapped, 35 to 40 minutes. Transfer loaf to a rack and cool completely.",
            "Make puddings: Preheat oven to 350°F with rack in middle. Butter ramekins or baking dish. Cut enough bread into 1-inch cubes to measure 3 3/4 cups (about half the loaf; reserve remaining bread for another use.) Divide bread among ramekins (or spread in larger baking dish). Whisk together eggs, milk, 1/2 teaspoon salt, and 1/4 teaspoon pepper. Stir in cheese and spoon over bread in ramekins or baking dish. Let stand 10 minutes. Put ramekins or baking dish in a larger baking pan and add enough hot water to come halfway up sides of ramekins or dish. Bake until just set and a knife inserted in center comes out clean, about 35 minutes. Transfer ramekins or dish from hot water bath to a rack and cool 20 minutes before serving.",
            "Preheat oven to 350°F with rack in middle. Butter ramekins or baking dish.",
            "Cut enough bread into 1-inch cubes to measure 3 3/4 cups (about half the loaf; reserve remaining bread for another use.) Divide bread among ramekins (or spread in larger baking dish).",
            "Whisk together eggs, milk, 1/2 teaspoon salt, and 1/4 teaspoon pepper. Stir in cheese and spoon over bread in ramekins or baking dish. Let stand 10 minutes.",
            "Put ramekins or baking dish in a larger baking pan and add enough hot water to come halfway up sides of ramekins or dish.",
            "Bake until just set and a knife inserted in center comes out clean, about 35 minutes.",
            "Transfer ramekins or dish from hot water bath to a rack and cool 20 minutes before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b26f349a93d64c380ae8aa/6:4/w_274%2Ch_169/388796_bread-pudding_1x1.jpg",
        "color": 3595484
    }
}