{
    "recipe": {
        "title": "Farro, Radicchio, and Roasted Beet Salad ",
        "ingredients": [
            "8 1- to 1 1/2-inch-diameter beets, tops trimmed to 1 inch",
            "Vegetable oil",
            "1 1/2 cups semi-pearled farro or wheat berries",
            "4 tablespoons extra-virgin olive oil, divided",
            "4 tablespoons red wine vinegar, divided",
            "1 garlic clove, pressed",
            "2 cups (packed) thinly sliced quartered radicchio (from about 1 medium head)",
            "1/2 cup finely chopped red onion",
            "1/3 cup chopped fresh Italian parsley",
            "1 cup crumbled feta cheese (about 4 ounces)"
        ],
        "instructions": [
            "Preheat oven to 350°F. Arrange beets in single layer in 8 x 8 x 2-inch baking dish. Drizzle with vegetable oil. Cover with foil and roast until beets are tender, about 45 minutes. Cool. Trim beets; peel. DO AHEAD: Can be made 1 day ahead. Cover; chill.",
            "Cook farro in large saucepan of boiling salted water until tender, stirring occasionally, about 20 minutes. Drain. Transfer to large bowl. Stir 2 tablespoons olive oil, 1 tablespoon vinegar, and garlic into hot farro. Cool to room temperature.",
            "Cut each beet into 6 to 8 wedges. Add beets, radicchio, onion, and parsley to farro; toss to incorporate evenly. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
            "Whisk 2 tablespoons olive oil and 3 tablespoons vinegar in small bowl. Drizzle over salad. Add feta cheese; toss to coat.",
            "Test-kitchen tip: Any type of beet (red, golden, red-and-white-striped Chioggia) would be great in this salad. To avoid stained hands, wear plastic gloves when peeling dark-colored beets.",
            "Any type of beet (red, golden, red-and-white-striped Chioggia) would be great in this salad. To avoid stained hands, wear plastic gloves when peeling dark-colored beets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56098ef462fa7a9917c1d8e2/6:4/w_274%2Ch_169/359409_hires.jpg",
        "color": 15266926
    }
}