{
    "recipe": {
        "title": "Favorite Bread and Butter Pudding with Bourbon Sauce ",
        "ingredients": [
            "4 stale slices firm-textured white bread, crusts and all (see headnote)",
            "2 tablespoons unsalted butter, softened",
            "1/2 cup dark seedless raisins (see headnote)",
            "3 large eggs, lightly beaten",
            "1/3 cup granulated sugar",
            "1/2 teaspoon vanilla extract",
            "1/2 teaspoon ground cinnamon",
            "1/4 teaspoon freshly grated nutmeg",
            "1 1/4 cups milk",
            "1 cup half-and-half",
            "1/4 cup firmly packed light brown sugar",
            "1 1/2 tablespoons cornstarch",
            "1/4 teaspoon freshly grated nutmeg",
            "1/4 teaspoon salt",
            "1 cup water",
            "1/3 cup bourbon (see Tip above)",
            "2 tablespoons unsalted butter",
            "1 tablespoon fresh lemon juice"
        ],
        "instructions": [
            "1. Butter 1 1/2-quart casserole or spritz with nonstick cooking spray and set aside.",
            "2. Spread one side of each slice of bread with butter, cut each slice into four pieces of equal size, spread half of them in casserole, and sprinkle half of raisins on top. Repeat layers and set aside.",
            "3. Beat eggs, sugar, vanilla, cinnamon, and nutmeg at high electric mixer speed about 2 minutes until creamy. With mixer at low speed, add milk gradually, then half-and-half.",
            "4. Pour over bread and raisins in casserole and let stand uncovered at room temperature 1 hour. After 40 minutes, preheat oven to 350°F.",
            "5. When pudding has stood 1 hour, set in large shallow pan, and place on pulled-out middle oven shelf. Pour hot water into pan to depth of 1 inch, slide shelf into oven, and bake pudding uncovered about 1 hour until cake tester inserted in center comes out clean.",
            "6. Transfer casserole to wire rack and cool 20 minutes.",
            "7. Meanwhile, prepare Bourbon Sauce: Combine sugar, cornstarch, nutmeg, and salt in small nonreactive saucepan. Whisk in water and bourbon and continue whisking until smooth. Add butter, set over moderate heat, and cook, whisking constantly, 2 to 3 minutes until thickened and translucent. Remove from heat, mix in lemon juice, and transfer to heated sauceboat.",
            "8. Serve pudding warm at table, trickle a little sauce over each portion, and pass the rest."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b0386acae54b6703412c36/6:4/w_274%2Ch_169/51139210_bread-pudding_1x1.jpg"
    }
}