{
    "recipe": {
        "title": "Fennel-Rubbed Leg of Lamb with Carrots and Salsa Verde ",
        "ingredients": [
            "1 (4–5-pound) butterflied boneless leg of lamb, rolled, tied",
            "Kosher salt, freshly ground pepper",
            "3 tablespoons fennel seeds",
            "4 teaspoons crushed red pepper flakes",
            "4 garlic cloves, finely grated",
            "3 tablespoons plus 1/4 cup olive oil",
            "2 1/2 pounds small or medium carrots with tops",
            "1/2 cup finely chopped parsley",
            "1/4 cup finely chopped chives",
            "2 tablespoons (or more) fresh lemon juice",
            "2 tablespoons olive oil",
            "Kosher salt, freshly ground pepper",
            "A spice mill or mortar and pestle"
        ],
        "instructions": [
            "Season lamb generously with salt and pepper; let it sit out at room temperature while you prepare the rub.",
            "Using spice mill or mortar and pestle, coarsely grind fennel seeds and red pepper flakes. Transfer to a small bowl and mix in garlic and 3 Tbsp. oil. Evenly rub lamb all over with spice mixture, making sure to work it into every nook and cranny.",
            "Preheat oven to 300°F. Heat remaining 1/4 cup oil in a large heavy skillet over medium. As soon as oil is hot and shimmering, add lamb to skillet and cook, carefully pouring off fat as needed into a small bowl (reserve it), until golden brown all over, 3–5 minutes per side. The goal here is to cook out some of the excess fat while you brown the meat, so it’s important to maintain a moderate heat to keep the meat from getting dark before the fat can melt out. If the oil looks really dark or tastes burned, discard it and use olive oil in the next step.",
            "Trim tops from carrots and set aside for making the salsa verde. Scrub carrots, pat dry, and scatter along the outer edges of a large rimmed baking sheet. Place seared lamb in the center. Pour reserved fat and any fat still in skillet (don’t forget to scrape out the crispy bits stuck to the bottom of the pan) over carrots, season with salt and pepper, and toss to coat.",
            "Roast lamb and carrots until an instant-read thermometer inserted into the center of leg registers 135°F for medium-rare, 75–90 minutes. Transfer lamb to a cutting board and tent with foil; let rest 20 minutes. Leave oven on.",
            "Salsa Verde and assembly: While the lamb is resting, transfer carrots to a platter, then carefully pour any juices from the baking sheet into a small bowl (you should have about 1/4 cup; if you don’t, top off with olive oil). Transfer carrots back to baking sheet and pop back into oven. Roast 5 minutes to reheat. Meanwhile, finely chop reserved carrot tops to make 1/2 cup; discard remaining tops. Place in a small bowl and mix in parsley, chives, lemon juice, pan juices, and 2 Tbsp. oil. Season with salt and pepper and more lemon juice if needed. Remove twine from lamb and slice about 1/2\" thick (but you can really go as thick or thin as you would like). Arrange on a platter and serve with warm roasted carrots and salsa verde alongside.",
            "While the lamb is resting, transfer carrots to a platter, then carefully pour any juices from the baking sheet into a small bowl (you should have about 1/4 cup; if you don’t, top off with olive oil). Transfer carrots back to baking sheet and pop back into oven. Roast 5 minutes to reheat.",
            "Meanwhile, finely chop reserved carrot tops to make 1/2 cup; discard remaining tops. Place in a small bowl and mix in parsley, chives, lemon juice, pan juices, and 2 Tbsp. oil. Season with salt and pepper and more lemon juice if needed.",
            "Remove twine from lamb and slice about 1/2\" thick (but you can really go as thick or thin as you would like). Arrange on a platter and serve with warm roasted carrots and salsa verde alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59e8f2f052887234610c097d/6:4/w_274%2Ch_169/fennel-rubbed-leg-of-lamb-with-carrots-and-salsa-verde-recipe-BA-101917.jpg",
        "color": 15992104
    }
}