{
    "recipe": {
        "title": "Fennel and Orange Salad with Lemon-Ginger Vinaigrette ",
        "ingredients": [
            "1/4 baguette, very thinly sliced",
            "2 tablespoons white wine vinegar",
            "1 teaspoon finely grated lemon zest",
            "1 teaspoon finely grated orange zest",
            "1 teaspoon finely grated peeled ginger",
            "1/2 teaspoon coarsely ground black pepper",
            "Kosher salt",
            "3 tablespoons extra-virgin olive oil",
            "2 navel oranges",
            "1 fennel bulb, trimmed, very thinly sliced, plus 1/4 cup fennel fronds",
            "4 ounces mustard greens, center ribs and stems removed, leaves torn into bite-size pieces (about 4 cups)"
        ],
        "instructions": [
            "Preheat oven to 375°F. Place baguette slices on a rimmed baking sheet and toast, 8-10 minutes. Let cool and break into pieces. Meanwhile, whisk vinegar, lemon and orange zests, ginger, and pepper in a large bowl; season with salt and whisk in oil. Using a sharp knife, cut all peel and white pith from oranges; discard. Working over bowl with dressing, cut between membranes to release segments into bowl; discard membranes. Add fennel, fennel fronds, mustard greens, and croutons to bowl; toss to combine.",
            "Preheat oven to 375°F. Place baguette slices on a rimmed baking sheet and toast, 8-10 minutes. Let cool and break into pieces. Meanwhile, whisk vinegar, lemon and orange zests, ginger, and pepper in a large bowl; season with salt and whisk in oil.",
            "Using a sharp knife, cut all peel and white pith from oranges; discard. Working over bowl with dressing, cut between membranes to release segments into bowl; discard membranes. Add fennel, fennel fronds, mustard greens, and croutons to bowl; toss to combine."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad7ff26529d92b2c048291/6:4/w_274%2Ch_169/51187060_fennel-orange-salad_1x1.jpg"
    }
}