{
    "recipe": {
        "title": "Fennel Slaw ",
        "ingredients": [
            "1 tablespoon fennel seeds",
            "1 tablespoon anise seeds",
            "1/3 cup mayonnaise",
            "1/2 cup red-wine vinegar",
            "3/4 teaspoon salt",
            "1/2 teaspoon black pepper",
            "2 medium fennel bulbs (sometimes called anise; 1 to 1 1/2 lb total), stalks cut off and discarded but fronds reserved",
            "1 tablespoon fresh lemon juice",
            "1 small green cabbage (2 to 2 1/2 lb, preferably Savoy), any tough outer leaves discarded",
            "1 large carrot, coarsely grated (1 cup)",
            "1 small red onion, halved lengthwise, then thinly sliced lengthwise (1 cup)",
            "1/4 cup finely chopped fresh flat-leaf parsley",
            "an electric coffee/spice grinder"
        ],
        "instructions": [
            "Toast fennel and anise seeds in a dry heavy skillet over moderate heat, shaking occasionally, until lightly browned, then cool. Coarsely grind fennel and anise seeds in grinder. Whisk together ground seeds and remaining dressing ingredients in a small bowl.",
            "Make slaw: Halve fennel bulbs lengthwise, then cut out and discard cores. Thinly slice fennel crosswise and toss with lemon juice in a very large bowl. Finely chop enough fennel fronds to measure 1/4 cup and add to sliced fennel. Quarter cabbage and cut out and discard core. Thinly slice cabbage crosswise and add to fennel along with carrot, onion, parsley, and dressing and toss well. Chill, covered, at least 1 hour to allow flavors to develop.",
            "Halve fennel bulbs lengthwise, then cut out and discard cores. Thinly slice fennel crosswise and toss with lemon juice in a very large bowl. Finely chop enough fennel fronds to measure 1/4 cup and add to sliced fennel.",
            "Quarter cabbage and cut out and discard core. Thinly slice cabbage crosswise and add to fennel along with carrot, onion, parsley, and dressing and toss well. Chill, covered, at least 1 hour to allow flavors to develop."
        ],
        "picture_link": null,
        "color": 4161572
    }
}