{
    "recipe": {
        "title": "Feta, Spinach, and Basil Omelette Muffins ",
        "ingredients": [
            "Cooking spray or sunflower oil, for greasing",
            "8 free-range eggs",
            "8 sun-dried tomatoes, drained well and roughly chopped",
            "Large handful of baby spinach, roughly chopped (about 2 Tablespoons)",
            "Good pinch of freshly grated nutmeg",
            "1/2 cup feta cheese, roughly broken into bite-sized pieces",
            "A few fresh basil leaves",
            "Sea salt and freshly ground black pepper",
            "1/2 cup arugula, watercress, or mixed salad leaves",
            "3 tablespoons extra-virgin olive oil",
            "1 tablespoon balsamic vinegar",
            "Sea salt and freshly ground black pepper"
        ],
        "instructions": [
            "Preheat the oven to 325°F. Grease 8 holes of a muffin tin with the spray or sunflower oil and set aside. Put the eggs, tomato, spinach, nutmeg and salt (just a little bit as the feta is very salty) and pepper into a large jug and whisk together until combined. Divide the mixture evenly among the 8 muffin holes and then sprinkle over the feta cheese. Bake in the oven for about 20 minutes or until the muffins have risen slightly, are firm to the touch and lightly golden. Then, remove from the oven and leave to cool a little. Place the salad leaves on a large serving plate. Whisk the oil and vinegar together in a small bowl or mug with a little salt and pepper and pour over the leaves. Using a small, sharp knife, loosen the edges of each muffin from the tin and carefully pop them out. Arrange them on top of the salad leaves. Rip up the basil leaves, scatter them over the top, and serve.",
            "Preheat the oven to 325°F. Grease 8 holes of a muffin tin with the spray or sunflower oil and set aside.",
            "Put the eggs, tomato, spinach, nutmeg and salt (just a little bit as the feta is very salty) and pepper into a large jug and whisk together until combined. Divide the mixture evenly among the 8 muffin holes and then sprinkle over the feta cheese.",
            "Bake in the oven for about 20 minutes or until the muffins have risen slightly, are firm to the touch and lightly golden. Then, remove from the oven and leave to cool a little.",
            "Place the salad leaves on a large serving plate. Whisk the oil and vinegar together in a small bowl or mug with a little salt and pepper and pour over the leaves.",
            "Using a small, sharp knife, loosen the edges of each muffin from the tin and carefully pop them out.",
            "Arrange them on top of the salad leaves. Rip up the basil leaves, scatter them over the top, and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5720fd91db3cd6fd5a7dd1a1/6:4/w_274%2Ch_169/FetaSpinachOmelette.jpg"
    }
}