{
    "recipe": {
        "title": "Fettuccine with Wild Mushroom Sauce ",
        "ingredients": [
            "1 1/2 ounces dried porcini mushrooms*",
            "3 cups hot water",
            "6 tablespoons ( 3/4 stick) butter",
            "3 tablespoons extra-virgin olive oil",
            "3 garlic cloves, crushed",
            "1 1/2 pounds assorted fresh mushrooms, such as wild crimini, portobello (dark gills scraped out), and stemmed shiitake, thickly sliced",
            "6 tablespoons chopped fresh Italian parsley, divided",
            "1 batch freshly cooked Homemade Egg Fettuccine",
            "1/2 cup freshly grated Pecorino Romano cheese plus more for passing"
        ],
        "instructions": [
            "Place porcini in medium bowl; add 3 cups hot water. Let soak until soft, about 30 minutes. Drain mushrooms, reserving soaking liquid. Melt butter with oil in large deep skillet over medium heat. Add garlic; sauté until beginning to brown, about 3 minutes. Add fresh mushrooms; sprinkle with salt and pepper. Cover; cook until tender, stirring often, about 6 minutes. Add drained porcini. Cover; cook 2 minutes. Uncover; sauté 2 minutes longer. Mix in 3 tablespoons parsley; season with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover mushroom sauce and soaking liquid separately and refrigerate. Add cooked fettuccine and 1/2 cup cheese to mushroom sauce in skillet. Toss over medium heat until heated, cheese melts, and sauce coats pasta, adding reserved mushroom soaking liquid as needed if dry. Mix in remaining 3 tablespoons parsley. Season to taste with salt and pepper. Transfer to large bowl and serve with more cheese.",
            "Place porcini in medium bowl; add 3 cups hot water. Let soak until soft, about 30 minutes. Drain mushrooms, reserving soaking liquid.",
            "Melt butter with oil in large deep skillet over medium heat. Add garlic; sauté until beginning to brown, about 3 minutes. Add fresh mushrooms; sprinkle with salt and pepper. Cover; cook until tender, stirring often, about 6 minutes. Add drained porcini. Cover; cook 2 minutes. Uncover; sauté 2 minutes longer. Mix in 3 tablespoons parsley; season with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover mushroom sauce and soaking liquid separately and refrigerate.",
            "Add cooked fettuccine and 1/2 cup cheese to mushroom sauce in skillet. Toss over medium heat until heated, cheese melts, and sauce coats pasta, adding reserved mushroom soaking liquid as needed if dry. Mix in remaining 3 tablespoons parsley. Season to taste with salt and pepper. Transfer to large bowl and serve with more cheese.",
            "*Available in the produce section of many supermarkets and at specialty foods stores and Italian markets.",
            "*Available in the produce section of many supermarkets and at specialty foods stores and Italian markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a2df3a00aeb2f1cf78a/6:4/w_274%2Ch_169/240104_hires.jpg"
    }
}