{
    "recipe": {
        "title": "Fettuccine with Sausage, Sage, and Crispy Garlic ",
        "ingredients": [
            "3/4 pound fettuccine (preferably egg fettuccine, such as De Cecco)",
            "2 tablespoons butter, divided",
            "1/4 cup olive oil",
            "8 garlic cloves, peeled, thinly sliced",
            "2 tablespoons finely chopped fresh sage",
            "1 pound sweet Italian turkey sausages, casings removed",
            "1/4 teaspoon dried crushed red pepper (optional)",
            "1 cup grated Asiago cheese* (about 3 ounces)"
        ],
        "instructions": [
            "Meanwhile, melt 1 tablespoon butter with oil in heavy large skillet over medium heat. Add garlic slices and sauté until light golden, about 45 seconds. Using slotted spoon, transfer garlic to bowl. Increase heat to medium-high; add sage to same skillet and stir until beginning to crisp, about 10 seconds. Add sausage and sauté until browned and crisp in spots, breaking up with fork, about 8 minutes. Drain pasta; add pasta and remaining 1 tablespoon butter to skillet. Using tongs, toss pasta with sausage mixture. Add crushed red pepper, if desired; season to taste with salt and pepper. Transfer pasta to large bowl. Top with crispy garlic and grated Asiago cheese.",
            "Meanwhile, melt 1 tablespoon butter with oil in heavy large skillet over medium heat. Add garlic slices and sauté until light golden, about 45 seconds. Using slotted spoon, transfer garlic to bowl.",
            "Increase heat to medium-high; add sage to same skillet and stir until beginning to crisp, about 10 seconds. Add sausage and sauté until browned and crisp in spots, breaking up with fork, about 8 minutes.",
            "Drain pasta; add pasta and remaining 1 tablespoon butter to skillet. Using tongs, toss pasta with sausage mixture. Add crushed red pepper, if desired; season to taste with salt and pepper. Transfer pasta to large bowl. Top with crispy garlic and grated Asiago cheese.",
            "*Available at some supermarkets and at specialty foods stores and Italian markets.",
            "*Available at some supermarkets and at specialty foods stores and Italian markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d77f7f9a841923089d576/6:4/w_274%2Ch_169/241613_hires.jpg"
    }
}