{
    "recipe": {
        "title": "Fire Cider Tonic ",
        "ingredients": [
            "1 cup coarsely grated peeled horseradish (about 4 ounces)",
            "1 small onion, coarsely chopped",
            "8 large garlic cloves, smashed",
            "1/2 cup peeled and coarsely grated or chopped ginger (about 3 ounces)",
            "1 tablespoon ground turmeric",
            "1 teaspoon black peppercorns",
            "4 rosemary sprigs",
            "1 whole clove",
            "1–2 dried hot chiles",
            "1 lemon, quartered",
            "2 cups (or more) unfiltered apple cider vinegar",
            "2 tablespoons (or more) honey",
            "A (preferably glass) quart container; cheesecloth",
            "Fire cider can be made 3 months ahead; store chilled in a (preferably glass) resealable container."
        ],
        "instructions": [
            "Place horseradish, onion, garlic, ginger, turmeric, peppercorns, rosemary, and clove in quart jar. Crumble chile (use 2 if you like it spicy) into jar. Squeeze in lemon quarters; add rinds. Pour vinegar into jar until solids are fully submerged. Cover tightly, then swirl jar gently to combine. Let stand in a dark spot 1 month.",
            "Strain through a cheesecloth-lined colander or sieve into a large measuring cup; discard solids. Gather up corners of cheesecloth to extract as much liquid as possible (wear gloves if you wish to avoid turmeric stains on your hands). Rinse out jar and pour in liquid. Add 2 Tbsp. honey, then shake covered jar or whisk to combine. Add more honey to taste.",
            "You can transfer mixture to a few smaller bottles, such as swing-top bottles, as it’s easier to pour from this way. Tightly seal and chill.",
            "Suggested Uses: Cold Preventative: Sip by the spoonful when you feel a cold coming. You can also dilute it in water. Fire Cider Tonic: This makes a great mocktail. Add about 1 Tbsp. fire cider and a squeeze of fresh orange juice to a glass of seltzer. Garnish with rosemary sprig. Salad Dressing: Use in place of apple cider vinegar in your favorite vinaigrette. You likely won’t need to add any additional sweetener. Fire Cider Tea: Add about 1 Tbsp. fire cider to a mug of hot water, along with a squeeze of fresh lemon juice and a little honey to sweeten. Finish with a bit of freshly ground black pepper. Fresh Herb Sauces: Use fire cider in place of the red wine vinegar in sauces like chimichurri. Marinade for fish, chicken, or tofu: Think of fire cider as the acid in bright, assertive marinades similar to those for jerk chicken.",
            "Cold Preventative: Sip by the spoonful when you feel a cold coming. You can also dilute it in water.",
            "Fire Cider Tonic: This makes a great mocktail. Add about 1 Tbsp. fire cider and a squeeze of fresh orange juice to a glass of seltzer. Garnish with rosemary sprig.",
            "Salad Dressing: Use in place of apple cider vinegar in your favorite vinaigrette. You likely won’t need to add any additional sweetener.",
            "Fire Cider Tea: Add about 1 Tbsp. fire cider to a mug of hot water, along with a squeeze of fresh lemon juice and a little honey to sweeten. Finish with a bit of freshly ground black pepper.",
            "Fresh Herb Sauces: Use fire cider in place of the red wine vinegar in sauces like chimichurri.",
            "Marinade for fish, chicken, or tofu: Think of fire cider as the acid in bright, assertive marinades similar to those for jerk chicken."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58af3b41d011dc426027376b/6:4/w_274%2Ch_169/Fire-Cider-hero-17022017.jpg",
        "color": 8122365
    }
}