{
    "recipe": {
        "title": "Fish in Crazy Water ",
        "ingredients": [
            "2 large garlic cloves",
            "6 ounces cherry tomatoes",
            "1/2 cup packed fresh flat-leafed parsley leaves",
            "a 2- to 2 1/2-pound whole red snapper or black bass, cleaned, with head removed and tail intact",
            "6 tablespoons olive oil",
            "2 cups water",
            "1 cup dry white wine"
        ],
        "instructions": [
            "Mince garlic. Quarter tomatoes and finely chop parsley. Season fish inside and out with salt and pepper. In a heavy skillet just large enough to fit fish heat oil over moderately high heat until hot but not smoking and sauté garlic, stirring, until it just begins to turn golden. Add fish, tomatoes, water, wine, and 1/4 cup parsley and bring to a boil over high heat. Spoon cooking liquid over fish and cook fish, covered, at a bare simmer until just cooked through, 15 to 20 minutes. Transfer fish and tomatoes to a large serving platter and cover with foil. Boil cooking liquid over high heat until reduced to 1 cup, about 10 minutes. Stir in remaining parsley and salt and pepper to taste. Fillet fish and spoon sauce and tomatoes over it.",
            "Mince garlic. Quarter tomatoes and finely chop parsley. Season fish inside and out with salt and pepper.",
            "In a heavy skillet just large enough to fit fish heat oil over moderately high heat until hot but not smoking and sauté garlic, stirring, until it just begins to turn golden. Add fish, tomatoes, water, wine, and 1/4 cup parsley and bring to a boil over high heat. Spoon cooking liquid over fish and cook fish, covered, at a bare simmer until just cooked through, 15 to 20 minutes.",
            "Transfer fish and tomatoes to a large serving platter and cover with foil. Boil cooking liquid over high heat until reduced to 1 cup, about 10 minutes. Stir in remaining parsley and salt and pepper to taste. Fillet fish and spoon sauce and tomatoes over it."
        ],
        "picture_link": null
    }
}