{
    "recipe": {
        "title": "Fish Wrapped in Banana Leaves with Chile Rajas and Crema ",
        "ingredients": [
            "1 1/2 lb fresh poblano chiles",
            "1 1/2 lb white onions, halved lengthwise, then sliced lengthwise 1/4 inch thick",
            "3/4 teaspoon salt",
            "3 tablespoons safflower oil",
            "1 lb banana leaves*, thawed if frozen",
            "8 (6-oz) pieces skinless snapper or halibut fillet",
            "1 cup crema (thick Mexican cream) or crème fraîche plus additional for drizzling if desired",
            "Garnish: fresh cilantro leaves"
        ],
        "instructions": [
            "Roast chiles on racks of gas burners over high heat, turning with tongs, until skins are blackened, 10 to 12 minutes. (Or broil chiles on a broiler pan about 5 inches from heat, turning occasionally, about 15 minutes.) Transfer to a large bowl and cover tightly with plastic wrap, then let stand 20 minutes.",
            "When cool enough to handle, peel chiles, discarding stems and seeds (do not rinse under running water as this washes away flavor), and cut lengthwise into 1/4-inch-thick strips.",
            "Cook onions with salt in oil in a 12-inch heavy skillet over moderate heat, stirring, until onions are tender but still have texture, about 10 minutes. Stir in chiles and cook, stirring, 1 minute, then season with salt.",
            "Assemble fish packets: Preheat oven to 450°F. Unfold banana leaves. Cut off (and reserve) tough center rib that runs along bottom edge of each leaf with kitchen shears. Cut ribs into 12- to 14-inch strips for tying packets. Gently cut leaves into 8 (12-inch) squares, being careful not to split them. Slowly run a banana-leaf square across flame of a gas burner, just enough to \"melt\" outer coating on leaf (it will become quite shiny; if you have an electric stove, hold leaf slightly above burner on moderately high). Place a piece of fish in center of square and season with salt, then top with 1/2 cup rajas and 2 tablespoons crema. Fold 2 sides of banana leaf over fish to enclose it, then fold in opposite sides to form a packet. Tie packet with a strip of banana-leaf rib and transfer to a large baking sheet. Assemble 7 more packets in same manner. Bake fish packets in middle of oven 20 minutes, then transfer each to a large plate or shallow soup bowl. Cut ties of packets and open them (leaves are not edible). Drizzle fish with additional crema.",
            "Preheat oven to 450°F.",
            "Unfold banana leaves. Cut off (and reserve) tough center rib that runs along bottom edge of each leaf with kitchen shears. Cut ribs into 12- to 14-inch strips for tying packets. Gently cut leaves into 8 (12-inch) squares, being careful not to split them.",
            "Slowly run a banana-leaf square across flame of a gas burner, just enough to \"melt\" outer coating on leaf (it will become quite shiny; if you have an electric stove, hold leaf slightly above burner on moderately high). Place a piece of fish in center of square and season with salt, then top with 1/2 cup rajas and 2 tablespoons crema. Fold 2 sides of banana leaf over fish to enclose it, then fold in opposite sides to form a packet. Tie packet with a strip of banana-leaf rib and transfer to a large baking sheet. Assemble 7 more packets in same manner.",
            "Bake fish packets in middle of oven 20 minutes, then transfer each to a large plate or shallow soup bowl. Cut ties of packets and open them (leaves are not edible). Drizzle fish with additional crema.",
            "Available at Latino and Asian markets.",
            "Available at Latino and Asian markets.",
            "Available at Latino and Asian markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea1427b55306961bff078/6:4/w_274%2Ch_169/107200.jpg"
    }
}