{
    "recipe": {
        "title": "Five-Spice Beet Soup ",
        "ingredients": [
            "4 2-to 2 1/2-inch-diameter beets, scrubbed, trimmed, unpeeled, each cut into 6 wedges (about 3 1/2 cups)",
            "3 cups vegetable broth, divided",
            "1 tablespoon olive oil",
            "1 medium-size red onion, thinly sliced (2 cups)",
            "1 celery stalk with leaves, stalk chopped, leaves sliced",
            "2 teaspoons grated peeled fresh ginger",
            "1/4 teaspoon (or more) Chinese five-spice powder*",
            "Sour cream or plain yogurt"
        ],
        "instructions": [
            "Place beet wedges in 4-cup glass measuring cup. Add 2 cups broth; cover with paper plate and microwave on high until tender, about 15 minutes. Meanwhile, heat oil in heavy medium saucepan over medium heat. Add onion and chopped celery stalk; cover and cook until almost tender and translucent, stirring often, about 12 minutes. Add beet mixture and 1 cup broth to onion mixture; cover and simmer 4 minutes. Mix in ginger and 1/4 teaspoon five-spice powder. Transfer to blender; cover and puree. Season soup to taste with salt, pepper, and additional five-spice powder, if desired; rewarm if necessary. Ladle soup into 4 bowls. Top with dollops of sour cream and sliced celery leaves.",
            "Place beet wedges in 4-cup glass measuring cup. Add 2 cups broth; cover with paper plate and microwave on high until tender, about 15 minutes.",
            "Meanwhile, heat oil in heavy medium saucepan over medium heat. Add onion and chopped celery stalk; cover and cook until almost tender and translucent, stirring often, about 12 minutes.",
            "Add beet mixture and 1 cup broth to onion mixture; cover and simmer 4 minutes. Mix in ginger and 1/4 teaspoon five-spice powder. Transfer to blender; cover and puree. Season soup to taste with salt, pepper, and additional five-spice powder, if desired; rewarm if necessary. Ladle soup into 4 bowls. Top with dollops of sour cream and sliced celery leaves.",
            "*A spice blend available in the spice section of most supermarkets.",
            "*A spice blend available in the spice section of most supermarkets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a4c96a59cdb91b5ff380/6:4/w_274%2Ch_169/351252_hires.jpg"
    }
}