{
    "recipe": {
        "title": "Five Spice Pork Rillettes ",
        "ingredients": [
            "3 garlic cloves",
            "1 teaspoon Chinese five-spice powder",
            "1 tablespoon plus 1/2 teaspoon kosher salt, divided",
            "2 pounds boneless pork shoulder, cut into 1 1/2-inch pieces",
            "1 pound skinless pork fatback (not salted), cut into 1/2-inch pieces",
            "5 flat-leaf parsley sprigs",
            "1 Turkish or 1/2 California bay leaf",
            "5 scallions, 3 halved crosswise and 2 finely chopped",
            "2 cups water",
            "1/3 cup plus 1 tablespoon dry Sherry, divided",
            "1 medium carrot, finely chopped",
            "cheesecloth",
            "kitchen string",
            "a 4-cup terrine or crock",
            "toasted baguette or crackers"
        ],
        "instructions": [
            "Preheat oven to 325°F with rack in lower third. Mince and mash garlic with five-spice powder, 1 tablespoon kosher salt, and 1/2 tsp pepper. Rub onto pork and fatback in a 5-quart heavy pot. Wrap parsley, bay leaf, and halved scallions in cheesecloth and tie with string. Add to pot with pork, water, and 1/3 cup Sherry and bring to a boil. Cover and braise in oven until meat is very tender, about 3 hours. Boil carrot until crisp-tender, about 4 minutes. Stir in chopped scallion and cook 1 minute. Drain and cool slightly. Drain pork mixture in a large sieve set over a bowl, reserving liquid. Finely shred meat and lightly mash fatback with tines, transferring both to a bowl. Skim and reserve fat from liquid. Stir 1/2 cup liquid into meat with vegetables, remaining tablespoon Sherry and 1/2 teaspoon kosher salt, and 1/2 tsp pepper. Cool. Transfer to terrine, pressing lightly. Top with 1/4 inch of fat. Cool, then chill 8 hours. Serve at room temperature.",
            "Preheat oven to 325°F with rack in lower third.",
            "Mince and mash garlic with five-spice powder, 1 tablespoon kosher salt, and 1/2 tsp pepper. Rub onto pork and fatback in a 5-quart heavy pot. Wrap parsley, bay leaf, and halved scallions in cheesecloth and tie with string. Add to pot with pork, water, and 1/3 cup Sherry and bring to a boil. Cover and braise in oven until meat is very tender, about 3 hours.",
            "Boil carrot until crisp-tender, about 4 minutes. Stir in chopped scallion and cook 1 minute. Drain and cool slightly.",
            "Drain pork mixture in a large sieve set over a bowl, reserving liquid. Finely shred meat and lightly mash fatback with tines, transferring both to a bowl. Skim and reserve fat from liquid. Stir 1/2 cup liquid into meat with vegetables, remaining tablespoon Sherry and 1/2 teaspoon kosher salt, and 1/2 tsp pepper. Cool.",
            "Transfer to terrine, pressing lightly. Top with 1/4 inch of fat. Cool, then chill 8 hours. Serve at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/562699bf219057901cc734d9/6:4/w_274%2Ch_169/five-spice-pork-rillettes.jpg"
    }
}