{
    "recipe": {
        "title": "Flank Steak with Bitter Greens and Charred Red Onion ",
        "ingredients": [
            "2 tablespoons Worcestershire sauce",
            "2 tablespoons fresh lemon juice",
            "2 tablespoons olive oil",
            "1 garlic clove, minced",
            "2 teaspoons sugar",
            "1 pound flank steak (3/4 inch thick)",
            "1 medium shallot, finely chopped",
            "3 tablespoons red-wine vinegar",
            "1/2 teaspoon Dijon mustard",
            "4 tablespoons extra-virgin olive oil, divided",
            "1 very large red onion, halved and sliced 1/3 inch thick",
            "3/4 pound bitter greens such as escarole or frisée or a combination",
            "Equipment: a grill basket"
        ],
        "instructions": [
            "Whisk together Worcestershire sauce, lemon juice, oil, garlic, and sugar in a shallow dish. Add steak, turning to coat, and marinate at room temperature 15 minutes.",
            "Make dressing and prepare onion while steak marinates: Whisk together shallot, vinegar, mustard, 3 tablespoon oil, 1/2 teaspoon salt, and 1/4 teaspoon pepper in a large bowl. Toss onion with remaining tablespoon oil and 1/4 teaspoon salt in a small bowl.",
            "Whisk together shallot, vinegar, mustard, 3 tablespoon oil, 1/2 teaspoon salt, and 1/4 teaspoon pepper in a large bowl. Toss onion with remaining tablespoon oil and 1/4 teaspoon salt in a small bowl.",
            "Grill steak and onion: Prepare a gas grill for direct-heat cooking over medium-high heat. Pat steak dry and season with 1/4 teaspoon each of salt and pepper. Oil grill rack. Grill steak, covered, turning once, 8 to 10 minutes total for medium-rare. Transfer steak to a cutting board and let rest, uncovered, 5 minutes. While steak rests, grill onion in grill basket, covered, stirring occasionally, until charred and tender, 4 to 5 minutes. Thinly slice steak across the grain. Toss greens, onion, and steak with dressing and salt to taste.",
            "Prepare a gas grill for direct-heat cooking over medium-high heat. Pat steak dry and season with 1/4 teaspoon each of salt and pepper. Oil grill rack. Grill steak, covered, turning once, 8 to 10 minutes total for medium-rare.",
            "Transfer steak to a cutting board and let rest, uncovered, 5 minutes.",
            "While steak rests, grill onion in grill basket, covered, stirring occasionally, until charred and tender, 4 to 5 minutes.",
            "Thinly slice steak across the grain. Toss greens, onion, and steak with dressing and salt to taste."
        ],
        "picture_link": null,
        "color": 6843978
    }
}