{
    "recipe": {
        "title": "Flank Steak with Bloody Mary Tomato Salad ",
        "ingredients": [
            "2 1 1/2 pounds flank steaks",
            "Kosher salt",
            "2 teaspoons (packed) light brown sugar",
            "1 teaspoon paprika",
            "1/4 teaspoon cayenne pepper",
            "1/4 teaspoon freshly ground black pepper",
            "Vegetable oil (for brushing)",
            "1 cup finely chopped red onion",
            "3 tablespoons Sherry vinegar, divided",
            "2 pound cherry or grape tomatoes, halved",
            "1 cup chopped celery hearts (inner stalks and leaves; from 1 bunch)",
            "1/2 cup chopped brined green olives plus 2 tablespoons olive brine",
            "2 tablespoons prepared horseradish",
            "1 tablespoon Worcestershire sauce",
            "1 teaspoon hot pepper sauce",
            "1/2 teaspoon celery seeds",
            "1/4 cup extra-virgin olive oil",
            "Kosher salt and freshly ground black pepper"
        ],
        "instructions": [
            "For steak: Place steaks on a large rimmed baking sheet; season with salt. Mix sugar and next 3 ingredients in a small bowl; rub all over steaks. Cover; refrigerate 1-3 hours. Let steaks stand at room temperature for 1 hour. Build a medium-hot fire in a charcoal grill, or heat a gas grill to high. Brush grates with oil. Grill to desired doneness, about 5-7 minutes per side for medium-rare. Let rest for 10 minutes. DO AHEAD: Can be made 1 day ahead. Let cool; cover and chill. Bring to room temperature before slicing.",
            "Place steaks on a large rimmed baking sheet; season with salt. Mix sugar and next 3 ingredients in a small bowl; rub all over steaks. Cover; refrigerate 1-3 hours.",
            "Let steaks stand at room temperature for 1 hour. Build a medium-hot fire in a charcoal grill, or heat a gas grill to high. Brush grates with oil. Grill to desired doneness, about 5-7 minutes per side for medium-rare. Let rest for 10 minutes. DO AHEAD: Can be made 1 day ahead. Let cool; cover and chill. Bring to room temperature before slicing.",
            "For salad: Mix onion and 1 tablespoon vinegar in a large bowl. Let macerate 10 minutes, tossing often. Add tomatoes, celery, and olives. Whisk remaining 2 tablespoon vinegar, olive brine, horseradish, and next 3 ingredients in a medium bowl. Slowly whisk in oil. Add to bowl with tomato mixture; toss to coat. Season with salt and pepper. DO AHEAD: Can be made 4 hours ahead. Cover; chill. Cut steak crosswise into 1/4\"-thick slices. Serve salad with steak.",
            "Mix onion and 1 tablespoon vinegar in a large bowl. Let macerate 10 minutes, tossing often. Add tomatoes, celery, and olives.",
            "Whisk remaining 2 tablespoon vinegar, olive brine, horseradish, and next 3 ingredients in a medium bowl. Slowly whisk in oil. Add to bowl with tomato mixture; toss to coat. Season with salt and pepper. DO AHEAD: Can be made 4 hours ahead. Cover; chill.",
            "Cut steak crosswise into 1/4\"-thick slices. Serve salad with steak."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55cb4a184b06801538805171/6:4/w_274%2Ch_169/366410_flank-steak_6x4.jpg"
    }
}