{
    "recipe": {
        "title": "Flatbread with Shrimp and White Bean Hummus ",
        "ingredients": [
            "1 1/4 cups warm water (105°F to 115°F)",
            "1 teaspoon active dry yeast",
            "1 teaspoon sugar",
            "3 cups all-purpose flour",
            "1 1/2 teaspoons kosher salt",
            "2 tablespoons extra-virgin olive oil",
            "5 to 6 garlic cloves, unpeeled",
            "1 tablespoon extra-virgin olive oil",
            "1 1/8 teaspoons kosher salt",
            "1 (15-ounce) can white beans, rinsed and drained",
            "2 tablespoons white vinegar",
            "2 teaspoons fresh lemon juice",
            "1 tablespoon tahini",
            "1 teaspoon fresh rosemary, finely chopped",
            "2 teaspoons unsalted butter",
            "2 medium Spanish onions, cut into medium dice",
            "1 1/2 teaspoons sugar",
            "1/4 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "2 tablespoons extra-virgin olive oil",
            "4 leeks, white and light green parts only, washed and cut into medium dice",
            "1/4 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "1 tablespoon extra-virgin olive oil for brushing flatbread",
            "1 lemon, halved lengthwise and very thinly sliced",
            "1 pound small, sweet shrimp such as Caribbean Laughing Bird*, peeled and cooked",
            "6 ounces Grana Padano or Parmigiano-Reggiano cheese, finely grated (about 1 ½ cups)",
            "3/4 teaspoon kosher salt",
            "1 1/2 teaspoons fresh lemon juice",
            "3/4 cup mixed micro greens, such as baby arugula",
            "*Small and full of flavor, Caribbean Laughing Bird shrimp are sustainably raised off the coast of Belize. If they're unavailable, you can substitute rock shrimp, which are similar in flavor, though not as environmentally friendly. Alternatively, use any sweet shrimp, cut into pieces if large.",
            "stand mixer with paddle attachment and dough hook, pasta machine or rolling pin, pizza stone or heavy baking sheet, food processor"
        ],
        "instructions": [
            "Make flatbread: In bowl of stand mixer fitted with paddle attachment, stir together water, yeast, and sugar until dissolved, about 5 seconds. Let stand until foamy, about 5 minutes. In large bowl, whisk together flour and salt. Add to yeast mixture and mix on low speed until just combined, about 30 seconds. Add oil and mix on low speed until just combined, about 30 seconds. Switch to dough hook and mix on medium speed until dough is elastic and pulls away from sides, about 8 minutes. (Dough should feel firm and moist, but not sticky.) Lightly oil large bowl. Gently shape dough into ball and transfer to bowl. Turn over several times to coat lightly with oil, then cover with plastic wrap and let rise in warm place (80°F to 85°F, see Chef's Notes) until doubled in size, about 1 hour. While dough is rising, position rack near bottom of oven and top with pizza stone or heavy baking sheet. Preheat oven to 450°F for 1 hour. Set smooth rollers of pasta machine on widest setting (see Chef's Notes). Divide dough into 6 equal parts. Cover 5 parts with plastic wrap. Shape remaining piece into rough rectangle and feed through rollers once to flatten into roughly 12-by 4-inch rectangle, approximately 1/8-inch thick. Transfer flatbread to large baking sheet, dust with flour, and top with sheet of parchment paper. Roll out remaining flatbreads in same manner, stacking between layers of parchment paper. Cover with plastic wrap until ready to bake. Transfer 1 or more flatbreads to preheated pizza stone and bake in batches until slightly puffed but still pale, about 5 minutes. Transfer to wire rack to cool completely. Leave oven on. DO AHEAD: Flatbreads can be prepared ahead and frozen, wrapped tightly in parchment paper and plastic wrap, up to 6 months.",
            "In bowl of stand mixer fitted with paddle attachment, stir together water, yeast, and sugar until dissolved, about 5 seconds. Let stand until foamy, about 5 minutes. In large bowl, whisk together flour and salt. Add to yeast mixture and mix on low speed until just combined, about 30 seconds. Add oil and mix on low speed until just combined, about 30 seconds. Switch to dough hook and mix on medium speed until dough is elastic and pulls away from sides, about 8 minutes. (Dough should feel firm and moist, but not sticky.)",
            "Lightly oil large bowl. Gently shape dough into ball and transfer to bowl. Turn over several times to coat lightly with oil, then cover with plastic wrap and let rise in warm place (80°F to 85°F, see Chef's Notes) until doubled in size, about 1 hour.",
            "While dough is rising, position rack near bottom of oven and top with pizza stone or heavy baking sheet. Preheat oven to 450°F for 1 hour.",
            "Set smooth rollers of pasta machine on widest setting (see Chef's Notes). Divide dough into 6 equal parts. Cover 5 parts with plastic wrap. Shape remaining piece into rough rectangle and feed through rollers once to flatten into roughly 12-by 4-inch rectangle, approximately 1/8-inch thick. Transfer flatbread to large baking sheet, dust with flour, and top with sheet of parchment paper. Roll out remaining flatbreads in same manner, stacking between layers of parchment paper. Cover with plastic wrap until ready to bake.",
            "Transfer 1 or more flatbreads to preheated pizza stone and bake in batches until slightly puffed but still pale, about 5 minutes. Transfer to wire rack to cool completely. Leave oven on. DO AHEAD: Flatbreads can be prepared ahead and frozen, wrapped tightly in parchment paper and plastic wrap, up to 6 months.",
            "Make hummus: Transfer garlic cloves to 6-inch square of foil, drizzle with 1 teaspoon olive oil, sprinkle with 1/8 teaspoon salt, and wrap tightly. Bake until tender, about 45 minutes. Unwrap and let cool. DO AHEAD: Roasted garlic can be prepared ahead and refrigerated, in airtight container, up to 3 days. Squeeze garlic cloves from skin into food processor. Add white beans, remaining 2 teaspoons olive oil, vinegar, lemon juice, tahini, rosemary, and remaining 1 teaspoon salt and purée until smooth, about 2 minutes. DO AHEAD: Hummus can be prepared ahead and refrigerated in airtight container up to 3 days.",
            "Transfer garlic cloves to 6-inch square of foil, drizzle with 1 teaspoon olive oil, sprinkle with 1/8 teaspoon salt, and wrap tightly. Bake until tender, about 45 minutes. Unwrap and let cool. DO AHEAD: Roasted garlic can be prepared ahead and refrigerated, in airtight container, up to 3 days.",
            "Squeeze garlic cloves from skin into food processor. Add white beans, remaining 2 teaspoons olive oil, vinegar, lemon juice, tahini, rosemary, and remaining 1 teaspoon salt and purée until smooth, about 2 minutes. DO AHEAD: Hummus can be prepared ahead and refrigerated in airtight container up to 3 days.",
            "Make caramelized onions: In large, heavy saucepan over moderately low heat, melt butter. Add onions and sauté, stirring occasionally, until slightly transparent and starting to soften, about 2 minutes. Add sugar and 4 teaspoons water and sauté, stirring occasionally, until golden brown, 12 minutes. Stir in salt and pepper, then transfer to medium bowl to cool. DO AHEAD: Onions can be prepared ahead and refrigerated, in airtight container, up to 3 days.",
            "In large, heavy saucepan over moderately low heat, melt butter. Add onions and sauté, stirring occasionally, until slightly transparent and starting to soften, about 2 minutes. Add sugar and 4 teaspoons water and sauté, stirring occasionally, until golden brown, 12 minutes. Stir in salt and pepper, then transfer to medium bowl to cool. DO AHEAD: Onions can be prepared ahead and refrigerated, in airtight container, up to 3 days.",
            "Make melted leeks: In large, heavy saucepan over moderate heat, heat olive oil. Add leeks and sauté, stirring occasionally, until soft and translucent, about 8 minutes. Stir in salt and pepper, then transfer to medium bowl to cool. DO AHEAD: Leeks can be prepared ahead and refrigerated, in airtight container, up to 3 days.",
            "In large, heavy saucepan over moderate heat, heat olive oil. Add leeks and sauté, stirring occasionally, until soft and translucent, about 8 minutes. Stir in salt and pepper, then transfer to medium bowl to cool. DO AHEAD: Leeks can be prepared ahead and refrigerated, in airtight container, up to 3 days.",
            "Assemble and serve: Position rack near bottom of oven and top with pizza stone or heavy baking sheet. Preheat oven to 450°F for 1 hour. Brush each flatbread with olive oil and spread with hummus. Scatter onions and leeks over and top with lemon slices and shrimp. Scatter with cheese, then sprinkle with salt and lemon juice. Transfer 1 or more flatbreads to preheated pizza stone and bake in batches until toppings are warmed through and cheese has melted, 6 to 8 minutes. Transfer flatbreads to large cutting board and top with micro greens. Using very sharp knife, cut into 6 thin slices and serve immediately.",
            "Position rack near bottom of oven and top with pizza stone or heavy baking sheet. Preheat oven to 450°F for 1 hour.",
            "Brush each flatbread with olive oil and spread with hummus. Scatter onions and leeks over and top with lemon slices and shrimp. Scatter with cheese, then sprinkle with salt and lemon juice.",
            "Transfer 1 or more flatbreads to preheated pizza stone and bake in batches until toppings are warmed through and cheese has melted, 6 to 8 minutes.",
            "Transfer flatbreads to large cutting board and top with micro greens. Using very sharp knife, cut into 6 thin slices and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a51062fa7a9917c257d4/6:4/w_274%2Ch_169/351889.jpg"
    }
}