{
    "recipe": {
        "title": "Flatbread with Fingerling Potatoes, Shitake Mushrooms, and Truffle Oil ",
        "ingredients": [
            "1 cup warm water (105 to115° F)",
            "1 1/4 teaspoons active dry yeast",
            "1 teaspoon sugar",
            "1 tablespoon plus 1 teaspoon dry milk powder",
            "1 3/4 cups all-purpose flour",
            "1/2 teaspoon kosher salt",
            "4 (approximately 1-inch-wide and 3-inch-long) fingerling potatoes",
            "4 sprigs fresh thyme plus 2 teaspoons fresh thyme leaves",
            "1 clove garlic, peeled and smashed with back of knife",
            "2 1/2 teaspoons kosher salt",
            "1 tablespoon canola oil",
            "1 tablespoon unsalted butter",
            "2 cups (4 ounces) fresh shiitake mushrooms, stemmed and thinly sliced",
            "1/4 cup shallots, minced (from 2 medium shallots)",
            "3/4 teaspoons freshly ground black pepper",
            "2 teaspoons extra-virgin olive oil",
            "1/4 cup white truffle oil",
            "1/2 cup crème fraîche",
            "2 tablespoons fresh chives, minced",
            "stand mixer fitted with paddle attachment and dough hook, heavy baking sheet"
        ],
        "instructions": [
            "In bowl of stand mixer fitted with paddle attachment, stir together water, yeast, and sugar until dissolved, about 5 seconds. Stir in milk powder until dissolved, about 5 seconds.",
            "In large bowl, whisk together flour and salt. Add to yeast mixture and mix on low speed until just combined, about 30 seconds. Switch to dough hook and mix on medium speed until dough is elastic but still sticky, about 10 minutes.",
            "First rise: Using vegetable oil, lightly oil large bowl. Gently shape dough into ball and transfer to bowl. Turn over several times to coat lightly with oil, then cover with plastic wrap and let rise in warm place (75°F to 80°F, see Chef's Notes) until doubled in size, about 1 ½ hours.",
            "Using vegetable oil, lightly oil large bowl. Gently shape dough into ball and transfer to bowl. Turn over several times to coat lightly with oil, then cover with plastic wrap and let rise in warm place (75°F to 80°F, see Chef's Notes) until doubled in size, about 1 ½ hours.",
            "Second rise: Using vegetable oil, liberally oil heavy baking sheet. Using hands, lift dough from bowl and gently turn over several times to remove excess air. Shape into ball and transfer to prepared baking sheet. Cover with plastic wrap and let rise in warm place (75°F to 80°F, see Chef's Notes) 30 minutes.",
            "Using vegetable oil, liberally oil heavy baking sheet. Using hands, lift dough from bowl and gently turn over several times to remove excess air. Shape into ball and transfer to prepared baking sheet. Cover with plastic wrap and let rise in warm place (75°F to 80°F, see Chef's Notes) 30 minutes.",
            "Shaping and final rise: Using fingertips, press and spread dough to edges of baking sheet. (If dough tears, mend hole by pressing surrounding dough together Cover with plastic wrap and let rise in warm place (75°F to 80°F, see Chef's Notes) until puffy, about 1 1/2 hours.",
            "Using fingertips, press and spread dough to edges of baking sheet. (If dough tears, mend hole by pressing surrounding dough together Cover with plastic wrap and let rise in warm place (75°F to 80°F, see Chef's Notes) until puffy, about 1 1/2 hours.",
            "Make topping: Preheat oven to 475°F. In medium saucepan over moderately high heat, combine potatoes, 4 sprigs thyme, garlic, salt, and enough water to cover by 1 inch. Bring to boil, then reduce heat to moderately low and simmer, uncovered, until potatoes are easily pierced with fork, about 20 minutes. Immediately drain, discarding thyme sprigs and garlic. When cool enough to handle, slice potatoes into 1/4-inch-thick rounds and reserve. (Potatoes can be prepared ahead and refrigerated, covered, up to 24 hours.) In medium sauté pan over moderately high heat, heat canola oil and butter until hot but not smoking. Add mushrooms and sauté 1 minute. Add shallots and sauté until light golden brown and soft, about 2 minutes. Stir in 1/2 teaspoon salt and 1/4 teaspoon pepper, then transfer to paper-towel-lined plate and reserve. (Mushrooms can be prepared ahead and refrigerated, covered, up to 24 hours.)",
            "Preheat oven to 475°F.",
            "In medium saucepan over moderately high heat, combine potatoes, 4 sprigs thyme, garlic, salt, and enough water to cover by 1 inch. Bring to boil, then reduce heat to moderately low and simmer, uncovered, until potatoes are easily pierced with fork, about 20 minutes. Immediately drain, discarding thyme sprigs and garlic. When cool enough to handle, slice potatoes into 1/4-inch-thick rounds and reserve. (Potatoes can be prepared ahead and refrigerated, covered, up to 24 hours.)",
            "In medium sauté pan over moderately high heat, heat canola oil and butter until hot but not smoking. Add mushrooms and sauté 1 minute. Add shallots and sauté until light golden brown and soft, about 2 minutes. Stir in 1/2 teaspoon salt and 1/4 teaspoon pepper, then transfer to paper-towel-lined plate and reserve. (Mushrooms can be prepared ahead and refrigerated, covered, up to 24 hours.)",
            "Assemble flatbread: Arrange potato slices on flatbread, then brush with olive oil and sprinkle with thyme leaves. Spread mushroom mixture on top, then drizzle with 2 tablespoons white truffle oil and sprinkle with 1 teaspoon salt and 1/2 teaspoon pepper. Bake, rotating pan 180 degrees halfway through, until crust is light golden brown, 20 to 22 minutes. While flatbread bakes, in small bowl, whisk together crème fraîche and remaining 2 tablespoons truffle oil. Transfer flatbread to large cutting board and let cool about 5 minutes. Drizzle with truffle oil–infused crème fraˆhe and sprinkle with chives. Using pizza wheel or very sharp knife, cut into slices and serve immediately.",
            "Arrange potato slices on flatbread, then brush with olive oil and sprinkle with thyme leaves. Spread mushroom mixture on top, then drizzle with 2 tablespoons white truffle oil and sprinkle with 1 teaspoon salt and 1/2 teaspoon pepper. Bake, rotating pan 180 degrees halfway through, until crust is light golden brown, 20 to 22 minutes.",
            "While flatbread bakes, in small bowl, whisk together crème fraîche and remaining 2 tablespoons truffle oil.",
            "Transfer flatbread to large cutting board and let cool about 5 minutes. Drizzle with truffle oil–infused crème fraˆhe and sprinkle with chives. Using pizza wheel or very sharp knife, cut into slices and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a4c2e0acd286555db692/6:4/w_274%2Ch_169/351233.jpg",
        "color": 10442998
    }
}