{
    "recipe": {
        "title": "Flat Zucchini Omelet ",
        "ingredients": [
            "1 lb small zucchini",
            "1 3/4 teaspoons salt",
            "2 tablespoons olive oil",
            "1 teaspoon finely chopped fresh marjoram flowers or leaves, or a pinch of dried marjoram",
            "2 large eggs",
            "1 large pinch black pepper",
            "1 tablespoon unsalted butter"
        ],
        "instructions": [
            "Trim ends of zucchini, then coarsely grate on large holes of a box grater. Toss zucchini with 1 teaspoon salt in a large bowl and let stand 30 minutes. Transfer zucchini to a colander, then firmly squeeze handfuls to remove excess liquid. Heat olive oil in a 10-inch heavy skillet over moderately high heat until hot but not smoking and sauté zucchini, stirring until golden, 6 to 7 minutes. Remove skillet from heat and stir in marjoram, then let mixture cool to warm, about 15 minutes. Lightly beat eggs with zucchini, pepper, and remaining 3/4 teaspoon salt in a large bowl, using a fork. Heat butter in a 7- to 8-inch nonstick skillet over moderately high heat until foam subsides and butter has a nutty fragrance. Add egg mixture, distributing zucchini evenly with a heatproof rubber spatula, and cook, lifting up egg around edges occasionally to let any uncooked egg flow underneath, until egg mixture is set around edge, about 1 minute. Reduce heat to moderately low and cook omelet until softly set but top is still moist, about 3 minutes. Shake skillet to loosen omelet from pan, then slide omelet onto a large plate. Wearing oven mitts, invert skillet over omelet, then holding skillet and plate together invert omelet, browned side up, into skillet. Cook omelet until underside is set, about 1 minute, then slide omelet onto a serving plate.",
            "Trim ends of zucchini, then coarsely grate on large holes of a box grater. Toss zucchini with 1 teaspoon salt in a large bowl and let stand 30 minutes.",
            "Transfer zucchini to a colander, then firmly squeeze handfuls to remove excess liquid.",
            "Heat olive oil in a 10-inch heavy skillet over moderately high heat until hot but not smoking and sauté zucchini, stirring until golden, 6 to 7 minutes. Remove skillet from heat and stir in marjoram, then let mixture cool to warm, about 15 minutes.",
            "Lightly beat eggs with zucchini, pepper, and remaining 3/4 teaspoon salt in a large bowl, using a fork.",
            "Heat butter in a 7- to 8-inch nonstick skillet over moderately high heat until foam subsides and butter has a nutty fragrance. Add egg mixture, distributing zucchini evenly with a heatproof rubber spatula, and cook, lifting up egg around edges occasionally to let any uncooked egg flow underneath, until egg mixture is set around edge, about 1 minute.",
            "Reduce heat to moderately low and cook omelet until softly set but top is still moist, about 3 minutes.",
            "Shake skillet to loosen omelet from pan, then slide omelet onto a large plate.",
            "Wearing oven mitts, invert skillet over omelet, then holding skillet and plate together invert omelet, browned side up, into skillet. Cook omelet until underside is set, about 1 minute, then slide omelet onto a serving plate."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd77b7b55306961bfaa2f/6:4/w_274%2Ch_169/235468.jpg"
    }
}