{
    "recipe": {
        "title": "Floating Islands with Lemon-Scented Custard Sauce and Raspberries ",
        "ingredients": [
            "1 cup whipping cream",
            "1/2 cup whole milk",
            "6 large egg yolks",
            "1/3 cup sugar",
            "3 tablespoons fresh lemon juice",
            "2 teaspoons finely grated lemon peel",
            "1/2 cup egg whites (about 4 large)",
            "Pinch of salt",
            "2/3 cup sugar",
            "6 paper-thin lemon slices",
            "2 6-ounce containers fresh raspberries"
        ],
        "instructions": [
            "For sauce: Bring cream and milk to simmer in heavy medium saucepan. Using whisk, beat egg yolks and sugar in medium bowl until light, about 2minutes. Gradually whisk hot cream mixture into yolks. Return mixture to saucepan and stir over medium-low heat until custard thickens and leaves path on back of spoon when finger is drawn across, about 3 minutes (do not boil). Pour custard into bowl. Stir in lemon juice and peel. Cool slightly, then chill uncovered until cold. do ahead Sauce can be made 2 days ahead. Cover and keep refrigerated.",
            "Bring cream and milk to simmer in heavy medium saucepan. Using whisk, beat egg yolks and sugar in medium bowl until light, about 2minutes. Gradually whisk hot cream mixture into yolks. Return mixture to saucepan and stir over medium-low heat until custard thickens and leaves path on back of spoon when finger is drawn across, about 3 minutes (do not boil). Pour custard into bowl. Stir in lemon juice and peel. Cool slightly, then chill uncovered until cold. do ahead Sauce can be made 2 days ahead. Cover and keep refrigerated.",
            "For meringue islands: Preheat oven to 350°F. Generously butter six 3/4-cup soufflé dishes and dust with sugar. Place on baking sheet. Using electric mixer, beat egg whites with pinch of salt in large bowl until soft peaks form. Gradually beat in sugar. Continue beating until stiff and glossy. Divide meringue among prepared souffl dishes, mounding slightly. Bake until meringues puff and begin to brown lightly on top and tester inserted into center comes out clean, about 15 minutes. Cool to room temperature, at least 20 minutes and up to 3 hours (meringues will deflate). Divide custard sauce among 6 shallow soup bowls. Carefully run small sharp knife around edge of meringues to loosen, if necessary. Invert meringues, then turn top side up and place on sauce. Garnish with lemon slices and sprinkle with raspberries.",
            "Preheat oven to 350°F. Generously butter six 3/4-cup soufflé dishes and dust with sugar. Place on baking sheet. Using electric mixer, beat egg whites with pinch of salt in large bowl until soft peaks form. Gradually beat in sugar. Continue beating until stiff and glossy. Divide meringue among prepared souffl dishes, mounding slightly. Bake until meringues puff and begin to brown lightly on top and tester inserted into center comes out clean, about 15 minutes. Cool to room temperature, at least 20 minutes and up to 3 hours (meringues will deflate).",
            "Divide custard sauce among 6 shallow soup bowls. Carefully run small sharp knife around edge of meringues to loosen, if necessary. Invert meringues, then turn top side up and place on sauce. Garnish with lemon slices and sprinkle with raspberries."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d782d7b55306961bf334c/6:4/w_274%2Ch_169/241879_hires.jpg"
    }
}