{
    "recipe": {
        "title": "Foie Gras Toasts with Greens and Verjus Port Glaze ",
        "ingredients": [
            "2/3 cup white verjus (juice of unripe fruits, primarily grapes) or 3 tablespoons fresh lemon juice",
            "1/2 cup Tawny Port",
            "3 tablespoons sugar",
            "1 1/2 tablespoons Sherry vinegar",
            "1/2 teaspoon salt",
            "1/4 teaspoon black pepper",
            "3 tablespoons pure walnut oil",
            "1 lb frisée (pale leafy parts only), torn into small sprigs (6 cups)",
            "1 lb Belgian endives (3 or 4), trimmed and cut crosswise into 1/4-inch-thick slices (3 cups)",
            "1/2 lb radicchio, halved lengthwise, cores and coarse center ribs discarded and leaves torn into bite-size pieces (3 cups)",
            "12 (1/2-inch-thick) slices pain de mie, Pullman loaf, or firm white sandwich bread, crusts discarded",
            "1 lb chilled foie gras terrine, unmolded if necessary",
            "Fleur de sel or kosher salt to taste"
        ],
        "instructions": [
            "Bring verjus, Port, and sugar to a boil in a 1-quart heavy saucepan, stirring until sugar is dissolved, then boil until syrupy and reduced to about 1/3 cup, 8 to 12 minutes.",
            "Make vinaigrette: Whisk together vinegar, salt, and pepper in a bowl, then add walnut oil in a slow stream, whisking. Just before serving, toss frisée, endives, and radicchio in a bowl with just enough vinaigrette to coat.",
            "Whisk together vinegar, salt, and pepper in a bowl, then add walnut oil in a slow stream, whisking.",
            "Just before serving, toss frisée, endives, and radicchio in a bowl with just enough vinaigrette to coat.",
            "Make toasts: Put oven rack in upper third of oven and preheat oven to 400°F. Toast bread slices on a baking sheet, turning over once, until pale golden, about 8 minutes. Cut foie gras terrine into 12 slices (about 1/4 inch thick) and put 1 on each toast (trim toasts to size of foie gras if desired). Sprinkle lightly with fleur de sel, then halve toasts diagonally. Let toasts stand, loosely covered with plastic wrap, 5 to 10 minutes, to bring foie gras to room temperature. Put 1 foie gras toast on each of 12 plates and drizzle with Port glaze, then divide salad among plates.",
            "Put oven rack in upper third of oven and preheat oven to 400°F.",
            "Toast bread slices on a baking sheet, turning over once, until pale golden, about 8 minutes. Cut foie gras terrine into 12 slices (about 1/4 inch thick) and put 1 on each toast (trim toasts to size of foie gras if desired). Sprinkle lightly with fleur de sel, then halve toasts diagonally. Let toasts stand, loosely covered with plastic wrap, 5 to 10 minutes, to bring foie gras to room temperature.",
            "Put 1 foie gras toast on each of 12 plates and drizzle with Port glaze, then divide salad among plates."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df1ee7b55306961bfe031/6:4/w_274%2Ch_169/109098.jpg",
        "color": 13277482
    }
}