{
    "recipe": {
        "title": "Foolproof Grilled Chicken ",
        "ingredients": [
            "4 quarts cold water",
            "1/4 cup sugar",
            "1/2 cup plus 1 teaspoon kosher salt",
            "5 1/2 to 6 pounds chicken parts with skin and bones",
            "1/4 cup fresh lime juice plus 4 limes, halved crosswise",
            "2 tablespoons Asian fish sauce",
            "1 large garlic clove, minced",
            "3 tablespoons finely chopped fresh mint",
            "1/4 cup finely chopped fresh cilantro",
            "1 teaspoon dried hot red pepper flakes",
            "1/2 cup vegetable oil",
            "a 22 1/2-inch charcoal kettle grill and a charcoal chimney; or a gas grill"
        ],
        "instructions": [
            "Bring water, sugar, and 1/2 cup salt to a boil in a 6- to 8-quart heavy pot, then reduce heat and simmer, uncovered, 15 minutes. Cool brine completely, then add chicken and soak, covered and chilled, 6 hours.",
            "Remove chicken and pat dry.",
            "Whisk together lime juice, fish sauce, garlic, mint, cilantro, red pepper flakes, and remaining teaspoon salt in a large bowl, then add oil in a stream, whisking until combined.",
            "To cook chicken using a charcoal grill: Open vents on bottom of grill and on lid. Light a large chimney starter of charcoal (80 to 100 briquettes). Leaving about one quarter of grill free of charcoal, bank lit charcoal across rest of grill so that coals are about three times higher on the opposite side. When charcoal turns grayish white (after 15 to 20 minutes), check fire temperature and grill chicken parts according to instructions in accompanying article. Transfer chicken as cooked to bowl with vinaigrette and turn to coat, then transfer to a serving platter and keep warm, loosely covered with foil. When chicken is almost done, grill lime halves, cut sides down, uncovered, over coals until grill marks appear, about 3 minutes, then transfer to platter with chicken. Serve limes with chicken and serve remaining vinaigrette on the side.",
            "Open vents on bottom of grill and on lid. Light a large chimney starter of charcoal (80 to 100 briquettes). Leaving about one quarter of grill free of charcoal, bank lit charcoal across rest of grill so that coals are about three times higher on the opposite side.",
            "When charcoal turns grayish white (after 15 to 20 minutes), check fire temperature and grill chicken parts according to instructions in accompanying article. Transfer chicken as cooked to bowl with vinaigrette and turn to coat, then transfer to a serving platter and keep warm, loosely covered with foil.",
            "When chicken is almost done, grill lime halves, cut sides down, uncovered, over coals until grill marks appear, about 3 minutes, then transfer to platter with chicken. Serve limes with chicken and serve remaining vinaigrette on the side.",
            "To cook chicken using a gas grill: Preheat all burners on high, covered, 10 minutes, then adjust heat to moderately high.",
            "Preheat all burners on high, covered, 10 minutes, then adjust heat to moderately high.",
            "For drumsticks, thighs, and wings (cooking time is longer than cooking times for charcoal grilling): Sear chicken in 2 batches on lightly oiled grill rack, covered with lid, turning over once, until well browned, 6 to 8 minutes total. Turn off 1 burner (middle burner if there are 3) and arrange all seared chicken on rack above shut-off burner. Cook seared chicken, covered with lid, moving chicken around grill (to avoid flare-ups) and turning over occasionally, until cooked through, 12 to 20 minutes. Transfer chicken as cooked to bowl with vinaigrette and turn to coat, then transfer to a serving platter and keep warm, loosely covered with foil.",
            "Sear chicken in 2 batches on lightly oiled grill rack, covered with lid, turning over once, until well browned, 6 to 8 minutes total. Turn off 1 burner (middle burner if there are 3) and arrange all seared chicken on rack above shut-off burner.",
            "Cook seared chicken, covered with lid, moving chicken around grill (to avoid flare-ups) and turning over occasionally, until cooked through, 12 to 20 minutes. Transfer chicken as cooked to bowl with vinaigrette and turn to coat, then transfer to a serving platter and keep warm, loosely covered with foil.",
            "For breast halves: Sear chicken (in 2 batches if necessary to avoid crowding), starting with skin sides down, on grill, covered with lid, turning over once, until well browned, 8 to 10 minutes total. Turn off 1 burner (middle burner if there are 3) and arrange all breasts on rack over shut-off burner. Cook seared chicken, covered with lid, turning over once, until cooked through, 18 to 20 minutes. Transfer chicken to bowl with vinaigrette and turn to coat, then transfer to platter to keep warm, loosely covered with foil. When chicken is almost done, grill lime halves, cut sides down, uncovered, over lit burner until grill marks appear, about 3 minutes, then transfer to platter with chicken. Serve limes with chicken and serve remaining vinaigrette on the side.",
            "Sear chicken (in 2 batches if necessary to avoid crowding), starting with skin sides down, on grill, covered with lid, turning over once, until well browned, 8 to 10 minutes total. Turn off 1 burner (middle burner if there are 3) and arrange all breasts on rack over shut-off burner.",
            "Cook seared chicken, covered with lid, turning over once, until cooked through, 18 to 20 minutes. Transfer chicken to bowl with vinaigrette and turn to coat, then transfer to platter to keep warm, loosely covered with foil.",
            "When chicken is almost done, grill lime halves, cut sides down, uncovered, over lit burner until grill marks appear, about 3 minutes, then transfer to platter with chicken. Serve limes with chicken and serve remaining vinaigrette on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5cad2f4ef951650ceae995cb/6:4/w_274%2Ch_169/Foolproof-Grilled-Chicken-03042019.jpg"
    }
}