{
    "recipe": {
        "title": "Fougasse ",
        "ingredients": [
            "1 teaspoon sugar",
            "1/2 cup warm water (105–115°F)",
            "2 teaspoons active dry yeast (from a 1/4-oz package)",
            "1/2 cup all-purpose flour",
            "2 tablespoons sugar",
            "1 1/4 teaspoons table salt",
            "1 teaspoon anise seeds, lightly crushed",
            "2/3 cup water",
            "2 teaspoons orange-flower water (preferably French)",
            "1 teaspoon finely grated fresh orange zest",
            "1/3 cup mild extra-virgin olive oil (preferably French) plus 1 tablespoon for brushing",
            "3 1/4 cups unbleached all-purpose flour plus additional for kneading",
            "1 1/2 teaspoons flaky or coarse sea salt",
            "a stand mixer fitted with paddle attachment"
        ],
        "instructions": [
            "Stir together sugar and warm water in bowl of mixer. Sprinkle yeast over mixture and let stand until foamy, about 5 minutes. (If yeast doesn't foam, discard and start over with new yeast.)",
            "Whisk flour into yeast mixture until combined well. Let starter rise, loosely covered with plastic wrap, 30 minutes.",
            "Make dough: Add sugar, salt, crushed anise seeds, water, orange-flower water, zest, 1/3 cup oil, and 11/4 cups flour to starter and beat at medium speed until smooth. Mix in remaining 2 cups flour, 1/2 cup at a time, at low speed until a soft dough forms. Turn dough out onto a lightly floured surface and knead, sprinkling surface lightly with flour if dough is very sticky, until smooth and elastic (dough will remain slightly sticky), 8 to 10 minutes. Form dough into a ball and transfer to a lightly oiled large bowl, turning dough to coat with oil. Cover bowl with plastic wrap and let dough rise in a draft-free place at warm room temperature until doubled in bulk, 1 to 1 1/2 hours. Punch down dough (do not knead), then halve. Pat out each half into an oval (about 12 inches long and 1/4 inch thick), then transfer to 2 lightly oiled large baking sheets. Using a very sharp knife or a pastry scraper, make a cut down center of each oval \"leaf,\" cutting all the way through to baking sheet and leaving a 1-inch border on each end of cut. Make 3 shorter diagonal cuts on each side of original cut, leaving a 1-inch border on each end of cuts, to create the look of leaf veins (do not connect cuts). Gently pull apart cuts about 1 1/2 inches with your fingers. Let dough stand, uncovered, until slightly puffed, about 30 minutes. Put oven racks in upper and lower thirds of oven and preheat oven to 375°F. Brush loaves with remaining tablespoon oil and sprinkle with sea salt. Bake, switching position of baking sheets halfway through baking, until loaves are golden brown and sound hollow when tapped on bottom, 35 to 40 minutes total. Transfer loaves to a rack and cool to warm or room temperature.",
            "Add sugar, salt, crushed anise seeds, water, orange-flower water, zest, 1/3 cup oil, and 11/4 cups flour to starter and beat at medium speed until smooth. Mix in remaining 2 cups flour, 1/2 cup at a time, at low speed until a soft dough forms.",
            "Turn dough out onto a lightly floured surface and knead, sprinkling surface lightly with flour if dough is very sticky, until smooth and elastic (dough will remain slightly sticky), 8 to 10 minutes. Form dough into a ball and transfer to a lightly oiled large bowl, turning dough to coat with oil. Cover bowl with plastic wrap and let dough rise in a draft-free place at warm room temperature until doubled in bulk, 1 to 1 1/2 hours.",
            "Punch down dough (do not knead), then halve. Pat out each half into an oval (about 12 inches long and 1/4 inch thick), then transfer to 2 lightly oiled large baking sheets.",
            "Using a very sharp knife or a pastry scraper, make a cut down center of each oval \"leaf,\" cutting all the way through to baking sheet and leaving a 1-inch border on each end of cut. Make 3 shorter diagonal cuts on each side of original cut, leaving a 1-inch border on each end of cuts, to create the look of leaf veins (do not connect cuts). Gently pull apart cuts about 1 1/2 inches with your fingers. Let dough stand, uncovered, until slightly puffed, about 30 minutes.",
            "Put oven racks in upper and lower thirds of oven and preheat oven to 375°F.",
            "Brush loaves with remaining tablespoon oil and sprinkle with sea salt. Bake, switching position of baking sheets halfway through baking, until loaves are golden brown and sound hollow when tapped on bottom, 35 to 40 minutes total. Transfer loaves to a rack and cool to warm or room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd7f07b55306961bfab8f/6:4/w_274%2Ch_169/236703.jpg",
        "color": 783220
    }
}