{
    "recipe": {
        "title": "Freeform Chicken Meatballs with Carrots and Yogurt Sauce ",
        "ingredients": [
            "1 1/2 lb. small carrots, scrubbed, tops trimmed to about 1/2\", halved lengthwise",
            "1/2 tsp. crushed red pepper flakes",
            "5 Tbsp. extra-virgin olive oil, divided, plus more for drizzling",
            "2 1/4 tsp. kosher salt, divided",
            "1 lb. ground chicken or ground turkey",
            "6 scallions, white and pale-green parts finely chopped",
            "1 large egg, beaten to blend",
            "2 Tbsp. plain breadcrumbs",
            "3 tsp. finely grated lemon zest",
            "2 tsp. garam masala",
            "1 cup plain Greek-style yogurt, preferably full-fat",
            "2 Tbsp. fresh lemon juice, plus more for serving",
            "2 cups baby arugula or watercress",
            "Flaky sea salt"
        ],
        "instructions": [
            "Arrange racks in upper and lower thirds of oven; preheat to 425°F. Toss carrots, red pepper flakes, 2 Tbsp. oil, and 1/2 tsp. kosher salt on a rimmed baking sheet. Roast on lower rack, tossing once halfway through, until carrots are nicely browned and fork-tender, 20–25 minutes.",
            "Meanwhile, mix ground chicken, scallions, egg, breadcrumbs, lemon zest, garam masala, 2 Tbsp. oil, and 1 1/2 tsp. kosher salt in a large bowl until just combined.",
            "Rub another rimmed baking sheet with 1 Tbsp. oil. Using your hands, scatter chicken mixture in small mounds (about 2\") on baking sheet. Roast on upper rack, turning pieces once halfway through with a spatula, until browned, crispy-edged, and cooked through, 15–20 minutes.",
            "Meanwhile, whisk yogurt, 2 Tbsp. lemon juice, and remaining 1/4 tsp. kosher salt in a small bowl. Spoon sauce over a platter or divide among plates, swooshing with the back of a spoon.",
            "Transfer carrots to baking sheet with meatballs and toss to combine. Arrange over yogurt sauce, then top with arugula. Drizzle with oil and lemon juice; season with sea salt."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ad1106343f92a3268c0b8bc/6:4/w_274%2Ch_169/Freeform-Chicken-Meatballs-with-Carrots-and-Yogurt-Sauce-13032018.jpg"
    }
}