{
    "recipe": {
        "title": "Freekeh Paella with Clams and Almond Aioli ",
        "ingredients": [
            "1/2 cup slivered almonds",
            "1 small garlic clove, finely grated",
            "1/4 cup olive oil",
            "2 tablespoons fresh lemon juice",
            "Kosher salt",
            "2 onions, cut into large pieces",
            "2 medium carrots, peeled, cut into large pieces",
            "8 garlic cloves, peeled",
            "1 medium-hot chile (such as a Hungarian wax pepper), stem removed",
            "2 ounces dried chorizo, casing removed, coarsely chopped",
            "3 tablespoons olive oil",
            "1 bay leaf",
            "Kosher salt",
            "2 cups freekeh",
            "2 tablespoons tomato paste",
            "12 littleneck clams, scrubbed",
            "4 hot pickled peppers from a jar, thinly sliced",
            "1/4 cup chopped fresh parsley",
            "Lemon wedges (for serving)"
        ],
        "instructions": [
            "Preheat oven to 350°. Toast almonds on a rimmed baking sheet, tossing once, until golden brown, 5–8 minutes. Let cool.",
            "Pulse almonds and garlic in a food processor or blender until finely ground. With motor running, gradually stream in oil, lemon juice, then 1/4 cup water; process, adding water as needed, until aioli is light, smooth, and consistency of mayonnaise; season with salt. Cover; chill.",
            "Do ahead: Aioli can be made 1 day ahead. Keep chilled.",
            "Paella: Pulse onions in a food processor until finely chopped; transfer to a large bowl. Repeat, separately, with carrots, garlic, and chile, adding to bowl with onions as you go. Pulse chorizo in food processor until finely ground. Heat oil in a large skillet over medium and cook chorizo, stirring often, until crisp, about 5 minutes. Using a slotted spoon, transfer chorizo to a plate. Add vegetables and bay leaf to skillet; season with salt. Cook, stirring often, until moisture is evaporated and vegetables have started to brown, 12–15 minutes; this is your flavor base. Add freekeh and cook, stirring, until lightly toasted and fragrant, about 3 minutes. Add tomato paste and cook, stirring, until darkened in color, about 2 minutes. Stir in chorizo and 4 1/2 cups water; season with salt. Bring to a simmer, cover, and cook, adding more water if liquid evaporates too quickly, until grains are al dente and almost all liquid is absorbed, 45–50 minutes. Nestle clams in freekeh and cover skillet. Cook until clams open, 7–10 minutes; discard any that don't open, along with bay leaf. Increase heat to medium-high and cook until clam juices evaporate and freekeh is tender, about 5 minutes. Top with pickled peppers and parsley; serve with aioli and lemon wedges.",
            "Pulse onions in a food processor until finely chopped; transfer to a large bowl. Repeat, separately, with carrots, garlic, and chile, adding to bowl with onions as you go. Pulse chorizo in food processor until finely ground.",
            "Heat oil in a large skillet over medium and cook chorizo, stirring often, until crisp, about 5 minutes. Using a slotted spoon, transfer chorizo to a plate.",
            "Add vegetables and bay leaf to skillet; season with salt. Cook, stirring often, until moisture is evaporated and vegetables have started to brown, 12–15 minutes; this is your flavor base.",
            "Add freekeh and cook, stirring, until lightly toasted and fragrant, about 3 minutes. Add tomato paste and cook, stirring, until darkened in color, about 2 minutes. Stir in chorizo and 4 1/2 cups water; season with salt. Bring to a simmer, cover, and cook, adding more water if liquid evaporates too quickly, until grains are al dente and almost all liquid is absorbed, 45–50 minutes. Nestle clams in freekeh and cover skillet. Cook until clams open, 7–10 minutes; discard any that don't open, along with bay leaf. Increase heat to medium-high and cook until clam juices evaporate and freekeh is tender, about 5 minutes.",
            "Top with pickled peppers and parsley; serve with aioli and lemon wedges."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b720082722874e516a1e10/6:4/w_274%2Ch_169/51260690_freekeh-paella_1x1.jpg",
        "color": 10899966
    }
}