{
    "recipe": {
        "title": "French \"Peasant\" Beets ",
        "ingredients": [
            "4 to 6 beets with greens (I like a mixture of golden and red beets)",
            "1 bunch Swiss chard, rinsed and dried",
            "3 tablespoons unsalted butter",
            "1 shallot, minced",
            "Salt and freshly ground black pepper",
            "2 tablespoons white wine (Muscadet is my preference)",
            "1/2 pound Bucheron (at room temperature), cut into 4 wedges",
            "Crusty peasant-style bread (warmed in the oven)"
        ],
        "instructions": [
            "1. Scrub and peel the beets. Remove the greens, wash and dry them, and chop coarsely. Set the greens aside in a large prep bowl. Slice the beets into 1/4-inch rounds.",
            "2. Remove the ribs from the Swiss chard and coarsely chop the ribs. Toss the leaves and ribs into the bowl with the beet greens.",
            "3. In a large sauté pan, melt the butter and sauté the shallot over medium heat until softened.",
            "Add the beet rounds to the shallot-butter mixture. Toss in a pinch of salt and crack some pepper over the beets. Reduce the heat and sauté the beets, turning to ensure even cooking, until the beets are beginning to glaze and become tender, about 15 minutes.",
            "Add the beet rounds to the shallot-butter mixture. Toss in a pinch of salt and crack some pepper over the beets. Reduce the heat and sauté the beets, turning to ensure even cooking, until the beets are beginning to glaze and become tender, about 15 minutes.",
            "Add the beet greens, chard, and chard ribs and sauté for about 5 minutes, then add the wine and cover. Cook until the greens are wilted, adding 2 tablespoons water if necessary. Allow the liquid to be mostly absorbed into the greens. Adjust the seasonings.",
            "Add the beet greens, chard, and chard ribs and sauté for about 5 minutes, then add the wine and cover. Cook until the greens are wilted, adding 2 tablespoons water if necessary. Allow the liquid to be mostly absorbed into the greens. Adjust the seasonings.",
            "Scoop the greens and beets into a shallow bowl. Serve with a generous wedge of Bucheron and some crusty bread. Crack a little bit of pepper over the entire dish.",
            "Scoop the greens and beets into a shallow bowl. Serve with a generous wedge of Bucheron and some crusty bread. Crack a little bit of pepper over the entire dish.",
            "Tips and Techniques To find the right cheese, Amy N‐B said: \"Nice grocery stores (such as Wegmans and Whole Foods) usually have it, and any good cheese counter should have it. It can be spelled Boucheron, Bucherondin, or Boucherondin. All will do the trick.\"",
            "To find the right cheese, Amy N‐B said: \"Nice grocery stores (such as Wegmans and Whole Foods) usually have it, and any good cheese counter should have it. It can be spelled Boucheron, Bucherondin, or Boucherondin. All will do the trick.\"",
            "About the Cook Amy Nichols‐Belo is a cultural anthropologist from Richmond, Virginia. Her favorite entertaining tip: \"When hosting an event where guests will be contributing dishes or beverages, provide a theme (tapas, sixties hors d'oeuvre, Latin) to avoid a meal that's more 'church basement potluck' than party.\" Here's her blog: Amy Cooks and Brad Does the Dishes (www.amycooksbraddoesthedishes.blogspot.com).",
            "Amy Nichols‐Belo is a cultural anthropologist from Richmond, Virginia.",
            "Her favorite entertaining tip: \"When hosting an event where guests will be contributing dishes or beverages, provide a theme (tapas, sixties hors d'oeuvre, Latin) to avoid a meal that's more 'church basement potluck' than party.\"",
            "Here's her blog: Amy Cooks and Brad Does the Dishes (www.amycooksbraddoesthedishes.blogspot.com).",
            "What the Community Said deensiebat: \"Made this last night and loved it. I had fallen into a rut of always making beets the same way—wedges parboiled, then roasted, greens reserved for later. Nice to have a new all‐in‐one method, with a sweet result.\" romanolikethecheese: \"Droplets of good balsamic vinegar on top set this dish up from good to really good!!\"",
            "deensiebat: \"Made this last night and loved it. I had fallen into a rut of always making beets the same way—wedges parboiled, then roasted, greens reserved for later. Nice to have a new all‐in‐one method, with a sweet result.\"",
            "romanolikethecheese: \"Droplets of good balsamic vinegar on top set this dish up from good to really good!!\""
        ],
        "picture_link": "https://assets.epicurious.com/photos/560400df08929a1609a1e5e6/6:4/w_274%2Ch_169/388612_hires.jpg"
    }
}