{
    "recipe": {
        "title": "French Spiced Bread ",
        "ingredients": [
            "2 tablespoons melted unsalted butter",
            "1/2 cup whole almonds",
            "1/2 cup store-bought or homemade candied orange peel",
            "1/2 cup dried apricots",
            "1/2 cup dried plums",
            "2 cups honey",
            "1 1/4 cups whole milk",
            "2 teaspoons kosher salt",
            "6 (3\") cinnamon sticks",
            "3 star anise pods",
            "3 cups all-purpose flour",
            "1 tablespoon plus 1 teaspoon baking powder",
            "1 tablespoon plus 1 teaspoon Reims N.39 spice mix",
            "2 teaspoons baking soda",
            "2 large eggs",
            "2 (9x5\") loaf pans"
        ],
        "instructions": [
            "Preheat oven to 325°F. Grease loaf pans with melted butter.",
            "Toast almonds on a rimmed baking sheet, tossing once or twice, until golden brown and fragrant, 6–8 minutes. Coarsely chop zest, apricots, plums, and toasted almonds. Transfer to a small bowl.",
            "Bring honey, milk, salt, cinnamon, and star anise to a boil in a medium saucepan over medium heat. Meanwhile, whisk flour, baking powder, spice mix, and baking soda in a large bowl.",
            "Strain honey mixture through a fine-mesh sieve into dry ingredients and whisk to combine. Add eggs and whisk until incorporated. Using a spatula, quickly fold in zest mixture.",
            "Divide dough between prepared pans, filling each about three-quarters full. Bake bread until tops are golden brown and a toothpick inserted into the centers comes out clean, 35–40 minutes.",
            "Let bread cool 10 minutes in pan, then carefully remove from pan and transfer to a wire rack.",
            "Do Ahead Bread can be made 5 days ahead. Tightly wrap and store at room temperature, or freeze up to 1 month.",
            "Bread can be made 5 days ahead. Tightly wrap and store at room temperature, or freeze up to 1 month."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56745838b47c050a284a4df6/6:4/w_274%2Ch_169/EP_12172015_apricotalmondbread.jpg"
    }
}