{
    "recipe": {
        "title": "Fresh Orange Tart with Hazelnut Crust ",
        "ingredients": [
            "1 1/4 teaspoons unflavored gelatin",
            "1 tablespoon water",
            "1 cup sugar",
            "2 tablespoons plus 2 teaspoons finely grated orange peel",
            "2 teaspoons finely grated lemon peel",
            "4 large eggs",
            "3/4 cup fresh orange juice",
            "3 tablespoons fresh lemon juice",
            "1 cup plus 6 tablespoons (2 3/4 sticks) unsalted butter, cut into tablespoon-size pieces, room temperature",
            "1 1/4 cups all purpose flour",
            "1/2 cup powdered sugar",
            "1/4 cup hazelnuts",
            "1/4 teaspoon salt",
            "9 tablespoons chilled unsalted butter, cut into 1/2-inch cubes",
            "1 large egg yolk",
            "Candied blood orange slices"
        ],
        "instructions": [
            "For orange filling: Sprinkle gelatin over 1 tablespoon water in small bowl. Let stand 10 minutes to soften. Combine sugar, 2 tablespoons orange peel, and lemon peel in medium metal bowl. Using fingertips, rub ingredients together until sugar is moistened. Add eggs; whisk until smooth. Whisk in both juices. Place bowl over saucepan of simmering water (do not allow bottom of bowl to touch water); whisk constantly until mixture thickens and thermometer inserted into mixture registers 180°F, about 5 minutes. Remove from heat. Add gelatin mixture and stir until dissolved. Strain orange mixture into blender; let cool until thermometer inserted into mixture registers 140°F, about 10 minutes. With blender running, add room-temperature butter 2 pieces at a time and process until blended. Continue blending 3 minutes longer. Transfer filling to bowl; mix in remaining 2 teaspoons orange peel. Cover and chill overnight.",
            "Sprinkle gelatin over 1 tablespoon water in small bowl. Let stand 10 minutes to soften. Combine sugar, 2 tablespoons orange peel, and lemon peel in medium metal bowl. Using fingertips, rub ingredients together until sugar is moistened. Add eggs; whisk until smooth. Whisk in both juices.",
            "Place bowl over saucepan of simmering water (do not allow bottom of bowl to touch water); whisk constantly until mixture thickens and thermometer inserted into mixture registers 180°F, about 5 minutes. Remove from heat. Add gelatin mixture and stir until dissolved. Strain orange mixture into blender; let cool until thermometer inserted into mixture registers 140°F, about 10 minutes.",
            "With blender running, add room-temperature butter 2 pieces at a time and process until blended. Continue blending 3 minutes longer.",
            "Transfer filling to bowl; mix in remaining 2 teaspoons orange peel. Cover and chill overnight.",
            "For crust: Butter 9-inch square tart pan with removable bottom. Finely grind flour, sugar, nuts, and salt in processor. Add butter and cut in using on/off turns until mixture resembles coarse meal. Add egg yolk and blend in using on/off turns just until moist clumps form (do not allow dough to form ball). Press dough onto bottom and up sides of prepared pan (crust will be about 1/4 inch thick). Using thumb, press around sides to extend crust 1/4 inch above edge of pan. Chill 1 hour. Preheat oven to 375°F. Bake crust until golden brown, about 20 minutes. Cool crust completely on rack. (Crust can be made 1 day ahead. Store airtight at room temperature.) Stir orange filling to loosen. Spoon enough chilled orange filling into crust to fill completely. Chill tart at least 1 hour and up to 4 hours. Garnish with candied blood orange slices. Drizzle oranges with some of syrup. Serve cold.",
            "Butter 9-inch square tart pan with removable bottom. Finely grind flour, sugar, nuts, and salt in processor. Add butter and cut in using on/off turns until mixture resembles coarse meal. Add egg yolk and blend in using on/off turns just until moist clumps form (do not allow dough to form ball). Press dough onto bottom and up sides of prepared pan (crust will be about 1/4 inch thick). Using thumb, press around sides to extend crust 1/4 inch above edge of pan. Chill 1 hour.",
            "Preheat oven to 375°F. Bake crust until golden brown, about 20 minutes. Cool crust completely on rack. (Crust can be made 1 day ahead. Store airtight at room temperature.)",
            "Stir orange filling to loosen. Spoon enough chilled orange filling into crust to fill completely. Chill tart at least 1 hour and up to 4 hours. Garnish with candied blood orange slices. Drizzle oranges with some of syrup. Serve cold."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de60af9a84192308a7d51/6:4/w_274%2Ch_169/233436.jpg"
    }
}