{
    "recipe": {
        "title": "Fresh Gingerbread with Lemon Icing ",
        "ingredients": [
            "1/2 cup plus 2 tablespoons unsalted butter",
            "1/2 cup plus 2 tablespoons brown sugar",
            "3/4 cup plus 1 tablespoon light corn syrup",
            "3/4 cup plus 1 tablespoon molasses",
            "2 teaspoons fresh ginger, finely grated",
            "1 teaspoon ground cinnamon",
            "1 cup plus 2 tablespoons milk",
            "2 large eggs, beaten to mix",
            "1 teaspoon baking soda, dissolved in 2 tablespoons warm water",
            "2 cups all-purpose flour",
            "roasting pan, approximately 12 x 8 x 2 inches, greased and lined with foil or parchment paper",
            "1 tablespoons lemon juice",
            "1/2 cup plus 2 tablespoons confectioners' sugar, sifted",
            "1 tablespoon warm water"
        ],
        "instructions": [
            "Preheat the oven to 325°F. In a saucepan, melt the butter along with the sugar, syrup, molasses, ginger, and cinnamon. Off the heat, add the milk, eggs, and baking soda in its water. Measure the flour out into a bowl and pour in the liquid ingredients, beating until very well mixed (it will be a very liquid batter). Pour it into the pan and bake for 3/4 - 1 hour until risen and firm. Be careful not to overcook it, as it is nicer a little stickier, and anyway it will carry on cooking as it cools. And when it is cool, get on with the icing. Whisk the lemon juice into the confectioners' sugar first, then gradually add the water. You want a good, thick icing, so go cautiously and be prepared not to add all the water. Spread over the cooled gingerbread with a palette knife, and leave to set before cutting.",
            "Preheat the oven to 325°F.",
            "In a saucepan, melt the butter along with the sugar, syrup, molasses, ginger, and cinnamon. Off the heat, add the milk, eggs, and baking soda in its water.",
            "Measure the flour out into a bowl and pour in the liquid ingredients, beating until very well mixed (it will be a very liquid batter). Pour it into the pan and bake for 3/4 - 1 hour until risen and firm. Be careful not to overcook it, as it is nicer a little stickier, and anyway it will carry on cooking as it cools.",
            "And when it is cool, get on with the icing. Whisk the lemon juice into the confectioners' sugar first, then gradually add the water. You want a good, thick icing, so go cautiously and be prepared not to add all the water. Spread over the cooled gingerbread with a palette knife, and leave to set before cutting."
        ],
        "picture_link": null
    }
}