{
    "recipe": {
        "title": "Fresh Spinach and Roasted-Garlic Custards ",
        "ingredients": [
            "2 cups heavy whipping cream",
            "2 cups (firmly packed) stemmed fresh spinach leaves (about 3 1/2 ounces)",
            "1 teaspoon coarse kosher salt",
            "1/2 teaspoon freshly ground white pepper",
            "4 large eggs",
            "1 tablespoon finely mashed roasted garlic",
            "Extra-virgin olive oil (for garnish)"
        ],
        "instructions": [
            "Preheat oven to 325°F. Butter six 3/4-cup ramekins or custard cups and place in 13x9x2-inch metal baking pan. Fill large bowl with ice and water. Bring cream to simmer in medium saucepan. Remove cream from heat. Add spinach, salt, and white pepper and stir until spinach wilts, about 1 minute. Place saucepan over ice water; stir to cool mixture quickly. Pour cooled spinach mixture into blender; add eggs and roasted garlic . Blend until spinach is pureed and custard is smooth. Divide custard among prepared ramekins. Pour enough hot water into pan to come halfway up sides of ramekins. Bake custards until gently set in center, turning pan after 30 minutes, about 55 minutes total. Do ahead Can be made 1 day ahead. Cool custards in water. Remove from water, cover, and chill. Rewarm custards 2 at a time, uncovered, about 1 minute in microwave at 50 percent power. Cut around custards to loosen and turn out onto plates. Drizzle with extra-virgin olive oil and serve.",
            "Preheat oven to 325°F. Butter six 3/4-cup ramekins or custard cups and place in 13x9x2-inch metal baking pan. Fill large bowl with ice and water. Bring cream to simmer in medium saucepan. Remove cream from heat. Add spinach, salt, and white pepper and stir until spinach wilts, about 1 minute. Place saucepan over ice water; stir to cool mixture quickly.",
            "Pour cooled spinach mixture into blender; add eggs and roasted garlic . Blend until spinach is pureed and custard is smooth. Divide custard among prepared ramekins. Pour enough hot water into pan to come halfway up sides of ramekins.",
            "Bake custards until gently set in center, turning pan after 30 minutes, about 55 minutes total. Do ahead Can be made 1 day ahead. Cool custards in water. Remove from water, cover, and chill. Rewarm custards 2 at a time, uncovered, about 1 minute in microwave at 50 percent power.",
            "Cut around custards to loosen and turn out onto plates. Drizzle with extra-virgin olive oil and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd7b87b55306961bfaae3/6:4/w_274%2Ch_169/236201.jpg"
    }
}