{
    "recipe": {
        "title": "Fresh Blueberry Brioche ",
        "ingredients": [
            "1 1/2 cups fresh blueberries",
            "2 tbsp whole milk",
            "1 tbsp active dry yeast",
            "1 cup plus 2 tbsp all-purpose flour",
            "1 cup plus 2 tbsp bread flour",
            "6 1/2 tbsp sugar, divided, plus more for sprinkling",
            "1 tsp kosher salt",
            "3 eggs",
            "1 egg yolk",
            "1/2 cup plus 2 tbsp unsalted butter, very soft",
            "1 batch Egg Wash"
        ],
        "instructions": [
            "Place fresh blueberries on a plate and freeze in a single layer. (Do not use frozen blueberries, as they are too watery.)",
            "Slightly warm milk and pour into bowl of a stand mixer fitted with dough hook attachment. Add yeast and whisk by hand to combine. Add all-purpose flour, bread flour, 2 1/2 tbsp sugar, salt, eggs, and egg yolk to bowl. Mix on low speed until dough comes together, 1-2 minutes.",
            "Increase mixer speed to medium-low and work dough for 6 minutes. Pause every minute to push dough back down and off the hook until it pulls off the bowl sides and looks like a strong bread dough.",
            "Reduce mixer speed to low and slowly add butter, a little at a time, over the course of 2 minutes (pausing after 1 minute to scrape down bowl and hook). When butter begins to blend in, increase mixer speed to medium-high to fully incorporate butter and bring the dough back together, 5-6 minutes longer.",
            "Place dough on a lightly floured work surface and press into a 16\" x 10\" rectangle with a short side nearest you; distribute blueberries and 2 tbsp sugar along the top edge and gently roll down, toward you, into a log.",
            "Place on a greased baking sheet, wrap in plastic, and refrigerate for at least 1 hour, or preferably overnight.",
            "Grease a 9\" x 5\" loaf pan. Reshape dough by pressing it into a 12\" x 6\" rectangle with a short side nearest you. Sprinkle with remaining 2 tbsp sugar and tightly roll down toward you.",
            "Place into greased loaf pan, loosely wrap in plastic, and allow to rise in a warm place until more than doubled in size, about 3 hours.",
            "Preheat oven to 350°. Carefully brush dough with Egg Wash, making sure egg doesn't pool around the edges. Liberally sprinkle with sugar. Bake until golden, 40-45 minutes. Allow to cool for about 15 minutes in the pan. Then transfer to a cooling rack."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54aaf77c19925f464b3a074f/6:4/w_274%2Ch_169/51256450_fresh-blueberry-brioche_1x1.jpg"
    }
}