{
    "recipe": {
        "title": "Fresh Raspberry-Quinoa Pancakes ",
        "ingredients": [
            "1 cup (4 ounces/120 grams) quinoa flour",
            "1/4 cup (1 ounce/50 grams) granulated sugar",
            "1 tablespoon baking powder",
            "1/2 teaspoon salt",
            "3/4 cup (6 ounces/180 milliliters) milk",
            "8 tablespoons (4 ounces/120 grams) unsalted butter, melted and slightly cooled, plus more for greasing the skillet",
            "2 large eggs",
            "1 cup (5 ounces/150 grams) fresh raspberries, plus more for garnish",
            "1 teaspoon pure vanilla extract",
            "1/2 cup (3 ounces/90 grams) cooked quinoa",
            "Salted butter, at room temperature, for serving",
            "Maple syrup or Honey, for serving",
            "Greek yogurt, for serving"
        ],
        "instructions": [
            "1. In a large bowl, whisk together the flour, sugar, baking powder, and salt. 2. In a blender, purée the milk, butter, eggs, raspberries, and vanilla until the raspberries are broken down. 3. Whisk the raspberry mixture into the dry ingredients. Stir in the quinoa. Heat a medium nonstick skillet or a nonstick griddle over medium heat. Lightly grease it with butter. Use a 1/4 cup measure to scoop the batter onto the skillet. Cook until the batter begins to bubble and the edges of the pancakes look opaque and set, about 3 minutes. Flip the pancakes over and cook until steam begins to escape through the pores in the pancakes, 2 to 3 minutes longer. Transfer to a plate and repeat with the remaining batter. 4. Top with butter and honey or a dollop of Greek yogurt and syrup or honey.",
            "1. In a large bowl, whisk together the flour, sugar, baking powder, and salt.",
            "2. In a blender, purée the milk, butter, eggs, raspberries, and vanilla until the raspberries are broken down.",
            "3. Whisk the raspberry mixture into the dry ingredients. Stir in the quinoa. Heat a medium nonstick skillet or a nonstick griddle over medium heat. Lightly grease it with butter. Use a 1/4 cup measure to scoop the batter onto the skillet. Cook until the batter begins to bubble and the edges of the pancakes look opaque and set, about 3 minutes. Flip the pancakes over and cook until steam begins to escape through the pores in the pancakes, 2 to 3 minutes longer. Transfer to a plate and repeat with the remaining batter.",
            "4. Top with butter and honey or a dollop of Greek yogurt and syrup or honey."
        ],
        "picture_link": "https://assets.epicurious.com/photos/556dc77c5fa91f011a45aa46/6:4/w_274%2Ch_169/56389608_fresh-raspberry-quinoa-pancakes_1x1.jpg"
    }
}