{
    "recipe": {
        "title": "Frico Caldo with Prosciutto and Garden Salad ",
        "ingredients": [
            "3 medium shallots, finely chopped",
            "3/4 cup sherry vinegar",
            "1 tablespoon sherry vinegar",
            "1 medium shallot, finely chopped",
            "2 teaspoons fresh cilantro, roughly chopped",
            "1 teaspoon kosher salt",
            "3 tablespoons grapeseed oil",
            "3 tablespoons purchased basil pesto",
            "1 tablespoon sherry vinegar",
            "1 tablespoon lemon juice (from 1/2 medium lemon)",
            "1 teaspoon kosher salt",
            "1/2 teaspoon freshly ground black pepper",
            "1 cup grapeseed oil",
            "1 1/2 teaspoons olive oil",
            "2 medium Yukon Gold potatoes, peeled and cut into quarters",
            "1 tablespoon unsalted butter",
            "1/2 medium onion, finely chopped",
            "2 cups finely grated Parmigiano-Reggiano (4 ounces total)",
            "1 tablespoon kosher salt",
            "1/2 teaspoon nutmeg, freshly grated",
            "1 tablespoon olive oil",
            "2 large heads romaine (about 3 pounds), torn into bite-sized pieces",
            "16 thin slices prosciutto (about 12 ounces)"
        ],
        "instructions": [
            "Make pickled shallots In small container, combine shallots and vinegar. Cover and refrigerate at least 8 hours or overnight.",
            "In small container, combine shallots and vinegar. Cover and refrigerate at least 8 hours or overnight.",
            "Make cilantro vinaigrette In small bowl, whisk together vinegar, shallot, cilantro, and salt. Slowly whisk in oil. Set aside (vinaigrette can be made ahead and refrigerated, covered, up to 24 hours).",
            "In small bowl, whisk together vinegar, shallot, cilantro, and salt. Slowly whisk in oil. Set aside (vinaigrette can be made ahead and refrigerated, covered, up to 24 hours).",
            "Make pesto-pickled shallot vinaigrette In fine-mesh sieve, drain pickled shallots, discarding liquid. Transfer shallots to medium bowl and whisk in pesto, vinegar, lemon juice, salt, and pepper. Slowly whisk in grapeseed oil, then olive oil. Set aside.",
            "In fine-mesh sieve, drain pickled shallots, discarding liquid. Transfer shallots to medium bowl and whisk in pesto, vinegar, lemon juice, salt, and pepper. Slowly whisk in grapeseed oil, then olive oil. Set aside.",
            "Make frico caldo In heavy 4-quart pot, combine potatoes with enough cold salted water to cover by 2 inches. Cover, set over high heat, and bring to boil, then reduce heat to moderate and simmer until tender, about 15 to 20 minutes. Drain. In heavy small skillet over moderate heat, melt butter. Add onions and sauté until soft, about 4 minutes. Transfer to large bowl. Using large wooden spoon, break up potatoes into roughly 1/4-inch pieces and add to onion. Add cheese, salt, and nutmeg and stir until just combined. In heavy 10-inch nonstick skillet over moderate heat, heat oil until hot but not smoking. Add potato mixture and flatten into 1/2-inch-thick, 7-inch-wide cake, rounding edges with spatula. Cook, without moving, until underside is browned, about 8 minutes. Invert large plate over skillet and flip frico onto plate. Slide frico back into skillet, uncooked side down, and cook until underside is golden brown, about 5 minutes more. Slide onto large plate and cut into 8 wedges.",
            "In heavy 4-quart pot, combine potatoes with enough cold salted water to cover by 2 inches. Cover, set over high heat, and bring to boil, then reduce heat to moderate and simmer until tender, about 15 to 20 minutes. Drain.",
            "In heavy small skillet over moderate heat, melt butter. Add onions and sauté until soft, about 4 minutes. Transfer to large bowl. Using large wooden spoon, break up potatoes into roughly 1/4-inch pieces and add to onion. Add cheese, salt, and nutmeg and stir until just combined.",
            "In heavy 10-inch nonstick skillet over moderate heat, heat oil until hot but not smoking. Add potato mixture and flatten into 1/2-inch-thick, 7-inch-wide cake, rounding edges with spatula. Cook, without moving, until underside is browned, about 8 minutes. Invert large plate over skillet and flip frico onto plate. Slide frico back into skillet, uncooked side down, and cook until underside is golden brown, about 5 minutes more. Slide onto large plate and cut into 8 wedges.",
            "Assemble and serve In large bowl, toss romaine with pesto vinaigrette. Arrange 1 wedge frico on each of 8 medium plates. Top each with 2 slices prosciutto and drizzle with cilantro vinaigrette. Arrange 1 cup romaine alongside each wedge. Serve immediately.",
            "In large bowl, toss romaine with pesto vinaigrette. Arrange 1 wedge frico on each of 8 medium plates. Top each with 2 slices prosciutto and drizzle with cilantro vinaigrette. Arrange 1 cup romaine alongside each wedge. Serve immediately."
        ],
        "picture_link": null
    }
}