{
    "recipe": {
        "title": "Fried Whole Fish with Tomatillo Sauce ",
        "ingredients": [
            "1 bunch cilantro",
            "8 ounces tomatillos, husks removed, rinsed, coarsely chopped",
            "1/4 cup drained jarred pickled jalapeños, plus 1 tablespoon (or more) brine from jar",
            "Kosher salt",
            "3 cups vegetable oil",
            "1 (1 1/2–2-pound) whole fish (such as black sea bass or red snapper), cleaned",
            "Warm tortillas (for serving)"
        ],
        "instructions": [
            "Trim cilantro at the point where it becomes more stem-y than leafy; set leaves with tender stems aside for serving. Coarsely chop about 1/2 cup worth of stems and place in a blender along with tomatillos, pickled jalapeños, and pickling liquid. Purée until smooth; taste and season sauce with salt and more pickling liquid if desired.",
            "Heat oil in a large cast-iron skillet over high. Transfer fish to a cutting board and pat dry thoroughly with paper towels. With a sharp knife, make slashes crosswise on a diagonal along the body of the fish every 2\" on both sides, cutting all the way down to the bone. Season fish generously inside and out with salt.",
            "When the oil is hot—it should be shimmering, and when you drop a small piece of tortilla into the oil it should begin sizzling immediately—grip the fish firmly by the tail and carefully lower, head first, into skillet, making sure to lay it down away from you. (If the tail sticks out of the pan a bit, it’s not a huge deal.) Fry until flesh on bottom side is cooked through and skin is deeply browned and crisp, about 4 minutes. While the fish is frying, use a metal spoon to baste the inside of the fish’s head with a bit of hot oil periodically. Use tongs and a fish spatula to carefully turn fish over. Fry until flesh on second side is cooked through and skin is deeply browned and crisp, about 4 minutes. Transfer to a wire rack and season both sides with more salt.",
            "Pour tomatillo sauce onto a rimmed platter and gently place fish on top. Tuck reserved cilantro into the cavity between the fish’s head and body and around the fish. Serve with tortillas."
        ],
        "picture_link": "https://assets.epicurious.com/photos/599b45c1ccbee25822ea597e/6:4/w_274%2Ch_169/fried-whole-fish-with-tomatillo-sauce-recipe-BA-081717.jpg"
    }
}