{
    "recipe": {
        "title": "Fried Mozzerella with Arugula and Prosciutto ",
        "ingredients": [
            "2 bunches arugula (3/4 pound total),coarse stems discarded",
            "5 ounces thinly sliced prosciutto (8 to 12 slices)",
            "1 (7-ounce) jar roasted red peppers, rinsed and torn into large pieces",
            "1/3 cup brine-cured black olives",
            "1/2 cup thinly sliced red onion",
            "2 tablespoons red-wine vinegar",
            "1 tablespoon anchovy paste",
            "1/4 cup extra-virgin olive oil",
            "2 large egg whites",
            "1 cup fine dry bread crumbs",
            "About 2 cups olive oil for frying",
            "1 pound salted fresh mozzarella, cut into 4 thick slices (without rounded ends)"
        ],
        "instructions": [
            "Divide arugula into 8 small bunches and loosely wrap each with 1 or 2 slices prosciutto. Divide among 4 plates with roasted peppers, olives, and onion. Whisk together vinegar, anchovy, and 1/4 teaspoon each of salt and pepper. Whisk in extra-virgin oil. Whisk egg whites with 1/2 teaspoon salt and 1/4 teaspoon pepper in a shallow bowl. Put bread crumbs in another shallow bowl. Double-coat each slice of cheese by dipping in egg mixture, then crumbs, and repeating. Transfer to a plate. Heat 1/2 inch olive oil in a 12-inch heavy skillet over medium-high heat until it shimmers. Fry coated mozzarella, turning carefully once or twice, until golden and cheese starts to melt but still retains its shape, about 2 minutes total. Drain briefly on paper towels, then transfer to plates. Drizzle everything with vinaigrette. Serve with: garlic bread with parsley",
            "Divide arugula into 8 small bunches and loosely wrap each with 1 or 2 slices prosciutto. Divide among 4 plates with roasted peppers, olives, and onion.",
            "Whisk together vinegar, anchovy, and 1/4 teaspoon each of salt and pepper. Whisk in extra-virgin oil.",
            "Whisk egg whites with 1/2 teaspoon salt and 1/4 teaspoon pepper in a shallow bowl. Put bread crumbs in another shallow bowl. Double-coat each slice of cheese by dipping in egg mixture, then crumbs, and repeating. Transfer to a plate.",
            "Heat 1/2 inch olive oil in a 12-inch heavy skillet over medium-high heat until it shimmers. Fry coated mozzarella, turning carefully once or twice, until golden and cheese starts to melt but still retains its shape, about 2 minutes total. Drain briefly on paper towels, then transfer to plates.",
            "Drizzle everything with vinaigrette.",
            "Serve with: garlic bread with parsley"
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d78b07b55306961bf3468/6:4/w_274%2Ch_169/242829_hires.jpg"
    }
}