{
    "recipe": {
        "title": "Frisée and Radish Salad with Hazelnut Dressing ",
        "ingredients": [
            "1/4 cup vegetable oil, divided",
            "1/2 cup hazelnuts (2 ounces), coarsely chopped",
            "4 bacon slices",
            "1 tablespoon Sherry vinegar or red-wine vinegar",
            "1 tablespoon fresh lemon juice",
            "2 small heads frisée (about 10 ounces total)",
            "4 medium radishes, thinly sliced"
        ],
        "instructions": [
            "Heat 1 tablespoon oil in a small skillet over medium heat until it shimmers. Add hazelnuts and cook, stirring occasionally, until golden, 2 to 3 minutes. Cool slightly in skillet. Cook bacon in a large skillet over medium heat until crisp. Transfer to paper towels to drain and reserve 1 tablespoon bacon fat. Break bacon into 1-inch pieces. Purée hazelnuts (with any remaining cooking oil), vinegar, lemon juice, 1/4 teaspoon salt, remaining vegetable oil, and reserved bacon fat in a blender just until nuts are finely chopped (dressing will be thick and slightly chunky). Toss frisée, radishes, and bacon with dressing.",
            "Heat 1 tablespoon oil in a small skillet over medium heat until it shimmers. Add hazelnuts and cook, stirring occasionally, until golden, 2 to 3 minutes. Cool slightly in skillet.",
            "Cook bacon in a large skillet over medium heat until crisp. Transfer to paper towels to drain and reserve 1 tablespoon bacon fat. Break bacon into 1-inch pieces.",
            "Purée hazelnuts (with any remaining cooking oil), vinegar, lemon juice, 1/4 teaspoon salt, remaining vegetable oil, and reserved bacon fat in a blender just until nuts are finely chopped (dressing will be thick and slightly chunky).",
            "Toss frisée, radishes, and bacon with dressing."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b428bc2413537c0d45de78/6:4/w_274%2Ch_169/357449_frisee-radish-salad_1x1.jpg"
    }
}