{
    "recipe": {
        "title": "Fromage Blanc Souffle ",
        "ingredients": [
            "8 tablespoons (120 g) unsalted butter, at room temperature, plus more for the baking dish",
            "11 1/2 tablespoons (165 g) sugar, plus more for the baking dish",
            "Freshly grated zest of 1 lemon",
            "3 tablespoons (25 g) cornstarch",
            "4 large egg yolks",
            "2 cups (480 g) fromage blanc",
            "6 large egg whites (at room temperature)",
            "Pinch of salt"
        ],
        "instructions": [
            "1. Liberally butter a shallow 2-quart (2-L) baking dish, with sides that are at least 2 1/2 inches (8 cm) high. Sprinkle a few spoonfuls of sugar inside,tilt the dish to coat the bottom and sides, then tip out any excess.",
            "2. Preheat the oven to 375°F (190°C).",
            "3. Using a rubber spatula or an electric mixer with the paddle attachment, mash the very soft butter with the lemon zest and cornstarch until completely smooth. Beat in the egg yolks until smooth, then whisk in the fromage blanc.",
            "4. With an electric mixer or by hand, whisk the egg whites with the salt in a clean, dry bowl (not plastic) until frothy. Increase the speed and beat until the whites begin to mound and hold their shape. While whipping, gradually add 10 tablespoons of the sugar, 1 tablespoon at a time. Once you've added all the sugar, beat until stiff.",
            "5. Fold one-third of the beaten egg whites into the fromage blanc mixture, then fold in the remaining egg whites just until incorporated. It's okay to have some tiny bits of white; that's preferable to overfolding the batter.",
            "6. Scrape the batter into the prepared baking dish, gently smooth the top, and sprinkle with the remaining 1 1/2 tablespoons of sugar.",
            "7. Bake on a middle rack (or slightly higher, if possible) for 30 minutes, until the top is browned and the soufflé is just set but still very jiggly in the center if you nudge it. Depending on your oven, this may take slightly less or more time. Rather than going by strict baking times, touch the center to tell when it's done. If you like your soufflé creamy in the middle, the center should feel rather soft, like runny pudding.",
            "If you like it more firm, you can bake it until a toothpick inserted into the center comes out pretty clean."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a76662fa7a9917c25abc/6:4/w_274%2Ch_169/355924.jpg",
        "color": 13579734
    }
}