{
    "recipe": {
        "title": "Frozen Praline Mousse Cake ",
        "ingredients": [
            "1 1/3 cups whole almonds (about 6 ounces)",
            "1 cup sugar",
            "4 large egg whites",
            "1 tablespoon all purpose flour",
            "1/2 cup plus 3/4 cup sugar",
            "2 tablespoons plus 1/4 cup water",
            "3/4 cup sliced almonds (about 3 ounces)",
            "6 large egg yolks",
            "1 large egg",
            "1 tablespoon dark corn syrup",
            "2 tablespoons Irish cream liqueur",
            "2 teaspoons instant espresso powder",
            "2 cups chilled whipping cream"
        ],
        "instructions": [
            "Make meringue: Preheat oven to 250°F. Line 10-inch-diameter springform pan with parchment paper. Lightly oil paper and pan sides. Finely grind whole almonds and 1/4 cup sugar in processor. Using electric mixer, beat egg whites in large bowl to soft peaks. Gradually add remaining 3/4 cup sugar and beat until stiff but not dry. Beat in ground almond mixture and flour. Spread mixture evenly over parchment paper in pan. Bake until dry, about 1 1/2 hours. Cool completely in pan.",
            "Preheat oven to 250°F. Line 10-inch-diameter springform pan with parchment paper. Lightly oil paper and pan sides. Finely grind whole almonds and 1/4 cup sugar in processor. Using electric mixer, beat egg whites in large bowl to soft peaks. Gradually add remaining 3/4 cup sugar and beat until stiff but not dry. Beat in ground almond mixture and flour. Spread mixture evenly over parchment paper in pan. Bake until dry, about 1 1/2 hours. Cool completely in pan.",
            "Make praline cream: Lightly oil rimmed baking sheet. Combine 1/2 cup sugar and 2 tablespoons water in heavy small saucepan over medium-low heat. Stir until sugar dissolves. Increase heat to medium-high and boil without stirring until mixture turns deep amber color, brushing down sides of pan with wet pastry brush and swirling occasionally, about 6 minutes. Stir in sliced almonds. Immediately pour mixture onto prepared sheet. Cool. Break praline into pieces and finely grind in processor. Whisk egg yolks, egg, remaining 3/4 cup sugar, and 1/4 cup water in large bowl to blend. Set over saucepan of simmering water and whisk until mixture thickens and instant-read thermometer registers 160°F, about 5 minutes. Remove bowl from over water. Using electric mixer, beat mixture until thick and cool, about 5 minutes. Whisk in corn syrup, liqueur, and espresso powder. Fold in ground praline. Using electric mixer, beat whipping cream in another large bowl until stiff peaks form. Fold whipped cream into praline mixture. Spread praline cream over almond meringue in pan, smoothing top. Freeze overnight. (Can be made up to 1 week ahead. Cover tightly and keep frozen.) Cut cake into slices and serve frozen.",
            "Lightly oil rimmed baking sheet. Combine 1/2 cup sugar and 2 tablespoons water in heavy small saucepan over medium-low heat. Stir until sugar dissolves. Increase heat to medium-high and boil without stirring until mixture turns deep amber color, brushing down sides of pan with wet pastry brush and swirling occasionally, about 6 minutes. Stir in sliced almonds. Immediately pour mixture onto prepared sheet. Cool. Break praline into pieces and finely grind in processor.",
            "Whisk egg yolks, egg, remaining 3/4 cup sugar, and 1/4 cup water in large bowl to blend. Set over saucepan of simmering water and whisk until mixture thickens and instant-read thermometer registers 160°F, about 5 minutes. Remove bowl from over water. Using electric mixer, beat mixture until thick and cool, about 5 minutes. Whisk in corn syrup, liqueur, and espresso powder. Fold in ground praline.",
            "Using electric mixer, beat whipping cream in another large bowl until stiff peaks form. Fold whipped cream into praline mixture. Spread praline cream over almond meringue in pan, smoothing top. Freeze overnight. (Can be made up to 1 week ahead. Cover tightly and keep frozen.) Cut cake into slices and serve frozen."
        ],
        "picture_link": null
    }
}