{
    "recipe": {
        "title": "Frozen Yogurt with Poached Peaches ",
        "ingredients": [
            "1 cup heavy cream",
            "1 cup plain whole-milk Greek yogurt",
            "1 cup whole milk",
            "1/2 cup honey",
            "2 tablespoons fresh lemon juice",
            "Pinch of kosher salt",
            "4 large ripe peaches (about 2 pounds)",
            "6 fresh lemon verbena leaves",
            "1 1/2 cups Cocchi Aperitivo Americano (Italian aperitif wine)",
            "1/2 cup sugar",
            "1/4 cup chopped unsalted, raw pistachios"
        ],
        "instructions": [
            "Whisk cream, yogurt, milk, honey, lemon juice, and salt in a large bowl. Process in an ice cream maker according to manufacturer's instructions.",
            "Transfer frozen yogurt to an airtight container or a shallow baking pan; cover and freeze until firm, at least 2 hours.",
            "Do ahead: Frozen yogurt can be made 1 week ahead. Keep frozen.",
            "Peaches and assembly: Using the tip of a paring knife, score an X in the bottom of each peach. Cook in a large pot of boiling water just until skins begin to peel back where cut, about 1 minute. Using a slotted spoon, transfer to a large bowl of ice water and let cool. Carefully peel peaches, reserving skins. Bring lemon verbena, Cocchi Americano, sugar, reserved peach skins, and 1 1/2 cups water to a boil in a medium saucepan. Reduce heat and simmer until mixture has thickened slightly and looks syrupy, 10–12 minutes. Add peaches, cover saucepan, reduce heat, and gently poach fruit until the tip of a paring knife easily slides through flesh, 12–15 minutes. (Very ripe fruit will take less time to cook.) Using a slotted spoon, transfer peaches to a plate and let cool. Cut into wedges. Meanwhile, return poaching liquid to a boil and cook until reduced by half, 15–20 minutes. Let cool, then discard solids. Scoop frozen yogurt into small glasses or bowls and serve topped with peaches, some reduced poaching syrup, and pistachios. Do ahead: Peaches can be poached 3 days ahead. Cover and chill in poaching liquid. Bring peaches to room temperature and reduce poaching liquid just before using.",
            "Using the tip of a paring knife, score an X in the bottom of each peach. Cook in a large pot of boiling water just until skins begin to peel back where cut, about 1 minute. Using a slotted spoon, transfer to a large bowl of ice water and let cool. Carefully peel peaches, reserving skins.",
            "Bring lemon verbena, Cocchi Americano, sugar, reserved peach skins, and 1 1/2 cups water to a boil in a medium saucepan. Reduce heat and simmer until mixture has thickened slightly and looks syrupy, 10–12 minutes.",
            "Add peaches, cover saucepan, reduce heat, and gently poach fruit until the tip of a paring knife easily slides through flesh, 12–15 minutes. (Very ripe fruit will take less time to cook.) Using a slotted spoon, transfer peaches to a plate and let cool. Cut into wedges.",
            "Meanwhile, return poaching liquid to a boil and cook until reduced by half, 15–20 minutes. Let cool, then discard solids.",
            "Scoop frozen yogurt into small glasses or bowls and serve topped with peaches, some reduced poaching syrup, and pistachios.",
            "Do ahead: Peaches can be poached 3 days ahead. Cover and chill in poaching liquid. Bring peaches to room temperature and reduce poaching liquid just before using."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac017219925f464b3a54c8/6:4/w_274%2Ch_169/51242270_frozen-yogurt-peaches_1x1.jpg",
        "color": 15294393
    }
}