{
    "recipe": {
        "title": "Frozen Mini S'mores Pies ",
        "ingredients": [
            "5 tablespoons unsalted butter",
            "1 tablespoon honey",
            "8 (4 3/4x2 1/4\") graham crackers",
            "1 (8-ounce) package cream cheese, softened",
            "1 (14-ounce) can sweetened condensed milk",
            "1/3 cup unsweetened cocoa powder",
            "3/4 cup chilled heavy cream",
            "1/2 cup light corn syrup",
            "1/2 cup sugar",
            "2 large egg whites",
            "1/8 teaspoon cream of tartar",
            "A standard 12-cup muffin pan; a kitchen torch"
        ],
        "instructions": [
            "Heat butter and honey in a small saucepan over medium or in a microwave-safe bowl, stirring occasionally, until butter is melted. Pulse graham crackers in a food processor until fine crumbs form. With the motor running, drizzle in butter-honey mixture and process until well combined. Transfer mixture to a medium bowl.",
            "Using an electric mixer on high speed, beat cream cheese in a large bowl until creamy, about 3 minutes. Add condensed milk and cocoa powder and beat until smooth.",
            "Using a whisk or electric mixer on medium-high speed, whip cream in another medium bowl to stiff peaks. Gently fold into cocoa powder mixture.",
            "Line muffin pan with paper liners. Pour cocoa powder mixture into a pastry bag or plastic bag with the corner snipped off and pipe evenly into muffin cups. Top each with 1 1/2 Tbsp. cracker crumb mixture, breaking up crumbs to completely cover, then press down gently to adhere. Freeze until set, at least 3 hours.",
            "Heat corn syrup, sugar, and 1/4 cup water in a small saucepan over low until sugar is melted. Increase heat to medium and cook until an instant-read thermometer registers 240˚F, about 5 minutes.",
            "Meanwhile, using electric mixer on medium-high speed (or a stand mixer fitted with the whisk attachment), beat egg whites and cream of tartar in a large bowl until soft peaks form. Reduce mixer speed to low and carefully add sugar syrup to egg whites in a slow and steady stream. Increase speed to high and beat until mixture is light, glossy, and fluffy, 6–8 minutes.",
            "Remove pies from molds, turn upside down, and remove paper liners. Dollop each pie with meringue. Using kitchen torch, carefully torch fluff. Serve immediately or return to freezer until ready to serve.",
            "Do Ahead Pies (without topping) can be made 2 weeks ahead; cover and freeze. Pies (with topping) can be made 5 days ahead; keep frozen.",
            "Pies (without topping) can be made 2 weeks ahead; cover and freeze. Pies (with topping) can be made 5 days ahead; keep frozen."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5995c5077ab3b547b4e167a4/6:4/w_274%2Ch_169/Frozen-Mini-S'Mores-Pies-11082017.jpg"
    }
}