{
    "recipe": {
        "title": "Frozen Peaches With Strawberries and Mint ",
        "ingredients": [
            "3/4 cup sugar",
            "6 large ripe peaches (about 3 1/2 pounds total), halved, pits removed",
            "1 vanilla bean, split lengthwise",
            "3 sprigs spearmint or mint",
            "1 tablespoon fresh lemon juice",
            "1 cup small strawberries, halved lengthwise"
        ],
        "instructions": [
            "Sprinkle sugar evenly across bottom of a large straight-sided skillet or Dutch oven and place peaches, cut sides up, in a single layer on top. Scrape in vanilla seeds and add pod; scatter spearmint over. Pour in water to come halfway up sides of peaches. Bring to a very gentle simmer over low heat, stirring once or twice just to dissolve sugar. Cook peaches, turning once, until tender but not falling apart, 5–10 minutes. Let cool. Pluck out vanilla pod and spearmint from pot; discard. Stir in lemon juice. Remove skins from peaches (they should slip off easily). Transfer peaches, cut side down, to a 3-qt. shallow baking dish and pour poaching liquid over. Freeze until peaches are icy all the way through but still soft enough to cut with a spoon, 45–60 minutes (poaching liquid should be semifrozen and break into shards when scraped with a fork, just like granita). Scatter strawberries over peaches just before serving.",
            "Sprinkle sugar evenly across bottom of a large straight-sided skillet or Dutch oven and place peaches, cut sides up, in a single layer on top. Scrape in vanilla seeds and add pod; scatter spearmint over. Pour in water to come halfway up sides of peaches. Bring to a very gentle simmer over low heat, stirring once or twice just to dissolve sugar. Cook peaches, turning once, until tender but not falling apart, 5–10 minutes. Let cool.",
            "Pluck out vanilla pod and spearmint from pot; discard. Stir in lemon juice. Remove skins from peaches (they should slip off easily). Transfer peaches, cut side down, to a 3-qt. shallow baking dish and pour poaching liquid over. Freeze until peaches are icy all the way through but still soft enough to cut with a spoon, 45–60 minutes (poaching liquid should be semifrozen and break into shards when scraped with a fork, just like granita).",
            "Scatter strawberries over peaches just before serving.",
            "Do Ahead Peaches can be poached 1 day ahead. Let cool in poaching liquid; cover and chill.",
            "Peaches can be poached 1 day ahead. Let cool in poaching liquid; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/577d24464f2c1eb16e3d583e/6:4/w_274%2Ch_169/frozen-peaches-wiht-strawberries-and-mint-BA-070616.jpg"
    }
}