{
    "recipe": {
        "title": "Frozen Iced Coffee With Coffee Jelly ",
        "ingredients": [
            "1 (1/4-ounce) envelope powdered unflavored gelatin (about 1 tablespoon)",
            "2 cups freshly brewed hot coffee",
            "3 tablespoons sugar",
            "3/4 cup heavy cream",
            "1 teaspoon sugar",
            "1 teaspoon vanilla extract",
            "1 1/2 cups cooled coffee",
            "1/4 cup chocolate syrup",
            "1/4 cup heavy cream",
            "3 tablespoons sugar",
            "1 tablespoon vanilla extract",
            "Bubble tea or other wide straws"
        ],
        "instructions": [
            "Dissolve gelatin in 3 Tbsp. cool water in a small bowl. Let stand until bloomed, about 2 minutes.",
            "Meanwhile, combine hot coffee and sugar in a loaf pan or large resealable container. Gently stir gelatin mixture into coffee until combined (do not stir too vigorously or air bubbles will appear). Chill until firm, about 2 hours.",
            "Make the whipped cream: Using an electric mixer on medium-high speed or a whisk, whip cream in a large bowl until soft peaks form. Add sugar and vanilla and whip to medium peaks.",
            "Using an electric mixer on medium-high speed or a whisk, whip cream in a large bowl until soft peaks form. Add sugar and vanilla and whip to medium peaks.",
            "Make the frozen iced coffee: Blend coffee, syrup, cream, sugar, vanilla, and 3 cups ice in a blender until smooth.",
            "Blend coffee, syrup, cream, sugar, vanilla, and 3 cups ice in a blender until smooth.",
            "Assemble the drink: Cut coffee jelly into 3/4” cubes. Fill 4 tall glasses with 1/2 cup cubed coffee jelly each. Spoon 3 Tbsp. whipped cream over each and spread to create a solid layer of cream. Divide frozen iced coffee (about 1 cup each) among glasses on top of cream layer. Top with more whipped cream and serve immediately with bubble tea straws.",
            "Cut coffee jelly into 3/4” cubes. Fill 4 tall glasses with 1/2 cup cubed coffee jelly each. Spoon 3 Tbsp. whipped cream over each and spread to create a solid layer of cream. Divide frozen iced coffee (about 1 cup each) among glasses on top of cream layer. Top with more whipped cream and serve immediately with bubble tea straws."
        ],
        "picture_link": "https://assets.epicurious.com/photos/577ec50a6cd1d6f116956b72/6:4/w_274%2Ch_169/Frozen-Iced-Coffee-with-Coffee-Jelly-07072016.jpg",
        "color": 1173470
    }
}