{
    "recipe": {
        "title": "Fruit Salad with Fennel, Watercress, and Smoked Salt ",
        "ingredients": [
            "1/4 cup olive oil",
            "1 tablespoon fresh lemon juice",
            "1/4 teaspoon smoked or flaky sea salt",
            "1/4 small honeydew melon, rind removed, very thinly sliced",
            "1 pluot or plum, sliced into thin wedges",
            "1/2 cup halved pitted fresh cherries",
            "1/2 cup unseasoned rice vinegar",
            "1/2 small fennel bulb, thinly sliced",
            "1 cup torn frisée",
            "1 cup trimmed watercress",
            "2 medium ruby red grapefruits, peel and white pith removed, flesh sliced into 1/4\"-thick rounds",
            "Smoked or flaky sea salt",
            "Freshly ground black pepper"
        ],
        "instructions": [
            "For the vinaigrette: Whisk oil, lemon juice, and salt in a small bowl to combine; set aside.",
            "Whisk oil, lemon juice, and salt in a small bowl to combine; set aside.",
            "For the Salad: Toss melon, pluot, cherries, and vinegar in medium bowl. Let sit, tossing occasionally, until fruit is lightly pickled, 10–15 minutes; drain. Toss fennel, frisée, and watercress with half of vinaigrette in a large bowl. Arrange grapefruits on a serving platter; sprinkle with smoked salt. Top with pickled fruit and scatter dressed fennel salad over. Serve salad drizzled with remaining lemon vinaigrette and sprinkled with smoked salt and pepper.",
            "Toss melon, pluot, cherries, and vinegar in medium bowl. Let sit, tossing occasionally, until fruit is lightly pickled, 10–15 minutes; drain.",
            "Toss fennel, frisée, and watercress with half of vinaigrette in a large bowl. Arrange grapefruits on a serving platter; sprinkle with smoked salt. Top with pickled fruit and scatter dressed fennel salad over.",
            "Serve salad drizzled with remaining lemon vinaigrette and sprinkled with smoked salt and pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5580687d81ac1e50236769f1/6:4/w_274%2Ch_169/56389670_fruit-salad-fennel-watercress_1x1.jpg"
    }
}