{
    "recipe": {
        "title": "Fudgy Double-Chocolate Brownies ",
        "ingredients": [
            "1 1/2 cups (3 sticks) unsalted butter, plus more for pan, if needed",
            "12 ounces bittersweet chocolate (about 70 percent), chopped",
            "3 tablespoons unsweetened cocoa powder, sifted",
            "6 large eggs, at room temperature",
            "3 cups sugar",
            "1 1/2 teaspoons salt",
            "2 1/4 cups cake flour",
            "A 13x9\" baking pan"
        ],
        "instructions": [
            "Preheat oven to 325°F. Grease a 13x9\" baking pan with room temperature butter or nonstick cooking spray, line the bottom with parchment, leaving a generous overhang on both long sides, and grease parchment with room temperature butter or nonstick cooking spray. Combine 1 1/2 cups butter, chocolate, and cocoa powder in a large heatproof bowl set over a pot of simmering water, stirring often, until mixture is melted and smooth. Remove from heat and set aside. Whip eggs, sugar, and salt in bowl of a stand mixer fitted with the whisk attachment (or using a hand mixer) on high speed, until tripled in size and lightened in color, 4–5 minutes. When you lift the whisk, the mixture should fall back on itself in thick ribbons and dissipate. Add one-third egg mixture to reserved chocolate mixture and stir to combine with a spatula. Fold in remaining egg mixture in 2 batches. Sift in flour in three parts, gently folding with spatula after each addition. Pour evenly into prepared pan. Smooth top of batter with spatula. Bake brownies, rotating in oven halfway through, until sides are visibly baked and center is set, 50–55 minutes. Transfer to a wire rack. After brownies have cooled, loosen edges with an offset spatula or a butter knife, then pull up both sides of the parchment to remove brownies from pan. Place brownies on parchment on a cutting board and cut into 15–18 pieces.",
            "Preheat oven to 325°F. Grease a 13x9\" baking pan with room temperature butter or nonstick cooking spray, line the bottom with parchment, leaving a generous overhang on both long sides, and grease parchment with room temperature butter or nonstick cooking spray.",
            "Combine 1 1/2 cups butter, chocolate, and cocoa powder in a large heatproof bowl set over a pot of simmering water, stirring often, until mixture is melted and smooth. Remove from heat and set aside.",
            "Whip eggs, sugar, and salt in bowl of a stand mixer fitted with the whisk attachment (or using a hand mixer) on high speed, until tripled in size and lightened in color, 4–5 minutes. When you lift the whisk, the mixture should fall back on itself in thick ribbons and dissipate.",
            "Add one-third egg mixture to reserved chocolate mixture and stir to combine with a spatula. Fold in remaining egg mixture in 2 batches. Sift in flour in three parts, gently folding with spatula after each addition. Pour evenly into prepared pan. Smooth top of batter with spatula.",
            "Bake brownies, rotating in oven halfway through, until sides are visibly baked and center is set, 50–55 minutes. Transfer to a wire rack. After brownies have cooled, loosen edges with an offset spatula or a butter knife, then pull up both sides of the parchment to remove brownies from pan. Place brownies on parchment on a cutting board and cut into 15–18 pieces."
        ],
        "picture_link": "https://assets.epicurious.com/photos/550c2fb4b1a50e633781bb34/6:4/w_274%2Ch_169/EP-20150319-brownies-inset-hires.jpg"
    }
}