{
    "recipe": {
        "title": "Full Moon Chocolate Zucchini Cake ",
        "ingredients": [
            "3 1/2 oz. white sugar",
            "2 1/4 oz. brown sugar",
            "3 1/2 oz. butter",
            "2 tablespoons vegetable oil",
            "1/2 teaspoon vanilla extract",
            "2 eggs",
            "7 oz. flour",
            "1/2 oz. moon-charged unsweetened cocoa powder",
            "1/2 teaspoon baking soda",
            "1/4 teaspoon ground cinnamon",
            "3 tablespoons buttermilk (or mix 1/4 teaspoon lemon juice or vinegar with milk and leave to stand for 5 minutes before using)",
            "5 oz. shredded zucchini",
            "3 oz. (or more to taste) plain chocolate chips",
            "confectioners’ sugar (for dusting)",
            "10 in. round cake tin (greased)",
            "Moon-phase stencil"
        ],
        "instructions": [
            "Preheat your oven to 325°F. In large bowl, combine the white and brown sugars, butter, oil, vanilla, and eggs. Beat well. Next, add the flour, cocoa, baking soda, cinnamon, and buttermilk, blending well with an electric mixer. Now add the shredded zucchini and chocolate chips, mixing well by hand. Spread the mixture in the greased pan, and bake in the preheated oven for 30–40 minutes or until a toothpick comes out clean when poked into the mixture. Cool completely. To make the stencil, trace shapes reflecting the phases of the moon onto a parchment round that is the same circumference as your cake (see photo for shape references) and carefully cut these out with scissors or a craft knife. Lay on top of the cooled cake and sprinkle confectioners’ sugar on top.",
            "Preheat your oven to 325°F.",
            "In large bowl, combine the white and brown sugars, butter, oil, vanilla, and eggs. Beat well. Next, add the flour, cocoa, baking soda, cinnamon, and buttermilk, blending well with an electric mixer.",
            "Now add the shredded zucchini and chocolate chips, mixing well by hand. Spread the mixture in the greased pan, and bake in the preheated oven for 30–40 minutes or until a toothpick comes out clean when poked into the mixture. Cool completely.",
            "To make the stencil, trace shapes reflecting the phases of the moon onto a parchment round that is the same circumference as your cake (see photo for shape references) and carefully cut these out with scissors or a craft knife. Lay on top of the cooled cake and sprinkle confectioners’ sugar on top."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c6487299d31f0719380abf6/6:4/w_274%2Ch_169/full-moon-chocolate-zucchini-cake-recipe-HC-021119.jpg"
    }
}