{
    "recipe": {
        "title": "Galangal-Braised Pork Belly With Trout Roe ",
        "ingredients": [
            "1/2 cup white miso",
            "3 tablespoons kosher salt",
            "2 tablespoons mild honey (such as clover or alfalfa)",
            "1 1/2 pound skinless pork belly",
            "1 1/2 cups sugar",
            "1/3 cup fresh lime juice",
            "1 2\" piece galangal or ginger, peeled, chopped",
            "1 cup coarsely chopped kimchi",
            "1 cup nasturtium leaves or trimmed watercress",
            "1 ounce trout roe (optional)",
            "Flaky sea salt"
        ],
        "instructions": [
            "Whisk miso, kosher salt, honey, and 1/2 cup water in a medium bowl until smooth. Gradually whisk in another 1/2 cup water; add pork belly. Cover and chill 3 days.",
            "Preheat oven to 325°F. Blend sugar, lime juice, galangal, and 1 1/2 cups water in a blender until smooth. Remove pork from brine and rinse off; discard brine. Place pork and galangal syrup in a large heavy pot. Cover pot, transfer to oven, and braise pork until tender and nearly falling apart, 3–3 1/2 hours.",
            "Remove pork from braising liquid and transfer to a rimmed baking sheet or large baking dish; chill until firm, at least 3 hours. Cover braising liquid and let sit at room temperature.",
            "Reheat oven to 325°F. Skim fat from braising liquid. Thinly slice pork belly lengthwise 1/4–1/8\" thick to make baconlike strips. Place pork slices on a clean rimmed baking sheet and spoon some braising liquid over. Roast until pork is warmed through, 8–10 minutes.",
            "Divide kimchi among plates. Top with pork. Scatter nasturtium leaves and roe, if using, over top. Sprinkle with sea salt.",
            "Do Ahead Pork can be braised 2 days ahead. Keep chilled; chill braising liquid separately.",
            "Pork can be braised 2 days ahead. Keep chilled; chill braising liquid separately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55db8a35edfa3b005396a54b/6:4/w_274%2Ch_169/56389982_galangal-braised-pork-belly.jpg",
        "color": 9220540
    }
}