{
    "recipe": {
        "title": "Garlic Broth ",
        "ingredients": [
            "2 heads of garlic",
            "2 Tbsp. extra-virgin olive oil, plus more for drizzling",
            "A handful of herbs (such as parsley, cilantro, and/or sage)",
            "Kosher salt, freshly ground pepper"
        ],
        "instructions": [
            "Slice 1 head of garlic in half crosswise; set aside. Separate cloves from remaining head, peel, and crush lightly. Heat 2 Tbsp. oil in a large saucepan over medium. Add crushed garlic cloves and cook, tossing occasionally, until golden brown and softened, 8–10 minutes. Add 2 quarts water, increase heat to high, and bring mixture to a boil. Add herbs and reserved halved head of garlic. Reduce heat so broth is at an active simmer and cook until garlic is very tender and broth is reduced by nearly half, 30–40 minutes. Season generously with salt and pepper. Strain broth through a mesh sieve into a large bowl (or, pass a wide slotted spoon through it a few times to fish out garlic and herbs). Divide broth among bowls. Sip it as is, or you can add cooked noodles, drizzle in some whisked eggs to make stracciatella, or rub toast with raw garlic and drizzle with oil and float on top.",
            "Slice 1 head of garlic in half crosswise; set aside. Separate cloves from remaining head, peel, and crush lightly. Heat 2 Tbsp. oil in a large saucepan over medium. Add crushed garlic cloves and cook, tossing occasionally, until golden brown and softened, 8–10 minutes. Add 2 quarts water, increase heat to high, and bring mixture to a boil. Add herbs and reserved halved head of garlic. Reduce heat so broth is at an active simmer and cook until garlic is very tender and broth is reduced by nearly half, 30–40 minutes. Season generously with salt and pepper.",
            "Strain broth through a mesh sieve into a large bowl (or, pass a wide slotted spoon through it a few times to fish out garlic and herbs).",
            "Divide broth among bowls. Sip it as is, or you can add cooked noodles, drizzle in some whisked eggs to make stracciatella, or rub toast with raw garlic and drizzle with oil and float on top.",
            "Do Ahead Broth can be made 3 days ahead. Let cool; cover and chill.",
            "Broth can be made 3 days ahead. Let cool; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ac27191e4c9f0030123afd4/6:4/w_274%2Ch_169/vegetarian-garlic-broth-recipe-BA-032918.jpg"
    }
}