{
    "recipe": {
        "title": "Giant Chocolate Cake with Bittersweet Chocolate Ganache and Edible Flowers ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "2 cups flour",
            "1 teaspoon baking soda",
            "1 teaspoon baking powder",
            "1/2 teaspoon salt",
            "1 cup plus 3 tablespoons unsweetened cocoa powder",
            "1 cup boiling water",
            "2 cups sugar",
            "3 large eggs",
            "3/4 cup (1 1/2 sticks) unsalted butter, room temperature, cut into 1-inch pieces",
            "1 cup buttermilk",
            "1 teaspoon vanilla extract",
            "5 ounces unsweetened chocolate, chopped",
            "1/4 cup (1/2 stick) chilled butter, cut into 1/2-inch cubes",
            "1 teaspoon vanilla extract",
            "3/4 cup heavy whipping cream",
            "3/4 cup sugar",
            "Edible flowers* (for decoration)",
            "1 12-inch round cake pan with 2-inch-high sides"
        ],
        "instructions": [
            "For cake: Preheat oven to 350°F. Spray 12-inch round cake pan with 2-inch-high sides with nonstick spray. Line bottom of pan with parchment paper round. Spray parchment paper with nonstick spray. Dust pan with flour, tapping out any excess. Sift 2 cups flour, baking soda, baking powder, and salt into medium bowl. Sift cocoa into another medium bowl. Pour 1 cup boiling water over cocoa; whisk to blend. Using electric mixer, beat sugar and eggs in large bowl until light and fluffy, about 2 minutes. Add butter to egg mixture and beat until blended. Beat in cocoa mixture. Add buttermilk and vanilla; beat to blend. Add dry ingredients and beat on low just to blend. Transfer batter to prepared pan; smooth top. Bake cake until tester inserted into center comes out clean, about 38 minutes. Cool cake completely in pan on rack. DO AHEAD: Can be made 1 day ahead. Cover and let stand at room temperature.",
            "Preheat oven to 350°F. Spray 12-inch round cake pan with 2-inch-high sides with nonstick spray. Line bottom of pan with parchment paper round. Spray parchment paper with nonstick spray. Dust pan with flour, tapping out any excess. Sift 2 cups flour, baking soda, baking powder, and salt into medium bowl. Sift cocoa into another medium bowl. Pour 1 cup boiling water over cocoa; whisk to blend. Using electric mixer, beat sugar and eggs in large bowl until light and fluffy, about 2 minutes. Add butter to egg mixture and beat until blended. Beat in cocoa mixture. Add buttermilk and vanilla; beat to blend. Add dry ingredients and beat on low just to blend. Transfer batter to prepared pan; smooth top.",
            "Bake cake until tester inserted into center comes out clean, about 38 minutes. Cool cake completely in pan on rack. DO AHEAD: Can be made 1 day ahead. Cover and let stand at room temperature.",
            "Place chopped chocolate, butter, and vanilla in medium bowl. Bring cream and sugar to boil in medium saucepan, stirring to dissolve sugar. Carefully pour hot cream mixture into bowl with chocolate. Let stand 1 minute. Whisk until melted and smooth. Chill ganache until thickened and spreadable, about 1 hour. Carefully invert cake onto large cake plate. Gently remove parchment paper. Spread ganache over top and sides of cake and allow ganache to set, about 1 hour. DO AHEAD: Cake can be made 1 day ahead. Cover with cake dome and refrigerate. Let stand at room temperature 1 hour before decorating. Decorate cake with edible flowers. Cut into wedges and serve. Available at some supermarkets and at farmers' markets. Use only those flowers that have been grown without pesticides.",
            "Place chopped chocolate, butter, and vanilla in medium bowl. Bring cream and sugar to boil in medium saucepan, stirring to dissolve sugar. Carefully pour hot cream mixture into bowl with chocolate. Let stand 1 minute. Whisk until melted and smooth. Chill ganache until thickened and spreadable, about 1 hour.",
            "Carefully invert cake onto large cake plate. Gently remove parchment paper. Spread ganache over top and sides of cake and allow ganache to set, about 1 hour. DO AHEAD: Cake can be made 1 day ahead. Cover with cake dome and refrigerate. Let stand at room temperature 1 hour before decorating.",
            "Decorate cake with edible flowers. Cut into wedges and serve.",
            "Available at some supermarkets and at farmers' markets. Use only those flowers that have been grown without pesticides.",
            "Available at some supermarkets and at farmers' markets. Use only those flowers that have been grown without pesticides."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a5966a59cdb91b5ff544/6:4/w_274%2Ch_169/353421_hires.jpg"
    }
}