{
    "recipe": {
        "title": "Gingerbread Truffles ",
        "ingredients": [
            "3/4 cup whipping cream",
            "10 whole allspice",
            "10 whole cloves",
            "1 tablespoon mild-flavored (light) molasses",
            "1 1/2 teaspoons grated peeled fresh ginger",
            "1/2 teaspoon ground cinnamon",
            "Pinch of salt",
            "7 ounces plus 12 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
            "7 ounces plus 12 ounces high-quality white chocolate (such as Lindt or Perugina), chopped",
            "1/2 cup chopped crystallized ginger plus additional for garnish"
        ],
        "instructions": [
            "Bring first 7 ingredients just to boil in heavy medium saucepan; remove from heat and let steep 1 hour. Combine 7 ounces bittersweet chocolate and 7 ounces white chocolate in large metal bowl set over saucepan of simmering water; stir until chocolate is melted and smooth. Remove bowl from over water. Strain cream mixture into chocolate; stir to blend. Stir in 1/2 cup chopped crystallized ginger. Chill filling until firm, at least 3 hours. Line baking sheet with parchment. Using 1-inch melon baller, scoop filling and roll between palms to form balls. Place on parchment. Chill truffles at least 2 hours. Line another sheet with parchment. Place 12 ounces bittersweet chocolate in medium metal bowl set over saucepan of simmering water; stir until chocolate is melted and smooth. Remove bowl from over water. Cool until thermometer inserted into chocolate registers 115°F. Quickly submerge 1 truffle in chocolate. Using fork, lift out truffle and tap fork against side of bowl so excess coating drips off. Using knife, slide truffle off fork and onto prepared sheet. Repeat with remaining truffles. Chill until set. Line another baking sheet with parchment. Place 12 ounces white chocolate in another medium metal bowl set over saucepan of simmering water; stir until melted and smooth. Remove bowl from over water. Cool until thermometer inserted into chocolate registers 100°F. Hold 1 truffle between thumb and index finger; dip halfway into white chocolate. Place on prepared sheet. Repeat with remaining truffles. If desired, press small pieces of crystallized ginger atop truffles. Chill until firm, about 30 minutes. (Can be made 1 week ahead. Cover; keep chilled.)",
            "Bring first 7 ingredients just to boil in heavy medium saucepan; remove from heat and let steep 1 hour.",
            "Combine 7 ounces bittersweet chocolate and 7 ounces white chocolate in large metal bowl set over saucepan of simmering water; stir until chocolate is melted and smooth. Remove bowl from over water. Strain cream mixture into chocolate; stir to blend. Stir in 1/2 cup chopped crystallized ginger. Chill filling until firm, at least 3 hours.",
            "Line baking sheet with parchment. Using 1-inch melon baller, scoop filling and roll between palms to form balls. Place on parchment. Chill truffles at least 2 hours.",
            "Line another sheet with parchment. Place 12 ounces bittersweet chocolate in medium metal bowl set over saucepan of simmering water; stir until chocolate is melted and smooth. Remove bowl from over water. Cool until thermometer inserted into chocolate registers 115°F. Quickly submerge 1 truffle in chocolate. Using fork, lift out truffle and tap fork against side of bowl so excess coating drips off. Using knife, slide truffle off fork and onto prepared sheet. Repeat with remaining truffles. Chill until set.",
            "Line another baking sheet with parchment. Place 12 ounces white chocolate in another medium metal bowl set over saucepan of simmering water; stir until melted and smooth. Remove bowl from over water. Cool until thermometer inserted into chocolate registers 100°F. Hold 1 truffle between thumb and index finger; dip halfway into white chocolate. Place on prepared sheet. Repeat with remaining truffles. If desired, press small pieces of crystallized ginger atop truffles. Chill until firm, about 30 minutes. (Can be made 1 week ahead. Cover; keep chilled.)"
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de6067b55306961bfd960/6:4/w_274%2Ch_169/233424.jpg"
    }
}