{
    "recipe": {
        "title": "Gingerbread Squares with Honey-Mascarpone Cream ",
        "ingredients": [
            "1 8-ounce package mascarpone cheese *",
            "2 tablespoons honey",
            "1 tablespoon fresh lemon juice",
            "1 1/4 cups all purpose flour",
            "2 teaspoons ground ginger",
            "1 teaspoon ground cinnamon",
            "1 teaspoon baking soda",
            "1/4 teaspoon ground cloves",
            "1/4 teaspoon salt",
            "1/4 cup finely chopped crystallized ginger",
            "1/2 cup vegetable oil",
            "1/2 cup mild-flavored (light) molasses",
            "1/2 cup (packed) dark brown sugar",
            "1 large egg",
            "1 1/2 teaspoons grated lemon peel",
            "1/2 cup boiling water",
            "Powdered sugar"
        ],
        "instructions": [
            "Whisk mascarpone cheese, honey, and lemon juice in small bowl to blend. Cover; chill until ready to serve. (Can be made 1 day ahead; keep chilled.)",
            "For cake: Preheat oven to 350°F. Butter and flour 8-inch square metal baking pan. Whisk first 6 ingredients in medium bowl to blend well; whisk in crystallized ginger. Whisk oil, molasses, and brown sugar in large bowl to blend; whisk in egg and lemon peel. Gradually whisk in dry ingredients, then boiling water. Transfer batter to prepared pan. Bake cake until tester inserted into center comes out clean, about 30 minutes. Cool cake 15 minutes. (Can be made 1 day ahead. Cool completely; cover and store at room temperature.) Cut cake into squares; sift powdered sugar over. Serve warm or at room temperature with topping.",
            "Preheat oven to 350°F. Butter and flour 8-inch square metal baking pan. Whisk first 6 ingredients in medium bowl to blend well; whisk in crystallized ginger. Whisk oil, molasses, and brown sugar in large bowl to blend; whisk in egg and lemon peel. Gradually whisk in dry ingredients, then boiling water. Transfer batter to prepared pan.",
            "Bake cake until tester inserted into center comes out clean, about 30 minutes. Cool cake 15 minutes. (Can be made 1 day ahead. Cool completely; cover and store at room temperature.) Cut cake into squares; sift powdered sugar over. Serve warm or at room temperature with topping.",
            "Italian cream cheese available at Italian markets and many supermarkets.",
            "Italian cream cheese available at Italian markets and many supermarkets.",
            "Italian cream cheese available at Italian markets and many supermarkets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea8987b55306961bff7f4/6:4/w_274%2Ch_169/105842.jpg",
        "color": 11741957
    }
}