{
    "recipe": {
        "title": "Gingerbread Angels ",
        "ingredients": [
            "6 cups all purpose flour",
            "1 tablespoon ground ginger",
            "1 tablespoon ground cinnamon",
            "2 teaspoons baking soda",
            "1 teaspoon salt",
            "1/2 cup coarsely chopped crystallized ginger (about 3 ounces)",
            "1 cup (2 sticks) unsalted butter, room temperature",
            "1 cup sugar",
            "1/2 cup (packed) golden brown sugar",
            "2 large eggs",
            "1/4 cup mild-flavored (light) molasses",
            "1/4 cup fresh orange juice",
            "2 teaspoons finely grated orange peel",
            "1 egg white, beaten with 1 tablespoon water (for glaze; optional)",
            "Raw sugar and/or colored sugar (optional)"
        ],
        "instructions": [
            "Whisk flour, ground ginger, cinnamon, soda, and salt in large bowl. Place crystallized ginger in mini processor; add 1 tablespoon flour mixture and blend until ginger is very finely chopped. Using electric mixer, beat butter in another large bowl until smooth. Add 1 cup sugar and 1/2 cup brown sugar; beat until light and fluffy. Beat in eggs, 1 at a time. Beat in molasses, orange juice, and orange peel (batter may look curdled). Beat in crystallized ginger mixture. Blend in remaining flour-spice mixture. Gather dough together. Flatten into disk. Wrap in plastic; chill at least 4 hours. Position 1 rack in top third and 1 rack in bottom third of oven; preheat to 350°F. Line 2 baking sheets with parchment. Divide dough into 4 portions; shape each into round. Chill 3 rounds. Roll out remaining dough round on floured work surface to generous 1/8-inch thickness. Using floured angel-shaped cookie cutter, cut out cookies. Gather dough scraps and reroll to generous 1/8-inch thickness; cut out more cookies. Using spatula, transfer cookies to sheets, spacing 1 inch apart. Brush cookies with glaze, then sprinkle with raw sugar and/or colored sugar, if desired. Bake cookies until golden, reversing sheets after 7 minutes, about 14 minutes total. Let stand 2 minutes; transfer to racks to cool. Repeat with remaining dough, cooling baking sheets between batches. DO AHEAD: Can be made 1 week ahead. Store between sheets of waxed paper in airtight container.",
            "Whisk flour, ground ginger, cinnamon, soda, and salt in large bowl. Place crystallized ginger in mini processor; add 1 tablespoon flour mixture and blend until ginger is very finely chopped. Using electric mixer, beat butter in another large bowl until smooth. Add 1 cup sugar and 1/2 cup brown sugar; beat until light and fluffy. Beat in eggs, 1 at a time. Beat in molasses, orange juice, and orange peel (batter may look curdled). Beat in crystallized ginger mixture. Blend in remaining flour-spice mixture. Gather dough together. Flatten into disk. Wrap in plastic; chill at least 4 hours.",
            "Position 1 rack in top third and 1 rack in bottom third of oven; preheat to 350°F. Line 2 baking sheets with parchment. Divide dough into 4 portions; shape each into round. Chill 3 rounds. Roll out remaining dough round on floured work surface to generous 1/8-inch thickness. Using floured angel-shaped cookie cutter, cut out cookies. Gather dough scraps and reroll to generous 1/8-inch thickness; cut out more cookies. Using spatula, transfer cookies to sheets, spacing 1 inch apart. Brush cookies with glaze, then sprinkle with raw sugar and/or colored sugar, if desired.",
            "Bake cookies until golden, reversing sheets after 7 minutes, about 14 minutes total. Let stand 2 minutes; transfer to racks to cool. Repeat with remaining dough, cooling baking sheets between batches. DO AHEAD: Can be made 1 week ahead. Store between sheets of waxed paper in airtight container."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5661a96287cc73f607397c5f/6:4/w_274%2Ch_169/1208-BA-FOD4-01.jpg"
    }
}