{
    "recipe": {
        "title": "Ginger Flank Steak with Sake-Glazed Vegetables ",
        "ingredients": [
            "1/2 cup soy sauce",
            "1/2 cup sake",
            "1/4 cup (packed) dark brown sugar",
            "3 tablespoons minced peeled fresh ginger",
            "1 tablespoon balsamic vinegar",
            "4 garlic cloves, crushed",
            "1 2-pound flank steak",
            "1 pound asparagus, trimmed, cut into 1 1/2-inch lengths",
            "3 tablespoons peanut oil",
            "2 red bell peppers, cut into 1-inch-wide strips",
            "1 1/2 pounds crimini mushrooms, halved, each half cut crosswise into 1/4-inch-thick slices",
            "4 green onions, cut into 1-inch lengths",
            "2 teaspoons cornstarch"
        ],
        "instructions": [
            "Combine first 6 ingredients in 13x9x2-inch glass baking dish. Add meat. Cover and refrigerate at least 2 hours and up to 1 day. Let stand at room temperature 1 hour before continuing. Cook asparagus in large pot of boiling salted water until crisp-tender, about 4 minutes. Drain. Rinse under cold water to cool. Drain again. Heat 2 tablespoons peanut oil in heavy large skillet over medium-high heat. Add red bell pepper strips and sauté 3 minutes. Add crimini mushrooms and sauté until mushrooms are soft, about 5 minutes. Add green onions and asparagus and sauté until vegetables are tender, about 2 minutes longer. Transfer vegetables to serving platter. Tent with foil to keep warm. Heat remaining 1 tablespoon peanut oil in same skillet over high heat. Remove steak from marinade; reserve marinade. Add steak to skillet and cook to desired doneness, about 4 minutes per side for medium-rare. Transfer to cutting board. Tent with foil and let stand 5 minutes. Meanwhile, place reserved marinade in small saucepan. Whisk in cornstarch. Whisk over high heat until sauce thickens and boils, about 3 minutes. Remove sauce from heat. Season sauce to taste with salt and pepper. Cut steak across grain on diagonal into 1/2-inch-thick slices. Arrange steak slices atop vegetables on platter. Spoon some of sauce over meat and vegetables. Serve, passing remaining sauce separately.",
            "Combine first 6 ingredients in 13x9x2-inch glass baking dish. Add meat. Cover and refrigerate at least 2 hours and up to 1 day. Let stand at room temperature 1 hour before continuing.",
            "Cook asparagus in large pot of boiling salted water until crisp-tender, about 4 minutes. Drain. Rinse under cold water to cool. Drain again.",
            "Heat 2 tablespoons peanut oil in heavy large skillet over medium-high heat. Add red bell pepper strips and sauté 3 minutes. Add crimini mushrooms and sauté until mushrooms are soft, about 5 minutes. Add green onions and asparagus and sauté until vegetables are tender, about 2 minutes longer. Transfer vegetables to serving platter. Tent with foil to keep warm.",
            "Heat remaining 1 tablespoon peanut oil in same skillet over high heat. Remove steak from marinade; reserve marinade. Add steak to skillet and cook to desired doneness, about 4 minutes per side for medium-rare. Transfer to cutting board. Tent with foil and let stand 5 minutes.",
            "Meanwhile, place reserved marinade in small saucepan. Whisk in cornstarch. Whisk over high heat until sauce thickens and boils, about 3 minutes. Remove sauce from heat. Season sauce to taste with salt and pepper.",
            "Cut steak across grain on diagonal into 1/2-inch-thick slices. Arrange steak slices atop vegetables on platter. Spoon some of sauce over meat and vegetables. Serve, passing remaining sauce separately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea0ab7b55306961bfeea9/6:4/w_274%2Ch_169/106314.jpg"
    }
}