{
    "recipe": {
        "title": "Ginger Scones ",
        "ingredients": [
            "2 1/4 cups all purpose flour",
            "1/3 cup sugar",
            "1 tablespoon baking powder",
            "1/4 teaspoon grated lemon peel",
            "11 tablespoons chilled unsalted butter, cut into small pieces",
            "3/4 cup plus 2 tablespoons whipping cream",
            "2/3 cup diced crystallized ginger"
        ],
        "instructions": [
            "Preheat oven to 400°F Lightly butter baking sheet. Blend flour, sugar, baking powder and lemon peel in processor. Add butter and cut in using on/off turns until mixture resembles coarse meal. Transfer mixture to large bowl. Make well in center; add 3/4 cup cream. Using fork, stir until just moist. Mix in ginger. Transfer dough to floured surface and gently knead until smooth, about 8 turns. Divide dough in half; pat each portion into 3/4-inch-thick round. Cut each round into 6 wedges and transfer to prepared baking sheet, spacing 1 inch apart. Brush tops with remaining 2 tablespoons cream. Bake scones until light brown, about 18 minutes. (Can be made 1 day ahead. Cool completely. Store in airtight container at room temperature. Rewarm in 350°F oven before serving.)",
            "Preheat oven to 400°F Lightly butter baking sheet. Blend flour, sugar, baking powder and lemon peel in processor. Add butter and cut in using on/off turns until mixture resembles coarse meal. Transfer mixture to large bowl. Make well in center; add 3/4 cup cream. Using fork, stir until just moist. Mix in ginger. Transfer dough to floured surface and gently knead until smooth, about 8 turns. Divide dough in half; pat each portion into 3/4-inch-thick round. Cut each round into 6 wedges and transfer to prepared baking sheet, spacing 1 inch apart. Brush tops with remaining 2 tablespoons cream.",
            "Bake scones until light brown, about 18 minutes. (Can be made 1 day ahead. Cool completely. Store in airtight container at room temperature. Rewarm in 350°F oven before serving.)"
        ],
        "picture_link": null
    }
}