{
    "recipe": {
        "title": "Gingerbread Cake ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "1 1/2 cups all-purpose flour",
            "1 teaspoon ground ginger",
            "3/4 teaspoon ground cinnamon",
            "3/4 teaspoon kosher salt",
            "1/2 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "1/2 cup (1 stick) unsalted butter, cut into 1/2\" pieces",
            "1/2 cup (packed) light brown sugar",
            "1/2 cup mild-flavored (light) molasses",
            "1 large egg, beaten to blend",
            "2 teaspoons grated peeled ginger",
            "1 cup chilled heavy cream",
            "1 tablespoon powdered sugar",
            "1/4 cup store-bought lemon curd",
            "Finely grated lemon zest",
            "An 8\" square metal cake pan"
        ],
        "instructions": [
            "For cake: Preheat oven to 350°F. Coat pan with nonstick spray. Line bottom with parchment paper; spray paper. Whisk flour and next 5 ingredients in a medium bowl. Place butter in a large bowl. Pour 1/2 cup boiling water over; whisk until melted. Whisk in sugar and next 3 ingredients. Add dry ingredients; whisk to blend. Transfer to prepared pan. Bake until a tester inserted into center of cake comes out clean, about 25 minutes. Let cool in pan for 10 minutes. Invert onto a wire rack; let cool. Remove parchment.",
            "Preheat oven to 350°F. Coat pan with nonstick spray. Line bottom with parchment paper; spray paper. Whisk flour and next 5 ingredients in a medium bowl. Place butter in a large bowl. Pour 1/2 cup boiling water over; whisk until melted. Whisk in sugar and next 3 ingredients. Add dry ingredients; whisk to blend. Transfer to prepared pan.",
            "Bake until a tester inserted into center of cake comes out clean, about 25 minutes. Let cool in pan for 10 minutes. Invert onto a wire rack; let cool. Remove parchment.",
            "For topping: Beat cream and sugar in a medium bowl until firm peaks form. Fold in curd, leaving swirls. Spread over cake. Garnish with zest.",
            "Beat cream and sugar in a medium bowl until firm peaks form. Fold in curd, leaving swirls. Spread over cake. Garnish with zest."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b288f19a93d64c380b2091/6:4/w_274%2Ch_169/368939_gingerbread-cake_1x1.jpg"
    }
}