{
    "recipe": {
        "title": "Gingersnap Cookies (Bubbee's Gingies) ",
        "ingredients": [
            "1 cup unsalted butter, softened",
            "1 1/2 cups granulated sugar plus additional for sprinkling",
            "1 large egg",
            "2 tablespoons finely grated peeled fresh gingerroot",
            "2 tablespoons dark corn syrup",
            "1 1/2 teaspoons freshly grated orange zest",
            "1 tablespoon fresh orange juice",
            "3 1/4 cups unbleached all-purpose flour",
            "2 teaspoons baking soda",
            "2 teaspoons ground cinnamon",
            "1/2 teaspoon ground cloves",
            "1 tablespoon ground ginger"
        ],
        "instructions": [
            "In a bowl with an electric mixer beat butter with 1 1/2 cups sugar until light and fluffy and add egg, beating until combined well. Beat in fresh gingerroot, corn syrup, zest, and orange juice. Into mixture sift remaining ingredients and beat just until combined well. Halve dough and on a sheet of wax paper form each piece into a 10-inch log. Chill logs, wrapped in wax paper, at least 1 day and up to 1 week. Preheat oven to 350°F. and lightly grease baking sheets. Cut logs into 1/4-inch-thick slices and arrange 2 inches apart on baking sheets. Lightly sprinkle cookies with additional sugar and bake in batches in middle of oven 10 to 15 minutes, or until golden. Transfer cookies to racks to cool. Makes about 80 cookies.",
            "In a bowl with an electric mixer beat butter with 1 1/2 cups sugar until light and fluffy and add egg, beating until combined well. Beat in fresh gingerroot, corn syrup, zest, and orange juice. Into mixture sift remaining ingredients and beat just until combined well.",
            "Halve dough and on a sheet of wax paper form each piece into a 10-inch log. Chill logs, wrapped in wax paper, at least 1 day and up to 1 week.",
            "Preheat oven to 350°F. and lightly grease baking sheets.",
            "Cut logs into 1/4-inch-thick slices and arrange 2 inches apart on baking sheets. Lightly sprinkle cookies with additional sugar and bake in batches in middle of oven 10 to 15 minutes, or until golden. Transfer cookies to racks to cool. Makes about 80 cookies."
        ],
        "picture_link": null
    }
}