{
    "recipe": {
        "title": "Ginger and Almond Bars ",
        "ingredients": [
            "3 tablespoons (45 g) unsalted butter",
            "1 3/4 cups (165 g) almond meal (also called almond flour or almond powder)",
            "2 tablespoons peeled and grated fresh ginger",
            "3 tablespoons mild honey, such as clover",
            "1 large egg, free-range and organic, lightly beaten",
            "1/2 teaspoon fine sea salt",
            "1 teaspoon pure vanilla extract",
            "4 tablespoons (60 g) unsalted butter",
            "1 cup (80 g) sliced almonds",
            "1/3 cup (45 g) minced candied ginger",
            "1/3 cup (80 ml) mild honey, such as clover",
            "1/4 teaspoon fine sea salt",
            "1 teaspoon pure vanilla extract",
            "A 9-1/2-inch (24 cm) square baking pan; baking parchment; a 2-quart (2 l) saucepan; a baking rack."
        ],
        "instructions": [
            "Center a rack in the oven. Preheat the oven to 400°F (200°C). Line the pan with baking parchment, letting the parchment hang over the sides. (This will make it easier to remove the dessert once baked.)",
            "Prepare the base: In the saucepan, melt the butter. Add the almond meal, fresh ginger, honey, egg, salt, and vanilla. Stir until well combined. The mixture should be thick and sticky. Turn the mixture out into the prepared pan. To help make a level and even base, place a piece of plastic wrap on top of the base. Using a flat-bottomed glass (or your fingers), smooth out the base by pressing gently to evenly cover the bottom of the pan. Remove and discard the plastic wrap. Bake until the base is slightly firm, 12 to 15 minutes.",
            "In the saucepan, melt the butter. Add the almond meal, fresh ginger, honey, egg, salt, and vanilla. Stir until well combined. The mixture should be thick and sticky.",
            "Turn the mixture out into the prepared pan. To help make a level and even base, place a piece of plastic wrap on top of the base. Using a flat-bottomed glass (or your fingers), smooth out the base by pressing gently to evenly cover the bottom of the pan. Remove and discard the plastic wrap. Bake until the base is slightly firm, 12 to 15 minutes.",
            "Meanwhile, prepare the topping: In the same saucepan, melt the butter over low heat. Add the almonds, candied ginger, honey, salt, and vanilla. Stir just until the ingredients are incorporated. When the base is baked, spread the topping evenly over the base and bake until the topping is dark and sizzling, 12 to 15 minutes. Do not underbake. Transfer the pan to the baking rack to cool. When the dessert is completely cool, remove it from the pan using the overhanging parchment as handles and cut it into 16 even squares.",
            "In the same saucepan, melt the butter over low heat. Add the almonds, candied ginger, honey, salt, and vanilla. Stir just until the ingredients are incorporated.",
            "When the base is baked, spread the topping evenly over the base and bake until the topping is dark and sizzling, 12 to 15 minutes. Do not underbake.",
            "Transfer the pan to the baking rack to cool. When the dessert is completely cool, remove it from the pan using the overhanging parchment as handles and cut it into 16 even squares.",
            "Do Ahead Store in an airtight container at room temperature for up to 1 week.",
            "Store in an airtight container at room temperature for up to 1 week.",
            "Variation: Chestnut Honey Squares: For the base, replace 1 cup (90g) almond meal with 3/4 cup (120 g) unbleached, all-purpose flour and use a strong honey, such as chestnut, in place of the mild honey. For the topping, replace the candied ginger with organic candied orange or lemon peel, cut into tiny cubes.",
            "Chestnut Honey Squares: For the base, replace 1 cup (90g) almond meal with 3/4 cup (120 g) unbleached, all-purpose flour and use a strong honey, such as chestnut, in place of the mild honey. For the topping, replace the candied ginger with organic candied orange or lemon peel, cut into tiny cubes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58b705eec7cd7f116cf66fb7/6:4/w_274%2Ch_169/ginger-almond-bars-022817.jpg"
    }
}