{
    "recipe": {
        "title": "Glazed Jelly Crepes ",
        "ingredients": [
            "1/3 cup all-purpose flour",
            "3 tablespoons milk",
            "2 tablespoons water",
            "1 large egg",
            "1 tablespoon unsalted butter, melted and cooled, plus additional for brushing the pan and crêpes",
            "1 1/2 ounces cream cheese, cut into thin slices",
            "1/3 cup jelly",
            "1 teaspoon sugar"
        ],
        "instructions": [
            "In a blender or small food processor blend flour, milk, water, egg, 1 tablespoon of butter, and a pinch salt 5 seconds. Turn off motor and scrape down sides of container. Blend batter 20 seconds more. Transfer batter to a bowl and let stand, covered, 15 minutes. Heat a 6- to 7-inch crêpe pan (preferably cast iron) over moderate heat until hot. Brush pan lightly with additional butter and heat until hot but not smoking. Remove pan from heat. Stir batter and half fill a 1/4-cup measure with it. Pour batter into pan, tilting and rotating pan quickly to cover bottom with a thin layer of batter, and return any excess to bowl. Return pan to heat and loosen edge of crêpe with a spatula. Cook crêpe until underside is browned lightly. Turn crêpe and brown other side lightly. Transfer crêpe to a plate. Make more crêpes with remaining batter in same manner, brushing pan lightly with additional butter as necessary. Preheat broiler. Divide cream cheese and jelly among crêpes. Fold each crêpe into quarters and arrange, overlapping slightly, in a buttered shallow flameproof dish. Brush crêpes lightly with additional butter and sprinkle with sugar. Broil crêpes under broiler about 4 inches from heat 1 minute, or until bubbling and golden.",
            "In a blender or small food processor blend flour, milk, water, egg, 1 tablespoon of butter, and a pinch salt 5 seconds. Turn off motor and scrape down sides of container. Blend batter 20 seconds more. Transfer batter to a bowl and let stand, covered, 15 minutes.",
            "Heat a 6- to 7-inch crêpe pan (preferably cast iron) over moderate heat until hot. Brush pan lightly with additional butter and heat until hot but not smoking. Remove pan from heat. Stir batter and half fill a 1/4-cup measure with it. Pour batter into pan, tilting and rotating pan quickly to cover bottom with a thin layer of batter, and return any excess to bowl. Return pan to heat and loosen edge of crêpe with a spatula. Cook crêpe until underside is browned lightly. Turn crêpe and brown other side lightly. Transfer crêpe to a plate. Make more crêpes with remaining batter in same manner, brushing pan lightly with additional butter as necessary.",
            "Preheat broiler.",
            "Divide cream cheese and jelly among crêpes. Fold each crêpe into quarters and arrange, overlapping slightly, in a buttered shallow flameproof dish. Brush crêpes lightly with additional butter and sprinkle with sugar. Broil crêpes under broiler about 4 inches from heat 1 minute, or until bubbling and golden."
        ],
        "picture_link": null
    }
}