{
    "recipe": {
        "title": "Gluten-Free Pistachio Truffle Cookies ",
        "ingredients": [
            "1/2 cup heavy cream",
            "2 tablespoons brown-rice syrup",
            "8 ounces high-quality bittersweet chocolate, finely chopped",
            "1 tablespoon cognac",
            "1 cup plus 3 tablespoons shelled pistachios, divided",
            "1/4 cup granulated sugar",
            "1 tablespoon cornstarch",
            "1/4 teaspoon fine sea salt",
            "1 large egg white",
            "1 teaspoons vanilla extract",
            "1/8 teaspoon almond extract",
            "6 ounces high-quality bittersweet chocolate, roughly chopped",
            "1 tablespoon extra-virgin coconut oil"
        ],
        "instructions": [
            "Make the truffle filling: In a small saucepan, heat cream and brown rice syrup over medium heat until it just begins to simmer. Immediately remove the pot from heat and add chocolate. Let stand for 3 minutes, then stir until chocolate is melted and smooth. Add cognac and stir to combine. Transfer truffle filling to a medium bowl and let stand at room temperature until the texture thickens and resembles peanut butter, whisking occasionally, about 45 minutes.",
            "In a small saucepan, heat cream and brown rice syrup over medium heat until it just begins to simmer. Immediately remove the pot from heat and add chocolate. Let stand for 3 minutes, then stir until chocolate is melted and smooth. Add cognac and stir to combine.",
            "Transfer truffle filling to a medium bowl and let stand at room temperature until the texture thickens and resembles peanut butter, whisking occasionally, about 45 minutes.",
            "Make the cookies: Arrange the racks in the upper and lower rungs in the oven and preheat the oven to 325°F. In the bowl of a food processor, pulse 3 tablespoons pistachios until very finely ground and powdery. Set ground pistachios aside. In the bowl of a food processor, combine remaining 1 cup pistachios, sugar, cornstarch, and salt; pulse until very finely ground. Add the egg white, vanilla extract, and almond extract, and pulse until well combined. Drop dough by teaspoonfuls onto two parchment-lined baking sheets, spacing them 1 inch apart. Use a finger dipped in water to gently flatten the pistachio rounds until they are about 1 inch in diameter. Bake until the cookies are set and edges are golden, about 12 minutes. Let the cookies to cool completely, then freeze cookies for 1 hour.",
            "Arrange the racks in the upper and lower rungs in the oven and preheat the oven to 325°F. In the bowl of a food processor, pulse 3 tablespoons pistachios until very finely ground and powdery. Set ground pistachios aside.",
            "In the bowl of a food processor, combine remaining 1 cup pistachios, sugar, cornstarch, and salt; pulse until very finely ground. Add the egg white, vanilla extract, and almond extract, and pulse until well combined.",
            "Drop dough by teaspoonfuls onto two parchment-lined baking sheets, spacing them 1 inch apart. Use a finger dipped in water to gently flatten the pistachio rounds until they are about 1 inch in diameter. Bake until the cookies are set and edges are golden, about 12 minutes. Let the cookies to cool completely, then freeze cookies for 1 hour.",
            "Assemble the cookies: Once the cookies have been frozen, spoon 1/2 teaspoon truffle filling on the flat side of each cookie. Use a butter knife or small offset spatula to shape the filling to a domed point. Freeze cookies until the filling is set, about 15 minutes more. Place cookies on a wire rack placed over a parchment-lined rimmed baking sheet. In a heatproof bowl set over a medium saucepan of barely simmering water, combine the 6 ounces of chocolate and the coconut oil. Stir until mixture is smooth; remove from heat and let cool slightly.",
            "Once the cookies have been frozen, spoon 1/2 teaspoon truffle filling on the flat side of each cookie. Use a butter knife or small offset spatula to shape the filling to a domed point. Freeze cookies until the filling is set, about 15 minutes more. Place cookies on a wire rack placed over a parchment-lined rimmed baking sheet.",
            "In a heatproof bowl set over a medium saucepan of barely simmering water, combine the 6 ounces of chocolate and the coconut oil. Stir until mixture is smooth; remove from heat and let cool slightly.",
            "Finish the cookies: Working with one cookie at a time, spoon the chocolate shell over the cookies to completely enclose the filling. Sprinkle the top of each cookie with a pinch of reserve ground pistachio while the glaze is still wet. Let cool completely before serving. Make ahead: The cookies can be stored in the refrigerator for up to 1 week.",
            "Working with one cookie at a time, spoon the chocolate shell over the cookies to completely enclose the filling. Sprinkle the top of each cookie with a pinch of reserve ground pistachio while the glaze is still wet. Let cool completely before serving.",
            "Make ahead: The cookies can be stored in the refrigerator for up to 1 week."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b87a407cbba01c0db7f413/6:4/w_274%2Ch_169/51259020_gluten-free-pistachio-cookies_1x1.jpg"
    }
}