{
    "recipe": {
        "title": "Gluten-Free Multi-Purpose Sweet Pastry Dough ",
        "ingredients": [
            "1 1/4 cups gluten-free oat flour (4.25 ounces)",
            "1/2 cup all-purpose gluten-free flour such as King Arthur (2.75 ounces), plus more for dusting",
            "1/2 cup granulated sugar",
            "1/2 teaspoon fine sea salt",
            "1/8 teaspoon baking soda",
            "8 tablespoons (1 stick) unsalted butter, cut into small pieces and chilled in freezer for 10 minutes",
            "2 ounces cream cheese, cut into small pieces and chilled in freezer for 10 minutes",
            "1 large egg",
            "1 teaspoon vanilla extract"
        ],
        "instructions": [
            "Pulse oat flour, gluten-free flour, sugar, salt, and baking soda in the bowl of a food processor until combined. Add butter and cream cheese and pulse just until they form pea-sized pieces. Whisk together egg and vanilla in a small bowl. With the machine running, add egg mixture to flour mixture and process until the dough just begins to hold together, about 10 seconds.",
            "Turn out mixture onto a work surface and push together to form a rough ball. Knead a few times to combine, then divide dough in half and flatten into 2 disks with smooth edges. Cover with plastic wrap and refrigerate until very firm, at least 2 hours or up to 3 days.",
            "To make cookies (Makes about 2 dozen): Preheat oven to 350°F with rack in middle. Dust your work surface and rolling pin generously with all-purpose gluten-free flour. Remove 1 dough disk from the refrigerator and roll out into a round about 1/8” thick. If dough becomes too soft to roll out, cover with plastic wrap and chill until firm. Cut out as many cookies as possible from with cutters and transfer to parchment-lined baking sheets, arranging them about 1 inch apart (scraps can be rerolled as many times as you like). Bake cookies, 1 sheet at a time, until edges are golden, 10 to 12 minutes, then transfer sheet pans to wire racks to cool completely. (If re-using baking sheets to bake multiples batches of cookies, let sheets cool completely between batches.)",
            "Preheat oven to 350°F with rack in middle.",
            "Dust your work surface and rolling pin generously with all-purpose gluten-free flour. Remove 1 dough disk from the refrigerator and roll out into a round about 1/8” thick. If dough becomes too soft to roll out, cover with plastic wrap and chill until firm. Cut out as many cookies as possible from with cutters and transfer to parchment-lined baking sheets, arranging them about 1 inch apart (scraps can be rerolled as many times as you like).",
            "Bake cookies, 1 sheet at a time, until edges are golden, 10 to 12 minutes, then transfer sheet pans to wire racks to cool completely. (If re-using baking sheets to bake multiples batches of cookies, let sheets cool completely between batches.)",
            "To Make Pie or Tart Crust (Makes enough for one double-crust pie, two single-crust pies, or two 9-inch tarts): Dust a large piece of parchment paper and your rolling pin with all-purpose gluten-free flour. Remove one dough disk from the refrigerator and roll out on parchment into a 1/8” thick round, gently reshaping and rotating the dough as you go to make sure it’s not sticking, and adding more GF flour underneath as needed. If dough becomes too soft or sticky, slide dough-covered parchment onto a baking sheet and freeze until firm, about 10 minutes. Invert a 9” pie plate over rolled out dough, gently slide your hand under parchment paper, and re-invert. Remove parchment paper, then fit dough into pie plate and crimp edges as desired. Chill in freezer 10 minutes, then bake according to your pie or tart recipe.",
            "Dust a large piece of parchment paper and your rolling pin with all-purpose gluten-free flour. Remove one dough disk from the refrigerator and roll out on parchment into a 1/8” thick round, gently reshaping and rotating the dough as you go to make sure it’s not sticking, and adding more GF flour underneath as needed. If dough becomes too soft or sticky, slide dough-covered parchment onto a baking sheet and freeze until firm, about 10 minutes. Invert a 9” pie plate over rolled out dough, gently slide your hand under parchment paper, and re-invert. Remove parchment paper, then fit dough into pie plate and crimp edges as desired. Chill in freezer 10 minutes, then bake according to your pie or tart recipe.",
            "To Make Bar Cookies (Makes two 8” baking dishes): Roll or press out dough according to your bar cookie recipe and bake according to instructions.",
            "Roll or press out dough according to your bar cookie recipe and bake according to instructions.",
            "Do Ahead Dough can be frozen for up to 3 months; thaw in refrigerator overnight before using.",
            "Dough can be frozen for up to 3 months; thaw in refrigerator overnight before using."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56325ee87218c5a0300ae25e/6:4/w_274%2Ch_169/EP_10282015_glutenfreepiedough.jpg"
    }
}