{
    "recipe": {
        "title": "Gnocchi Souffles ",
        "ingredients": [
            "1 cup all-purpose flour, sifted",
            "3/4 cup plus 2 tablespoons whole milk",
            "3/4 stick (6 tablespoons) unsalted butter, cut into pieces",
            "2 ounces finely grated Parmigiano-Reggiano (1 cup)",
            "3/4 teaspoon salt",
            "1/8 teaspoon freshly grated nutmeg",
            "3 large eggs",
            "1/2 cup heavy cream",
            "1/4 pound chilled Bra Tenero cheese (not Bra Duro), thinly sliced (preferably with a cheese plane)",
            "10 grams fresh white truffle (1/3 ounces; optional)",
            "a pastry bag fitted with a 1/2-inch plain tip; 8 (1/3-cup) individual shallow gratin dishes (3 oz); a truffle slicer or a Japanese Benriner (optional)"
        ],
        "instructions": [
            "Sift flour into a bowl. Bring milk and butter just to a boil in a 3-quart heavy saucepan, stirring until butter is melted. Reduce heat, then, when mixture is at a simmer, add flour all at once and cook, stirring vigorously with a wooden spoon, until mixture pulls away from side of pan, 1 to 2 minutes. Remove from heat and stir in Parmigiano-Reggiano, salt, and nutmeg. Add eggs 1 at a time, stirring vigorously after each addition until mixture is smooth. Transfer dough to pastry bag. Put oven rack in middle position and preheat oven to 375°F. Working in batches of about 20, pipe 1/2-inch lengths of dough directly into a 6- to 8-quart pot of boiling salted water , using a paring knife to cut off dough at tip. Simmer gnocchi until they rise to surface, then transfer with a slotted spoon to a large bowl of ice and cold water to stop cooking. When all gnocchi are cooked and cooled, drain well in a colander. Divide cream among gratin dishes, then arrange gnocchi in 1 layer over cream and cover with Bra Tenero slices. Arrange dishes in a shallow baking pan and bake until golden and bubbling, 18 to 20 minutes. While gnocchi soufflés bake, shave truffle (if using) into very thin slices with slicer. Scatter truffle over baked gnocchi soufflés and serve immediately.",
            "Sift flour into a bowl. Bring milk and butter just to a boil in a 3-quart heavy saucepan, stirring until butter is melted. Reduce heat, then, when mixture is at a simmer, add flour all at once and cook, stirring vigorously with a wooden spoon, until mixture pulls away from side of pan, 1 to 2 minutes. Remove from heat and stir in Parmigiano-Reggiano, salt, and nutmeg. Add eggs 1 at a time, stirring vigorously after each addition until mixture is smooth. Transfer dough to pastry bag.",
            "Put oven rack in middle position and preheat oven to 375°F.",
            "Working in batches of about 20, pipe 1/2-inch lengths of dough directly into a 6- to 8-quart pot of boiling salted water , using a paring knife to cut off dough at tip. Simmer gnocchi until they rise to surface, then transfer with a slotted spoon to a large bowl of ice and cold water to stop cooking. When all gnocchi are cooked and cooled, drain well in a colander.",
            "Divide cream among gratin dishes, then arrange gnocchi in 1 layer over cream and cover with Bra Tenero slices. Arrange dishes in a shallow baking pan and bake until golden and bubbling, 18 to 20 minutes.",
            "While gnocchi soufflés bake, shave truffle (if using) into very thin slices with slicer.",
            "Scatter truffle over baked gnocchi soufflés and serve immediately.",
            "*Available at some cheese shops and by mail order from Artisinal Cheese Center (877-797-1200; artisinalcheese.com).",
            "*Available at some cheese shops and by mail order from Artisinal Cheese Center (877-797-1200; artisinalcheese.com)."
        ],
        "picture_link": null
    }
}