{
    "recipe": {
        "title": "Goat Cheese and Walnut Souffles with Watercress and Frisée Salad ",
        "ingredients": [
            "3/4 cup walnuts, toasted lightly, cooled, and chopped fine",
            "3 tablespoons unsalted butter",
            "4 tablespoons all-purpose flour",
            "1 cup milk",
            "4 large eggs, separated, the whites at room temperature",
            "1 1/2 cups crumbled mild goat cheese such as Montrachet (about 6 ounces)",
            "1 teaspoon fresh thyme leaves or 1/4 teaspoon crumbled dried",
            "a pinch of cream of tartar",
            "3 tablespoons Sherry vinegar",
            "3/4 teaspoon Dijon-style mustard",
            "4 tablespoons walnut oil",
            "2 tablespoons olive oil",
            "2 large bunches of watercress, rinsed, spun dry, and coarse stems discarded (about 5 cups)",
            "5 cups torn frisée (French or Italian curly chicory, available at specialty produce markets), rinsed and spun dry"
        ],
        "instructions": [
            "Coat the bottom and side of each of 8 buttered 1/2-cup ramekins with about 1 tablespoon of the walnuts and arrange the ramekins in a jelly-roll pan. In a small saucepan melt the butter over moderately low heat, whisk in the flour, and cook the roux, whisking, for 3 minutes. Add the milk in a stream, whisking, and boil the mixture over moderate heat, whisking, for 2 minutes, or until it is thick and smooth. Transfer the mixture to a bowl and let it cool slightly. Whisk in the yolks, 1 at a time, the goat cheese, the thyme, and salt and pepper to taste and whisk the mixture until it is combined well. In another bowl beat the whites with a pinch of salt until they are frothy, add the cream of tartar, and beat the whites until they just hold stiff peaks. Whisk one third of the whites into the cheese mixture and fold in the remaining whites gently but thoroughly. Divide the soufflé mixture among the ramekins, sprinkle each soufflé with about 1 1/2 teaspoons of the remaining walnuts, and bake the soufflés in the upper third of a preheated 400°F. oven for 20 minutes, or until they are puffed and golden.",
            "Transfer a ramekin to each plate and serve the soufflés immediately.",
            "Transfer a ramekin to each plate and serve the soufflés immediately.",
            "Make the salad while the soufflés are baking: In a bowl whisk together the vinegar, the mustard, and salt and pepper to taste, add the oils in a stream, whisking, and whisk the dressing until it is emulsified. In a bowl toss the watercress and the frisée with the dressing and divide the salad among 8 plates.",
            "In a bowl whisk together the vinegar, the mustard, and salt and pepper to taste, add the oils in a stream, whisking, and whisk the dressing until it is emulsified. In a bowl toss the watercress and the frisée with the dressing and divide the salad among 8 plates."
        ],
        "picture_link": null,
        "color": 5798073
    }
}