{
    "recipe": {
        "title": "Goat Cheese Souffles ",
        "ingredients": [
            "4 tablespoons (1/2 stick) butter, room temperature",
            "3/4 cup (about) dry white breadcrumbs",
            "2 tablespoons all purpose flour",
            "2/3 cup whole milk",
            "5 ounces soft fresh goat cheese (such as Montrachet), very coarsely crumbled",
            "1/2 teaspoon salt",
            "1/4 teaspoon pepper",
            "2 large egg yolks",
            "4 large egg whites"
        ],
        "instructions": [
            "Preheat oven to 350°F. Rub inside of six 3/4-cup soufflé dishes or ramekins with 2 tablespoons butter. Coat with breadcrumbs; tap out excess. Set aside.",
            "Melt remaining 2 tablespoons butter in heavy large saucepan over medium-low heat. Add flour and cook 2 minutes, whisking constantly. Gradually whisk in milk. Increase heat to medium. Simmer mixture until very thick, stirring constantly, about 5 minutes. Add half of goat cheese and whisk until melted and smooth. Mix in salt and pepper. Whisk egg yolks in medium bowl to blend. Gradually whisk in hot soufflé base. Cool 5 minutes.",
            "Beat whites in large bowl until stiff but not dry. Mix 1/4 of whites into soufflé base to lighten. Fold in remaining whites. Fold in remaining goat cheese. Divide mixture among prepared soufflé dishes. Place in 13x9x2-inch metal baking pan. Add enough hot water to pan to come halfway up sides of dishes.",
            "Bake soufflés until puffed and golden brown on top and softly set in center, about 20 minutes. Serve soufflés immediately in their dishes. Or for twice-baked version, cool soufflés in dishes in water for 5 minutes. Remove soufflés from water. Run small sharp knife around sides of dishes to loosen soufflés. Turn out onto buttered baking sheet. Refrigerate up to 4 hours. Before serving, rewarm soufflés on same sheet in 350°F oven until heated through, about 10 minutes."
        ],
        "picture_link": null
    }
}