{
    "recipe": {
        "title": "Goat Cheese Ice Cream with Roasted Red Cherries ",
        "ingredients": [
            "2 cups whole milk",
            "1 tablespoon plus 1 teaspoon cornstarch",
            "1/2 cup (about 4 ounces) fresh goat cheese",
            "1 1/2 ounces (3 tablespoons) cream cheese, softened",
            "1/4 teaspoon fine sea salt",
            "1 1/4 cups heavy cream",
            "2/3 cup sugar",
            "1/4 cup light corn syrup",
            "Roasted Cherries"
        ],
        "instructions": [
            "Mix about 2 tablespoons of the milk with the cornstarch in a small bowl to make a smooth slurry. Whisk the goat cheese, cream cheese, and salt in a medium bowl until smooth. Fill a large bowl with ice and water.",
            "Cook Combine the remaining milk, the cream, sugar, and corn syrup in a 4-quart saucepan, bring to a rolling boil over medium-high heat, and boil for 4 minutes. Remove from the heat, and gradually whisk in the cornstarch slurry. Bring the mixture back to a boil over medium-high heat and cook, stirring with a rubber spatula, until slightly thickened, about 1 minute. Remove from the heat.",
            "Combine the remaining milk, the cream, sugar, and corn syrup in a 4-quart saucepan, bring to a rolling boil over medium-high heat, and boil for 4 minutes. Remove from the heat, and gradually whisk in the cornstarch slurry. Bring the mixture back to a boil over medium-high heat and cook, stirring with a rubber spatula, until slightly thickened, about 1 minute. Remove from the heat.",
            "Chill Gradually whisk the hot milk mixture into the cream cheese mixture until smooth. Pour the mixture into a 1-gallon Ziploc freezer bag and submerge the sealed bag in the ice bath. Let stand, adding more ice as necessary, until cold, about 30 minutes.",
            "Gradually whisk the hot milk mixture into the cream cheese mixture until smooth. Pour the mixture into a 1-gallon Ziploc freezer bag and submerge the sealed bag in the ice bath. Let stand, adding more ice as necessary, until cold, about 30 minutes.",
            "Freeze Pour the ice cream base into the frozen canister and spin until thick and creamy. Pack the ice cream into a storage container, alternating it with layers of the cherries and ending with a spoonful of cherries; do not mix. Press a sheet of parchment directly against the surface, and seal with an airtight lid. Freeze in the coldest part of your freezer until firm, at least 4 hours.",
            "Pour the ice cream base into the frozen canister and spin until thick and creamy. Pack the ice cream into a storage container, alternating it with layers of the cherries and ending with a spoonful of cherries; do not mix. Press a sheet of parchment directly against the surface, and seal with an airtight lid. Freeze in the coldest part of your freezer until firm, at least 4 hours."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b2ae0611c5d6af478b1e72/6:4/w_274%2Ch_169/366551_goat-cheese-ice-cream_1x1.jpg"
    }
}