{
    "recipe": {
        "title": "Goat Cheese, Honey, and Rye Crust Pie ",
        "ingredients": [
            "3/4 cup all-purpose flour, plus more for surface",
            "1/2 cup rye flour",
            "1/2 teaspoon kosher salt",
            "1/2 teaspoon sugar",
            "1/2 cup (1 stick) cold unsalted butter, cut into cubes, plus more for pan",
            "1 tablespoon chilled apple cider vinegar",
            "8 ounces chèvre goat cheese, room temperature",
            "8 ounces cream cheese, room temperature",
            "1/2 cup honey",
            "1/4 cup sugar",
            "1/2 teaspoon vanilla extract",
            "3 large eggs, room temperature",
            "1/2 cup whole milk",
            "1/4 cup (1/2 stick) unsalted butter",
            "4 sweet apples, such as Fuji or Gala, cored, cut into 1/2\" wedges",
            "1/4 cup honey",
            "12 thyme sprigs",
            "1/4 teaspoon kosher salt",
            "A 9\" pie pan"
        ],
        "instructions": [
            "Make the pie dough: Mix 3/4 cup all-purpose flour, rye flour, salt, and sugar in a large bowl. Add 1/2 cup butter and rub into dry ingredients with your fingertips until mixture resembles coarse breadcrumbs; it's fine if some larger, flat pieces of butter remain. Add vinegar and 3 Tbsp. ice water. Mix with a spoon until a rough dough forms, adding more water by the tablespoon if it seems dry. (Alternatively, dough can be made in a food processor.) Turn dough out onto a work surface and gather into a ball, folding it over onto itself once or twice if needed. Shape into a disc, wrap in plastic, and chill at least 1 hour. Arrange rack in bottom third of oven; place a rimmed baking sheet on rack. Preheat oven to 375°F. Grease 9\" pie pan with butter. Roll out dough on a lightly floured surface to a 13\" round. Roll dough loosely around rolling pin, then unfurl into pan. Gently lift and settle dough into pan. Trim excess dough with scissors, leaving a 1\" overhang. Crimp as desired. Chill dough at least 30 minutes. Line shell with parchment paper and fill with pie weights or beans. Place on preheated baking sheet and bake until crust is set and beginning to brown, 20-25 minutes. Remove weights and parchment, prick bottom of crust all over with a fork, then continue to bake until crust is golden brown and dry to the touch, 5-10 more minutes. Transfer pie pan to a cooling rack to cool slightly; return baking sheet to oven.",
            "Mix 3/4 cup all-purpose flour, rye flour, salt, and sugar in a large bowl. Add 1/2 cup butter and rub into dry ingredients with your fingertips until mixture resembles coarse breadcrumbs; it's fine if some larger, flat pieces of butter remain. Add vinegar and 3 Tbsp. ice water. Mix with a spoon until a rough dough forms, adding more water by the tablespoon if it seems dry. (Alternatively, dough can be made in a food processor.)",
            "Turn dough out onto a work surface and gather into a ball, folding it over onto itself once or twice if needed. Shape into a disc, wrap in plastic, and chill at least 1 hour.",
            "Arrange rack in bottom third of oven; place a rimmed baking sheet on rack. Preheat oven to 375°F. Grease 9\" pie pan with butter. Roll out dough on a lightly floured surface to a 13\" round. Roll dough loosely around rolling pin, then unfurl into pan. Gently lift and settle dough into pan. Trim excess dough with scissors, leaving a 1\" overhang. Crimp as desired. Chill dough at least 30 minutes.",
            "Line shell with parchment paper and fill with pie weights or beans. Place on preheated baking sheet and bake until crust is set and beginning to brown, 20-25 minutes. Remove weights and parchment, prick bottom of crust all over with a fork, then continue to bake until crust is golden brown and dry to the touch, 5-10 more minutes. Transfer pie pan to a cooling rack to cool slightly; return baking sheet to oven.",
            "Make the filling: Reduce oven temperature to 350°F. Beat chèvre and cream cheese in the bowl of a stand mixer fitted with the paddle attachment until incorporated. Add honey, sugar, and vanilla and continue to beat on medium speed until creamy. Add eggs one at a time, beating on low speed until incorporated. Add milk and beat on low speed until incorporated. Pour filling into pie shell, return to preheated baking sheet, and bake until filling is mostly set but center jiggles slightly, 35–40 minutes. Remove from oven, place another pie pan or rimmed baking sheet upside down on top of pie, and let cool to room temperature. (The inverted pan helps keep the filling from cracking as it cools.) Then chill until set, about 1 hour.",
            "Reduce oven temperature to 350°F. Beat chèvre and cream cheese in the bowl of a stand mixer fitted with the paddle attachment until incorporated. Add honey, sugar, and vanilla and continue to beat on medium speed until creamy. Add eggs one at a time, beating on low speed until incorporated. Add milk and beat on low speed until incorporated.",
            "Pour filling into pie shell, return to preheated baking sheet, and bake until filling is mostly set but center jiggles slightly, 35–40 minutes. Remove from oven, place another pie pan or rimmed baking sheet upside down on top of pie, and let cool to room temperature. (The inverted pan helps keep the filling from cracking as it cools.) Then chill until set, about 1 hour.",
            "Make the apples: Melt butter in a large nonstick pan over medium heat. Add apples and toss to coat. Cook 2 minutes, then add honey, thyme, and salt. Cook, tossing carefully to avoid breaking up apples, until apples are softened and caramelized and sauce has thickened, 10–15 minutes. Serve pie slightly chilled or at room temperature with apple mixture alongside.",
            "Melt butter in a large nonstick pan over medium heat. Add apples and toss to coat. Cook 2 minutes, then add honey, thyme, and salt. Cook, tossing carefully to avoid breaking up apples, until apples are softened and caramelized and sauce has thickened, 10–15 minutes.",
            "Serve pie slightly chilled or at room temperature with apple mixture alongside.",
            "Do Ahead Dough can be made 2 days ahead; keep chilled. Crimped dough in pan can be formed 1 day ahead; keep chilled.",
            "Dough can be made 2 days ahead; keep chilled. Crimped dough in pan can be formed 1 day ahead; keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58c6ff96d6177b0ba25ba27d/6:4/w_274%2Ch_169/Goat-Cheese-Honey-and-Rye-Pie-09032017.jpg"
    }
}