{
    "recipe": {
        "title": "Gochujang Grilled Cheese ",
        "ingredients": [
            "2 ounces grated Gruyère (about 6 tablespoons)",
            "2 ounces grated white cheddar (about 6 tablespoons)",
            "1 ounce grated fontina cheese (about 3 tablespoons)",
            "2 garlic cloves, finely grated",
            "2 tablespoons coarsely chopped fresh parsley",
            "2 tablespoons gochujang (Korean hot pepper paste)",
            "2 tablespoons mayonnaise (preferably Duke's)",
            "1 tablespoon chopped red onion",
            "2 slices pancetta (about 1 ounce)",
            "4 slices good-quality crusty Italian bread, such as ciabatta",
            "2 tablespoons mayonnaise (preferably Duke's)",
            "2 small pickled okra, thinly sliced",
            "1/2 cup fresh bean sprouts",
            "2 tablespoons olive oil",
            "2 tablespoons unsalted butter"
        ],
        "instructions": [
            "Mix Gruyère, white cheddar, fontina cheese, garlic, parsley, gochujang, mayonnaise, and onion in a medium bowl until well combined.",
            "Assemble the sandwiches: Heat a large cast-iron or non-stick skillet over medium-high. Fry pancetta until crispy and fat has rendered, 3-5 minutes per side. Wipe out skillet and reserve for sandwiches. Spread 1 side of each slice of bread with 2 Tbsp. mayonnaise total (doing this before toasting helps ensure a golden brown and crispy grilled cheese). Flip 2 slices over so mayo side is face down. Divide cheese spread between these 2 slices. Top each slice with a piece of pancetta, half of sliced okra, half of bean sprouts, and a second slice of bread with the mayo on the outside of the sandwich. Heat reserved skillet over medium-high. Combine oil and butter, stir until butter is melted, and immediately add sandwiches. Cover skillet with a lid or baking sheet to properly melt cheese; toast until bread is crispy and browned, 3–5 minutes per side. Cut sandwiches in half and serve immediately.",
            "Heat a large cast-iron or non-stick skillet over medium-high. Fry pancetta until crispy and fat has rendered, 3-5 minutes per side. Wipe out skillet and reserve for sandwiches.",
            "Spread 1 side of each slice of bread with 2 Tbsp. mayonnaise total (doing this before toasting helps ensure a golden brown and crispy grilled cheese). Flip 2 slices over so mayo side is face down. Divide cheese spread between these 2 slices. Top each slice with a piece of pancetta, half of sliced okra, half of bean sprouts, and a second slice of bread with the mayo on the outside of the sandwich.",
            "Heat reserved skillet over medium-high. Combine oil and butter, stir until butter is melted, and immediately add sandwiches. Cover skillet with a lid or baking sheet to properly melt cheese; toast until bread is crispy and browned, 3–5 minutes per side. Cut sandwiches in half and serve immediately.",
            "Do Ahead Cheese spread can be made up to 3 days in advance and refrigerated.",
            "Cheese spread can be made up to 3 days in advance and refrigerated."
        ],
        "picture_link": "https://assets.epicurious.com/photos/553562d767c3a7e837c3d7cc/6:4/w_274%2Ch_169/EP-04162015-edlee-grilledcheese-hires.jpg",
        "color": 15396289
    }
}