{
    "recipe": {
        "title": "Golden Beet and Sunflower Salad ",
        "ingredients": [
            "2 1/2 lb medium golden beets (with greens)",
            "1/2 cup raw (not roasted) sunflower seeds (2 1/4 oz)",
            "2 tablespoons finely chopped shallot",
            "2 1/2 tablespoons cider vinegar",
            "3/4 teaspoon salt",
            "1/4 teaspoon black pepper",
            "1/4 teaspoon sugar",
            "3 tablespoons extra-virgin olive oil",
            "6 oz sunflower sprouts or baby mesclun (6 cups)"
        ],
        "instructions": [
            "Put oven racks in lower third and middle of oven and preheat oven to 425°F. Trim beet greens, leaving 1 inch of stems attached. Tightly wrap beets together in double layers of foil to make packages (2 or 3 per package) and roast in middle of oven until tender, 40 to 45 minutes. Unwrap beets and cool slightly. While beets roast, toast sunflower seeds in a pie plate or a small baking pan in lower third of oven, shaking occasionally, until seeds are golden, about 10 minutes. Whisk together shallot, vinegar, salt, pepper, and sugar in a small bowl, then add oil in a stream, whisking. When beets are cool enough to handle, slip off and discard skins. Cut beets lengthwise into 1/4-inch-thick slices and gently toss with 3 tablespoons vinaigrette in a bowl. Toss sunflower sprouts and half of sunflower seeds with remaining vinaigrette in another bowl. Arrange beets on 6 salad plates and top with dressed sprouts. Sprinkle salads with remaining sunflower seeds.",
            "Put oven racks in lower third and middle of oven and preheat oven to 425°F.",
            "Trim beet greens, leaving 1 inch of stems attached. Tightly wrap beets together in double layers of foil to make packages (2 or 3 per package) and roast in middle of oven until tender, 40 to 45 minutes. Unwrap beets and cool slightly.",
            "While beets roast, toast sunflower seeds in a pie plate or a small baking pan in lower third of oven, shaking occasionally, until seeds are golden, about 10 minutes.",
            "Whisk together shallot, vinegar, salt, pepper, and sugar in a small bowl, then add oil in a stream, whisking.",
            "When beets are cool enough to handle, slip off and discard skins. Cut beets lengthwise into 1/4-inch-thick slices and gently toss with 3 tablespoons vinaigrette in a bowl.",
            "Toss sunflower sprouts and half of sunflower seeds with remaining vinaigrette in another bowl. Arrange beets on 6 salad plates and top with dressed sprouts. Sprinkle salads with remaining sunflower seeds."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df249f9a84192308a857a/6:4/w_274%2Ch_169/109626.jpg"
    }
}