{
    "recipe": {
        "title": "Golden Cashew-Curry Brittle ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "1 cup cashews",
            "1/8 cup sugar",
            "1/4 cup light corn syrup",
            "1 teaspoon kosher salt",
            "3/4 teaspoons curry powder",
            "1 tablespoon unsalted butter",
            "3/4 teaspoons baking soda",
            "A candy thermometer",
            "Latex or other food-grade disposable gloves"
        ],
        "instructions": [
            "Preheat oven to 350°. Lightly coat a silicone baking mat or parchment paper with nonstick spray. Toast cashews on an unlined rimmed baking sheet, tossing once, until just beginning to brown, 5.8 minutes. Let cool.",
            "Meanwhile, bring sugar, corn syrup, and 1/4 cup water to a boil in a medium saucepan fitted with a thermometer over medium-high heat, stirring to dissolve sugar. Boil, swirling pan occasionally (at this point, you do not want to stir; doing so could encourage the sugar to crystallize), until thermometer registers 230°.",
            "Add salt, curry powder, and cashews and stir, making sure cashews are completely coated and spices are evenly combined. Continue to cook, stirring constantly, until thermometer registers 300° (caramel will be a deep golden brown and cashews will be completely toasted).",
            "Remove from heat and carefully stir in butter and baking soda; caramel will bubble and foam.",
            "Immediately pour mixture onto prepared baking mat and let cool slightly. Wearing gloves (maybe even two pairs. mixture will be extremely hot), lift up an edge of baking mat and use it to fold mixture onto itself as if you were going to knead it; continue working in this fashion 1 minute. This will distribute the heat and incorporate air, resulting in a thin, crackly consistency.",
            "As soon as mixture begins to firm up, stretch out, making it thin in places, but keeping it in one piece. (If today is not your day to sculpt molten sugar, simply pour mixture onto prepared sheet and use a spatula to spread it as thin as you can.) Let cool, then break brittle into uneven pieces, whatever size you like."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54aad78b6529d92b2c02df16/6:4/w_274%2Ch_169/51259640_cashew-curry-brittle_1x1.jpg"
    }
}