{
    "recipe": {
        "title": "Good Luck Beef and Korean Rice Cake Soup (Tteokguk) ",
        "ingredients": [
            "1 1/2-pound piece point- or flat-cut beef brisket or stew meat, fat trimmed",
            "1 teaspoon toasted sesame oil",
            "1 tablespoon plus 2 teaspoons vegetable oil",
            "Kosher salt",
            "4 scallions",
            "1 (3-inch) piece ginger, peeled",
            "4 garlic cloves, finely grated",
            "1/3 Korean radish, peeled, quartered lengthwise, sliced crosswise 1/2\" thick, or 1/2 medium daikon, halved lengthwise, sliced crosswise 1/2\" thick",
            "4 large eggs",
            "8–10 ounces Korean rice cakes (tteok), sliced",
            "2 teaspoons fish sauce",
            "Freshly ground black pepper",
            "Korean red chile threads (optional; for serving)"
        ],
        "instructions": [
            "Cut meat into 1 1/2\" pieces. Heat sesame oil and 1 Tbsp. vegetable oil in a large pot over medium-high. Add meat and season with salt. Cook, turning occasionally, until browned on all sides, 8–12 minutes. Meanwhile, separate scallion whites from greens and coarsely chop; set aside. Thinly slice scallion greens and set aside separately for serving. Using a flat-bottomed mug or the side of a chef’s knife, lightly smash ginger. Add to pot along with garlic, reserved scallion whites, and 16 cups cold water and bring to a boil. Reduce heat and simmer, skimming any foam from surface, until meat is tender, 60–75 minutes, if using stew meat, or up to 2 hours , if using brisket. Transfer meat to a plate with a slotted spoon, then scoop out ginger and scallion whites and discard. Add Korean radish to pot and simmer until tender but not mushy (it should still hold its shape), 12–15 minutes. Meanwhile, heat 1 tsp. vegetable oil in a medium nonstick skillet over medium. Whisk eggs in a medium bowl and season with a large pinch of salt. Pour half of eggs into the center of skillet and quickly swirl pan to distribute evenly. Cook eggs undisturbed until they are just set, about 2 minutes. Carefully loosen with a heatproof rubber spatula, flip, and cook until other side is just set, about 1 minute. Slide egg crepe onto a cutting board and fold in half; let cool. Slice into 1/4\"-thick ribbons. Repeat with remaining eggs and 1 tsp. vegetable oil. Slice beef as thin as you can and return to pot; add rice cakes. Cook until rice cakes are soft, about 5 minutes. Stir in fish sauce; taste and season soup with more salt and a few grinds of pepper. Ladle soup into bowls and top with sliced egg, reserved scallion greens, and chile threads (if using).",
            "Cut meat into 1 1/2\" pieces. Heat sesame oil and 1 Tbsp. vegetable oil in a large pot over medium-high. Add meat and season with salt. Cook, turning occasionally, until browned on all sides, 8–12 minutes.",
            "Meanwhile, separate scallion whites from greens and coarsely chop; set aside. Thinly slice scallion greens and set aside separately for serving.",
            "Using a flat-bottomed mug or the side of a chef’s knife, lightly smash ginger. Add to pot along with garlic, reserved scallion whites, and 16 cups cold water and bring to a boil. Reduce heat and simmer, skimming any foam from surface, until meat is tender, 60–75 minutes, if using stew meat, or up to 2 hours , if using brisket. Transfer meat to a plate with a slotted spoon, then scoop out ginger and scallion whites and discard.",
            "Add Korean radish to pot and simmer until tender but not mushy (it should still hold its shape), 12–15 minutes.",
            "Meanwhile, heat 1 tsp. vegetable oil in a medium nonstick skillet over medium. Whisk eggs in a medium bowl and season with a large pinch of salt. Pour half of eggs into the center of skillet and quickly swirl pan to distribute evenly. Cook eggs undisturbed until they are just set, about 2 minutes. Carefully loosen with a heatproof rubber spatula, flip, and cook until other side is just set, about 1 minute. Slide egg crepe onto a cutting board and fold in half; let cool. Slice into 1/4\"-thick ribbons. Repeat with remaining eggs and 1 tsp. vegetable oil.",
            "Slice beef as thin as you can and return to pot; add rice cakes. Cook until rice cakes are soft, about 5 minutes. Stir in fish sauce; taste and season soup with more salt and a few grinds of pepper.",
            "Ladle soup into bowls and top with sliced egg, reserved scallion greens, and chile threads (if using).",
            "Do Ahead Soup (without garnishes) can be made 2 days ahead. Let cool; cover and chill. Reheat over medium before serving.",
            "Soup (without garnishes) can be made 2 days ahead. Let cool; cover and chill. Reheat over medium before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a3002b56b9ebc1ca25c594f/6:4/w_274%2Ch_169/good-luck-beef-and-korean-rice-cake-soup-recipe-BA-121217.jpg"
    }
}