{
    "recipe": {
        "title": "Good Gravy Bowl with Broccoli & Seitan ",
        "ingredients": [
            "2 teaspoons olive oil",
            "1 medium yellow onion, diced",
            "3 cloves garlic, chopped",
            "Pinch of salt",
            "1 1/2 tablespoons organic cornstarch",
            "1 1/2 cups vegetable broth",
            "3 tablespoons chopped fresh thyme",
            "1/2 teaspoon dried sage",
            "Several pinches of freshly ground black pepper",
            "1 1/2 cups cooked brown lentils",
            "2 tablespoons mellow white miso",
            "2 teaspoons olive oil",
            "2 cups thinly sliced seitan, in bite-size pieces",
            "Several pinches of freshly ground black pepper",
            "4 cups broccoli florets",
            "4 cups cooked quinoa"
        ],
        "instructions": [
            "Prepare the gravy: Preheat a 2-quart saucepan over medium heat and add the oil. Sauté the onion and garlic in the oil with a pinch of salt for 5 to 7 minutes, until lightly browned.",
            "In the meantime, mix the cornstarch with 1/2 cup of the vegetable broth, stirring with a fork to dissolve, and set aside.",
            "When the onions have browned, add the thyme, sage, and pepper and sauté for 30 seconds or so. Add the lentils, miso, and the remaining 1 cup broth (not the broth mixed with the cornstarch just yet) and heat through. Once warm, use an immersion blender to purée until relatively smooth. If you don't have an immersion blender, transfer to a blender or food processor to purée, and then transfer back to the pot.",
            "Stream in the broth-cornstarch mixture, stirring constantly, and heat for another 7 minutes, until thick and silky. Taste for seasoning and keep warm until ready to serve.",
            "Prepare the seitan: Preheat a large, heavy pan over medium-high heat (as usual, cast iron is preferred) and add the oil. Sauté the seitan in the oil, along with a few pinches of black pepper, until seared on both sides, 5 to 7 minutes. Set aside until ready to serve.",
            "Steam the broccoli: Get your steaming apparatus ready. Place the broccoli in the steamer and sprinkle on a pinch of salt. Steam for 5 to 7 minutes, until brilliantly bright green. Remove from the steamer immediately. To assemble: Place the quinoa in bowls, then add the broccoli and seitan. Smother in gravy, and serve!"
        ],
        "picture_link": "https://assets.epicurious.com/photos/56034745c301a9f945efdfe8/6:4/w_274%2Ch_169/51208410_hires.jpg"
    }
}