{
    "recipe": {
        "title": "Gorgonzola Chicken Breasts ",
        "ingredients": [
            "4 chicken breast halves with skin and bones (about 2 1/2 pounds total)",
            "1/4 pound chilled Gorgonzola dolce, sliced",
            "1 tablespoon vegetable oil",
            "1/3 cup water",
            "2 1/2 tablespoons balsamic vinegar"
        ],
        "instructions": [
            "Preheat oven to 425°F with rack in middle. Pat chicken dry, then cut a deep 3-inch-long pocket horizontally in long curved side of each chicken breast half. Fill each pocket with one quarter of cheese. Season chicken all over with 1 teaspoon salt and 1/2 teaspoon pepper. Heat oil in an ovenproof 12-inch heavy skillet over medium-high heat until it shimmers. Place chicken, skin side down, in skillet and cook, undisturbed, until golden brown, about 4 minutes. Turn breasts over, then place skillet in oven and bake until just cooked through, 20 to 25 minutes. Transfer chicken to a platter. Return skillet to burner (handle will be very hot) and add water and vinegar. Boil, stirring and scraping up any brown bits and melted cheese, until sauce thickens slightly, about 3 minutes. Strain through a fine-mesh sieve into a heatproof measuring cup, then skim off excess fat. Season with salt and pepper. Serve chicken with sauce.",
            "Preheat oven to 425°F with rack in middle.",
            "Pat chicken dry, then cut a deep 3-inch-long pocket horizontally in long curved side of each chicken breast half. Fill each pocket with one quarter of cheese. Season chicken all over with 1 teaspoon salt and 1/2 teaspoon pepper.",
            "Heat oil in an ovenproof 12-inch heavy skillet over medium-high heat until it shimmers. Place chicken, skin side down, in skillet and cook, undisturbed, until golden brown, about 4 minutes. Turn breasts over, then place skillet in oven and bake until just cooked through, 20 to 25 minutes. Transfer chicken to a platter.",
            "Return skillet to burner (handle will be very hot) and add water and vinegar. Boil, stirring and scraping up any brown bits and melted cheese, until sauce thickens slightly, about 3 minutes. Strain through a fine-mesh sieve into a heatproof measuring cup, then skim off excess fat. Season with salt and pepper. Serve chicken with sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d794ef3a00aeb2f1cb785/6:4/w_274%2Ch_169/350591_hires.jpg"
    }
}