{
    "recipe": {
        "title": "Grain Bowls with Grilled Corn, Steak, and Avocado ",
        "ingredients": [
            "1 lb. skirt or flank steak",
            "1 1/2 tsp. kosher salt, divided, plus more",
            "1 tsp. freshly ground black pepper, plus more",
            "3 large or 4 small ears of corn, shucked",
            "2 cups cooked whole grains, such as quinoa, farro, rice, or barley",
            "3 oz. crumbled feta or Cotija cheese (about 1/2 cup)",
            "4 scallions, thinly sliced",
            "1/4 cup extra-virgin olive oil",
            "2 Tbsp. fresh lime juice",
            "1 avocado, peeled, thinly sliced",
            "Creamy Jalapeño Sauce (for serving)"
        ],
        "instructions": [
            "Season steak with 1 tsp. salt and 1 tsp. pepper. Let sit at room temperature 30 minutes.",
            "Prepare a grill for medium-high heat or heat grill pan over medium-high. Grill steak, turning occasionally, until an instant-read thermometer inserted into the center of steak registers 120–125°F for medium-rare (2–3 minutes per side for skirt; 3–4 minutes per side for flank). Transfer to a cutting board and let rest at least 10 minutes or until cool.",
            "Meanwhile, grill corn until charred on all sides, about 10 minutes. Transfer to cutting board and let cool.",
            "Slice corn off cobs into a large bowl. Add grains, feta, scallions, oil, lime juice, and 1/2 tsp. salt and stir to combine. Divide corn mixture among bowls.",
            "Thinly slice steak against the grain (to make slicing easier for skirt steak, cut into 5\"–6\" segments, then slice against the grain). Top bowls with steak and avocado. Drizzle jalapeño sauce over; season with salt and pepper.",
            "Do Ahead: Steak and corn can be grilled 3 days ahead. Transfer to separate airtight containers and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b564fde33d06024dd38a32a/6:4/w_274%2Ch_169/Grilled-Corn-and-Steak-Grain-Bowls-12072018.jpg"
    }
}