{
    "recipe": {
        "title": "Grain Salad with Tomatoes and Cucumbers ",
        "ingredients": [
            "2 cups semi-pearled farro or spelt",
            "Kosher salt",
            "1/3 cup pine nuts",
            "3 medium Persian cucumbers, peeled, cut into ¾\" pieces",
            "3 medium tomatoes, thinly sliced",
            "1 pint Sun Gold and/or cherry tomatoes, halved crosswise",
            "1 small red onion, very thinly sliced",
            "Juice of 1 lemon (or more)",
            "1/3 cup extra-virgin olive oil",
            "2 Tbsp. red wine vinegar",
            "Freshly ground black pepper",
            "2 cups torn basil leaves"
        ],
        "instructions": [
            "Preheat oven to 350°F. Cook farro in a large Dutch oven or other heavy pot over medium heat, stirring often, until golden brown and toasted (it should start to smell like popcorn and some grains may pop), about 4 minutes. Remove pot from heat and pour in cold water to cover grains by 1\"; throw in a healthy handful of salt. Set pot over medium-high heat and bring water to a boil. Reduce heat and simmer, skimming foam occasionally from surface, until grains are tender but still have some bite, 25–35 minutes. Drain and transfer farro to a large bowl.",
            "Meanwhile, toast pine nuts on a rimmed baking sheet, tossing once, until golden brown, about 5 minutes. Let cool.",
            "Add pine nuts, cucumbers, both kinds of tomatoes, red onion, lemon juice, oil, and vinegar to bowl with farro and toss everything together to combine. Taste and season with salt, pepper, and more lemon juice, if desired.",
            "Top salad with basil just before serving.",
            "Do Ahead Farro can be cooked 1 day ahead. Let cool; cover and chill.",
            "Farro can be cooked 1 day ahead. Let cool; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ad7863e59e81a5d899942be/6:4/w_274%2Ch_169/grain-salad-with-tomatoes-and-cucumbers-recipe-BA-041818.jpg"
    }
}