{
    "recipe": {
        "title": "Grand Aioli ",
        "ingredients": [
            "1 pound baby new potatoes",
            "Kosher salt",
            "1 pound green beans, trimmed",
            "3 large eggs",
            "10 ounces large shrimp, peeled, deveined, tails left on",
            "3 garlic cloves",
            "4 large egg yolks",
            "2 tablespoons (or more) fresh lemon juice",
            "1 teaspoon Dijon mustard",
            "1 cup grapeseed oil",
            "1 cup olive oil",
            "1 or 2 heads of endive, leaves separated",
            "3 romaine hearts or heads of Little Gem lettuce, quartered",
            "2 bunch breakfast radishes",
            "4 mini seedless cucumbers, sliced",
            "1 pint cherry tomatoes"
        ],
        "instructions": [
            "Place potatoes in a medium pot; add cold water to cover by 1\". Season with salt, bring to a boil, and cook until potatoes are fork-tender, 12–15 minutes. Transfer to a large bowl of ice water and chill until cold, about 3 minutes. Transfer to paper towels and pat dry, reserving bowl of ice water. Meanwhile, bring another medium pot of salted water to a boil. Add green beans and cook until crisp-tender, 2–4 minutes. Using a slotted spoon, transfer beans to ice water; reserve hot water in pot. Chill beans until cold, about 3 minutes. Transfer to paper towels and pat dry, reserving bowl of ice water. Return water in green bean pot to a boil, carefully add eggs, and cook 8 minutes. Using a slotted spoon, transfer eggs to ice water; reserve hot water in pot. Chill eggs until cold, about 5 minutes. Peel; set aside, reserving bowl of ice water. Return water to a boil, add shrimp, and cook just until pink, about 3 minutes. Transfer to ice water and chill until cold, about 3 minutes. Transfer to paper towels and pat dry. Meanwhile, pulse garlic in a food processor until finely chopped. Add egg yolks, lemon juice, and mustard; season with salt, then process to combine. With the motor running, slowly pour in grapeseed oil a few drops at a time. After about 1/4 cup has been added, scrape down sides of bowl with a rubber spatula. Continue to add grapeseed oil with the motor running, then add olive oil and process until combined. If sauce is too thick, add water 1 Tbsp. at a time. Taste and add more salt and lemon juice, if needed. Transfer aioli to a serving bowl. Arrange potatoes, green beans, shrimp, halved eggs, endive, romaine, radishes, cucumbers, and tomatoes on a platter and serve alongside.",
            "Place potatoes in a medium pot; add cold water to cover by 1\". Season with salt, bring to a boil, and cook until potatoes are fork-tender, 12–15 minutes. Transfer to a large bowl of ice water and chill until cold, about 3 minutes. Transfer to paper towels and pat dry, reserving bowl of ice water.",
            "Meanwhile, bring another medium pot of salted water to a boil. Add green beans and cook until crisp-tender, 2–4 minutes. Using a slotted spoon, transfer beans to ice water; reserve hot water in pot. Chill beans until cold, about 3 minutes. Transfer to paper towels and pat dry, reserving bowl of ice water.",
            "Return water in green bean pot to a boil, carefully add eggs, and cook 8 minutes. Using a slotted spoon, transfer eggs to ice water; reserve hot water in pot. Chill eggs until cold, about 5 minutes. Peel; set aside, reserving bowl of ice water.",
            "Return water to a boil, add shrimp, and cook just until pink, about 3 minutes. Transfer to ice water and chill until cold, about 3 minutes. Transfer to paper towels and pat dry.",
            "Meanwhile, pulse garlic in a food processor until finely chopped. Add egg yolks, lemon juice, and mustard; season with salt, then process to combine. With the motor running, slowly pour in grapeseed oil a few drops at a time. After about 1/4 cup has been added, scrape down sides of bowl with a rubber spatula. Continue to add grapeseed oil with the motor running, then add olive oil and process until combined. If sauce is too thick, add water 1 Tbsp. at a time. Taste and add more salt and lemon juice, if needed.",
            "Transfer aioli to a serving bowl. Arrange potatoes, green beans, shrimp, halved eggs, endive, romaine, radishes, cucumbers, and tomatoes on a platter and serve alongside.",
            "Do Ahead Potatoes, green beans, and eggs can be cooked 2 days ahead. Transfer to an airtight container and chill. Aioli can be made 1 day ahead. Transfer to an airtight container and chill.",
            "Potatoes, green beans, and eggs can be cooked 2 days ahead. Transfer to an airtight container and chill. Aioli can be made 1 day ahead. Transfer to an airtight container and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59283ae889e0b4428b3a12ee/6:4/w_274%2Ch_169/Le-Grand-Aioli-hero-6x4-22052017.jpg"
    }
}