{
    "recipe": {
        "title": "Granola Bars with Dried Fruit and Seeds ",
        "ingredients": [
            "Nonstick vegetable cooking spray",
            "1 1/4 cups dried fruit (cherries, raisins, currants, cranberries, and/or blueberries), divided",
            "2/3 cup honey",
            "1/2 cup creamy almond, peanut, or sunflower butter",
            "1 1/2 teaspoons ground cinnamon",
            "3/4 teaspoon kosher salt",
            "1 teaspoon vanilla extract",
            "1 1/2 cups old-fashioned oats, divided",
            "1/2 cup raw pumpkin seeds",
            "1/2 cup raw sesame seeds",
            "1/2 cup raw sunflower seeds",
            "1/2 cup unsweetened coconut flakes"
        ],
        "instructions": [
            "Preheat oven to 325°F. Lightly coat a 13x9\" pan with nonstick spray and line with parchment paper, leaving an overhang on both long sides; spray parchment.",
            "Pulse 3/4 cup fruit and 1/2 cup hot water in a food processor until smooth and incorporated, 3–4 minutes. Add honey, almond butter, cinnamon, salt, and vanilla and pulse until combined, about 15 seconds. Add 1/2 cup oats and pulse until well combined, 30–45 seconds. Add pumpkin seeds, sesame seeds, sunflower seeds, coconut, and remaining 1 cup oats and 1/2 cup fruit. Pulse until just combined, about 15 seconds.",
            "Transfer mixture to prepared pan, pressing down until completely even. Bake granola until darkened, firm around the edges, and the center gives just slightly when pressed, about 35 minutes. Transfer pan to a wire rack and let cool in pan. Remove granola using parchment overhang, then cut into 20 bars with a serrated knife.",
            "Do Ahead Granola can be made 5 days ahead. Keep tightly wrapped at room temperature.",
            "Granola can be made 5 days ahead. Keep tightly wrapped at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59b6ea76f6bfdf7bca18bf72/6:4/w_274%2Ch_169/Granola-Bars-with-Dried-Fruit-and-Seeds-recipe-28082017.jpg"
    }
}