{
    "recipe": {
        "title": "Grandma Douglas's Schnecken ",
        "ingredients": [
            "9 × 13-inch Baking Pan",
            "1/2 cup (1 stick/4 ounces/113 grams) unsalted butter, plus more for the bowl and pan",
            "1 cup (8 1/2 ounces/242 grams) milk",
            "5 tablespoons (2 1/4 ounces/63 grams) granulated sugar",
            "1 tablespoon active dry yeast",
            "1 1/2 teaspoons kosher salt",
            "1 large egg plus 1 large egg yolk",
            "3 to 3 1/2 cups (13 1/2 to 15 1/2 ounces/383 to 439 grams) all- purpose flour as needed",
            "3/4 cup (1 1/2 sticks/6 ounces/170 grams) unsalted butter",
            "3/4 cup (4 1/2 ounces/128 grams) packed brown sugar",
            "1/4 cup (3 ounces/85 grams) light corn syrup",
            "3/4 cup (3 ounces/85 grams) chopped pecans",
            "4 tablespoons (1/2 stick/2 ounces/57 grams) unsalted butter",
            "1 cup (7 ounces/200 grams) granulated sugar",
            "1 tablespoon ground cinnamon"
        ],
        "instructions": [
            "1. To make the dough, melt the 1/2 cup butter in a small saucepan over medium-low heat. Add the milk and sugar and heat just to lukewarm (about 110°F), stirring to dissolve the sugar. Pour the warm milk mixture into a bowl. Stir in the yeast. Allow the mixture to sit for 10 minutes, then stir in the salt. 2. Beat the whole egg and egg yolk together and add to the yeast mixture. Stir in the flour 1 cup at a time until you have a sticky dough. Scrape the dough out onto a floured work surface and knead for about 5 minutes, until you have a nice smooth dough. Butter a large bowl. Place the dough in the prepared bowl and cover with plastic wrap. Put the bowl in a warm place and allow the dough to rise for 2 hours, until tripled in volume. 3. Meanwhile, brush a 9 × 13-inch baking pan with some melted butter (or spray it with vegetable oil spray). To prepare the sugar-pecan topping, melt the butter with the brown sugar and corn syrup in a small saucepan over medium-low heat, stirring to combine. Remove from the heat and spread the mixture in the bottom of the pan. Sprinkle with the chopped pecans. 4. Punch down the dough and turn it out of the bowl onto a lightly floured work surface. Knead for a minute, then use a lightly floured rolling pin to roll the dough into a rectangle about 15 × 12 inches and 1/8 inch thick. To make the cinnamon-sugar filling, melt the butter in a small saucepan over medium-low heat and allow it to cool. Brush the butter thoroughly over the surface of the dough. In a bowl, mix together the sugar and cinnamon. Sprinkle the cinnamon sugar evenly over the melted butter. Roll the rectangle up, like a jelly roll, along one long edge. 5. Slice the log of rolled dough into 1-inch-thick slices and arrange the slices, cut sides up, in the prepared pan. Cover the pan with a piece of plastic wrap (you can spray the plastic wrap first with vegetable oil spray to be sure it doesn't stick to the dough) and allow it to rise in a warm place for about 40 minutes. 6. Preheat the oven to 350°F. Bake the schnecken until golden brown, 35 to 40 minutes, rotating the pan halfway through the baking time. Check them occasionally during the baking time, and if they seem to be browning too quickly, loosely cover them with a sheet of aluminum foil. 7. Remove the pan from the oven and cool on a wire rack for 5 to 10 minutes. Turn the schnecken out of the pan while still warm by inverting the pan over a large platter or baking sheet. Serve the schnecken warm.",
            "1. To make the dough, melt the 1/2 cup butter in a small saucepan over medium-low heat. Add the milk and sugar and heat just to lukewarm (about 110°F), stirring to dissolve the sugar. Pour the warm milk mixture into a bowl. Stir in the yeast. Allow the mixture to sit for 10 minutes, then stir in the salt.",
            "2. Beat the whole egg and egg yolk together and add to the yeast mixture. Stir in the flour 1 cup at a time until you have a sticky dough. Scrape the dough out onto a floured work surface and knead for about 5 minutes, until you have a nice smooth dough. Butter a large bowl. Place the dough in the prepared bowl and cover with plastic wrap. Put the bowl in a warm place and allow the dough to rise for 2 hours, until tripled in volume.",
            "3. Meanwhile, brush a 9 × 13-inch baking pan with some melted butter (or spray it with vegetable oil spray). To prepare the sugar-pecan topping, melt the butter with the brown sugar and corn syrup in a small saucepan over medium-low heat, stirring to combine. Remove from the heat and spread the mixture in the bottom of the pan. Sprinkle with the chopped pecans.",
            "4. Punch down the dough and turn it out of the bowl onto a lightly floured work surface. Knead for a minute, then use a lightly floured rolling pin to roll the dough into a rectangle about 15 × 12 inches and 1/8 inch thick. To make the cinnamon-sugar filling, melt the butter in a small saucepan over medium-low heat and allow it to cool. Brush the butter thoroughly over the surface of the dough. In a bowl, mix together the sugar and cinnamon. Sprinkle the cinnamon sugar evenly over the melted butter. Roll the rectangle up, like a jelly roll, along one long edge.",
            "5. Slice the log of rolled dough into 1-inch-thick slices and arrange the slices, cut sides up, in the prepared pan. Cover the pan with a piece of plastic wrap (you can spray the plastic wrap first with vegetable oil spray to be sure it doesn't stick to the dough) and allow it to rise in a warm place for about 40 minutes.",
            "6. Preheat the oven to 350°F. Bake the schnecken until golden brown, 35 to 40 minutes, rotating the pan halfway through the baking time. Check them occasionally during the baking time, and if they seem to be browning too quickly, loosely cover them with a sheet of aluminum foil.",
            "7. Remove the pan from the oven and cool on a wire rack for 5 to 10 minutes. Turn the schnecken out of the pan while still warm by inverting the pan over a large platter or baking sheet. Serve the schnecken warm."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b0511ba7baf2e46eefba1b/6:4/w_274%2Ch_169/51128800_schnecken_1x1.jpg"
    }
}