{
    "recipe": {
        "title": "Granola Bark ",
        "ingredients": [
            "1 1/2 tsp ground cinnamon",
            "3 cups/300g rolled oats (not quick-cooking)",
            "1 1/4 cups/175g almonds, chopped",
            "1 1/4 cups/60g unsweetened shredded coconut",
            "1/2 cup/80g flax seeds or chia seeds, whole or ground",
            "1/4 cup/35g sesame seeds",
            "1/2 cup/60g almond flour or hazelnut flour",
            "1/2 cup/120ml maple syrup or honey, or 1/4 cup/60ml of each",
            "1/2 cup/75g coconut sugar",
            "1/4 cup/60ml water",
            "1 tsp vanilla extract",
            "1/2 tsp sea salt",
            "1/3 cup/80ml olive oil or vegetable oil",
            "1 large egg white, whisked until frothy"
        ],
        "instructions": [
            "Combine the cinnamon, oats, almonds, coconut, flax or chia seeds, sesame seeds, and almond flour or hazelnut flour in a large bowl.",
            "Preheat the oven to 325°F/165°C. Line a 13 by 18 inch/33 by 46cm rimmed baking sheet with parchment paper or a silicone mat.",
            "Combine the maple syrup or honey or a mix of both, coconut sugar, water, vanilla, and salt in a small saucepan and bring to a boil, stirring to dissolve the sugar and salt. Remove from the heat and let cool to warm room temperature.",
            "Add the olive oil and egg white to the cooled syrup mixture and whisk to incorporate. Pour over the oats mixture and mix well.",
            "Spread the mixture evenly across the prepared baking sheet. Using another same-size baking sheet or the bottom of a pot, press the mixture down firmly to compact it before baking. Bake for 45 minutes or longer, until dark golden brown, rotating the sheet after about 15 minutes to promote even browning. While the granola bakes, open the oven door a couple of times to release steam.",
            "Set the baking sheet on a cooling rack until the surface of the granola is crisp. Leave the oven on. If the surface is still tacky to the touch once it has cooled, return the pan to the oven and continue baking for another 10 to 15 minutes, checking every 5 minutes. Don’t let the bark get too dark, or it’ll taste bitter.",
            "Once cool, break the bark into pieces and store in an airtight container at room temperature for up to 2 weeks, or in the refrigerator for up to 1 month."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58d41e728d4f93266cf492ed/6:4/w_274%2Ch_169/tartine-granola-bar-bark-032317.jpg"
    }
}