{
    "recipe": {
        "title": "Grapefruit Bars with Candied Zest ",
        "ingredients": [
            "1 cup all-purpose flour",
            "3/4 cup powdered sugar",
            "2 Tbsp. granulated sugar",
            "3/4 tsp. kosher salt",
            "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
            "2 large egg yolks",
            "1 grapefruit",
            "1/2 cup granulated sugar, divided",
            "3 large eggs",
            "3 large egg yolks",
            "1 cup granulated sugar",
            "1 Tbsp. cornstarch",
            "1 Tbsp. finely grated grapefruit zest (from 1)",
            "1/4 cup fresh grapefruit juice (from 1)",
            "2 tsp. finely grated lemon zest (from 2)",
            "3/4 cup fresh lemon juice (from 5–6)",
            "1 tsp. vanilla extract or paste",
            "1/2 tsp. kosher salt",
            "1/2 cup (1 stick) unsalted butter, room temperature, cut into 8 pieces",
            "Powdered sugar (for serving; optional)"
        ],
        "instructions": [
            "Place a rack in middle of oven; preheat to 350°F. Line an 8x8\" baking pan, preferably metal, with overlapping sheets of parchment paper, leaving at least 4\" overhang on each side. Pulse flour, powdered sugar, granulated sugar, and salt in a food processor a few times to combine. Add butter and pulse until largest pieces are pea-size. Add egg yolks and pulse just until dough comes together in small clumps. (Shortbread can also be made by hand: Whisk dry ingredients in a large bowl, then work in the butter with your fingers before mixing in the egg yolks with a sturdy spoon.)",
            "Transfer dough to prepared pan (you may find it easier to form the dough into a ball first, instead of working with clumps—entirely up to you!) and press into an even layer. If dough is sticky, use a piece of plastic wrap between your hand and the dough. Prick dough with a fork in several spots (this helps it stay flat as it bakes). Bake shortbread until edges and top are golden brown, 24–28 minutes. Let cool.",
            "Candied grapefruit zest: While the shortbread is baking, use a sharp knife to remove zest from grapefruit in 2\"–3\" wide strips (it’s okay to leave some white pith attached). Slice strips very thinly lengthwise; save fruit for another use. Combine zest and 2 cups water in a small saucepan and bring to a simmer. Drain immediately. Combine zest with 1/4 cup granulated sugar and 1 cup water in the same saucepan and bring to a simmer. Cook, stirring occasionally, until zest is translucent and softened, 15–20 minutes. Drain, discarding syrup, and toss zest in a small bowl with remaining 1/4 cup granulated sugar. Set aside until ready to use.",
            "While the shortbread is baking, use a sharp knife to remove zest from grapefruit in 2\"–3\" wide strips (it’s okay to leave some white pith attached). Slice strips very thinly lengthwise; save fruit for another use. Combine zest and 2 cups water in a small saucepan and bring to a simmer. Drain immediately. Combine zest with 1/4 cup granulated sugar and 1 cup water in the same saucepan and bring to a simmer. Cook, stirring occasionally, until zest is translucent and softened, 15–20 minutes. Drain, discarding syrup, and toss zest in a small bowl with remaining 1/4 cup granulated sugar. Set aside until ready to use.",
            "Curd and assembly: Reduce oven temperature to 300°F. Vigorously whisk eggs, egg yolks, granulated sugar, and cornstarch in a large saucepan until smooth and sugar is mostly dissolved. Whisk in grapefruit zest and juice, lemon zest and juice, and vanilla. Set saucepan over medium heat and cook, whisking constantly and making sure to get into the corners of the pan, until curd begins to bubble slightly around the edges and thickens, about 5 minutes. Simmer very gently, still whisking, 30 seconds, then remove from heat. Whisk salt into curd, followed by butter a piece at a time, whisking to fully incorporate after each addition. Scrape curd into pan with shortbread and smooth over crust. Top with some of the candied grapefruit zest (you probably won’t need all of it; snack on any left over!). Bake grapefruit bars until surface of curd is set (the center will still wobble slightly when pan is gently shaken), 20–25 minutes. Transfer to the refrigerator and chill until very cold, at least 3 hours, or preferably overnight. Just before serving, slice grapefruit bars into 2\" squares and dust with powdered sugar if desired.",
            "Reduce oven temperature to 300°F. Vigorously whisk eggs, egg yolks, granulated sugar, and cornstarch in a large saucepan until smooth and sugar is mostly dissolved. Whisk in grapefruit zest and juice, lemon zest and juice, and vanilla. Set saucepan over medium heat and cook, whisking constantly and making sure to get into the corners of the pan, until curd begins to bubble slightly around the edges and thickens, about 5 minutes. Simmer very gently, still whisking, 30 seconds, then remove from heat. Whisk salt into curd, followed by butter a piece at a time, whisking to fully incorporate after each addition. Scrape curd into pan with shortbread and smooth over crust. Top with some of the candied grapefruit zest (you probably won’t need all of it; snack on any left over!).",
            "Bake grapefruit bars until surface of curd is set (the center will still wobble slightly when pan is gently shaken), 20–25 minutes. Transfer to the refrigerator and chill until very cold, at least 3 hours, or preferably overnight.",
            "Just before serving, slice grapefruit bars into 2\" squares and dust with powdered sugar if desired.",
            "Do Ahead Shortbread can be baked 3 days ahead. Store tightly covered at room temperature. Grapefruit can be candied 1 week ahead. Store airtight at room temperature. Bars can be baked 3 days ahead. Cover and keep chilled.",
            "Shortbread can be baked 3 days ahead. Store tightly covered at room temperature. Grapefruit can be candied 1 week ahead. Store airtight at room temperature. Bars can be baked 3 days ahead. Cover and keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c114607b6a8347908b6f8e4/6:4/w_274%2Ch_169/grapefruit-bars-with-candied-zest-recipe-BA-121218.jpg",
        "color": 12983044
    }
}