{
    "recipe": {
        "title": "Gratin of White Asparagus ",
        "ingredients": [
            "4 1/2 tbsp unsalted butter, melted",
            "15 white asparagus spears",
            "small bunch of lemon thyme, leaves only",
            "generous 3/4 cup crème fraîche",
            "1 tbsp Dijon mustard",
            "sea salt and freshly ground black pepper",
            "1 cup fresh white bread crumbs",
            "3 1/2 ounces Parmesan, freshly grated",
            "2 tbsp minced curly parsley"
        ],
        "instructions": [
            "Preheat the oven to 450°F (convection oven to 425°F). Brush a copper or ceramic gratin dish with a little of the melted butter. Trim the asparagus: you will find that white asparagus needs to be trimmed much higher—roughly halfway up the stalks, as a rule of thumb. Slice the spears in half lengthwise and lay them in the buttered gratin dish. Sprinkle with most of the lemon thyme leaves, saving a few for garnish. Now put the crème fraîche and mustard into a heavy pan and place over medium heat. Stir to combine and bring to a simmer, then turn down the heat slightly and let bubble to reduce by about a quarter. Season the reduced mixture with salt and pepper to taste. Meanwhile, put the bread crumbs in a bowl, add the Parmesan, parsley, and some pepper, and toss with your fingers to combine. Pour the mustardy crème fraîche over the asparagus, then scatter the crumb mixture on top, distributing it evenly. Drizzle over the rest of the melted butter. Bake the gratin on the middle shelf of the oven until the top is crisp and golden and the cream bubbles up around the sides of the dish, 15 to 20 minutes. Sprinkle with the remaining thyme leaves and serve.",
            "Preheat the oven to 450°F (convection oven to 425°F). Brush a copper or ceramic gratin dish with a little of the melted butter.",
            "Trim the asparagus: you will find that white asparagus needs to be trimmed much higher—roughly halfway up the stalks, as a rule of thumb. Slice the spears in half lengthwise and lay them in the buttered gratin dish. Sprinkle with most of the lemon thyme leaves, saving a few for garnish.",
            "Now put the crème fraîche and mustard into a heavy pan and place over medium heat. Stir to combine and bring to a simmer, then turn down the heat slightly and let bubble to reduce by about a quarter. Season the reduced mixture with salt and pepper to taste.",
            "Meanwhile, put the bread crumbs in a bowl, add the Parmesan, parsley, and some pepper, and toss with your fingers to combine.",
            "Pour the mustardy crème fraîche over the asparagus, then scatter the crumb mixture on top, distributing it evenly. Drizzle over the rest of the melted butter. Bake the gratin on the middle shelf of the oven until the top is crisp and golden and the cream bubbles up around the sides of the dish, 15 to 20 minutes. Sprinkle with the remaining thyme leaves and serve."
        ],
        "picture_link": null
    }
}