{
    "recipe": {
        "title": "Green Grits ",
        "ingredients": [
            "1 1/2 cups whole milk",
            "1 teaspoon salt",
            "1/2 teaspoon fresh-ground black pepper",
            "1 cup grits",
            "1 heaping cup fresh cilantro leaves",
            "One 4-ounce can diced green chiles (preferably Hatch brand, fire-roasted)",
            "6 green onions, chopped (about 1/2 cup)",
            "3 tablespoons unsalted butter",
            "1/2 cup grated sharp cheddar cheese",
            "1/4 cup grated Parmesan cheese"
        ],
        "instructions": [
            "Combine the milk and 2 1/2 cups of water in a medium-sized pot, and bring the mixture up to a simmer over medium-high heat. Mix in the salt and pepper. Then whisk in the grits, pouring them in slowly and whisking continuously until they're smooth, with no lumps. The grits should look a little like oatmeal, only finer. Turn the heat down to medium-low and keep cooking, whisking regularly so nothing sticks. Meanwhile, combine the cilantro leaves, diced green chiles, and green onions in a food processor and pulse for 30 seconds or so, until everything is finely chopped. When the grits have cooked through and thickened, pull the pot off the heat and add the cilantro mixture. Whisk everything together so the grits turn green. Then add the butter and whisk again, so the butter melts in. Whisk in the grated cheddar and Parmesan cheeses. Serve it up hot.",
            "Combine the milk and 2 1/2 cups of water in a medium-sized pot, and bring the mixture up to a simmer over medium-high heat.",
            "Mix in the salt and pepper. Then whisk in the grits, pouring them in slowly and whisking continuously until they're smooth, with no lumps. The grits should look a little like oatmeal, only finer.",
            "Turn the heat down to medium-low and keep cooking, whisking regularly so nothing sticks.",
            "Meanwhile, combine the cilantro leaves, diced green chiles, and green onions in a food processor and pulse for 30 seconds or so, until everything is finely chopped.",
            "When the grits have cooked through and thickened, pull the pot off the heat and add the cilantro mixture. Whisk everything together so the grits turn green. Then add the butter and whisk again, so the butter melts in.",
            "Whisk in the grated cheddar and Parmesan cheeses. Serve it up hot."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56043ac1968c2fa94dc98b41/6:4/w_274%2Ch_169/369253_hires.jpg"
    }
}