{
    "recipe": {
        "title": "Green Tea Cheesecake with Raspberries and Raspberry-Mint Tisane ",
        "ingredients": [
            "1 cup (generous) ground shortbread cookies (about 6 ounces)",
            "2 8-ounce packages cream cheese, room temperature (do not use whipped or \"light\" products)",
            "1/2 cup (packed) fromage blanc*",
            "3/4 cup plus 2 tablespoons sugar",
            "4 large eggs",
            "2 teaspoons Japanese green tea powder** or 2 teaspoons finely ground green tea from about 4 tea bags",
            "2 1/2-pint containers fresh red raspberries",
            "2 1/2-pint containers fresh golden raspberries",
            "1 bunch fresh mint",
            "Boiling water"
        ],
        "instructions": [
            "For cake: Preheat oven to 325°F. Press cookie crumbs firmly onto bottom (not sides) of 8-inch-diameter springform pan. Wrap outside of pan tightly with 3 layers of heavy-duty foil. Using electric mixer, beat cream cheese, fromage blanc, and sugar in large bowl until smooth. Add eggs 1 at a time, beating until incorporated after each addition. Beat in green tea powder until smooth. Pour batter over prepared crust in pan. Place cakein roasting pan; add enough hot water to roasting pan to come halfway up sides of springform pan. Bake cake until set but center moves very slightly when pan is gently shaken, about 1 hour. Remove cake from roasting pan; cool 1 hour at room temperature. Refrigerate uncovered overnight. (Can be prepared 2 days ahead. Cover and keep refrigerated.)",
            "Preheat oven to 325°F. Press cookie crumbs firmly onto bottom (not sides) of 8-inch-diameter springform pan. Wrap outside of pan tightly with 3 layers of heavy-duty foil. Using electric mixer, beat cream cheese, fromage blanc, and sugar in large bowl until smooth. Add eggs 1 at a time, beating until incorporated after each addition. Beat in green tea powder until smooth. Pour batter over prepared crust in pan. Place cakein roasting pan; add enough hot water to roasting pan to come halfway up sides of springform pan.",
            "Bake cake until set but center moves very slightly when pan is gently shaken, about 1 hour. Remove cake from roasting pan; cool 1 hour at room temperature. Refrigerate uncovered overnight. (Can be prepared 2 days ahead. Cover and keep refrigerated.)",
            "For tisane: Place 5 raspberries (mix of red and golden) and 3 mint leaves in each of 8 heatproof glasses. Fill glasses with boiling water; let steep 5 minutes. Cut around pan sides to loosen cake; remove sides. Place cake on platter. Garnish cake with some raspberries. Cut cake into wedges. Serve each piece with a few raspberries and a glass of tisane.",
            "Place 5 raspberries (mix of red and golden) and 3 mint leaves in each of 8 heatproof glasses. Fill glasses with boiling water; let steep 5 minutes.",
            "Cut around pan sides to loosen cake; remove sides. Place cake on platter. Garnish cake with some raspberries. Cut cake into wedges. Serve each piece with a few raspberries and a glass of tisane.",
            "*Fromage blanc is available at some supermarkets, cheese stores, and specialty foods stores. **Green tea powder is available at Japanese markets.",
            "*Fromage blanc is available at some supermarkets, cheese stores, and specialty foods stores.",
            "**Green tea powder is available at Japanese markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9930f3a00aeb2f1cf4b2/6:4/w_274%2Ch_169/233720.jpg"
    }
}