{
    "recipe": {
        "title": "Greek-Style Shrimp Pasta with Kale ",
        "ingredients": [
            "1 (28-ounce) can diced tomatoes",
            "2 tablespoons extra-virgin olive oil, plus more for drizzling",
            "6 garlic cloves, thinly sliced",
            "1/2 cup dry white wine",
            "2 teaspoons chopped oregano",
            "1 teaspoon crushed red pepper flakes",
            "1 1/2 tsp. kosher salt, plus more",
            "8 ounces medium shell pasta",
            "1 large bunch of curly kale, stems removed, torn into bite-sized pieces (about 10 cups)",
            "1 1/2 pounds large shrimp, peeled, deveined",
            "2 1/2 ounces crumbled feta (about 1/2 cup)"
        ],
        "instructions": [
            "Pour tomatoes into a fine-mesh sieve set over a medium bowl. Shake to release as much juice as possible, then let tomatoes drain in sieve, collecting juices in bowl, until ready to use. Heat 2 Tbsp. oil in a large Dutch oven or other large heavy pot over high. Add drained tomatoes and garlic and cook, stirring occasionally, until they begin to caramelize, about 12 minutes. Add wine and cook, scraping up browned bits, until reduced by half, about 1 minute. Add collected tomato juices, oregano, red pepper, and 1 1/2 tsp. salt and bring to a simmer. Cook, stirring occasionally, until slightly thickened, about 5 minutes. Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, 3 minutes less than package directions. Drain, reserving 1 cup pasta cooking liquid. Working in batches, add kale to tomato sauce, stirring after each addition, until all kale is wilted. Using a spider or slotted spoon, transfer pasta to pot with sauce. Add shrimp, cover, and cook, stirring occasionally and adding pasta cooking liquid if needed to loosen sauce, until pasta is al dente, shrimp are cooked through, and everything is nicely coated in sauce, about 3 minutes. Divide pasta among bowls. Top with feta and drizzle with oil.",
            "Pour tomatoes into a fine-mesh sieve set over a medium bowl. Shake to release as much juice as possible, then let tomatoes drain in sieve, collecting juices in bowl, until ready to use.",
            "Heat 2 Tbsp. oil in a large Dutch oven or other large heavy pot over high. Add drained tomatoes and garlic and cook, stirring occasionally, until they begin to caramelize, about 12 minutes. Add wine and cook, scraping up browned bits, until reduced by half, about 1 minute. Add collected tomato juices, oregano, red pepper, and 1 1/2 tsp. salt and bring to a simmer. Cook, stirring occasionally, until slightly thickened, about 5 minutes.",
            "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, 3 minutes less than package directions. Drain, reserving 1 cup pasta cooking liquid.",
            "Working in batches, add kale to tomato sauce, stirring after each addition, until all kale is wilted. Using a spider or slotted spoon, transfer pasta to pot with sauce. Add shrimp, cover, and cook, stirring occasionally and adding pasta cooking liquid if needed to loosen sauce, until pasta is al dente, shrimp are cooked through, and everything is nicely coated in sauce, about 3 minutes.",
            "Divide pasta among bowls. Top with feta and drizzle with oil."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a32afe1ff2e7d346fdd7d10/6:4/w_274%2Ch_169/shrimp-and-tomato-pasta-11032017.jpg"
    }
}