{
    "recipe": {
        "title": "Green Panzanella with Pickled Shallot ",
        "ingredients": [
            "1 large shallot, thinly sliced",
            "1/2 cup red wine vinegar",
            "Kosher salt, freshly ground pepper",
            "3 1/2 pounds assorted ripe green heirloom tomatoes (such as Green Zebras), cut into wedges",
            "1/2 cup extra-virgin olive oil",
            "4 cups torn 1 1/2\" pieces white country bread, with crusts (about 1/2 of a 1-pound loaf)",
            "2 garlic cloves, lightly crushed",
            "3 tablespoons olive oil",
            "Kosher salt, freshly ground pepper",
            "2 cups arugula, thick stems trimmed"
        ],
        "instructions": [
            "For tomatoes and pickled shallot: Combine shallot and vinegar in a small bowl; season with salt and pepper and toss to combine. Let stand 30 minutes. Meanwhile, place tomatoes on a large rimmed baking sheet; season with salt and let stand 15 minutes. Transfer 2 tablespoons vinegar from shallot mixture to a large bowl (reserve remaining vinegar with shallots). Whisking constantly, gradually add oil; whisk until combined. Season dressing with salt, pepper, and more vinegar from shallot mixture, if desired. Add tomatoes and their juices to dressing and gently toss to coat. Let tomato mixture stand at room temperature until tomatoes release more juices and soften slightly, about 1 hour.",
            "Combine shallot and vinegar in a small bowl; season with salt and pepper and toss to combine. Let stand 30 minutes.",
            "Meanwhile, place tomatoes on a large rimmed baking sheet; season with salt and let stand 15 minutes.",
            "Transfer 2 tablespoons vinegar from shallot mixture to a large bowl (reserve remaining vinegar with shallots). Whisking constantly, gradually add oil; whisk until combined. Season dressing with salt, pepper, and more vinegar from shallot mixture, if desired.",
            "Add tomatoes and their juices to dressing and gently toss to coat. Let tomato mixture stand at room temperature until tomatoes release more juices and soften slightly, about 1 hour.",
            "For croutons and assembly: Meanwhile, preheat oven to 350°F. Combine bread and garlic on a large rimmed baking sheet and drizzle with oil; season with salt and pepper. Squeeze bread pieces lightly with your hands so they will evenly absorb oil and spread out in a single layer. Bake bread pieces, tossing occasionally, until crisp on the outside but still chewy in the center, 10-15 minutes. Let croutons cool slightly, then discard garlic. Add arugula and croutons to bowl with tomato mixture; season with salt and pepper and toss to combine. Drain pickled shallot. Serve panzanella topped with pickled shallot.",
            "Meanwhile, preheat oven to 350°F. Combine bread and garlic on a large rimmed baking sheet and drizzle with oil; season with salt and pepper. Squeeze bread pieces lightly with your hands so they will evenly absorb oil and spread out in a single layer.",
            "Bake bread pieces, tossing occasionally, until crisp on the outside but still chewy in the center, 10-15 minutes. Let croutons cool slightly, then discard garlic.",
            "Add arugula and croutons to bowl with tomato mixture; season with salt and pepper and toss to combine. Drain pickled shallot. Serve panzanella topped with pickled shallot."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54af4ba0c4a891cc44ccd5a8/6:4/w_274%2Ch_169/51179200_panzanella-shallot_1x1.jpg"
    }
}