{
    "recipe": {
        "title": "Green Chicken Soup with Dill Matzo Balls ",
        "ingredients": [
            "4 large eggs, lightly beaten",
            "1/4 cup plus 1 tablespoon vegetable oil or chicken schmaltz",
            "1 cup matzo meal",
            "1/4 cup seltzer water",
            "2 tablespoons chopped dill",
            "2 teaspoons kosher salt, plus more",
            "1 whole chicken (about 3 1/2 pounds)",
            "3 celery stalks, halved crosswise",
            "3 large carrots, peeled and halved crosswise",
            "2 medium onions, peeled and halved through the root",
            "1 medium fennel bulb, quartered and cored",
            "6 garlic cloves, peeled",
            "1 bay leaf",
            "1/4 cup (loosely packed) fresh dill with stems, plus more roughly chopped fresh dill for serving",
            "1/4 cup (loosely packed) fresh parsley with stems, plus more roughly chopped fresh parsley for serving",
            "4-5 ounces Tuscan kale (about 1/2 bunch), stemmed and cut crosswise into 1/4-inch ribbons",
            "Kosher salt and freshly ground pepper"
        ],
        "instructions": [
            "For the soup: Place chicken, celery, carrots, onions, fennel, garlic, bay leaf, and parsley and dill with stems in a large pot. Add cold water to cover by 1\". Bring to a boil over high heat, then reduce heat to low. Gently simmer, partially covered, skimming off any foam that accumulates, until chicken is very tender and falling off the bone, about 1 1/2-2 hours. While the soup is simmering, make the matzo balls: Using a fork, mix together the eggs, oil, matzo meal, seltzer water, dill, and 2 tsp. salt in a large bowl. Cover and refrigerate for 30 minutes. Meanwhile, bring a large pot of generously salted water to a boil over high heat. Reduce heat to medium-low and keep water at a simmer. Moisten your hands with water. Scoop out a rounded tablespoonful of chilled matzo ball batter and very gently pat into a 1\" ball (avoid squeezing too hard or rolling too much). Drop into simmering water and repeat with remaining batter. Cover pot and gently simmer until matzo balls are tender and puffed, 40-45 minutes. Drain matzo balls and return to the pot; cover and keep in a warm place. Remove chicken and vegetables from the chicken broth with a slotted spoon and transfer to a cutting board; let rest until cool enough to handle. Meanwhile, strain broth through a fine-mesh sieve into a large bowl, discarding solids. Return the strained broth to the pot. Using your fingers, remove chicken meat from bones and shred into bite-sized pieces. Slice vegetables into bite-size pieces. Place chicken and vegetables in broth, cover pot, and set aside in a warm place until ready to serve. To serve, add kale to broth and bring to a simmer over medium heat. Cook, stirring occasionally, until kale softens, 3-5 minutes. Season soup generously with salt and pepper. Divide matzo balls among bowls and ladle soup on top. Garnish with chopped parsley and dill before serving.",
            "Place chicken, celery, carrots, onions, fennel, garlic, bay leaf, and parsley and dill with stems in a large pot. Add cold water to cover by 1\". Bring to a boil over high heat, then reduce heat to low. Gently simmer, partially covered, skimming off any foam that accumulates, until chicken is very tender and falling off the bone, about 1 1/2-2 hours.",
            "While the soup is simmering, make the matzo balls: Using a fork, mix together the eggs, oil, matzo meal, seltzer water, dill, and 2 tsp. salt in a large bowl. Cover and refrigerate for 30 minutes.",
            "Meanwhile, bring a large pot of generously salted water to a boil over high heat. Reduce heat to medium-low and keep water at a simmer.",
            "Moisten your hands with water. Scoop out a rounded tablespoonful of chilled matzo ball batter and very gently pat into a 1\" ball (avoid squeezing too hard or rolling too much). Drop into simmering water and repeat with remaining batter. Cover pot and gently simmer until matzo balls are tender and puffed, 40-45 minutes. Drain matzo balls and return to the pot; cover and keep in a warm place.",
            "Remove chicken and vegetables from the chicken broth with a slotted spoon and transfer to a cutting board; let rest until cool enough to handle. Meanwhile, strain broth through a fine-mesh sieve into a large bowl, discarding solids. Return the strained broth to the pot. Using your fingers, remove chicken meat from bones and shred into bite-sized pieces. Slice vegetables into bite-size pieces. Place chicken and vegetables in broth, cover pot, and set aside in a warm place until ready to serve.",
            "To serve, add kale to broth and bring to a simmer over medium heat. Cook, stirring occasionally, until kale softens, 3-5 minutes. Season soup generously with salt and pepper.",
            "Divide matzo balls among bowls and ladle soup on top. Garnish with chopped parsley and dill before serving.",
            "Do Ahead Matzo balls can be cooled to room temperature, then stored, covered, in the fridge up to 1 day. Soup can be made until just before adding kale, cooled to room temperature, then stored in a covered container in the fridge up to 1 day. Reheat, then add kale and simmer for a few minutes before serving.",
            "Matzo balls can be cooled to room temperature, then stored, covered, in the fridge up to 1 day. Soup can be made until just before adding kale, cooled to room temperature, then stored in a covered container in the fridge up to 1 day. Reheat, then add kale and simmer for a few minutes before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5506fb2dd7d414037b2afcba/6:4/w_274%2Ch_169/EP-03132015-matzo-soup-6x4.jpg"
    }
}