{
    "recipe": {
        "title": "Green-Tea Truffles ",
        "ingredients": [
            "2 cups/310 g finely chopped premium white chocolate",
            "1 1/2 cups/360 ml heavy cream",
            "2 green-tea bags",
            "1/2 teaspoon salt",
            "1 tsp vanilla extract",
            "About 1/4 cup/55 g matcha (Japanese green-tea powder)",
            "3/4 cup/70 g powdered sugar",
            "1/2 cup/15 g crispy rice cereal, crushed"
        ],
        "instructions": [
            "1 In a double boiler, partially melt the white chocolate over simmering water until it's semiliquid but still lumpy. Place the cream, tea bags, and salt in a heat-proof measuring cup and microwave for 1 minute. (Alternatively, heat these ingredients in a small saucepan just until they simmer, then cool for 1 minute.) Remove the tea bags. In a medium bowl, stir together the cream mixture and the melted chocolate. Add the vanilla. Keep stirring until the mixture smooths into a well-blended ganache. 2 Cool the ganache in the refrigerator for at least 30 minutes. 3 With two spoons, scoop 1-in/2.5-cm balls of the ganache onto a baking sheet. Roll the balls with your hands into smooth, uniform shapes. Chill if necessary. 4 Sift the matcha and powdered sugar together in a small bowl. Mix in the cereal. Dip each ganache ball into the matcha mixture and shake off the excess. Serve at room temperature.",
            "1 In a double boiler, partially melt the white chocolate over simmering water until it's semiliquid but still lumpy. Place the cream, tea bags, and salt in a heat-proof measuring cup and microwave for 1 minute. (Alternatively, heat these ingredients in a small saucepan just until they simmer, then cool for 1 minute.) Remove the tea bags. In a medium bowl, stir together the cream mixture and the melted chocolate. Add the vanilla. Keep stirring until the mixture smooths into a well-blended ganache.",
            "2 Cool the ganache in the refrigerator for at least 30 minutes.",
            "3 With two spoons, scoop 1-in/2.5-cm balls of the ganache onto a baking sheet. Roll the balls with your hands into smooth, uniform shapes. Chill if necessary.",
            "4 Sift the matcha and powdered sugar together in a small bowl. Mix in the cereal. Dip each ganache ball into the matcha mixture and shake off the excess. Serve at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b01adecf36710e6195fa9c/6:4/w_274%2Ch_169/51162200_green-tea-truffles_1x1.jpg"
    }
}