{
    "recipe": {
        "title": "Greek Millet Saganaki with Shrimp and Ouzo ",
        "ingredients": [
            "1 1/4 cups water",
            "3/4 cup millet",
            "1 bay leaf",
            "Pinch of fine sea salt",
            "1 tablespoon extra-virgin olive oil",
            "1 cup finely chopped yellow onion (about 1 small)",
            "1 clove garlic, peeled and slightly crushed",
            "1 small hot green chile, minced (optional)",
            "1/4 teaspoon fine sea salt",
            "2 tablespoons tomato paste",
            "1 (28-ounce) can whole tomatoes, crushed in a bowl",
            "1/4 teaspoon freshly ground black pepper",
            "1/2 cup green pimiento-stuffed olives, halved if large",
            "4 ounces coarsely crumbled Greek feta cheese (about 1 cup), preferably sheep's milk",
            "1 pound jumbo shell-on shrimp, deveined and patted dry",
            "Fine sea salt and freshly ground black pepper",
            "2 tablespoons extra-virgin olive oil",
            "1/3 cup ouzo, or other anise-flavored liqueur",
            "1/4 cup chopped fresh flat-leaf parsley"
        ],
        "instructions": [
            "1 To prepare the millet, bring the water, millet, bay leaf, and salt to a boil in a 2-quart saucepan. Decrease the heat to maintain a simmer, cover, and cook until the water is absorbed, about 15 minutes. Remove from the heat and let sit, covered, for 5 to 10 minutes. Uncover, remove the bay leaf, and set aside to cool.",
            "2 Meanwhile, make the saganaki. Heat the olive oil in a large Dutch oven or large heavy-bottomed saucepan over medium heat until it shimmers. Add the onion, garlic, chile, and salt; cook, stirring frequently, until the onion softens and turns light golden, about 5 minutes. Add the tomato paste and cook, stirring, until it darkens, about 1 minute. Add the tomatoes with their juices and the pepper; bring to a boil over medium-high heat. Decrease the heat to maintain a light boil and cook, uncovered, for 3 minutes.",
            "3 Stir in the millet and green olives. Taste for salt and pepper and adjust (keeping in mind that olives and feta cheese can be quite salty). Remove the pot from the heat, sprinkle with the feta, and cover to allow the cheese to soften.",
            "4 To prepare the shrimp, season them with salt and pepper. Heat the olive oil in a 12-inch skillet over high heat until it shimmers. Add the shrimp. Cook, undisturbed, until the shrimp turn golden, 1 to 2 minutes, and then flip them with a spatula and cook until they are just opaque throughout, 1 to 2 more minutes, depending on the size. Add the ouzo and cook until syrupy, about 30 seconds. Using a spatula, briskly remove the shrimp from the pan and arrange on top of the millet. Sprinkle with the parsley and serve at once."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56043a70968c2fa94dc98a6d/6:4/w_274%2Ch_169/366650.jpg",
        "color": 9238853
    }
}