{
    "recipe": {
        "title": "Green Tea Noodles with Gochujang Dipping Sauce ",
        "ingredients": [
            "3 dried anchovies or 3 tablespoons dried bonito flakes",
            "1 small piece konbu (dried kelp), wiped lightly with a dry cloth",
            "1 garlic clove, peeled",
            "3 tablespoons gochujang (Korean hot pepper paste)",
            "2 tablespoons finely grated cucumber",
            "2 tablespoons finely grated daikon radish",
            "2 tablespoons fresh lime juice",
            "1 tablespoon finely grated ginger",
            "1 tablespoon low-sodium soy sauce",
            "2 teaspoons toasted sesame oil",
            "1 1/2 teaspoons sugar",
            "1 (7-ounce) package green tea soba noodles",
            "1/2 medium cucumber, cut into matchsticks",
            "Thai or regular basil leaves (for serving)"
        ],
        "instructions": [
            "Bring anchovies, konbu, garlic, and 1 1/2 cups water to a boil in a medium pot over medium-high, stirring occasionally. Reduce to a simmer, cover, and cook 7 minutes. Pour mixture through a fine-mesh sieve set over a large bowl; discard solids.",
            "Make the dipping sauce: Whisk gochujang, cucumber, radish, lime juice, ginger, soy sauce, sesame oil, sugar, and 1 cup dashi in a medium bowl until well combined. Chill until cold.",
            "Whisk gochujang, cucumber, radish, lime juice, ginger, soy sauce, sesame oil, sugar, and 1 cup dashi in a medium bowl until well combined. Chill until cold.",
            "To serve: Cook soba noodles in a large pot of boiling salted water, stirring occasionally, until noodles are cooked through but still chewy, 4–6 minutes. Drain and rinse with cold water immediately to stop the cooking process. Divide noodles among 2 plates or bowls. Garnish with cucumber matchsticks and Thai basil leaves. Serve with dipping sauce on the side.",
            "Cook soba noodles in a large pot of boiling salted water, stirring occasionally, until noodles are cooked through but still chewy, 4–6 minutes. Drain and rinse with cold water immediately to stop the cooking process.",
            "Divide noodles among 2 plates or bowls. Garnish with cucumber matchsticks and Thai basil leaves. Serve with dipping sauce on the side.",
            "Do Ahead Dashi can be made up to 3 days in advance and refrigerated.",
            "Dashi can be made up to 3 days in advance and refrigerated."
        ],
        "picture_link": "https://assets.epicurious.com/photos/553562d7a628db5238489267/6:4/w_274%2Ch_169/EP-04162015-edlee-noodles-hires.jpg",
        "color": 7625453
    }
}