{
    "recipe": {
        "title": "Green Beans with Coriander and Garlic ",
        "ingredients": [
            "2 pounds tender young green beans, washed and tipped",
            "3 quarts boiling water plus 1 1/2 teaspoons salt",
            "2 large garlic cloves, peeled and minced",
            "2/3 cup coarsely chopped fresh coriander (the dried won't do)",
            "5 to 6 tablespoons olive oil",
            "1 tablespoon lemon juice",
            "3 to 4 tablespoons cider vinegar",
            "1/4 teaspoon freshly ground black pepper (about)"
        ],
        "instructions": [
            "Cook the beans in the boiling salted water in a large covered saucepan over moderate heat 10 to 12 minutes until tender. Meanwhile, place the garlic and coriander in a large heat-proof bowl. As soon as the beans are done, drain well, return to moderate heat, and shake the pan 30 to 40 seconds to drive off all excess moisture. Dump the hot beans on top of the garlic and coriander and let stand 10 minutes. Add 5 tablespoons of the olive oil and toss well to mix; cover and marinate in the refrigerator 3 to 4 hours or, better yet, overnight. About 45 minutes before serving, bring the beans from the refrigerator and let stand, still covered, on the counter. Just before serving, add the lemon juice, 3 tablespoons of the vinegar, and the pepper. Toss well, taste, and add more vinegar, olive oil, salt, and pepper, if needed. Serve as an accompaniment to pork, poultry, veal, or beef.",
            "Cook the beans in the boiling salted water in a large covered saucepan over moderate heat 10 to 12 minutes until tender. Meanwhile, place the garlic and coriander in a large heat-proof bowl. As soon as the beans are done, drain well, return to moderate heat, and shake the pan 30 to 40 seconds to drive off all excess moisture. Dump the hot beans on top of the garlic and coriander and let stand 10 minutes. Add 5 tablespoons of the olive oil and toss well to mix; cover and marinate in the refrigerator 3 to 4 hours or, better yet, overnight.",
            "About 45 minutes before serving, bring the beans from the refrigerator and let stand, still covered, on the counter. Just before serving, add the lemon juice, 3 tablespoons of the vinegar, and the pepper. Toss well, taste, and add more vinegar, olive oil, salt, and pepper, if needed. Serve as an accompaniment to pork, poultry, veal, or beef."
        ],
        "picture_link": null
    }
}