{
    "recipe": {
        "title": "Green Goddess Cobb Salad ",
        "ingredients": [
            "2 scallions, finely chopped",
            "1/4 cup fresh tarragon leaves with tender stems",
            "2 tablespoons chopped fresh chives",
            "2 tablespoons chopped fresh cilantro",
            "2 tablespoons chopped fresh parsley",
            "1/4 cup olive oil",
            "2 tablespoons white wine vinegar",
            "2 tablespoons plain yogurt",
            "1 avocado, cut into 1/4\" slices, divided",
            "Kosher salt, freshly ground pepper",
            "1 ounce guanciale (salt-cured pork jowl), very thinly sliced",
            "1 rotisserie chicken, skin removed and reserved, meat torn into bite-size pieces",
            "4 Little Gem lettuces or other small lettuces, leaves separated",
            "1 fennel bulb, thinly sliced",
            "1 cup pea shoots (tendrils)",
            "1/2 small red onion, thinly sliced"
        ],
        "instructions": [
            "Puree scallions, tarragon, chives, cilantro, parsley, oil, vinegar, yogurt, and one-fourth of avocado in a food processor until smooth. Thin dressing with water, adding a little at a time, until similar in consistency to heavy cream; season with salt and pepper. Heat a dry small skillet over medium and cook guanciale, turning occasionally, until fat is rendered and meat is brown and crisp, 5–8 minutes. Transfer to paper towels to drain. Add reserved chicken skin to skillet and cook, turning and pressing occasionally, until golden brown and crisp, 5–8 minutes. Transfer to paper towels with guanciale. Arrange lettuce on a platter; drizzle with half of dressing and season with salt and pepper. Top with chicken meat, fennel, pea shoots, onion, and remaining avocado. Season with salt and pepper. Drizzle with remaining dressing and crumble crispy chicken skin and guanciale over top.",
            "Puree scallions, tarragon, chives, cilantro, parsley, oil, vinegar, yogurt, and one-fourth of avocado in a food processor until smooth. Thin dressing with water, adding a little at a time, until similar in consistency to heavy cream; season with salt and pepper.",
            "Heat a dry small skillet over medium and cook guanciale, turning occasionally, until fat is rendered and meat is brown and crisp, 5–8 minutes. Transfer to paper towels to drain.",
            "Add reserved chicken skin to skillet and cook, turning and pressing occasionally, until golden brown and crisp, 5–8 minutes. Transfer to paper towels with guanciale.",
            "Arrange lettuce on a platter; drizzle with half of dressing and season with salt and pepper. Top with chicken meat, fennel, pea shoots, onion, and remaining avocado. Season with salt and pepper. Drizzle with remaining dressing and crumble crispy chicken skin and guanciale over top."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5537e4a567c3a7e837c3f185/6:4/w_274%2Ch_169/56389408_green-goddess-cobb-salad_1x1.jpg"
    }
}