{
    "recipe": {
        "title": "Green Mole with Pork ",
        "ingredients": [
            "2 pounds boneless center cut pork loin in one piece, rolled and tied together with the ribs and backbone",
            "1/2 teaspoon black peppercorns, bruised",
            "1 teaspoon salt, or to taste",
            "9 garlic cloves",
            "8 whole cloves, or 1/4 teaspoon ground",
            "1 teaspoon cumin seeds",
            "3 jalapeño chiles, tops removed",
            "6 large tomatillos, husks removed",
            "1 small onion, cut into chunks",
            "2 sprigs fresh thyme",
            "2 sprigs fresh marjoram",
            "1 cup (8 ounces) masa, either fresh or reconstituted by mixing 6 tablespoons masa harina to a smooth paste with 1 cup of water (see Tips, below)",
            "1 medium bunch Italian parsley",
            "Eight 6-inch sprigs fresh epazote or 1/4 cup dried, crumbled (see Tips, below)",
            "3 large or 5 medium-size fresh hoja santa leaves or 6 dried leaves (see Tips, below)",
            "2 cups cooked Great Northern or other white beans"
        ],
        "instructions": [
            "Choose a deep saucepan or Dutch oven large enough to hold the meat comfortably. Place the tied pork loin and bones in it along with the peppercorns, salt, and 4 of the garlic cloves. Add enough cold water to cover by 1 inch (at least 7 cups). Bring to a boil over high heat. Reduce the heat to medium-low and cook, partly covered, for 1 hour, or until a meat thermometer inserted into the center reads 120° F. (Do not worry about the low temperature. The meat will cook more thoroughly in reheating.) Remove the meat and bones from the cooking stock and set aside. Strain the stock; you should have about 6 cups.",
            "Grind the cloves and cumin together in an electric coffee or spice grinder, or with a mortar and pestle. Place the ground spices in a blender with the chiles, tomatillos, onion, thyme, marjoram, the remaining 5 garlic cloves, and 1/2 cup of the strained stock. Process until smoothly puréed (about 2 minutes on high).",
            "Return the remaining strained stock to the pan; bring back to a boil, and adjust the heat to maintain a gentle simmer. Add the puréed mixture to the hot stock and cook, uncovered, for 3 minutes.",
            "Thin the masa by mixing with 1 cup water. Whisk the thinned masa into the stock mixture; whisking constantly, let the sauce return to the simmer.",
            "Cook, uncovered, over low heat for 10 minutes, whisking occasionally. If lumps form, pass the mixture through a medium-mesh sieve (pushing with a spoon to force through the lumpy bits) and return to the heat. The mixture should thicken to the consistency of whipping cream; if necessary, increase the heat slightly to reduce and thicken it.",
            "Untie the cooked pork and carve into serving pieces. Carve the bones into separate rib sections.",
            "Place the parsely, epazote, and hoja santa in a blender or food processor. If using a blender, add a few tablespoons water to facilitate blending. Process to a smooth purée.",
            "Add the cooked beans to the masa-thickened sauce and let return to a simmer. Return the carved meat and bones to the pot along with the puréed herbs. Taste and add more salt if desired. Cook until just heated through, 4 to 5 minutes. Give each person a piece or two of rib bone along with the meat and sauce. Serve immediately."
        ],
        "picture_link": null
    }
}