{
    "recipe": {
        "title": "Green Beans with Ginger and Cashews ",
        "ingredients": [
            "1 1/2 pounds green beans, trimmed and cut into 1-inch pieces (about 5 cups)",
            "4 tablespoons (1/2 stick) unsalted butter",
            "3 tablespoons fresh ginger, peeled and finely chopped (from 2 1/2-inch knob)",
            "1/2 cup Homemade Turkey Stock or canned turkey stock or canned low-sodium chicken broth",
            "1 cup salted roasted cashews, coarsely chopped",
            "1/2 teaspoon salt",
            "1/4 teaspoon freshly ground black pepper"
        ],
        "instructions": [
            "In large pot boiling salted water , cook beans until crisp-tender, about 4 minutes. Drain in colander and rinse well under cold running water. Drain well and pat dry with paper towels. (Green beans can be prepared up to 1 day ahead and refrigerated, wrapped in paper towels, in zippered plastic bags.) In 12-inch heavy skillet over moderate heat, heat butter until hot but not smoking. Add ginger and sauté until softened and fragrant, about 30 seconds. Stir in green beans and stock and cook, stirring often, until liquid is almost completely evaporated, about 3 to 6 minutes. Add cashews and sauté 1 minute. Stir in salt and pepper. (Green beans can be made up to 30 minutes before serving. Let stand in skillet, uncovered. Reheat over high heat, stirring often, about 2 minutes.) Transfer to serving dish and serve immediately.",
            "In large pot boiling salted water , cook beans until crisp-tender, about 4 minutes. Drain in colander and rinse well under cold running water. Drain well and pat dry with paper towels. (Green beans can be prepared up to 1 day ahead and refrigerated, wrapped in paper towels, in zippered plastic bags.)",
            "In 12-inch heavy skillet over moderate heat, heat butter until hot but not smoking. Add ginger and sauté until softened and fragrant, about 30 seconds. Stir in green beans and stock and cook, stirring often, until liquid is almost completely evaporated, about 3 to 6 minutes. Add cashews and sauté 1 minute. Stir in salt and pepper. (Green beans can be made up to 30 minutes before serving. Let stand in skillet, uncovered. Reheat over high heat, stirring often, about 2 minutes.) Transfer to serving dish and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a6cf9a84192308a1c6c/6:4/w_274%2Ch_169/240448_hires.jpg"
    }
}