{
    "recipe": {
        "title": "Griddle Cakes with Marmalade and Clotted Cream ",
        "ingredients": [
            "1/2 cup all-purpose flour",
            "1/2 cup quick-cooking oats",
            "2 teaspoons sugar",
            "1 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "1/4 teaspoon salt",
            "1 cup well-shaken buttermilk",
            "1 large egg, lightly beaten",
            "5 tablespoons unsalted butter, melted and cooled slightly",
            "Accompaniments: marmalade or jam; clotted cream or crème fraîche"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 200°F. Warm 4 plates in oven. Heat a well-seasoned griddle or heavy skillet (preferably cast-iron) over moderately low heat until hot. While griddle heats, whisk together flour, oats, sugar, baking powder, baking soda, and salt, then whisk in buttermilk, egg, and 3 tablespoons butter until combined. Brush hot griddle with some of remaining butter, then spoon 3 tablespoons batter per oatcake onto hot griddle and cook until bubbles appear on surface, edges are set, and undersides are golden, 1 to 2 minutes. Flip cakes with a large spatula and cook until tops spring back when pressed gently, 1 to 2 minutes more. Transfer as cooked to plates in oven and loosely cover with foil. Brush griddle with butter between batches if necessary. Brush griddle cakes with any remaining butter and serve immediately.",
            "Put oven rack in middle position and preheat oven to 200°F. Warm 4 plates in oven.",
            "Heat a well-seasoned griddle or heavy skillet (preferably cast-iron) over moderately low heat until hot.",
            "While griddle heats, whisk together flour, oats, sugar, baking powder, baking soda, and salt, then whisk in buttermilk, egg, and 3 tablespoons butter until combined.",
            "Brush hot griddle with some of remaining butter, then spoon 3 tablespoons batter per oatcake onto hot griddle and cook until bubbles appear on surface, edges are set, and undersides are golden, 1 to 2 minutes. Flip cakes with a large spatula and cook until tops spring back when pressed gently, 1 to 2 minutes more. Transfer as cooked to plates in oven and loosely cover with foil. Brush griddle with butter between batches if necessary.",
            "Brush griddle cakes with any remaining butter and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de5337b55306961bfd6d8/6:4/w_274%2Ch_169/231656.jpg"
    }
}