{
    "recipe": {
        "title": "Grilled Salmon with Thai Curry Sauce and Basmati Rice ",
        "ingredients": [
            "1 cup basmati rice",
            "1 1/2 cups water",
            "2 tablespoons unsalted butter",
            "1 1/8 teaspoons minced peeled fresh gingerroot",
            "1 1/8 teaspoons minced garlic",
            "2 1/4 teaspoons peanut oil",
            "3/4 teaspoon ground coriander seeds",
            "1 1/2 teaspoons curry powder",
            "1 1/2 teaspoons Thai red curry paste",
            "1 1/2 teaspoons paprika",
            "3/4 teaspoon ground cumin",
            "1 1/4 cups well-stirred unsweetened coconut milk",
            "3 tablespoons tomato purée",
            "1 tablespoon soy sauce",
            "1 1/2 tablespoons packed dark brown sugar",
            "3 cups finely shredded green cabbage",
            "3/4 cup julienne strips of seeded peeled cucumber",
            "3 tablespoons finely chopped fresh coriander",
            "3 tablespoons finely chopped fresh mint leaves",
            "1 tablespoon soy sauce",
            "3 tablespoons rice vinegar (not seasoned)",
            "four 6-ounce pieces salmon fillet",
            "olive oil for brushing salmon",
            "1/4 cup roasted peanuts"
        ],
        "instructions": [
            "Preheat oven to 400°F.",
            "In a saucepan with an ovenproof lid bring rice, water, and butter to boil. Bake rice, covered, in middle of oven 12 minutes. Keep rice warm.",
            "Make sauce: In a heavy saucepan sauté gingerroot and garlic in oil over moderately high heat, stirring, until golden. Add coriander, curry powder, curry paste, paprika, and cumin and sauté, stirring, 1 minute, or until fragrant. Whisk in coconut milk, tomato purée, soy sauce, and brown sugar and bring just to a boil. Remove pan from heat and keep warm.",
            "In a heavy saucepan sauté gingerroot and garlic in oil over moderately high heat, stirring, until golden. Add coriander, curry powder, curry paste, paprika, and cumin and sauté, stirring, 1 minute, or until fragrant. Whisk in coconut milk, tomato purée, soy sauce, and brown sugar and bring just to a boil. Remove pan from heat and keep warm.",
            "Prepare vegetables: In a bowl toss together all vegetable ingredients.",
            "In a bowl toss together all vegetable ingredients.",
            "Prepare grill. Brush salmon with oil and sprinkle with salt and pepper to taste. Grill salmon on an oiled rack set 5 to 6 inches over glowing coals until just cooked through, about 5 minutes on each side.",
            "Prepare grill.",
            "Brush salmon with oil and sprinkle with salt and pepper to taste. Grill salmon on an oiled rack set 5 to 6 inches over glowing coals until just cooked through, about 5 minutes on each side.",
            "Put each in center of 4 plates and arrange salmon on top. Top salmon with vegetables and spoon sauce around it. Sprinkle vegetables with peanuts.",
            "Put each in center of 4 plates and arrange salmon on top. Top salmon with vegetables and spoon sauce around it. Sprinkle vegetables with peanuts."
        ],
        "picture_link": null
    }
}