{
    "recipe": {
        "title": "Grilled Lemon-Garlic Chicken with Leeks and Potatoes ",
        "ingredients": [
            "1 lemon",
            "3 garlic cloves, finely grated",
            "1 1/2 teaspoons kosher salt",
            "3/4 teaspoon smoked paprika",
            "3 tablespoons olive oil, plus more for grill",
            "3 boneless, skinless chicken thighs (about 1 pound), halved",
            "2 leeks (about 8 ounces), quartered, white and light green parts cut into 3\" pieces",
            "1 large red bell pepper, cut into 2\"-thick strips",
            "1/2 pound baby new potatoes, halved",
            "1 1/2 cups parsley leaves with tender stems",
            "A flat grill basket (about 13 1/2 x 8 1/2\")"
        ],
        "instructions": [
            "Prepare a grill for medium heat. Zest 2 tsp. lemon zest off lemon and transfer to a large bowl. Cut off ends, then squeeze 1 Tbsp. lemon juice into bowl with zest. Slice remaining lemon into thin rounds. Whisk garlic, salt, paprika, and 3 Tbsp. oil into lemon juice and zest. Add lemon slices, chicken, leeks, bell pepper, and potatoes and toss to coat. Brush wires of grill basket with oil, then add chicken mixture. Arrange in an even layer and close basket. Place grill basket on grill, cover, and cook, turning once halfway through, until chicken is fully cooked through and vegetables are lightly charred, 20–25 minutes. Transfer chicken mixture to a large bowl, add parsley, and toss to combine.",
            "Prepare a grill for medium heat. Zest 2 tsp. lemon zest off lemon and transfer to a large bowl. Cut off ends, then squeeze 1 Tbsp. lemon juice into bowl with zest. Slice remaining lemon into thin rounds.",
            "Whisk garlic, salt, paprika, and 3 Tbsp. oil into lemon juice and zest. Add lemon slices, chicken, leeks, bell pepper, and potatoes and toss to coat.",
            "Brush wires of grill basket with oil, then add chicken mixture. Arrange in an even layer and close basket. Place grill basket on grill, cover, and cook, turning once halfway through, until chicken is fully cooked through and vegetables are lightly charred, 20–25 minutes.",
            "Transfer chicken mixture to a large bowl, add parsley, and toss to combine."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5956613125dc3d1d829b7161/6:4/w_274%2Ch_169/Grill-Basket-hero1-29062017.jpg"
    }
}