{
    "recipe": {
        "title": "Grilled Steak Salad with Pickle Pepper Vinaigrette ",
        "ingredients": [
            "3 tablespoons white-wine vinegar",
            "2 tablespoons Dijon mustard",
            "3 tablespoons olive oil",
            "1 teaspoon sugar",
            "1/4 cup finely diced red bell pepper",
            "1/4 cup finely diced peeled and seeded cucumber",
            "2 tablespoons finely diced dill pickle",
            "2 tablespoons chopped shallot",
            "2 tablespoons drained capers",
            "1 bunch watercress",
            "a 1 1/4-inch-thick boneless beef top loin (strip) steak (about 1 pound)"
        ],
        "instructions": [
            "Prepare grill.",
            "Make vinaigrette: In a bowl whisk together vinegar, mustard, oil, sugar, and salt to taste. Stir in remaining vinaigrette ingredients and season with pepper. Discard tough stems from watercress. Season steak with salt and pepper and grill on an oiled rack set 5 to 6 inches over glowing coals about 3 minutes on each side for medium-rare. (Alternatively, grill steak in a hot well-seasoned ridged grill pan over moderately high heat.) Transfer steak to a cutting board and let stand 5 minutes. Holding a sharp knife at a 45° angle, cut steak into about 12 thin slices. Spoon vinaigrette generously onto 2 large plates and mound watercress in center. Arrange steak slices on watercress.",
            "In a bowl whisk together vinegar, mustard, oil, sugar, and salt to taste. Stir in remaining vinaigrette ingredients and season with pepper.",
            "Discard tough stems from watercress. Season steak with salt and pepper and grill on an oiled rack set 5 to 6 inches over glowing coals about 3 minutes on each side for medium-rare. (Alternatively, grill steak in a hot well-seasoned ridged grill pan over moderately high heat.) Transfer steak to a cutting board and let stand 5 minutes. Holding a sharp knife at a 45° angle, cut steak into about 12 thin slices.",
            "Spoon vinaigrette generously onto 2 large plates and mound watercress in center. Arrange steak slices on watercress."
        ],
        "picture_link": null,
        "color": 30576
    }
}