{
    "recipe": {
        "title": "Grilled Shrimp With Honey-Ginger Barbecue Sauce ",
        "ingredients": [
            "Honey-Ginger Barbecue Sauce",
            "4 pounds jumbo (21-25 per pound) or extra-large (26-30 per pound) shrimp in shell, peeled, leaving tail and adjoining shell segment intact, and deveined (See Cooks' Notes)",
            "4 tablespoons vegetable oil",
            "1 teaspoon salt",
            "18 to 24 (12-inch) wooden skewers (depending on size of shrimp used), soaked in water for 30 minutes"
        ],
        "instructions": [
            "For the Shrimp: If necessary, pat shrimp dry, then thread about 6 shrimp (through top and tail, leaving shrimp curled), onto each skewer, without leaving space between shrimp. Prepare grill for direct-heat cooking over medium-hot charcoal (medium-high for gas); see Grilling Procedure. Meanwhile, brush shrimp with vegetable oil and sprinkle evenly with salt. Lightly oil grill rack. Grill shrimp, covered only if using a gas grill, turning over once, 2 minutes. Brush shrimp with some sauce from the saucepan, then turn. Brush shrimp with additional sauce then grill until just cooked through, 1 to 2 minutes. Serve with reserved sauce.",
            "If necessary, pat shrimp dry, then thread about 6 shrimp (through top and tail, leaving shrimp curled), onto each skewer, without leaving space between shrimp.",
            "Prepare grill for direct-heat cooking over medium-hot charcoal (medium-high for gas); see Grilling Procedure.",
            "Meanwhile, brush shrimp with vegetable oil and sprinkle evenly with salt.",
            "Lightly oil grill rack. Grill shrimp, covered only if using a gas grill, turning over once, 2 minutes. Brush shrimp with some sauce from the saucepan, then turn. Brush shrimp with additional sauce then grill until just cooked through, 1 to 2 minutes. Serve with reserved sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b0967e1cc76a014cfab81c/6:4/w_274%2Ch_169/51108030_grilled-shrimp_1x1.jpg"
    }
}