{
    "recipe": {
        "title": "Grilled Turbot with Celery Leaf Salsa Verde ",
        "ingredients": [
            "2 whole turbot (about 3 lb. each), heads and fins removed, split in half along the backbone",
            "1 1/4 cups extra-virgin olive oil, divided",
            "Kosher salt",
            "8 sprigs rosemary, divided",
            "1 1/2 cups finely chopped parsley",
            "1/2 cup finely chopped celery leaves",
            "1 garlic clove, finely grated",
            "1/2 lemon",
            "1/2 tsp. Aleppo-style or other mild red pepper flakes",
            "Freshly ground black pepper",
            "Aioli or store-bought mayonnaise (for serving)"
        ],
        "instructions": [
            "Prepare a grill for medium-low indirect heat (for a gas grill, leave one or two burners off; for a charcoal grill, bank coals on one side of grill). Tear off 4 large sheets of foil. Rub fish with 1/2 cup oil (2 Tbsp. per piece) and season with salt. Working one at a time, place a fillet in the center of a sheet of foil and top with 2 rosemary sprigs. Fold in short sides of foil over fish, then fold in long sides and roll edges together to seal.",
            "Place pouches on cool side of grill, cover grill, and cook fish, turning once, 20–25 minutes. Open a pouch to check fish. Flesh should be slightly opaque and the tip of a knife should slide through easily. Grill a little longer if needed.",
            "Meanwhile, combine parsley, celery leaves, and garlic in a medium bowl. Finely zest lemon into bowl, then squeeze in juice. Add red pepper flakes and mix in remaining 3/4 cup oil; season with salt and black pepper. Let salsa verde sit 10 minutes for flavors to come together.",
            "Transfer fish to a platter and serve with salsa verde and aioli."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ad7863720e37426cda19102/6:4/w_274%2Ch_169/grilled-turbot-with-celery-leaf-salsa-verde-recipe-BA-041818.jpg",
        "color": 8713223
    }
}