{
    "recipe": {
        "title": "Grilled Flank Steak with Spicy Pepper and Watermelon Salad ",
        "ingredients": [
            "1 1/2 tablespoons fresh lime juice",
            "1 tablespoon grapeseed oil or olive oil",
            "2 garlic cloves, pressed",
            "1 teaspoon hot chili paste (such as sambal oelek)*",
            "1/2 teaspoon grated peeled fresh ginger",
            "1/2 teaspoon honey",
            "1 1 1/2-pound flank steak",
            "1/4 cup hot chili sauce (such as sriracha)*",
            "1/4 cup grapeseed oil or olive oil",
            "3 tablespoons seasoned rice vinegar",
            "1 1/4 teaspoons honey",
            "4 large bell peppers, preferably assorted colors, cut into 1/2-inch squares",
            "2 tablespoons minced red jalapeño chiles",
            "2 cups 1/2-inch cubes seedless watermelon"
        ],
        "instructions": [
            "For steak: Whisk all ingredients except flank steak in 13 x 9 x 2-inch baking dish. Add steak; turn to coat. Cover and let marinate at room temperature 2 hours, turning occasionally. Alternatively, cover and chill at least 4 hours and up to 1 day. Bring to room temperature before grilling.",
            "For pepper and watermelon salad: Whisk hot chili sauce, oil, vinegar, and honey in small bowl; season dressing with salt and pepper. Place peppers and chiles in large bowl. Toss with 6 tablespoons dressing. Let marinate 2 hours at room temperature. DO AHEAD: Can be made 8 hours ahead. Cover dressing and salad separately and chill. Bring to room temperature before serving. Prepare barbecue (high heat). Grill steak with some marinade still clinging until cooked to desired doneness, about 4 minutes per side for rare. Transfer to work surface; let rest 10 minutes. Thinly slice steak against grain; transfer to platter. Drizzle with some of remaining dressing from salad. Toss watermelon into pepper salad. Serve flank steak and salad with remaining dressing alongside. * Available in the Asian foods section of many supermarkets and at Asian markets.",
            "Whisk hot chili sauce, oil, vinegar, and honey in small bowl; season dressing with salt and pepper. Place peppers and chiles in large bowl. Toss with 6 tablespoons dressing. Let marinate 2 hours at room temperature. DO AHEAD: Can be made 8 hours ahead. Cover dressing and salad separately and chill. Bring to room temperature before serving.",
            "Prepare barbecue (high heat). Grill steak with some marinade still clinging until cooked to desired doneness, about 4 minutes per side for rare. Transfer to work surface; let rest 10 minutes. Thinly slice steak against grain; transfer to platter. Drizzle with some of remaining dressing from salad.",
            "Toss watermelon into pepper salad. Serve flank steak and salad with remaining dressing alongside. * Available in the Asian foods section of many supermarkets and at Asian markets."
        ],
        "picture_link": null,
        "color": 700193
    }
}