{
    "recipe": {
        "title": "Grilled Rainbow Chard with Fava Beans and Oregano ",
        "ingredients": [
            "2 pounds Swiss chard (preferably rainbow), stems and center ribs cut out (reserve leaves for another use)",
            "1 cup shelled fresh fava beans (1 1/4 pounds in pods) or shelled fresh or frozen edamame (soybeans; 3/4 pound in pods)",
            "1 1/2 tablespoons extra-virgin olive oil, divided",
            "1 small garlic clove, thinly sliced",
            "2 teaspoons chopped oregano",
            "1 teaspoon fresh lemon juice"
        ],
        "instructions": [
            "Halve stems crosswise and cook in a large pot of boiling salted water (2 tablespoons salt for 4 quarts water) until just barely tender, 3 to 5 minutes (depending on thickness). Cool in an ice bath, reserving cooking water, then transfer to a plate.",
            "Prepare fava beans: Halve stems crosswise and cook in a large pot of boiling salted water (2 tablespoons salt for 4 quarts water) until just barely tender, 3 to 5 minutes (depending on thickness). Cool in an ice bath, reserving cooking water, then transfer to a plate. Prepare fava beans: Cook beans in boiling water 3 minutes, then drain and transfer to ice bath. Gently peel off skins (if using edamame, don't peel). Grill stems and assemble dish: Prepare grill for direct-heat cooking over medium-hot charcoal (medium heat for gas); see Grilling Procedure. .",
            "Halve stems crosswise and cook in a large pot of boiling salted water (2 tablespoons salt for 4 quarts water) until just barely tender, 3 to 5 minutes (depending on thickness). Cool in an ice bath, reserving cooking water, then transfer to a plate. Prepare fava beans: Cook beans in boiling water 3 minutes, then drain and transfer to ice bath. Gently peel off skins (if using edamame, don't peel). Grill stems and assemble dish: Prepare grill for direct-heat cooking over medium-hot charcoal (medium heat for gas); see Grilling Procedure. .",
            "Toss chard stems with 1 tablespoon oil and 1/4 teaspoon each of salt and pepper. Oil grill rack, then grill chard stems, covered only if using a gas grill, turning occasionally, until tender and lightly charred, about 7 minutes. Cut into 1-inch lengths. Cook garlic in remaining 1/2 tablespoon oil in a medium skillet over medium heat, stirring, until just pale golden. Add oregano, beans, and chard and cook, stirring, 1 minute. Transfer to a serving dish and stir in lemon juice and salt and pepper to taste.",
            "Toss chard stems with 1 tablespoon oil and 1/4 teaspoon each of salt and pepper. Oil grill rack, then grill chard stems, covered only if using a gas grill, turning occasionally, until tender and lightly charred, about 7 minutes. Cut into 1-inch lengths.",
            "Cook garlic in remaining 1/2 tablespoon oil in a medium skillet over medium heat, stirring, until just pale golden. Add oregano, beans, and chard and cook, stirring, 1 minute. Transfer to a serving dish and stir in lemon juice and salt and pepper to taste."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d78b57b55306961bf3474/6:4/w_274%2Ch_169/242846_hires.jpg"
    }
}