{
    "recipe": {
        "title": "Grilled Turkey Under a Brick ",
        "ingredients": [
            "Diamond Crystal or Morton kosher salt (see below)",
            "1 tablespoon plus 1 teaspoon ground mustard powder",
            "1 tablespoon plus 1 teaspoon paprika",
            "1 tablespoon dried thyme",
            "1 tablespoon freshly ground black pepper",
            "1 tablespoon garlic powder",
            "1 tablespoon light brown sugar",
            "1 tablespoon onion powder",
            "1 (12-14 pound) turkey (not kosher)",
            "Vegetable oil (for brushing)",
            "Heatproof gloves; 4 standard bricks (about 5 pounds each) or 1 large cinder block (about 25 pounds)"
        ],
        "instructions": [
            "Determine how much salt you need for your bird: Figure about 1 tsp. Diamond Crystal kosher salt per pound of turkey, or 2/3 tsp. Morton kosher salt per pound of turkey. For example, for a 12-pound turkey, use 1/4 cup Diamond Crystal kosher salt, or 2 Tbsp. plus 2 tsp. Morton kosher salt.",
            "Whisk salt, mustard powder, paprika, thyme, pepper, garlic powder, brown sugar, and onion powder in a small bowl.",
            "Place turkey, breast side down, on a large cutting board. Cut along each side of backbone with kitchen shears—this will take some force (you can ask your butcher to do this). Discard backbone or reserve for another use (like stock for gravy).",
            "With turkey skin side down, use a knife to score long oblong bone in center of breast all the way down. Turn turkey skin side up, then firmly press down with both hands on breastbone until you hear a cracking sound. The bone should be cracked completely in half; if not, use your knife to cut the bone the rest of the way in half.",
            "Pat turkey very dry with paper towels. Rub spice mixture all over skin and flesh sides. Splay open, skin side up, on a wire rack set inside a rimmed baking sheet. Tuck wing tips under breasts. Chill, uncovered, at least 1 day, preferably 2, and up to 3. If you’d rather cover the bird, loosely cover with plastic wrap, then uncover for the final 4–6 hours of chilling. Do not rinse turkey after brining. Let sit at room temperature 1 hour before cooking.",
            "Prepare a grill for medium heat (if your grill has a thermometer, it should register about 350°F). Wrap bricks or cinder block in foil.",
            "Oil grates well and transfer turkey, skin side down, onto grill. Wearing heatproof gloves, arrange bricks on top of turkey, with 3 across breast and 1 across drumsticks, or place cinder block in the center. Cover grill and cook, checking every 5 minutes, until skin side is deep golden brown and crispy, 10–15 minutes total.",
            "Wearing heatproof gloves, carefully remove bricks or cinder block and flip bird over, skin side up. Cover grill and continue to cook until an instant-read thermometer registers 160°F (take temperature in a few places including thickest part of thigh and breast), 65–80 minutes more, replenishing coals if needed. Transfer turkey to cutting board, tent with foil, and let rest at least 30 minutes before carving.",
            "Do Ahead Turkey can be seasoned with dry brine ideally 2 days but up to 3 days ahead. Keep chilled.",
            "Turkey can be seasoned with dry brine ideally 2 days but up to 3 days ahead. Keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59ee0bdaefafe3715cc954f9/6:4/w_274%2Ch_169/grilled-turkey-under-brick-recipe-2x1-071817.jpg"
    }
}