{
    "recipe": {
        "title": "Grilled Chicken with Tricolor Salsa ",
        "ingredients": [
            "6 large chicken breast halves or one 4-pound chicken, cut into 4 pieces",
            "1/4 cup fresh lemon juice",
            "3 tablespoons olive oil",
            "1/4 red onion, chopped",
            "1 tablespoon grated lemon peel",
            "1 teaspoon ground cumin",
            "1 cup fresh corn kernels (from 2 small ears) or frozen, thawed",
            "1 large tomato, seeded, chopped",
            "2/3 cup chopped red onion",
            "1/2 cup chopped fresh cilantro",
            "2 tablespoons olive oil",
            "1 tablespoon fresh lemon juice",
            "1/2 teaspoon ground cumin",
            "1/2 to 1 jalapeño chili, seeded, minced",
            "1 avocado, pitted, peeled, chopped",
            "Fresh cilantro sprigs"
        ],
        "instructions": [
            "For chicken: Place chicken in glass baking dish. Combine all remaining ingredients and pour over chicken; turn to coat. Cover and chill at least 3 hours or overnight, turning occasionally.",
            "Place chicken in glass baking dish. Combine all remaining ingredients and pour over chicken; turn to coat. Cover and chill at least 3 hours or overnight, turning occasionally.",
            "For salsa: Combine first 8 ingredients in medium bowl. (Can be prepared 6 hours ahead. Cover and refrigerate.) Prepare barbecue (medium-high heat) or preheat broiler. Season chicken with salt and pepper. Grill until cooked through, 8 minutes per side for breasts and 12 minutes per side for leg pieces. Add avocado to salsa. Season to taste with salt and pepper. Place chicken on plates. Spoon salsa alongside. Top chicken with cilantro sprigs.",
            "Combine first 8 ingredients in medium bowl. (Can be prepared 6 hours ahead. Cover and refrigerate.)",
            "Prepare barbecue (medium-high heat) or preheat broiler. Season chicken with salt and pepper. Grill until cooked through, 8 minutes per side for breasts and 12 minutes per side for leg pieces.",
            "Add avocado to salsa. Season to taste with salt and pepper. Place chicken on plates. Spoon salsa alongside. Top chicken with cilantro sprigs."
        ],
        "picture_link": null
    }
}