{
    "recipe": {
        "title": "Grilled Rib-Eye Steaks with Roasted-Pepper Salsa ",
        "ingredients": [
            "6 red bell peppers (2 pounds)",
            "1 to 2 habanero or Scotch bonnet chiles, seeded and minced",
            "3 tablespoons fresh lemon juice",
            "2 tablespoons extra-virgin olive oil",
            "1 garlic clove, finely chopped",
            "3/4 teaspoon salt",
            "1/2 teaspoon black pepper",
            "2 tablespoons coarsely chopped fresh flat-leaf parsley",
            "4 (1 1/2-inch-thick) bone-in rib-eye steaks (7 pounds)",
            "3 1/2 teaspoons salt",
            "2 teaspoons black pepper",
            "Garnish: flaky sea salt such as Maldon",
            "an instant-read thermometer"
        ],
        "instructions": [
            "Prepare grill for direct-heat cooking over medium-hot charcoal (moderately high heat for gas).",
            "Oil grill rack, then grill bell peppers, covered only if using a gas grill, turning occasionally, until slightly softened and charred, 15 to 20 minutes.",
            "Transfer bell peppers to a large bowl and cover tightly with plastic wrap, then let stand 20 minutes. When cool enough to handle, peel peppers, discarding stems and seeds, and cut lengthwise into thin strips. Toss with remaining salsa ingredients.",
            "Grill Steaks: Prepare grill for indirect-heat cooking over medium-hot charcoal (moderately high heat for gas). Pat steaks dry and sprinkle with salt and pepper. Oil grill rack, then sear steaks directly over coals, uncovered, turning over once and moving to area of grill with no coals underneath if flare-ups occur, until well browned, 4 to 6 minutes total. Move steaks to area with no coals underneath and grill, covered, until thermometer inserted into center of meat (do not touch bone) registers 120°F for medium-rare, 8 to 12 minutes more. Transfer steaks to a cutting board and let stand 15 minutes.",
            "Prepare grill for indirect-heat cooking over medium-hot charcoal (moderately high heat for gas).",
            "Pat steaks dry and sprinkle with salt and pepper. Oil grill rack, then sear steaks directly over coals, uncovered, turning over once and moving to area of grill with no coals underneath if flare-ups occur, until well browned, 4 to 6 minutes total. Move steaks to area with no coals underneath and grill, covered, until thermometer inserted into center of meat (do not touch bone) registers 120°F for medium-rare, 8 to 12 minutes more. Transfer steaks to a cutting board and let stand 15 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d99c4f3a00aeb2f1cf666/6:4/w_274%2Ch_169/238686.jpg",
        "color": 8036726
    }
}