{
    "recipe": {
        "title": "Grilled Peaches with Fresh Raspberry Sauce ",
        "ingredients": [
            "2 1/4 cups (lightly packed) fresh raspberries (about 13 ounces)",
            "3 tablespoons water",
            "3 tablespoons sugar",
            "1 tablespoon fresh lemon juice",
            "3 tablespoons unsalted butter",
            "1 1/2 tablespoons (packed) dark brown sugar",
            "6 medium-size ripe but firm peaches, halved, pitted"
        ],
        "instructions": [
            "Puree 2 1/4 cups fresh raspberries along with 3 tablespoons water in food processor until puree is smooth. Strain raspberry puree through fine-mesh strainer, pressing on solids to release as much liquid as possible; discard solids in strainer. Stir in 3 tablespoons sugar and 1 tablespoon fresh lemon juice until blended. DO AHEAD Fresh raspberry sauce can be made 1 day ahead. Cover and refrigerate. Prepare barbecue (medium heat). Melt butter with brown sugar in heavy small skillet over medium heat. Remove skillet from heat. Brush peach halves all over with melted butter mixture. Grill until tender, about 8 minutes, turning occasionally. Serve with sauce.",
            "Puree 2 1/4 cups fresh raspberries along with 3 tablespoons water in food processor until puree is smooth. Strain raspberry puree through fine-mesh strainer, pressing on solids to release as much liquid as possible; discard solids in strainer. Stir in 3 tablespoons sugar and 1 tablespoon fresh lemon juice until blended. DO AHEAD Fresh raspberry sauce can be made 1 day ahead. Cover and refrigerate.",
            "Prepare barbecue (medium heat). Melt butter with brown sugar in heavy small skillet over medium heat. Remove skillet from heat. Brush peach halves all over with melted butter mixture. Grill until tender, about 8 minutes, turning occasionally. Serve with sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d99f4f9a84192308a1b5c/6:4/w_274%2Ch_169/239086.jpg"
    }
}