{
    "recipe": {
        "title": "Grilled Thai Green Bean Salad ",
        "ingredients": [
            "2–3 Thai or serrano chiles, ribs and seeds removed, finely chopped",
            "4 garlic cloves, pressed",
            "1/2 cup fresh lime juice",
            "1/4 cup sugar",
            "2 tablespoons soy sauce",
            "1 teaspoon kosher salt",
            "1 tablespoon vegetable oil, plus more for grill",
            "1 (14-ounce) block firm tofu, cut into 1/2\" planks",
            "1 pound green beans or mix of green beans and yellow wax beans, trimmed",
            "1 ripe but firm mango (about 1 pound), thinly sliced on the bias",
            "1 small carrot (about 5 ounces), thinly sliced on the bias",
            "1/2 cup cilantro, coarsely chopped, plus 1 tablespoon leaves",
            "2 ripe avocados, cut into quarters, skin removed",
            "2 tablespoons chopped salted, roasted peanuts",
            "1 small head of lettuce (such as romaine hearts or Bibb), separated into leaves for wrapping",
            "A flat grill basket (about 13 1/2 x 8 1/2\") or grill pan"
        ],
        "instructions": [
            "Whisk chiles, garlic, lime juice, sugar, soy sauce, and salt in a small bowl. Pour half of sauce into a shallow dish; reserve remaining sauce. Add 1 Tbsp. oil to sauce in shallow dish and whisk to combine. Add tofu and gently toss; set aside to marinate.",
            "Prepare a grill for medium-high heat (or heat a grill pan over medium-high). If using grill, arrange beans in grill basket and place on hot grill. Cover and grill, turning once halfway through, until beans are lightly charred and crisp-tender, about 8 minutes. If using grill pan, cook beans directly on pan, tossing occasionally, until well charred and cooked through, about 10 minutes.",
            "Remove tofu from marinade, reserving marinade, and transfer to a plate; pat dry. Brush grill and tofu with oil and grill tofu, turning once halfway through, until lightly charred, 2–3 minutes per side. If using grill, be careful when turning, as tofu may stick. Transfer to plate and drizzle with reserved marinade.",
            "Toss beans, mango, carrot, and 1/2 cup chopped cilantro with reserved sauce. Transfer to a platter and arrange tofu and avocados alongside. Top with peanuts and 1 Tbsp. cilantro leaves. Arrange lettuce leaves on another platter. To serve, wrap tofu, avocado, and bean mixture in lettuce leaves."
        ],
        "picture_link": "https://assets.epicurious.com/photos/596396b1df48bf035a7f5939/6:4/w_274%2Ch_169/Grilled-Thai-Green-Bean-Salad-070620170618221.jpg",
        "color": 5194316
    }
}