{
    "recipe": {
        "title": "Grilled Shrimp and Corn Salad ",
        "ingredients": [
            "1 pound large peeled, deveined shrimp",
            "1 ounce tequila",
            "Juice of 2 limes",
            "3 ears of corn, husks removed",
            "2 heads romaine lettuce, chopped",
            "1/2 cup black beans, drained and rinsed",
            "1/2 cup cherry tomatoes, halved",
            "1 avocado, sliced",
            "1/4 cup your favorite salad dressing",
            "Chopped fresh cilantro, for garnish",
            "Sliced lime, for garnish",
            "Tortilla chips (optional)"
        ],
        "instructions": [
            "Thread the shrimp on skewers and place in a baking dish. Coat with tequila and lime juice and marinate 15 minutes. Oil and preheat a grill or grill pan to medium-high heat. Brush the corn with olive oil and sprinkle with salt and pepper. Place the shrimp and corn on the grill and grill about 3 minutes per side until cooked through. Cool slightly. Remove the shrimp from skewers and slice the kernels off the cobs. In a large bowl, toss the lettuce with the beans, tomatoes, avocado, and dressing. Arrange grilled shrimp and corn on top and garnish with cilantro and lime. Serve with tortilla chips, if desired.",
            "Thread the shrimp on skewers and place in a baking dish. Coat with tequila and lime juice and marinate 15 minutes. Oil and preheat a grill or grill pan to medium-high heat. Brush the corn with olive oil and sprinkle with salt and pepper. Place the shrimp and corn on the grill and grill about 3 minutes per side until cooked through. Cool slightly. Remove the shrimp from skewers and slice the kernels off the cobs.",
            "In a large bowl, toss the lettuce with the beans, tomatoes, avocado, and dressing. Arrange grilled shrimp and corn on top and garnish with cilantro and lime. Serve with tortilla chips, if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59824aa147c7920fc5163b5e/6:4/w_274%2Ch_169/grilled-shrimp-and-corn-salad-recipe-HC-080217.jpg"
    }
}