{
    "recipe": {
        "title": "Grilled Green Tomatoes with Burrata and Green Juice ",
        "ingredients": [
            "1/2 small romaine heart, coarsely chopped",
            "1/4 English hothouse cucumber or 1/2 Persian cucumber, coarsely chopped",
            "1 cup (packed) torn kale leaves",
            "3/4 cup cilantro leaves with tender stems",
            "1 tablespoon (or more) fresh lime juice",
            "Kosher salt",
            "1 thick slice country-style bread, torn into bite-size pieces",
            "7 tablespoons olive oil, divided, plus more for brushing",
            "Kosher salt",
            "3 unripe green tomatoes, sliced 1/2\" thick",
            "1 tablespoon red wine vinegar",
            "Freshly ground black pepper",
            "8 ounces burrata or fresh mozzarella, torn into pieces",
            "1 bunch scallions, thinly sliced",
            "1 jalapeno, thinly sliced",
            "1/2 cup unsalted, roasted almonds, coarsely chopped",
            "1 cup cilantro leaves with tender stems",
            "Flaky sea salt"
        ],
        "instructions": [
            "Green juice: Blend romaine, cucumber, kale, cilantro, and 1/4 cup water in a blender until fairly smooth, about 1 minute. Strain through a fine-mesh sieve into a small bowl or measuring glass, pressing on solids to release as much liquid as possible; you should have about 1/2 cup. (Alternatively, you can do this step in a juicer.) Stir in lime juice and season with salt. Taste and adjust flavor with more lime juice, if needed.",
            "Blend romaine, cucumber, kale, cilantro, and 1/4 cup water in a blender until fairly smooth, about 1 minute. Strain through a fine-mesh sieve into a small bowl or measuring glass, pressing on solids to release as much liquid as possible; you should have about 1/2 cup. (Alternatively, you can do this step in a juicer.) Stir in lime juice and season with salt. Taste and adjust flavor with more lime juice, if needed.",
            "Tomatoes and assembly: Preheat oven to 400°F. Toss bread with 2 tablespoons oil on a rimmed baking sheet; season with kosher salt. Bake, tossing halfway through, until golden brown and crisp, 6–8 minutes. Let bread cool, then gently crush with a flat-bottomed measuring cup into smaller pieces. Prepare a grill for medium-high heat or heat a grill pan over medium-high. Brush tomatoes on both sides with 1 tablespoon oil and grill until softened and lightly charred, about 4 minutes per side. Transfer to plates and drizzle with vinegar, 1/3 cup green juice, and 1 tablespoon oil. Season with kosher salt and pepper and top with burrata. Toss scallions, jalapeno, almonds, breadcrumbs, 2 tablespoons green juice, and remaining 3 tablespoons oil in a medium bowl; season with kosher salt and pepper. Add cilantro and toss again to bring everything together. Scatter scallion mixture evenly over tomatoes and burrata; drizzle with oil and sprinkle with sea salt.",
            "Preheat oven to 400°F. Toss bread with 2 tablespoons oil on a rimmed baking sheet; season with kosher salt. Bake, tossing halfway through, until golden brown and crisp, 6–8 minutes. Let bread cool, then gently crush with a flat-bottomed measuring cup into smaller pieces.",
            "Prepare a grill for medium-high heat or heat a grill pan over medium-high. Brush tomatoes on both sides with 1 tablespoon oil and grill until softened and lightly charred, about 4 minutes per side. Transfer to plates and drizzle with vinegar, 1/3 cup green juice, and 1 tablespoon oil. Season with kosher salt and pepper and top with burrata.",
            "Toss scallions, jalapeno, almonds, breadcrumbs, 2 tablespoons green juice, and remaining 3 tablespoons oil in a medium bowl; season with kosher salt and pepper. Add cilantro and toss again to bring everything together.",
            "Scatter scallion mixture evenly over tomatoes and burrata; drizzle with oil and sprinkle with sea salt."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55d4c2d563b1ba1b5534b08d/6:4/w_274%2Ch_169/56389868_grilled-green-tomatoes_6x4.jpg"
    }
}