{
    "recipe": {
        "title": "Grilled Steak and Mixed Peppers ",
        "ingredients": [
            "3 (1\"–1 1/2\"-thick) strip steaks (about 2 1/2 lb. total), patted dry",
            "2 1/2 tsp. kosher salt, divided",
            "2 1/4 tsp. freshly ground black pepper, divided, plus more",
            "2 Tbsp. extra-virgin olive oil, plus more for grill and drizzling",
            "1 lb. mini sweet mixed peppers",
            "6 oz. shishito peppers",
            "Flaky sea salt"
        ],
        "instructions": [
            "Season steaks on all sides with 2 tsp. kosher salt and 2 tsp. pepper. Let sit at room temperature 1 hour. Prepare a grill for medium-high heat; oil grate. Grill steaks until lightly charred and an instant-read thermometer inserted into the thickest part registers 120°F, 6–8 minutes per side for medium-rare. Transfer to a cutting board and let rest 10 minutes before slicing against the grain. Meanwhile, grill sweet peppers, turning often, until lightly charred and softened, about 5 minutes. Transfer to a platter and cover with foil. Grill shishitos, turning often, until lightly charred and softened, about 3 minutes. Transfer to platter with sweet peppers and cover with foil. Let rest 10 minutes. Drizzle with 2 Tbsp. oil, then season with 1/2 tsp. kosher salt and 1/4 tsp. pepper and toss to combine. Transfer sliced steak to platter alongside peppers. Drizzle with oil, then season with sea salt and pepper.",
            "Season steaks on all sides with 2 tsp. kosher salt and 2 tsp. pepper. Let sit at room temperature 1 hour.",
            "Prepare a grill for medium-high heat; oil grate. Grill steaks until lightly charred and an instant-read thermometer inserted into the thickest part registers 120°F, 6–8 minutes per side for medium-rare. Transfer to a cutting board and let rest 10 minutes before slicing against the grain.",
            "Meanwhile, grill sweet peppers, turning often, until lightly charred and softened, about 5 minutes. Transfer to a platter and cover with foil. Grill shishitos, turning often, until lightly charred and softened, about 3 minutes. Transfer to platter with sweet peppers and cover with foil. Let rest 10 minutes. Drizzle with 2 Tbsp. oil, then season with 1/2 tsp. kosher salt and 1/4 tsp. pepper and toss to combine.",
            "Transfer sliced steak to platter alongside peppers. Drizzle with oil, then season with sea salt and pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b64a0b14e722a4f20884a92/6:4/w_274%2Ch_169/Grilled-Steak-with-Grilled-Peppers-recipe-31072018.jpg"
    }
}