{
    "recipe": {
        "title": "Grilled Eggplant and Greens with Spiced Yogurt ",
        "ingredients": [
            "2 medium Japanese eggplants or 1 globe eggplant (about 1 pound), sliced crosswise on a diagonal 1/2\"-thick",
            "3/4 teaspoon ground turmeric",
            "6 tablespoons olive oil, divided, plus more for serving",
            "Kosher salt",
            "Freshly ground black pepper",
            "2 large bunches hardy greens (such as kale or Swiss chard)",
            "1/2 cup fresh mint leaves",
            "3/4 cup plain Greek yogurt",
            "1/4 teaspoon garam masala or curry powder",
            "Lemon wedges (for serving)"
        ],
        "instructions": [
            "Prepare grill for medium-high heat. Toss eggplant with turmeric and 2 tablespoons oil in a medium bowl; season with salt and pepper. Toss greens with 2 tablespoons oil in a large bowl; season with salt and pepper. Grill eggplant, turning often, until tender and charred in spots, 5-8 minutes; transfer to a large bowl. Grill greens, turning often, until lightly charred in spots, about 2 minutes; transfer to a cutting board and let cool slightly. Remove thick ribs and stems from greens and discard. Tear large leaves into large pieces; transfer to bowl with eggplant, add mint and 2 tablespoons oil, and toss to combine. Mix yogurt and garam masala in a small bowl; season with salt and pepper. Spoon yogurt onto a platter and top with eggplant, greens, and mint mixture. Drizzle with more oil and serve with lemon wedges.",
            "Prepare grill for medium-high heat. Toss eggplant with turmeric and 2 tablespoons oil in a medium bowl; season with salt and pepper. Toss greens with 2 tablespoons oil in a large bowl; season with salt and pepper.",
            "Grill eggplant, turning often, until tender and charred in spots, 5-8 minutes; transfer to a large bowl.",
            "Grill greens, turning often, until lightly charred in spots, about 2 minutes; transfer to a cutting board and let cool slightly. Remove thick ribs and stems from greens and discard. Tear large leaves into large pieces; transfer to bowl with eggplant, add mint and 2 tablespoons oil, and toss to combine.",
            "Mix yogurt and garam masala in a small bowl; season with salt and pepper.",
            "Spoon yogurt onto a platter and top with eggplant, greens, and mint mixture. Drizzle with more oil and serve with lemon wedges."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac087c19925f464b3a6509/6:4/w_274%2Ch_169/51239710_grilled-eggplant-greens_1x1.jpg"
    }
}