{
    "recipe": {
        "title": "Grilled Fennel-Rubbed Triple-Cut Pork Chops ",
        "ingredients": [
            "1/4 cup kosher salt",
            "1/4 cup coarsely ground black pepper",
            "1/4 cup finely ground fennel seeds",
            "2 (2 1/2-pounds) triple pork chops with 1/4–1/2\" fat cap, chine bone removed (not frenched)",
            "4 tablespoons extra-virgin olive oil, plus more for serving",
            "Flaky sea salt",
            "Fennel pollen or finely ground fennel seeds (for serving)"
        ],
        "instructions": [
            "Prepare grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Combine kosher salt, pepper, and ground fennel in a small bowl. Rub each pork chop all over with 2 tablespoons oil, followed by spice mixture, patting to adhere. (Save any extra rub to use on chicken, lamb, or more chops another time.) Grill chops over direct heat, turning often and moving to cooler side of grill as needed to control flare-ups, until deeply browned on all sides, 10–15 minutes total.",
            "Move chops to indirect heat, placing bone side down, and grill, turning every 20 minutes or so, until an instant-read thermometer inserted into the thickest part of chops registers 118°F, 45–60 minutes. (Check after 30 minutes—once thermometer registers 100°F, the temperature will climb much faster.) This cooking method and target temperature yield juicy chops with still-pink flesh.",
            "Transfer pork chops to a cutting board and let rest 5 minutes (temperature will rise about 5°). Cut loin on each chop from the bones in one piece. Slice between bones to separate and grill over direct heat, turning often, until crisped and well charred, about 5 minutes.",
            "Grill loins over direct heat, cut side up, just to reheat slightly, about 2 minutes. Slice loins 1/2\" thick and transfer to a platter. Drizzle with oil and sprinkle with sea salt and fennel pollen. Serve with bones alongside.",
            "Do Ahead Pork can be rubbed with oil and spice mixture 1 day ahead; cover and chill. Pork caxn be grilled 2 hours ahead. Do not cut meat from bones; hold at room temperature. Grill over high to reheat, about 2 minutes, before finishing as directed above.",
            "Pork can be rubbed with oil and spice mixture 1 day ahead; cover and chill. Pork caxn be grilled 2 hours ahead. Do not cut meat from bones; hold at room temperature. Grill over high to reheat, about 2 minutes, before finishing as directed above."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5580674b74cbe9ed7c20c86f/6:4/w_274%2Ch_169/56389662_grilled-fennel-rubbed-pork-chops_1x1.jpg"
    }
}