{
    "recipe": {
        "title": "Grilled Pizza With Harissa and Herb Salad ",
        "ingredients": [
            "1 1/4 cups warm water (105°F to 115°F)",
            "1/4 teaspoon sugar",
            "1 envelope (1/4 ounce) active dry yeast",
            "3 cups (or more) all purpose flour, divided",
            "1/4 cup whole wheat flour",
            "1 tablespoon extra-virgin olive oil plus additional for brushing",
            "2 1/2 teaspoons coarse kosher salt",
            "6 teaspoons harissa sauce*",
            "1 1/2 cups (packed) coarsely grated Gruyére cheese, divided",
            "3/4 cup freshly grated Parmesan cheese, divided",
            "4 cups mixed baby greens",
            "1 cup fresh Italian parsley leaves",
            "1 cup fresh basil leaves, coarsely torn",
            "1/2 cup coarsely chopped assorted fresh herbs (such as chives, chervil, tarragon, and dill)",
            "1 tablespoon extra-virgin olive oil",
            "1/4 cup pine nuts, lightly toasted"
        ],
        "instructions": [
            "Mix 1 1/4 cups warm water and sugar in large bowl; sprinkle yeast over. Let stand until yeast dissolves and mixture looks spongey, about 10 minutes. Whisk in 1 cup all purpose flour; let stand in warm draft-free area until mixture is bubbling, about 35 minutes.",
            "Stir whole wheat flour, 1 tablespoon olive oil, and coarse salt into yeast mixture, then stir in 2 cups all purpose flour. Knead dough in bowl until almost smooth and beginning to pull away from sides of bowl, adding more all purpose flour by tablespoonfuls if dough is very sticky. Turn dough out onto lightly floured surface and knead until smooth and elastic, about 7 minutes. Form dough into ball. Place dough ball in oiled large bowl; turn dough to coat with oil. Cover with plastic wrap and let dough rise in warm draft-free area until doubled in volume, about 1 1/2 hours.",
            "Punch down dough; divide into 6 equal pieces. Roll each dough piece on floured surface into ball. Cover dough balls loosely with plastic wrap and let rest 30 minutes.",
            "Prepare barbecue (medium-high heat). Sprinkle 2 large baking sheets with flour. Roll out each dough ball on lightly floured work surface to 7- to 7 1/2-inch round, letting dough rest briefly if springing back. Transfer to floured baking sheets. Brush tops lightly with olive oil. Working in batches, grill dough rounds, oiled side up, until bottoms are firm and grill marks appear, watching to avoid burning, about 3 minutes. Turn crusts over, grilling until dough is set, about 2 minutes. Transfer crusts, grill-marked side up, to baking sheets. DO AHEAD Can be made 8 hours ahead. Let stand at room temperature.",
            "Prepare barbecue (medium heat). Spread 1 teaspoon harissa very thinly over top of each pizza crust. Sprinkle each with 1/4 cup Gruyére and 2 tablespoons Parmesan cheese. Return pizzas to grill; cover and grill just until cheese melts, about 4 minutes.",
            "Prepare barbecue (medium heat). Spread 1 teaspoon harissa very thinly over top of each pizza crust. Sprinkle each with 1/4 cup Gruyére and 2 tablespoons Parmesan cheese. Return pizzas to grill; cover and grill just until cheese melts, about 4 minutes.",
            "For herb salad: Combine baby greens, parsley leaves, basil leaves, chopped assorted fresh herbs, and olive oil in medium bowl; toss to coat thoroughly with oil.",
            "Combine baby greens, parsley leaves, basil leaves, chopped assorted fresh herbs, and olive oil in medium bowl; toss to coat thoroughly with oil.",
            "Place pizzas on platter. Divide salad among crusts; sprinkle with pine nuts.",
            "Place pizzas on platter. Divide salad among crusts; sprinkle with pine nuts."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5579c54a81ac1e5023674ba0/6:4/w_274%2Ch_169/239069_grilled-pizza-harissa-herb_6x4-CP.jpg",
        "color": 585248
    }
}