{
    "recipe": {
        "title": "Grilled Steak Kebabs with Orange and Hoisin Glaze ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "1/2 cup frozen orange juice concentrate, thawed",
            "1/2 cup hoisin sauce",
            "2 tablespoons chili powder",
            "1 1/2 tablespoons olive oil",
            "2 teaspoons (packed) finely grated orange peel",
            "1 1/2 pounds tenderloin steaks (about 1 1/4 inches thick), cut into 20 cubes",
            "3 1/3-inch-thick orange slices",
            "Chopped green onions"
        ],
        "instructions": [
            "Spray grill rack with nonstick spray and prepare barbecue (medium-high heat). Whisk juice concentrate, hoisin, chili powder, oil, and orange peel in medium bowl; season sauce with salt and pepper. Place beef in large bowl. Sprinkle with salt and pepper; toss to coat. Add 1/4 cup sauce; toss well. Let stand 5 minutes. Cut each orange slice into 6 wedges. Alternate 5 beef cubes and 4 orange wedges on each of 4 metal skewers. Grill kebabs to desired doneness, brushing with more sauce and turning occasionally, about 10 minutes for medium-rare. Place 1 skewer on each of 4 plates; sprinkle with green onions. Serve kebabs with remaining sauce.",
            "Spray grill rack with nonstick spray and prepare barbecue (medium-high heat). Whisk juice concentrate, hoisin, chili powder, oil, and orange peel in medium bowl; season sauce with salt and pepper.",
            "Place beef in large bowl. Sprinkle with salt and pepper; toss to coat. Add 1/4 cup sauce; toss well. Let stand 5 minutes. Cut each orange slice into 6 wedges. Alternate 5 beef cubes and 4 orange wedges on each of 4 metal skewers.",
            "Grill kebabs to desired doneness, brushing with more sauce and turning occasionally, about 10 minutes for medium-rare.",
            "Place 1 skewer on each of 4 plates; sprinkle with green onions. Serve kebabs with remaining sauce."
        ],
        "picture_link": null
    }
}