{
    "recipe": {
        "title": "Grilled Split Lobster ",
        "ingredients": [
            "2 (1 1/2-pounds) live lobsters",
            "2 tablespoons oil",
            "Salt",
            "Pepper",
            "Butter, hot sauce, lemon wedges, for serving"
        ],
        "instructions": [
            "Prepare grill for medium-high heat; oil grate. Chill two 1 1/2-pounds live lobsters in freezer 15 minutes (this will slow down their nervous system—helpful for what comes next). Working one at a time, transfer to a cutting board, belly side down, with head facing you. Using a kitchen towel, hold tail (it shouldn't be very active now) and, starting where the tail meets the body, bisect body and head lengthwise in one fell swoop. Turn lobster around and cut lengthwise through tail. Remove any tomalley or eggs (reserving, if you'd like). Immediately rub cut side of lobsters with 2 tablespoons oil total; season with salt and pepper. Grill, cut side down, pressing claws against grill, until meat is nearly cooked through, 6–8 minutes. Turn and grill until shells are lightly charred and meat is cooked through (tail meat will look opaque and be firm), about 3 minutes. Remove lobsters from grill and serve with melted butter, hot sauce, and lemon wedges for squeezing over.",
            "Prepare grill for medium-high heat; oil grate. Chill two 1 1/2-pounds live lobsters in freezer 15 minutes (this will slow down their nervous system—helpful for what comes next). Working one at a time, transfer to a cutting board, belly side down, with head facing you. Using a kitchen towel, hold tail (it shouldn't be very active now) and, starting where the tail meets the body, bisect body and head lengthwise in one fell swoop. Turn lobster around and cut lengthwise through tail. Remove any tomalley or eggs (reserving, if you'd like).",
            "Immediately rub cut side of lobsters with 2 tablespoons oil total; season with salt and pepper. Grill, cut side down, pressing claws against grill, until meat is nearly cooked through, 6–8 minutes. Turn and grill until shells are lightly charred and meat is cooked through (tail meat will look opaque and be firm), about 3 minutes. Remove lobsters from grill and serve with melted butter, hot sauce, and lemon wedges for squeezing over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5580698474cbe9ed7c20d0e1/6:4/w_274%2Ch_169/56389677_grilled-split-lobster_1x1.jpg"
    }
}