{
    "recipe": {
        "title": "Grilled Stuffed Mackerel ",
        "ingredients": [
            "1 medium mackerel, cleaned and deboned if possible",
            "1/4 tsp ginger paste",
            "1/4 tsp garlic paste",
            "salt, to taste",
            "1 tbsp plus 1 tsp vegetable oil",
            "2 tsp lemon juice",
            "1/2 small onion, peeled and sliced",
            "5 fresh curry leaves",
            "2 tsp Goan red spice paste",
            "1 medium tomato, chopped",
            "lemon wedges, to serve"
        ],
        "instructions": [
            "Wash and dry the inside of the fish. Make deep slashes across both sides of the fish. Stir together the ginger and garlic pastes, salt, 1 teaspoon of the oil and the lemon juice and rub all over and into the slits of the fish. Place in a nonmetallic dish, cover and marinate in the fridge for 30 minutes. Heat the remaining oil in a small nonstick saucepan and fry the onion until golden brown. Add the curry leaves and masala paste and cook over medium-low heat for 3-4 minutes, stirring constantly. If you are concerned that the masala sauce may burn, add a sprinkling of water to the pan. Add the tomato and salt and cook briskly for 6-8 minutes, stirring often. The tomatoes will completely break down and you will be left with a spicy, thick masala sauce. Taste and adjust the seasoning. Rub a little of this stuffing mixture on the flesh and inside the slits and stuff the rest into the cavity. Put the fish back in the fridge for another 20 minutes, if you have time. Preheat the grill and cover the grill pan with kitchen foil. Place the fish on top and cook for 6-7 minutes on each side, turning carefully, until the fish is golden brown and cooked through. Serve with lemon wedges and plain rice.",
            "Wash and dry the inside of the fish. Make deep slashes across both sides of the fish. Stir together the ginger and garlic pastes, salt, 1 teaspoon of the oil and the lemon juice and rub all over and into the slits of the fish. Place in a nonmetallic dish, cover and marinate in the fridge for 30 minutes.",
            "Heat the remaining oil in a small nonstick saucepan and fry the onion until golden brown. Add the curry leaves and masala paste and cook over medium-low heat for 3-4 minutes, stirring constantly. If you are concerned that the masala sauce may burn, add a sprinkling of water to the pan. Add the tomato and salt and cook briskly for 6-8 minutes, stirring often. The tomatoes will completely break down and you will be left with a spicy, thick masala sauce. Taste and adjust the seasoning.",
            "Rub a little of this stuffing mixture on the flesh and inside the slits and stuff the rest into the cavity. Put the fish back in the fridge for another 20 minutes, if you have time.",
            "Preheat the grill and cover the grill pan with kitchen foil. Place the fish on top and cook for 6-7 minutes on each side, turning carefully, until the fish is golden brown and cooked through. Serve with lemon wedges and plain rice."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55c3c86da9c6a0784e28f95b/6:4/w_274%2Ch_169/362329_hires-6x4.jpg"
    }
}