{
    "recipe": {
        "title": "Grilled Chicken with Mustard Barbecue Sauce and Tomato Salad ",
        "ingredients": [
            "2 Tbsp. extra-virgin olive oil, plus more for grill",
            "1/4 cup apple cider vinegar",
            "1/4 cup (packed) light brown sugar",
            "2 Tbsp. honey",
            "2 tsp. Worcestershire sauce",
            "1 tsp. garlic powder",
            "1 tsp. paprika",
            "1/4 tsp. cayenne pepper",
            "1/2 cup plus 2 Tbsp. country-style mustard",
            "5–6 lb. skin-on, bone-in chicken breasts and/or whole legs",
            "2 Tbsp. plus 3 tsp. kosher salt, divided, plus more",
            "2 large sweet onions, sliced into 1/2\"-thick rounds",
            "1 (15-oz.) jar pickled green beans",
            "2 lb. tomatoes, halved if large, sliced into 1/2\"-thick rounds"
        ],
        "instructions": [
            "Prepare a grill for 2-zone heat (for a charcoal grill, bank two-thirds of coals over one side of grill and scatter remaining coals over the other side; for a gas grill, set one burner to medium-high heat and the remaining burners to medium-low heat). Clean and lightly oil grate. Mix vinegar, brown sugar, honey, Worcestershire, garlic powder, paprika, cayenne, and 1/2 cup mustard in a medium bowl; set aside. Season chicken on all sides with 2 Tbsp. plus 2 tsp. salt. Grill chicken skin side down over direct heat, turning halfway through or whenever there is a flare, until lightly charred, 5-8 minutes. Move chicken to cooler part of grill, cover with lid, and continue to grill, turning several times and keeping covered, until an instant-read thermometer inserted into the thickest part of the breast registers 140°F, 15–20 minutes. The smaller pieces will go more quickly ,and you can transfer them to a rimmed baking sheet until all pieces are ready. Uncover grill and return any pieces from baking sheet back to grill. Using a brush, generously baste chicken with reserved sauce. Continue to grill, turning every 1–2 minutes and basting the other side, until the internal temperature of thickest part of breast registers 155°F and sauce is shiny and lacquered, about 6 minutes. Transfer chicken to a cutting board as pieces are done (again, the smaller pieces will go more quickly). Let rest 10 minutes before separating drumsticks from thighs and slicing chicken breast in half on a bias. While chicken rests, gently toss onions, 2 Tbsp. oil, and 1 tsp. salt in a medium bowl, being careful not to break up onion rounds into rings. Grill over medium-low heat, turning once, until charred on both sides and tender, 10–15 minutes. Whisk 2 Tbsp. bean pickling liquid and remaining 2 Tbsp. mustard in a large bowl. Drain beans and add to bowl. Add tomatoes and grilled onions. Toss to combine; season with salt. Arrange chicken on a large platter and serve with salad alongside. Do Ahead: Sauce can be made 3 days ahead. Cover and chill.",
            "Prepare a grill for 2-zone heat (for a charcoal grill, bank two-thirds of coals over one side of grill and scatter remaining coals over the other side; for a gas grill, set one burner to medium-high heat and the remaining burners to medium-low heat). Clean and lightly oil grate.",
            "Mix vinegar, brown sugar, honey, Worcestershire, garlic powder, paprika, cayenne, and 1/2 cup mustard in a medium bowl; set aside.",
            "Season chicken on all sides with 2 Tbsp. plus 2 tsp. salt. Grill chicken skin side down over direct heat, turning halfway through or whenever there is a flare, until lightly charred, 5-8 minutes. Move chicken to cooler part of grill, cover with lid, and continue to grill, turning several times and keeping covered, until an instant-read thermometer inserted into the thickest part of the breast registers 140°F, 15–20 minutes. The smaller pieces will go more quickly ,and you can transfer them to a rimmed baking sheet until all pieces are ready.",
            "Uncover grill and return any pieces from baking sheet back to grill. Using a brush, generously baste chicken with reserved sauce. Continue to grill, turning every 1–2 minutes and basting the other side, until the internal temperature of thickest part of breast registers 155°F and sauce is shiny and lacquered, about 6 minutes. Transfer chicken to a cutting board as pieces are done (again, the smaller pieces will go more quickly). Let rest 10 minutes before separating drumsticks from thighs and slicing chicken breast in half on a bias.",
            "While chicken rests, gently toss onions, 2 Tbsp. oil, and 1 tsp. salt in a medium bowl, being careful not to break up onion rounds into rings. Grill over medium-low heat, turning once, until charred on both sides and tender, 10–15 minutes.",
            "Whisk 2 Tbsp. bean pickling liquid and remaining 2 Tbsp. mustard in a large bowl. Drain beans and add to bowl. Add tomatoes and grilled onions. Toss to combine; season with salt.",
            "Arrange chicken on a large platter and serve with salad alongside.",
            "Do Ahead: Sauce can be made 3 days ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b843bce1abfc56568396369/6:4/w_274%2Ch_169/Grilled-Chicken-with-Mustard-Sauce-and-Tomato-Salad-recipe-2-22082018.jpg"
    }
}