{
    "recipe": {
        "title": "Grilled Ham, Cheese, and Salami with Caper Relish ",
        "ingredients": [
            "1/2 cup olive oil",
            "3 tablespoons white wine vinegar",
            "1 large shallot, minced",
            "4 teaspoons minced fresh oregano",
            "1 rectangular 10x7x1 1/2-inch bread loaf (such as ciabatta)",
            "3 ounces sliced provolone cheese",
            "4 ounces sliced Italian Genoa salami",
            "4 ounces sliced Black Forest ham",
            "3 tablespoons finely chopped pitted brine-cured green olives",
            "3 tablespoons capers, chopped",
            "3 tablespoons minced peperoncini",
            "3 tablespoons butter, room temperature",
            "3 ounces Teleme or Fontina cheese, grated (about 1 cup)",
            "1 cup thinly sliced iceberg lettuce"
        ],
        "instructions": [
            "Whisk first 4 ingredients in small bowl; season dressing with salt and pepper. Cut top crust (about 1/3 inch) off bread and discard. Cut bread horizontally in half. Arrange provolone cheese on cut side of bottom half, covering completely. Top with layer of salami, then ham. Mix olives, capers, and peperoncini in small bowl; spread relish over ham. Press top half of bread, cut side down, atop relish; spread with 1 1/2 tablespoons butter. Heat heavy large skillet over medium heat 3 minutes. Place sandwich, buttered side down, in skillet. Using another skillet, press sandwich to compact slightly. Cook until golden, about 5 minutes. Spread top of sandwich with remaining 1 1/2 tablespoons butter. Using large spatula, turn sandwich over. Press again with second skillet. Cook until bottom is golden and cheese melts, about 5 minutes. Transfer sandwich to work surface. Lift off bread top; sprinkle with Teleme cheese, lettuce, and dressing. Press bread top onto sandwich and cut into quarters.",
            "Whisk first 4 ingredients in small bowl; season dressing with salt and pepper.",
            "Cut top crust (about 1/3 inch) off bread and discard. Cut bread horizontally in half. Arrange provolone cheese on cut side of bottom half, covering completely. Top with layer of salami, then ham. Mix olives, capers, and peperoncini in small bowl; spread relish over ham. Press top half of bread, cut side down, atop relish; spread with 1 1/2 tablespoons butter.",
            "Heat heavy large skillet over medium heat 3 minutes. Place sandwich, buttered side down, in skillet. Using another skillet, press sandwich to compact slightly. Cook until golden, about 5 minutes. Spread top of sandwich with remaining 1 1/2 tablespoons butter. Using large spatula, turn sandwich over. Press again with second skillet. Cook until bottom is golden and cheese melts, about 5 minutes.",
            "Transfer sandwich to work surface. Lift off bread top; sprinkle with Teleme cheese, lettuce, and dressing. Press bread top onto sandwich and cut into quarters."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea187f3a00aeb2f1d6c3b/6:4/w_274%2Ch_169/107645.jpg"
    }
}