{
    "recipe": {
        "title": "Grilled Bread Salad with Sweet Peppers and Onions ",
        "ingredients": [
            "1/4 small loaf country-style bread (about 6 ounces), crust removed, bread torn into large pieces",
            "6 tablespoons olive oil, divided",
            "Kosher salt",
            "Freshly ground pepper",
            "2 large red bell peppers, halved, ribs and seeds removed",
            "2 small red onions, peeled, quartered, with some root attached",
            "3 tablespoons Sherry vinegar or red winevinegar",
            "1/2 teaspoon paprika, preferably smoked",
            "2 tablespoons coarsely chopped fresh chives, plus more for serving"
        ],
        "instructions": [
            "Prepare grill for medium-high heat. Toss bread with 2 tablespoons oil in a medium bowl; season with salt and pepper. Toss bell peppers and onions with 2 tablespoons oil; season with salt and pepper. Grill bread, turning occasionally, until golden brown, 8-10 minutes. Transfer to a plate. Grill vegetables, turning often, until very tender and charred in spots, 8-10 minutes for peppers and 10-12 minutes for onions; transfer to a cutting board. Trim root end from onions and separate layers. Transfer to a large bowl, add vinegar and paprika, and toss to coat. Remove as much skin as possible from peppers; discard. Cut into 1 1/2\" strips. Add peppers, grilled bread, 2 tablespoons chives, and remaining 2 tablespoons oil to bowl with onions and toss to combine; season with salt, pepper, and more vinegar, if desired. Serve topped with more chives.",
            "Prepare grill for medium-high heat. Toss bread with 2 tablespoons oil in a medium bowl; season with salt and pepper. Toss bell peppers and onions with 2 tablespoons oil; season with salt and pepper.",
            "Grill bread, turning occasionally, until golden brown, 8-10 minutes. Transfer to a plate.",
            "Grill vegetables, turning often, until very tender and charred in spots, 8-10 minutes for peppers and 10-12 minutes for onions; transfer to a cutting board.",
            "Trim root end from onions and separate layers. Transfer to a large bowl, add vinegar and paprika, and toss to coat. Remove as much skin as possible from peppers; discard. Cut into 1 1/2\" strips.",
            "Add peppers, grilled bread, 2 tablespoons chives, and remaining 2 tablespoons oil to bowl with onions and toss to combine; season with salt, pepper, and more vinegar, if desired. Serve topped with more chives."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55ddd35ae5dddc7a28fd6432/6:4/w_274%2Ch_169/54ac08ef19925f464b3a660c_51239720_grilled-bread-salad_CP.jpg"
    }
}