{
    "recipe": {
        "title": "Grilled Jerk Chicken with Scotch Bonnet Sauce and Mango Chutney ",
        "ingredients": [
            "6 tablespoons olive oil",
            "5 Scotch bonnet chiles with seeds, chopped (wear gloves when handling chiles)",
            "2 scallions, green and white parts, chopped (about 3 tablespoons)",
            "1/4 cup dried thyme",
            "1 tablespoon dry mustard",
            "1 tablespoon kosher salt",
            "1 tablespoon freshly ground black pepper",
            "12 boneless, skin-on chicken breasts (buy bone-in breasts and cut meat from bone)",
            "2 tablespoons vegetable oil",
            "1 small red onion, thinly sliced",
            "1 large ripe but firm mango, peeled, pitted, and cut into 1/2-inch dice (about 1 cup)",
            "1/2 cup cider vinegar",
            "2 tablespoons (packed) brown sugar",
            "1/8 teaspoon ground allspice",
            "1/4 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "7 Scotch bonnet chiles with seeds, finely diced (wear gloves when handling chiles)",
            "1/3 cup yellow deli mustard, such as French's",
            "1/3 cup freshly squeezed orange juice (from about 1 orange)",
            "2 tablespoons fresh lime juice (from about 1 lime)",
            "1 tablespoon (packed) brown sugar",
            "1/8 teaspoon curry powder",
            "1/8 teaspoon ground cumin",
            "1/8 teaspoon ground coriander",
            "1/2 teaspoon kosher salt",
            "1/2 teaspoon freshly ground black pepper"
        ],
        "instructions": [
            "In blender or food processor, purée oil, chiles, scallions, thyme, dry mustard, salt, and pepper until smooth. Arrange chicken in large glass baking dish and coat on all sides with paste. Cover and refrigerate at least 1 hour and up to 4 hours.",
            "Make chutney: In medium sauté pan over moderate heat, heat oil until hot but not smoking. Add onion and sauté, stirring occasionally, until translucent, 7 to 9 minutes. Add mango and vinegar and cook, stirring frequently, until mango is tender, about 3 minutes. Stir in brown sugar and allspice and simmer gently until sugar is melted and mixture is slightly thickened and syrupy, about 3 to 5 minutes. Stir in salt and pepper. Transfer chutney to serving dish and cool to room temperature, stirring occasionally.",
            "In medium sauté pan over moderate heat, heat oil until hot but not smoking. Add onion and sauté, stirring occasionally, until translucent, 7 to 9 minutes. Add mango and vinegar and cook, stirring frequently, until mango is tender, about 3 minutes. Stir in brown sugar and allspice and simmer gently until sugar is melted and mixture is slightly thickened and syrupy, about 3 to 5 minutes. Stir in salt and pepper. Transfer chutney to serving dish and cool to room temperature, stirring occasionally.",
            "Make Scotch bonnet sauce: In medium bowl, stir together all ingredients; stand back to let irritating fumes dissipate, then set aside.",
            "In medium bowl, stir together all ingredients; stand back to let irritating fumes dissipate, then set aside.",
            "Cook chicken Prepare grill for cooking: If using charcoal grill, open vents on bottom, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 4 to 5 seconds. If using gas grill, preheat burners on high with hood closed 10 minutes, then turn down to moderately high. Arrange chicken breasts on grill, skin sides down. Grill, turning once, until cooked through, about 7 to 9 minutes per side. Transfer breasts to platter and top each with spoonful of mango chutney. Serve, passing additional chutney and hot sauce on side.",
            "Prepare grill for cooking: If using charcoal grill, open vents on bottom, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 4 to 5 seconds. If using gas grill, preheat burners on high with hood closed 10 minutes, then turn down to moderately high.",
            "Arrange chicken breasts on grill, skin sides down. Grill, turning once, until cooked through, about 7 to 9 minutes per side. Transfer breasts to platter and top each with spoonful of mango chutney. Serve, passing additional chutney and hot sauce on side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d99bb7b55306961bf76c1/6:4/w_274%2Ch_169/238565.jpg",
        "color": 8885057
    }
}