{
    "recipe": {
        "title": "Grilled Scallops with Creamed Corn ",
        "ingredients": [
            "3 dried pasilla chiles (about 1 ounce total), coarsely chopped",
            "2 tablespoons dried thyme",
            "1 tablespoon dried oregano",
            "1 tablespoon ground coriander",
            "1 tablespoon ground fennel",
            "2 teaspoons chipotle chile powder",
            "2 teaspoons freshly ground black pepper",
            "2 teaspoons paprika",
            "1 teaspoon garlic powder",
            "1 teaspoon onion powder",
            "Zest of 1 lime",
            "1 pound large sea scallops, side muscle removed, rinsed, patted dry",
            "2 tablespoons olive oil",
            "4 green garlic or 2 medium leeks, white and pale green parts only, thinly sliced",
            "1 medium shallot, finely chopped",
            "1 garlic clove, thinly sliced",
            "4 ears of corn, husked, kernels grated on the large holes of a box grater",
            "1 tablespoon unsalted butter",
            "Kosher salt",
            "Vegetable oil (for drizzling)",
            "Lime wedges (for serving)",
            "A spice mill; four 8-inch metal skewers"
        ],
        "instructions": [
            "Prepare a grill for medium-high heat. Coarsely grind pasilla chiles in spice mill. Mix ground chiles with thyme, oregano, coriander, fennel, chipotle chile powder, black pepper, paprika, garlic powder, and onion powder in a small bowl to combine. Scatter lime zest over scallops, then cover them all over with 2 Tbsp. dry rub (reserve extra rub for another use). Chill scallops while you make the creamed corn.",
            "Heat olive oil in a medium saucepan over medium-low. Cook green garlic, shallot, and garlic, stirring occasionally, until very tender but without taking on any color, 6–8 minutes. Increase heat to medium and add grated corn; cook, stirring often, until liquid evaporates, about 5 minutes. Stir in 2 Tbsp. water and cook, stirring, until absorbed. Continue to cook, stirring and adding water 2 Tbsp. at a time and letting it absorb completely before adding more, until corn is creamy with a risotto-like consistency, 12–18 minutes. Stir in butter; season creamed corn with salt.",
            "Thread scallops onto skewers, dividing evenly, season with salt, and drizzle with a little vegetable oil. Grill until deeply browned and just cooked through, about 3 minutes per side, depending on size. Transfer skewers to a platter and squeeze some lime juice over scallops.",
            "To serve, divide creamed corn among plates and top with skewers. Serve with more lime wedges for squeezing over.",
            "Do Ahead: Dry rub can be made 1 month ahead. Store airtight at room temperature.",
            "Dry rub can be made 1 month ahead. Store airtight at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5949509d7a84a95bcfcc443e/6:4/w_274%2Ch_169/grilled-scallops-with-creamed-corn-062017.jpg",
        "color": 6743573
    }
}