{
    "recipe": {
        "title": "Grilled Kale Salad with Ricotta and Plums ",
        "ingredients": [
            "4 tablespoons extra-virgin olive oil, divided",
            "3 tablespoons balsamic vinegar",
            "2 teaspoons chopped fresh thyme",
            "1 teaspoon honey",
            "Kosher salt, freshly ground pepper",
            "4 medium plums, halved, pitted, thinly sliced",
            "12 large or 16 small curly kale leaves",
            "3/4 cup fresh ricotta"
        ],
        "instructions": [
            "Whisk 3 tablespoons oil, vinegar, thyme, and honey in a medium bowl. Season vinaigrette to taste with salt and pepper. Add plums and toss to coat; transfer plums to a plate. Build a medium-hot fire in a charcoal grill, or heat a gas grill to high. Brush kale leaves with remaining 1 tablespoon oil; season with salt. Grill kale, turning once, until crispy and charred at edges, about 2 minutes. Transfer to a work surface; let stand until cool enough to handle. Remove large center stems with a knife and discard (just trim the tough ends from smaller, more tender kale stems). Divide ricotta among plates; season with salt and pepper. Stir vinaigrette again. Tear larger kale leaves into pieces (leave smaller leaves whole). Place leaves in a large bowl and toss with some of the vinaigrette. Divide leaves among plates. Top with plums and drizzle some vinaigrette over.",
            "Whisk 3 tablespoons oil, vinegar, thyme, and honey in a medium bowl. Season vinaigrette to taste with salt and pepper. Add plums and toss to coat; transfer plums to a plate.",
            "Build a medium-hot fire in a charcoal grill, or heat a gas grill to high. Brush kale leaves with remaining 1 tablespoon oil; season with salt. Grill kale, turning once, until crispy and charred at edges, about 2 minutes. Transfer to a work surface; let stand until cool enough to handle. Remove large center stems with a knife and discard (just trim the tough ends from smaller, more tender kale stems).",
            "Divide ricotta among plates; season with salt and pepper. Stir vinaigrette again. Tear larger kale leaves into pieces (leave smaller leaves whole). Place leaves in a large bowl and toss with some of the vinaigrette. Divide leaves among plates. Top with plums and drizzle some vinaigrette over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b0a63ac6a78d1a4a60965f/6:4/w_274%2Ch_169/51104400_grilled-kale-salad_1x1.jpg"
    }
}