{
    "recipe": {
        "title": "Grilled Frittata with Zucchini, Leeks, Crème Fraîche and Harissa ",
        "ingredients": [
            "1 large zucchini (about 12 ounces), sliced lengthwise 1/3 inch thick",
            "2 medium leeks, roots trimmed, top 2 inches discarded, leeks halved lengthwise and rinsed well",
            "Extra-virgin olive oil, for brushing",
            "1 1/2 teaspoons kosher salt, divided",
            "Freshly ground black pepper",
            "12 large eggs",
            "1/4 cup plus 2 tablespoons crème fraîche",
            "2 teaspoons harissa, plus more for serving",
            "2 tablespoons torn basil leaves"
        ],
        "instructions": [
            "Light a grill or preheat a grill pan; if you're using a charcoal grill, leave one spot cooler for indirect cooking. Lightly brush both sides of the zucchini and the leeks with olive oil and season with 1/2 teaspoon salt and pepper. Grill the zucchini over high heat, turning once, until nicely browned and tender, about 2 minutes per side. Transfer to a work surface, let cool slightly and slice crosswise 1/2 inch thick.",
            "Grill the leeks over high heat until grill marks form, about 2 minutes per side, then move the leeks to a cooler part of the grill and grill over moderately low heat, turning occasionally, until just tender, about 15 minutes. Transfer the leeks to a work surface and let cool slightly. Remove the outer leaf and thinly slice the leeks crosswise, discarding any tough dark green pieces.",
            "Turn the grill burners to moderate heat or, if you're using a charcoal grill, let the hot coals cool slightly. Brush a seasoned 12-inch cast-iron skillet generously with olive oil and set it on the grill.",
            "In a large bowl, whisk the eggs with 1/4 cup of the crème fraîche and remaining 1 teaspoon salt. Stir in the cooled vegetables. When the skillet is hot, carefully pour in the eggs and vegetables. Using a spoon, carefully dollop the remaining 2 tablespoons of the crème fraîche and the 2 teaspoons of harissa around the top of the eggs. Close the grill and cook the frittata for about 15 minutes, moving the skillet a few times to make sure it's evenly heated, until the eggs are puffed and set.",
            "Let the frittata cool slightly, then garnish with the basil leaves. Slice the frittata into wedges and serve, passing more harissa at the table."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54abf9e06529d92b2c0346f4/6:4/w_274%2Ch_169/51241440_grilled-frittata_1x1.jpg"
    }
}