{
    "recipe": {
        "title": "Grilled Pork Ribs with Gochujang Barbecue Sauce ",
        "ingredients": [
            "2/3 cup apple cider vinegar",
            "1/2 cup (packed) dark brown sugar",
            "6 Tbsp. gochujang (Korean hot pepper paste)",
            "1/4 cup adobo (from 1 can chipotle chiles in adobo)",
            "2 racks St. Louis–style pork spareribs (about 4 lb.)",
            "Kosher salt, freshly ground pepper",
            "Vegetable oil (for grill)"
        ],
        "instructions": [
            "Place a rack in middle of oven and preheat to 350°F. Whisk vinegar, brown sugar, gochujang, and adobo in a medium bowl until sugar is dissolved. Transfer half of sauce to a small bowl and set aside for serving. Season ribs all over with salt and pepper. Place each rack on a double layer of foil and wrap up. Set on a rimmed baking sheet; bake until very tender but not falling apart, 2 1/2–3 hours. Let cool. Prepare a grill for medium-high heat; oil grate. Grill ribs, turning several times and beginning to baste with remaining sauce as soon as ribs begin to brown, until charred and coated with a thick layer of glaze and heated through, 8–10 minutes. Transfer ribs to a cutting board and cut between bones into individual ribs. Serve with reserved sauce alongside.",
            "Place a rack in middle of oven and preheat to 350°F. Whisk vinegar, brown sugar, gochujang, and adobo in a medium bowl until sugar is dissolved. Transfer half of sauce to a small bowl and set aside for serving.",
            "Season ribs all over with salt and pepper. Place each rack on a double layer of foil and wrap up. Set on a rimmed baking sheet; bake until very tender but not falling apart, 2 1/2–3 hours. Let cool.",
            "Prepare a grill for medium-high heat; oil grate. Grill ribs, turning several times and beginning to baste with remaining sauce as soon as ribs begin to brown, until charred and coated with a thick layer of glaze and heated through, 8–10 minutes. Transfer ribs to a cutting board and cut between bones into individual ribs. Serve with reserved sauce alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b16fb092d124719c33e5a52/6:4/w_274%2Ch_169/grilled-pork-ribs-with-gochujang-barbecue-sauce-recipe-BA-060518.jpg"
    }
}