{
    "recipe": {
        "title": "Grilled Beets with Burrata and Poppy Seed Vinaigrette ",
        "ingredients": [
            "1 small shallot, finely chopped",
            "2 tablespoons Sherry vinegar",
            "2 teaspoons poppy seeds",
            "1 teaspoon Dijon mustard",
            "1 teaspoon finely grated orange zest",
            "1/4 cup vegetable oil",
            "5 tablespoons extra-virgin olive oil, divided",
            "Kosher salt, freshly ground pepper",
            "1 1/2 pounds mixed baby beets (any color), trimmed, divided",
            "1 bunch scallions, root ends trimmed",
            "1 pound burrata or fresh mozzarella, cut into 8 wedges"
        ],
        "instructions": [
            "Whisk shallot, vinegar, poppy seeds, mustard, and orange zest in a medium bowl. Whisk in vegetable oil, then 2 tablespoons olive oil; season with salt and pepper. Set vinaigrette aside. Peel and thinly slice 1 beet; set aside. Prepare a grill for medium heat. Toss remaining beets with 2 tablespoons olive oil in a medium bowl; season with salt and pepper. Grill beets, covered, turning occasionally, until tender, 30-35 minutes. Transfer beets to a plate and let cool. Meanwhile, toss scallions with remaining 1 tablespoon olive oil; season with salt and pepper. Grill scallions, turning occasionally, until charred, about 2 minutes. Using a paper towel, rub skins from beets and cut into bite-size pieces. Toss beets and reserved dressing in a medium bowl. Place cheese on plates or a platter and top with scallions, dressed beets, and reserved beet slices. DO AHEAD: Vinaigrette can be made 1 day ahead. Cover and chill. Beets can be grilled and peeled 1 day ahead. Cover and chill. Bring to room temperature before serving.",
            "Whisk shallot, vinegar, poppy seeds, mustard, and orange zest in a medium bowl. Whisk in vegetable oil, then 2 tablespoons olive oil; season with salt and pepper. Set vinaigrette aside.",
            "Peel and thinly slice 1 beet; set aside.",
            "Prepare a grill for medium heat. Toss remaining beets with 2 tablespoons olive oil in a medium bowl; season with salt and pepper. Grill beets, covered, turning occasionally, until tender, 30-35 minutes. Transfer beets to a plate and let cool.",
            "Meanwhile, toss scallions with remaining 1 tablespoon olive oil; season with salt and pepper. Grill scallions, turning occasionally, until charred, about 2 minutes.",
            "Using a paper towel, rub skins from beets and cut into bite-size pieces. Toss beets and reserved dressing in a medium bowl. Place cheese on plates or a platter and top with scallions, dressed beets, and reserved beet slices.",
            "DO AHEAD: Vinaigrette can be made 1 day ahead. Cover and chill. Beets can be grilled and peeled 1 day ahead. Cover and chill. Bring to room temperature before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54af431cc4a891cc44ccc4d6/6:4/w_274%2Ch_169/51175080_grilled-beets-burrata_1x1.jpg"
    }
}