{
    "recipe": {
        "title": "Grilled Clambake with Miso-Lime Butter ",
        "ingredients": [
            "4 lb. littleneck clams",
            "3 tsp. kosher salt, divided, plus more",
            "1 cup (2 sticks) unsalted butter, room temperature",
            "1/2 cup white miso paste",
            "1 2 1/2\" piece ginger, peeled, very finely grated",
            "2 1/2 tsp. finely grated lime zest",
            "1 tsp. crushed red pepper flakes",
            "1 1/2 lb. baby new potatoes",
            "1 lb. jumbo shell-on shrimp",
            "4 ears corn, shucked",
            "14 scallions",
            "2 Tbsp. extra-virgin olive oil",
            "1/4 cup chopped cilantro leaves with tender stems",
            "1 Tbsp. toasted sesame seeds",
            "Lime wedges (for serving)"
        ],
        "instructions": [
            "Place clams in a large bowl of heavily salted cold water. Let soak 20 minutes. Drain and scrub any clams that are still dirty or sandy. Pulse butter, miso, ginger, lime zest, and red pepper flakes in a food processor until smooth and well incorporated. Set aside half of miso butter for serving. Transfer remaining miso butter to a small bowl. Prepare a grill for medium-high heat. Arrange 2 layers of 2 large pieces of foil on a work surface, overlapping to create one large surface area. Place potatoes in center of foil in 1 layer and dot with 2 Tbsp. miso butter. Season with 1 3/4 tsp. salt. Fold up sides of foil, then crimp and fold to seal. Transfer to a large rimmed baking sheet. Arrange 2 more layers of 2 large pieces of foil in the same way to create 1 large surface area. Place half of clams in center of foil, dot with 1 1/2 Tbsp. miso butter, and enclose in a purse shape (so you can take a peek at clams when cooking). Repeat with more foil and remaining clams. Transfer both packets of clams to pan with potatoes. Arrange shrimp, corn, and scallions on another large rimmed baking sheet in separate sections. Drizzle with oil; season with 1 1/4 tsp. salt. Toss to coat. Grill potatoes, turning every 5 minutes, until tender when pricked with a toothpick, about 25 minutes total. Return potatoes in foil back to baking sheet to keep warm. After potatoes have been cooking for 10 minutes, grill corn, brushing occasionally with miso butter and turning every 3–4 minutes, until charred in some spots, about 10 minutes total. Return corn to baking sheet and cover with foil to keep warm. Grill clams until they open, 10–15 minutes. Transfer to pan with potatoes and corn. Grill scallions and shrimp, brushing with miso butter and turning once halfway through, until scallions are charred and shrimp is cooked through, 4–6 minutes, depending on their size. Return to baking sheet. Cut each ear of corn into 4 pieces and divide between 2 platters. Divide potatoes, shrimp, scallions, and clams between platters, then pour clam juices over. Top with cilantro and sesame seeds. Serve with reserved miso butter, lime wedges, and lots of napkins. Do Ahead: Miso butter can be made 2 days ahead. Cover and chill. Potato packets and clam packets can be grilled 1 day ahead. Enclose packets and chill.",
            "Place clams in a large bowl of heavily salted cold water. Let soak 20 minutes. Drain and scrub any clams that are still dirty or sandy.",
            "Pulse butter, miso, ginger, lime zest, and red pepper flakes in a food processor until smooth and well incorporated. Set aside half of miso butter for serving. Transfer remaining miso butter to a small bowl.",
            "Prepare a grill for medium-high heat. Arrange 2 layers of 2 large pieces of foil on a work surface, overlapping to create one large surface area. Place potatoes in center of foil in 1 layer and dot with 2 Tbsp. miso butter. Season with 1 3/4 tsp. salt. Fold up sides of foil, then crimp and fold to seal. Transfer to a large rimmed baking sheet.",
            "Arrange 2 more layers of 2 large pieces of foil in the same way to create 1 large surface area. Place half of clams in center of foil, dot with 1 1/2 Tbsp. miso butter, and enclose in a purse shape (so you can take a peek at clams when cooking). Repeat with more foil and remaining clams. Transfer both packets of clams to pan with potatoes.",
            "Arrange shrimp, corn, and scallions on another large rimmed baking sheet in separate sections. Drizzle with oil; season with 1 1/4 tsp. salt. Toss to coat.",
            "Grill potatoes, turning every 5 minutes, until tender when pricked with a toothpick, about 25 minutes total. Return potatoes in foil back to baking sheet to keep warm.",
            "After potatoes have been cooking for 10 minutes, grill corn, brushing occasionally with miso butter and turning every 3–4 minutes, until charred in some spots, about 10 minutes total. Return corn to baking sheet and cover with foil to keep warm. Grill clams until they open, 10–15 minutes. Transfer to pan with potatoes and corn.",
            "Grill scallions and shrimp, brushing with miso butter and turning once halfway through, until scallions are charred and shrimp is cooked through, 4–6 minutes, depending on their size. Return to baking sheet.",
            "Cut each ear of corn into 4 pieces and divide between 2 platters. Divide potatoes, shrimp, scallions, and clams between platters, then pour clam juices over. Top with cilantro and sesame seeds. Serve with reserved miso butter, lime wedges, and lots of napkins.",
            "Do Ahead: Miso butter can be made 2 days ahead. Cover and chill. Potato packets and clam packets can be grilled 1 day ahead. Enclose packets and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b32829bf27ea85e2fe954f8/6:4/w_274%2Ch_169/Grilled-Clam-Bake-recipe-22062018.jpg"
    }
}