{
    "recipe": {
        "title": "Grilled Fattoush with Halloumi and Eggplant ",
        "ingredients": [
            "5 tablespoons olive oil, plus more for grill",
            "2 scallions",
            "1 jalapeño",
            "1/2 cup halved pitted Castelvetrano or other green olives",
            "3 tablespoons salted, roasted pistachios",
            "3 tablespoons fresh lemon juice",
            "1 tablespoon white wine vinegar",
            "Kosher salt, freshly ground pepper",
            "1 tablespoon dried thyme",
            "1 tablespoon toasted sesame seeds",
            "1/4 teaspoon garlic powder",
            "2 (6)-inch pitas",
            "2 medium eggplants, halved lengthwise (or crosswise if using 1 large eggplant)",
            "2 tablespoons olive oil, plus more for grill",
            "Kosher salt",
            "1 (8)-ounce package Halloumi cheese",
            "2 large Persian cucumbers or 1 small English hothouse cucumber",
            "1 pound tomatoes, halved, cut into wedges if large",
            "1/2 cup torn mint leaves",
            "1/4 cup dill sprigs"
        ],
        "instructions": [
            "Prepare a grill for medium heat; oil grate. Grill scallions and jalapeño, turning once, until lightly blistered and crisp-tender, about 2 minutes for scallions and 4 minutes for jalapeño. Transfer to a cutting board and let cool slightly.",
            "Slice open jalapeño and scrape out seeds (unless you like things very spicy); discard. Coarsely chop chile and scallions. Mix in a medium bowl with olives, pistachios, lemon juice, vinegar, and 5 Tbsp. oil; season dressing with salt and pepper.",
            "Dressing can be made 1 day ahead. Cover and chill. Bring to room temperature before serving.",
            "Assemble the salad: Mix thyme, sesame seeds, and garlic powder in a small bowl. Lightly coat pitas and eggplants with 2 Tbsp. oil; season with salt and rub with thyme mixture. Grill, turning occasionally and moving to a cooler part of grill if needed to avoid scorching, until pitas are golden and crisp and eggplants are browned and tender, 5 minutes for pitas, and 8–10 minutes for eggplants. Transfer to a platter and let cool slightly. Meanwhile, grill Halloumi until charred and soft, about 2 minutes per side. Transfer to platter with pitas and eggplants. Tear pitas and Halloumi into chunky pieces, then cut eggplants into bite-size pieces. Transfer to a large bowl and add cucumbers, tomatoes, and dressing. Give everything a good toss to bring it all together; season with salt. Top with mint leaves and dill sprigs.",
            "Mix thyme, sesame seeds, and garlic powder in a small bowl. Lightly coat pitas and eggplants with 2 Tbsp. oil; season with salt and rub with thyme mixture. Grill, turning occasionally and moving to a cooler part of grill if needed to avoid scorching, until pitas are golden and crisp and eggplants are browned and tender, 5 minutes for pitas, and 8–10 minutes for eggplants. Transfer to a platter and let cool slightly.",
            "Meanwhile, grill Halloumi until charred and soft, about 2 minutes per side. Transfer to platter with pitas and eggplants.",
            "Tear pitas and Halloumi into chunky pieces, then cut eggplants into bite-size pieces. Transfer to a large bowl and add cucumbers, tomatoes, and dressing. Give everything a good toss to bring it all together; season with salt. Top with mint leaves and dill sprigs."
        ],
        "picture_link": "https://assets.epicurious.com/photos/593ee59868bd4e58aaab1d24/6:4/w_274%2Ch_169/grilled-fattoush-with-halloumi-and-eggplant.jpg"
    }
}