{
    "recipe": {
        "title": "Grilled Chicken with Board Dressing ",
        "ingredients": [
            "1 dried guajillo or New Mexico chile or",
            "1/2 teaspoon crushed red pepper flakes",
            "3/4 cup chopped fresh cilantro",
            "1/4 cup chopped fresh oregano",
            "1 teaspoon finely grated lime zest",
            "1/4 cup olive oil plus more for grill",
            "Kosher salt, freshly ground pepper",
            "freshly ground pepper",
            "1 4-pound chicken, halved, backbone removed",
            "Lime wedges (for serving)"
        ],
        "instructions": [
            "If using whole chile, toast in a dry skillet, turning often, until slightly puffed and darkened, about 4 minutes. (Do not toast red pepper flakes.) Discard stem and seeds. Finely chop chile and transfer to a small bowl. Stir in cilantro, oregano, lime zest, and 1/4 cup oil; season dressing with salt and pepper.",
            "Prepare grill for medium indirect heat (for a charcoal grill, bank coals on 1 side of grill; for a gas grill, leave 1 burner turned off). Brush grill rack with oil. Season chicken with salt and pepper and place, skin side down, on grill. Grill chicken, turning occasionally, until skin is crisp and browned and an instant-read thermometer inserted into the thickest part of a thigh registers 165°, 10-15 minutes per side (move chicken to cooler part of grill if it's cooking too quickly). About 5 minutes before chicken is done, baste with some of dressing.",
            "Pour remaining dressing onto a carving board (or platter, if you don't have a large board) and place chicken, skin side up, on top. Let sit at least 10 minutes to rest and absorb flavor from dressing before carving. Drizzle chicken with some dressing from board and serve with limes.",
            "DO AHEAD: Dressing can be made 2 days ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54afe2552edcf2b41143abaa/6:4/w_274%2Ch_169/51170400_grilled-chicken_1x1.jpg"
    }
}