{
    "recipe": {
        "title": "Grilled Shrimp and Sausage Skewers with Smoky Paprika Glaze ",
        "ingredients": [
            "3/4 cup olive oil",
            "4 large garlic cloves, pressed",
            "2 tablespoons chopped fresh thyme",
            "5 teaspoons smoked paprika*",
            "4 teaspoons Sherry wine vinegar",
            "3/4 teaspoon salt",
            "1/2 teaspoon freshly ground black pepper",
            "1/2 teaspoon dried crushed red pepper",
            "12 uncooked extra-large shrimp (13 to 15 per pound), peeled, deveined",
            "12 1-inch-long pieces andouille or other fully cooked smoked sausages (such as linguiça; about 16 ounces)",
            "12 cherry tomatoes",
            "12 2-layer sections of red onion wedges",
            "Nonstick vegetable oil spray",
            "6 long metal skewers"
        ],
        "instructions": [
            "Whisk oil, garlic, thyme, smoked paprika, Sherry wine vinegar, salt, black pepper, and crushed red pepper in medium bowl to blend for glaze. Transfer half of glaze to small bowl and reserve for serving.",
            "Alternately thread shrimp, sausage pieces, cherry tomatoes, and sections of onion wedges on each of 6 long metal skewers. Arrange skewers on large rimmed baking sheet. DO AHEAD: Can be made up to 6 hours ahead. Cover and chill skewers and bowls of glaze separately.",
            "Coat grill rack with nonstick spray and prepare barbecue (medium-high heat). Brush skewers on both sides with glaze from 1 bowl. Grill until shrimp are opaque in center, turning and brushing occasionally with more glaze, 6 to 8 minutes.",
            "Arrange skewers on platter. Serve with remaining bowl of glaze.",
            "* Sometimes labeled Pimentón Dulce or Pimentón de La Vera Dulce; available at some supermarkets, at specialty foods stores, and from latienda.com.",
            "* Sometimes labeled Pimentón Dulce or Pimentón de La Vera Dulce; available at some supermarkets, at specialty foods stores, and from latienda.com."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b32ac4460b4423363efdef/6:4/w_274%2Ch_169/359337_grilled-shrimp-sausage-skewers_1x1.jpg",
        "color": 2262465
    }
}