{
    "recipe": {
        "title": "Grilled Meatball Sandwich ",
        "ingredients": [
            "2 lb (1 kg) ground beef",
            "1/2 cup (4 oz/125 g) ricotta cheese",
            "1/4 cup (1 oz/ 30 g) freshly grated Parmesan cheese",
            "1/4 cup (1/3 oz/10 g) Panko bread crumbs",
            "4 large eggs, lightly beaten",
            "2 Tbsp minced fresh flat-leaf parsley",
            "1 garlic clove, minced",
            "1 tsp red pepper flakes",
            "Kosher salt",
            "Oil for grill",
            "1 large baguette",
            "8 oz (250 g) thinly sliced Provolone cheese",
            "Arugula Pesto"
        ],
        "instructions": [
            "In a large bowl, combine the beef, ricotta, Parmesan, bread crumbs, eggs, parsley, garlic, red pepper flakes, and 2 tsp salt. Mix gently just until combined; you don't want to overwork the meat. Form the mixture into 12 meatballs about the size of golf balls, putting them on a lightly oiled baking sheet as you work. Set aside at room temperature. Build a hot fire in a charcoal grill or preheat a gas grill to high. Using a grill brush, scrape the heated grill rack clean. Rub the rack with oil. Arrange the meatballs on the grill rack without crowding. Using tongs, grill until browned evenly on all sides and cooked to medium, 8-10 minutes total, depending on grill temperature. Move any meatballs to a cooler area of the grill if they threaten to overbrown. Transfer to a platter or clean baking sheet as they are finished. Let rest for 5 minutes while you assemble the sandwiches. Cut the baguette crosswise into fourths and split each piece horizontally. Lay the pieces, cut side down, on the grill. Toast until golden brown, about 3 minutes. Lay the provolone slices on half of the baguette pieces. Place 3 meatballs on top of the cheese-lined baguette slices. Garnish with the pesto and serve right away.",
            "In a large bowl, combine the beef, ricotta, Parmesan, bread crumbs, eggs, parsley, garlic, red pepper flakes, and 2 tsp salt. Mix gently just until combined; you don't want to overwork the meat. Form the mixture into 12 meatballs about the size of golf balls, putting them on a lightly oiled baking sheet as you work. Set aside at room temperature.",
            "Build a hot fire in a charcoal grill or preheat a gas grill to high. Using a grill brush, scrape the heated grill rack clean. Rub the rack with oil. Arrange the meatballs on the grill rack without crowding. Using tongs, grill until browned evenly on all sides and cooked to medium, 8-10 minutes total, depending on grill temperature. Move any meatballs to a cooler area of the grill if they threaten to overbrown. Transfer to a platter or clean baking sheet as they are finished. Let rest for 5 minutes while you assemble the sandwiches.",
            "Cut the baguette crosswise into fourths and split each piece horizontally. Lay the pieces, cut side down, on the grill. Toast until golden brown, about 3 minutes. Lay the provolone slices on half of the baguette pieces. Place 3 meatballs on top of the cheese-lined baguette slices. Garnish with the pesto and serve right away."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b07dbffca98987608b33f9/6:4/w_274%2Ch_169/51116010_grilled-meatball-sandwich_1x1.jpg"
    }
}