{
    "recipe": {
        "title": "Grilled Cornish Game Hens with Lemon, Sumac, and Date Relish ",
        "ingredients": [
            "9 cups water",
            "1 cup fresh lemon juice, divided",
            "1/2 cup coarse kosher salt",
            "5 1 1/4- to 11/2-pound Cornish game hens, cut lengthwise in half, backbone removed",
            "1/2 cup olive oil",
            "2 tablespoons ground sumac*",
            "4 garlic cloves, peeled",
            "10 very thin lemon slices",
            "Date Relish"
        ],
        "instructions": [
            "Combine 9 cups water, 1/2 cup lemon juice, and coarse salt in large nonreactive pot. Stir until salt dissolves. Add hen halves and press to submerge. Refrigerate hens in brine, weighing down with heavy plate if needed, at least 6 hours and up to 1 day.",
            "Whisk 1/2 cup lemon juice, oil, and sumac in medium bowl. Press in garlic cloves; season with pepper. Let dressing stand 15 minutes to thicken slightly, whisking occasionally.",
            "Drain hens. Pat dry with paper towels; arrange on large rimmed baking sheet. Using fingertips, loosen skin of breast meat on each hen half. Brush some dressing under skin onto breast meat of each hen; place lemon slice onto breast meat and pull skin over to cover. Brush hens all over with remaining dressing. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature.",
            "Prepare barbecue (medium-high heat). Place hens, skin side up, on grill rack. Cover and grill until bottom sides are brown, about 8 minutes. Turn hens over; grill uncovered until skin sides brown, about 6 minutes. Continue to grill until hens are cooked through, turning occasionally, about 9 minutes longer. Transfer hens to platter. Serve with Date Relish.",
            "*Ground, dried, reddish-purple berries that grow wild throughout the Middle East; available at specialty foods stores and Middle Eastern markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/562fac2b83f23b081c8f5ffb/6:4/w_274%2Ch_169/242994_hires.jpg"
    }
}