{
    "recipe": {
        "title": "Grilled Carrot \"Hot Dogs\" with Tangy Slaw ",
        "ingredients": [
            "8 medium carrots, peeled, trimmed",
            "2 tablespoons pure maple syrup",
            "2 tablespoons soy sauce",
            "1 tablespoon adobo sauce from can of chipotle chiles in adobo",
            "1/2 teaspoon honey",
            "1/2 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "3/4 cup mayonnaise, divided",
            "1/4 cup fresh lime juice, divided",
            "1/2 small red onion",
            "1/2 small head of savoy cabbage (about 10 ounces), thinly sliced (about 6 cups)",
            "1 (15-ounce) can white beans, drained",
            "1/3 cup coarsely chopped cilantro, plus 3 tablespoons whole leaves",
            "Vegetable oil (for grill)",
            "4 hot dog buns",
            "2 tablespoons Corn Nuts"
        ],
        "instructions": [
            "Combine carrots, maple syrup, soy sauce, adobo sauce, and 1 cup water in a deep, large saucepan. Cover and cook over medium-high heat 10 minutes. Uncover, reduce heat to medium-low, and continue to cook, shaking pan occasionally, until liquid is completely reduced and carrots are coated in glaze, 2–3 minutes more.",
            "Meanwhile, whisk honey, salt, pepper, 1/2 cup mayonnaise, and 3 Tbsp. lime juice in a large bowl until smooth. Thinly slice half of onion to yield about 1/4 cup. Add onion, cabbage, beans, and 1/3 cup cilantro to bowl and stir to combine.",
            "Prepare a grill for medium-high heat or heat a grill pan or cast-iron skillet over medium-high; oil grate or pan. Grill carrots, turning once, until browned and slightly charred, about 2 minutes on each side. Transfer carrots to a plate. Toast buns until golden brown, about 30 seconds. Transfer buns to plate.",
            "Finely chop remaining half of onion to yield 3 Tbsp. Mix remaining 1/4 cup mayonnaise and 1 Tbsp. lime juice in a small bowl until smooth.",
            "Nestle 2 carrots into buns with large ends on opposite sides. Drizzle with mayonnaise mixture, then top with finely chopped onion, Corn Nuts, and 3 Tbsp. cilantro leaves. Serve with coleslaw alongside.",
            "Do Ahead Carrots and slaw can be made 3 days ahead. Store separately in airtight containers and chill.",
            "Carrots and slaw can be made 3 days ahead. Store separately in airtight containers and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59381ddaf692c10ac01b000e/6:4/w_274%2Ch_169/GRILLED-CARROT-DOG-WITH-CILANTRO-SLAW-recipe-02062017.jpg",
        "color": 7375916
    }
}