{
    "recipe": {
        "title": "Grilled Grass-Fed Rib-Eye Steaks with Balsamic-Caper Vinaigrette ",
        "ingredients": [
            "1/2 cup balsamic vinegar",
            "1/2 cup minced shallots",
            "1/4 cup extra-virgin olive oil plus more for steaks and grill",
            "1/4 teaspoon dried crushed red pepper",
            "1/4 cup chopped fresh Italian parsley",
            "2 tablespoons drained capers",
            "2 teaspoons fresh thyme leaves",
            "4 3/4-inch-thick grass-fed rib-eye steaks",
            "3 garlic cloves, pressed",
            "4 teaspoons smoked paprika*",
            "2 teaspoons coarse kosher salt",
            "1 1/2 teaspoons freshly ground black pepper"
        ],
        "instructions": [
            "Simmer vinegar in small pan over medium heat until reduced to 1/4 cup, about 6 minutes. Add shallots, 1/4 cup oil, and crushed red pepper; return to simmer. Remove from heat; whisk in parsley, capers, and thyme. Season vinaigrette with salt and pepper. Rub both sides of steaks with oil and garlic. Mix paprika, 2 teaspoons coarse salt, and 1 1/2 teaspoons black pepper in small bowl. Sprinkle on both sides of steaks. Let stand at least 15 minutes and up to 1 hour. Prepare barbecue (medium-high heat). Brush grill rack with oil to coat. Grill steaks until cooked to desired doneness, about 3 minutes per side for medium-rare. Transfer steaks to plates. Spoon vinaigrette over.",
            "Simmer vinegar in small pan over medium heat until reduced to 1/4 cup, about 6 minutes. Add shallots, 1/4 cup oil, and crushed red pepper; return to simmer. Remove from heat; whisk in parsley, capers, and thyme. Season vinaigrette with salt and pepper.",
            "Rub both sides of steaks with oil and garlic. Mix paprika, 2 teaspoons coarse salt, and 1 1/2 teaspoons black pepper in small bowl. Sprinkle on both sides of steaks. Let stand at least 15 minutes and up to 1 hour.",
            "Prepare barbecue (medium-high heat). Brush grill rack with oil to coat. Grill steaks until cooked to desired doneness, about 3 minutes per side for medium-rare. Transfer steaks to plates. Spoon vinaigrette over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a54d62fa7a9917c25860/6:4/w_274%2Ch_169/352592_hires.jpg"
    }
}