{
    "recipe": {
        "title": "Grilled Lamb Chops with Fresh Mango Chutney ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "1 cup plain whole-milk yogurt",
            "4 tablespoons chopped fresh mint, divided",
            "1 1/2 teaspoons garam masala",
            "8 T-bone loin lamb chops (each about 1 inch thick)",
            "1 1/2 cups 1/2-inch cubes peeled pitted mango",
            "2 1/2 tablespoons ginger preserves",
            "1 1/2 tablespoons fresh lime juice",
            "1 1/2 teaspoons minced serrano chiles with seeds"
        ],
        "instructions": [
            "Spray grill rack with nonstick spray and prepare barbecue (medium-high heat). Whisk plain yogurt, 2 tablespoons chopped mint, and garam masala in medium bowl to blend. Add lamb chops and turn to coat with yogurt mixture. Let stand at room temperature 15 minutes. Meanwhile, combine mango cubes, ginger preserves, lime juice, serrano chiles, and remaining 2 tablespoons mint in small bowl. Season mango chutney to taste with salt and pepper. Remove lamb chops from yogurt mixture; sprinkle generously with salt and pepper. Grill lamb to desired doneness about 5 minutes per side for medium-rare. Place 2 lamb chops on each of 4 plates; serve with mango chutney.",
            "Spray grill rack with nonstick spray and prepare barbecue (medium-high heat). Whisk plain yogurt, 2 tablespoons chopped mint, and garam masala in medium bowl to blend. Add lamb chops and turn to coat with yogurt mixture. Let stand at room temperature 15 minutes.",
            "Meanwhile, combine mango cubes, ginger preserves, lime juice, serrano chiles, and remaining 2 tablespoons mint in small bowl. Season mango chutney to taste with salt and pepper.",
            "Remove lamb chops from yogurt mixture; sprinkle generously with salt and pepper. Grill lamb to desired doneness about 5 minutes per side for medium-rare. Place 2 lamb chops on each of 4 plates; serve with mango chutney."
        ],
        "picture_link": null
    }
}