{
    "recipe": {
        "title": "Grilled Swordfish with Charred Leeks and Citrus ",
        "ingredients": [
            "4 medium leeks (about 2 1/2 lb.)",
            "1 cup green olives",
            "1/4 cup coarsely chopped dill",
            "3 Tbsp. white wine vinegar",
            "Kosher salt",
            "5 Tbsp. extra-virgin olive oil, divided, plus more",
            "3 oranges",
            "4 (1\"-thick) swordfish steaks (about 3 lb.)",
            "Freshly ground black pepper"
        ],
        "instructions": [
            "Prepare a grill for high heat. Trim dark green parts from leeks and remove any tough outer layers. Rinse off any sand and dirt and pat dry. Throw leeks on grill (no oil needed) and grill, turning every few minutes with tongs, until outside layer is completely blackened (they should start to soften and you might see some juices begin to ooze out), 10–12 minutes. Transfer to a platter and let cool (this also allows them to steam and become tender on the inside). Reduce grill heat to medium-high. Meanwhile, smash open olives using the side of a chef’s knife and remove pits (try to leave olive flesh in big pieces). Transfer to a medium bowl. Cut leeks into 1/2\"-thick rounds (ashy parts and all) and add to bowl with olives along with dill, vinegar, a big pinch of salt, and 3 Tbsp. oil; toss to combine. Remove peel and white pith from oranges with a sharp paring knife and discard. Slice oranges crosswise into 1/4\"-thick rounds. Set aside for serving. Clean and oil grate and rub swordfish steaks with 2 Tbsp. oil; season with salt. Grill until lightly charred and just cooked through (fish will feel firm when gently pressed), 5–7 minutes per side. Divide swordfish among plates and arrange reserved sliced oranges around. Spoon leek mixture and any juices in bowl over. Drizzle with more oil and season with pepper.",
            "Prepare a grill for high heat. Trim dark green parts from leeks and remove any tough outer layers. Rinse off any sand and dirt and pat dry.",
            "Throw leeks on grill (no oil needed) and grill, turning every few minutes with tongs, until outside layer is completely blackened (they should start to soften and you might see some juices begin to ooze out), 10–12 minutes. Transfer to a platter and let cool (this also allows them to steam and become tender on the inside). Reduce grill heat to medium-high.",
            "Meanwhile, smash open olives using the side of a chef’s knife and remove pits (try to leave olive flesh in big pieces). Transfer to a medium bowl.",
            "Cut leeks into 1/2\"-thick rounds (ashy parts and all) and add to bowl with olives along with dill, vinegar, a big pinch of salt, and 3 Tbsp. oil; toss to combine.",
            "Remove peel and white pith from oranges with a sharp paring knife and discard. Slice oranges crosswise into 1/4\"-thick rounds. Set aside for serving.",
            "Clean and oil grate and rub swordfish steaks with 2 Tbsp. oil; season with salt. Grill until lightly charred and just cooked through (fish will feel firm when gently pressed), 5–7 minutes per side.",
            "Divide swordfish among plates and arrange reserved sliced oranges around. Spoon leek mixture and any juices in bowl over. Drizzle with more oil and season with pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b16fb043674e370f3a0ce0d/6:4/w_274%2Ch_169/grilled-swordfish-with-charred-leeks-and-citrus-recipe-BA-060518.jpg"
    }
}