{
    "recipe": {
        "title": "Grilled Summer Vegetables with Harissa Dressing ",
        "ingredients": [
            "1/2 cup plus 3 tablespoons extra-virgin olive oil",
            "2 tablespoons fresh lemon juice",
            "2 teaspoons harissa powder",
            "1 red bell pepper, quartered, seeded",
            "1 1 1/2-pound eggplant, trimmed, cut crosswise into 1/2-inch-thick rounds",
            "4 medium zucchini, halved lengthwise, then crosswise",
            "6 large green lettuce leaves",
            "3 tablespoons chopped fresh cilantro",
            "Lemon wedges (for garnish)",
            "Ingredient info: Harissa powder is a spice blend sold at Middle Eastern markets, specialty foods stores, and online at wholespice.com. If unavailable, combine 2 teaspoons ground coriander; 1 1/2 teaspoons ancho chile powder; 1 teaspoon each garlic powder, paprika, and cumin; 1/2 teaspoon salt; and 1/4 teaspoon cayenne pepper."
        ],
        "instructions": [
            "Whisk 1/2 cup oil, lemon juice, and harissa in medium bowl. Season dressing with salt.",
            "Prepare barbecue (high heat). Grill bell pepper quarters, skin side down, until skin is blackened all over (do not turn). Reduce heat to medium (if using gas grill) or let coals cool slightly (if using charcoal grill). Pour remaining 3 tablespoons oil onto rimmed baking sheet. Place eggplant rounds and zucchini on prepared sheet; turn to coat. Sprinkle vegetables with salt and pepper. Grill until charred in spots and cooked through, turning occasionally, about 10 minutes. Return vegetables to same sheet. Peel peppers. DO AHEAD: Dressing and vegetables can be made 2 hours ahead. Let stand at room temperature.",
            "Line platter with lettuce. Cut eggplant rounds crosswise in half; arrange in concentric circles atop outside edge of lettuce, leaving center empty. Cut bell pepper and zucchini into 1-inch pieces; mound in center. Drizzle some of dressing over. Sprinkle with cilantro. Serve with lemon wedges; pass additional dressing."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3068311c5d6af478b813c/6:4/w_274%2Ch_169/359789_grilled-summer-vegetables-harissa-_1x1.jpg",
        "color": 10314019
    }
}