{
    "recipe": {
        "title": "Ground Pork Menudo ",
        "ingredients": [
            "2 tbsp (30 ml) olive oil",
            "2 cloves garlic, chopped",
            "1 small onion, chopped",
            "1 lb (450 g) lean ground pork",
            "1 tbsp (15 ml) fish sauce",
            "1/2 cup (120 ml) tomato sauce",
            "1 1/2 cups (350 ml) water",
            "1 cup (128 g) diced carrots",
            "1 large potato, peeled and diced",
            "1 red or green bell pepper, seeded and diced",
            "1/2 cup (75 g) frozen green peas",
            "1/2 cup (75 g) raisins",
            "Salt and freshly ground black pepper, to taste",
            "Steamed rice, for serving"
        ],
        "instructions": [
            "Heat the oil in a skillet over medium-high heat. Add the garlic and onion, and sauté until the onion begins to soften, about 2 minutes. Add the ground pork and cook, stirring regularly, for 5 minutes or until the meat is lightly browned. Stir in the fish sauce. Add the tomato sauce and water. Stir, cover and cook on medium heat for 5 minutes, stirring occasionally. Add the carrots, potato and bell pepper, and cook for 10 minutes. Add the green peas and raisins, and cook for another 5 minutes, or until the vegetables are tender. Season to taste with salt and pepper. Serve with steamed rice.",
            "Heat the oil in a skillet over medium-high heat. Add the garlic and onion, and sauté until the onion begins to soften, about 2 minutes.",
            "Add the ground pork and cook, stirring regularly, for 5 minutes or until the meat is lightly browned. Stir in the fish sauce.",
            "Add the tomato sauce and water. Stir, cover and cook on medium heat for 5 minutes, stirring occasionally.",
            "Add the carrots, potato and bell pepper, and cook for 10 minutes. Add the green peas and raisins, and cook for another 5 minutes, or until the vegetables are tender. Season to taste with salt and pepper. Serve with steamed rice."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b8ffe14cf06db2dbe76e60e/6:4/w_274%2Ch_169/filipino-ground-pork-menudo-stew-recipe-090518.jpg"
    }
}