{
    "recipe": {
        "title": "Ground Beef Tacos ",
        "ingredients": [
            "1 tablespoon vegetable oil",
            "1/2 onion, chopped",
            "1/2 pound ground beef",
            "1 garlic clove, minced",
            "1 serrano chile, stemmed and chopped",
            "1/2 teaspoon salt",
            "1 teaspoon chili powder",
            "1/4 teaspoon ground black pepper",
            "1/4 teaspoon ground cumin",
            "1 1/2 cups grated Cheddar or Monterey Jack cheese",
            "1 1/2 cups chopped tomato",
            "1 1/2 cups chopped iceberg lettuce",
            "6 taco shells",
            "1 cup Salsa Picante or favorite salsa, optional"
        ],
        "instructions": [
            "For the filling: Heat the oil in a skillet over medium-high heat and cook the onion until it begins to wilt, about 2 minutes. Add the meat and sear, chopping with a spatula into small pieces until the pink color is gone. Add the garlic and chile and cook for 2 minutes or until the garlic is soft. Add the salt, chili powder, black pepper, cumin, and a tablespoon of water, mix well, and cook for 2 to 3 minutes or until well blended.",
            "Heat the oil in a skillet over medium-high heat and cook the onion until it begins to wilt, about 2 minutes. Add the meat and sear, chopping with a spatula into small pieces until the pink color is gone. Add the garlic and chile and cook for 2 minutes or until the garlic is soft. Add the salt, chili powder, black pepper, cumin, and a tablespoon of water, mix well, and cook for 2 to 3 minutes or until well blended.",
            "Assembly: To assemble the tacos, put 1/4 cup meat mixture, then 1/4 cup each cheese, chopped tomato, and lettuce on each taco shell. Drizzle with salsa if desired.",
            "To assemble the tacos, put 1/4 cup meat mixture, then 1/4 cup each cheese, chopped tomato, and lettuce on each taco shell. Drizzle with salsa if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/594c0f0f705436304c0c5859/6:4/w_274%2Ch_169/How-To-Make-Taco-Meat-20062017..jpg"
    }
}