{
    "recipe": {
        "title": "Guacamole Taquero: Taco-Shop Guacamole ",
        "ingredients": [
            "1/2 pound tomatillos (5 or 6), husked, rinsed, and coarsely chopped",
            "6 large (about 3 1/2 inches long) fresh epazote leaves or cilantro",
            "2 small garlic cloves, peeled and coarsely chopped",
            "1/4 cup coarsely chopped white onion",
            "2 fresh serrano or jalapeño chiles, coarsely chopped, including seeds, or more to taste",
            "1 tablespoon freshly squeezed lime juice, or more to taste",
            "1/2 teaspoon fine salt, or 1 teaspoon kosher salt",
            "1 small ripe Mexican Hass avocado, halved and pitted"
        ],
        "instructions": [
            "Put the tomatillos into the blender jar first, then add the epazote, garlic, onion, chiles, lime juice, and salt. Blend until very smooth, at least a minute (be patient; see note below). Scoop the avocado flesh with a spoon into the blender jar and blend until smooth. Add a little water, if necessary, to achieve a pourable texture. Season to taste with additional chile, lime juice, and salt, and blend once more.",
            "This salsa tastes best the day it's made, but the acidity from the tomatillos will keep it from discoloring as quickly as most guacamoles. It'll still be delicious the next day if you store it in the refrigerator with a piece of plastic wrap pressed against the surface. Let it come to room temperature before you serve it.",
            "Note: Blending Stubborn Tomatillos It takes a minute or so for the blades of the blender jar to catch raw chopped tomatillos. Once they do, all the ingredients will be pulled toward them. Be patient, and do not add any water. If the tomatillos don't liquidize after a minute or so, stop the blender, prod them with a wooden spoon, and try to blend again.",
            "It takes a minute or so for the blades of the blender jar to catch raw chopped tomatillos. Once they do, all the ingredients will be pulled toward them. Be patient, and do not add any water. If the tomatillos don't liquidize after a minute or so, stop the blender, prod them with a wooden spoon, and try to blend again."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b2f52911c5d6af478b5500/6:4/w_274%2Ch_169/364411_guacamole-taquero_1x1.jpg"
    }
}