{
    "recipe": {
        "title": "Guajillo-Braised Beef Short Rib Taco ",
        "ingredients": [
            "8 guajillo chiles, stemmed and seeded",
            "3 dried chipotle chiles, stemmed and seeded",
            "2 to 4 tablespoons vegetable oil",
            "3 pounds boneless beef short ribs",
            "1 large yellow onion, coarsely chopped",
            "2 cloves garlic, coarsely chopped",
            "1 (12-ounce) bottle Negro Modelo or other dark Mexican beer",
            "2 teaspoons ground cumin",
            "1 teaspoon freshly ground black pepper",
            "1 1/2 tablespoons dried Mexican oregano",
            "1 1/2 tablespoons kosher salt",
            "1/2 cup water",
            "Corn tortillas, warmed, for serving",
            "Chopped white onion, chopped fresh cilantro, salsa of choice, and lime wedges, for serving"
        ],
        "instructions": [
            "Preheat the oven to 325°F.",
            "Working in two batches if necessary to avoid crowding, lightly toast all of the chiles in a dry, heavy skillet over medium heat for 30 seconds on each side, until fragrant but not blackened. Set them aside on a plate.",
            "Heat 2 tablespoons of the oil in a Dutch oven or other heavy pot with a lid over medium-high heat. When the oil is hot, working in batches to avoid crowding, add the meat and sear for about 3 minutes on each side, until the pieces have formed a uniformly browned crust. Add more oil to the pot as needed to prevent scorching. As the pieces are ready, set them aside on a plate.",
            "Add the onion to the same same pot over medium heat and cook, stirring occasionally, for about 5 minutes, until it starts to brown. Add the garlic and cook for an additional 2 minutes.",
            "Pour in the beer, add the toasted chiles, and turn down the heat to low. Simmer uncovered, stirring occasionally, for about 5 minutes, until the chiles have softened and are pliable. Remove from the heat and let cool.",
            "Transfer the contents of the pot to a blender and reserve the pot. Add the cumin, pepper, oregano, salt, and water to the blender and blend the mixture on high speed until smooth and the consistency of cream, adding more water if needed to thin the mixture a bit.",
            "Return the seared meat to the pot and pour in the chile mixture. Cover, transfer to the oven, and cook, stirring occasionally, for 3 to 4 hours, until the meat is fork-tender.",
            "Remove from the oven and, using tongs or a couple of forks, shred the meat in the pot. Taste and adjust the seasoning with salt if needed. Serve with the tortillas, onion, cilantro, salsa, and lime."
        ],
        "picture_link": "https://assets.epicurious.com/photos/555a0edb100d9bda6d81cd64/6:4/w_274%2Ch_169/51249220_guajillo-braised-beef-short-rib-taco_1x1.jpg"
    }
}