{
    "recipe": {
        "title": "Gumbo Ya Ya ",
        "ingredients": [
            "2 cups unsalted butter",
            "4 cups all-purpose flour",
            "2 red bell peppers, diced",
            "2 green bell peppers, diced",
            "2 medium yellow onions, diced",
            "2 stalks celery, diced",
            "5 quarts chicken stock, heated",
            "2 tablespoons Creole Seasoning",
            "1 teaspoon ground black pepper",
            "1 teaspoon crushed red pepper",
            "1 teaspoon chili powder",
            "1 teaspoon thyme",
            "1 tablespoon chopped garlic",
            "2 bay leaves",
            "2 tablespoons kosher salt",
            "1 pound andouille sausage, sliced 1/2-inch thick",
            "1 whole 4-pound chicken, roasted and deboned, cut into 2-inch pieces"
        ],
        "instructions": [
            "1. First you make a roux. Melt the butter in a 12-quart stockpot. Whisk in the flour and cook until foaming. Cook, stirring often, until dark mahogany, about 1 hour. 2. Add the peppers, onion, and celery. Cook until soft, about 5 minutes. Whisk in the chicken stock (make sure it’s hot), and bring the mixture to a boil. Reduce the heat to simmer. Stir in Creole Seasoning, black pepper, crushed red pepper, chili powder, thyme, chopped garlic, bay leaves, and kosher salt. Cook, skimming fat as necessary, an additional 45 minutes. 3. Add the andouille and chicken and cook for approximately 15 minutes. Taste, and adjust for seasoning.",
            "1. First you make a roux. Melt the butter in a 12-quart stockpot. Whisk in the flour and cook until foaming. Cook, stirring often, until dark mahogany, about 1 hour.",
            "2. Add the peppers, onion, and celery. Cook until soft, about 5 minutes. Whisk in the chicken stock (make sure it’s hot), and bring the mixture to a boil. Reduce the heat to simmer. Stir in Creole Seasoning, black pepper, crushed red pepper, chili powder, thyme, chopped garlic, bay leaves, and kosher salt. Cook, skimming fat as necessary, an additional 45 minutes.",
            "3. Add the andouille and chicken and cook for approximately 15 minutes. Taste, and adjust for seasoning."
        ],
        "picture_link": null
    }
}