{
    "recipe": {
        "title": "Halfsteak Frites ",
        "ingredients": [
            "1 1/2 pounds russet (baking) potatoes",
            "About 8 cups canola oil",
            "Kosher salt",
            "1 1/2 teaspoons Sherry vinegar",
            "1 (1 1/2-to 2-inch-thick) dry-aged bone-in top loin (strip) steak",
            "2 tablespoons unsalted butter",
            "2 thyme sprigs",
            "3 tablespoons veal or beef demi-glace (frozen or packaged, reconstituted if necessary)",
            "1/2 tablespoon extra-virgin olive oil",
            "Equipment: a deep-fat thermometer"
        ],
        "instructions": [
            "Make Fries: Peel potatoes and cut into 1/4-inch-thick sticks. Rinse well, then soak in cold water, chilled, at least 2 hours. Drain potatoes and pat dry thoroughly. Heat 2 1/2 inches canola oil to 275°F in a 4-to 5-quart heavy pot over medium heat. Fry potatoes in 2 batches, stirring once or twice, 3 minutes per batch (potatoes will not be golden), transferring with a slotted spoon to paper towels to drain. Return oil to 275°F between batches. Heat oil to 320°F. Refry potatoes in 2 batches, stirring once or twice, until golden and crisp, about 8 minutes per batch, transferring to fresh paper towels. Return oil to 320°F between batches. Sprinkle hot fries with kosher salt and vinegar.",
            "Peel potatoes and cut into 1/4-inch-thick sticks. Rinse well, then soak in cold water, chilled, at least 2 hours.",
            "Drain potatoes and pat dry thoroughly. Heat 2 1/2 inches canola oil to 275°F in a 4-to 5-quart heavy pot over medium heat.",
            "Fry potatoes in 2 batches, stirring once or twice, 3 minutes per batch (potatoes will not be golden), transferring with a slotted spoon to paper towels to drain. Return oil to 275°F between batches.",
            "Heat oil to 320°F. Refry potatoes in 2 batches, stirring once or twice, until golden and crisp, about 8 minutes per batch, transferring to fresh paper towels. Return oil to 320°F between batches.",
            "Sprinkle hot fries with kosher salt and vinegar.",
            "Cook steak: Heat a 10-inch heavy skillet (preferably cast-iron; not nonstick) over medium-high heat until very hot. Pat steak dry and season with 3/4 teaspoon kosher salt and 1/2 teaspoon pepper. Add 1 1/2 teaspoons canola oil to skillet, then sear steak, turning once, 8 to 12 minutes total for medium-rare. During final minutes of cooking, add butter and thyme to skillet and baste steak with butter. Transfer steak to a cutting board and let rest 10 minutes. Add demi-glace to butter in skillet and simmer, scraping up brown bits, 30 seconds. Remove from heat and stir in olive oil. Cut meat from bone and slice. Serve steak with sauce spooned over it.◊",
            "Heat a 10-inch heavy skillet (preferably cast-iron; not nonstick) over medium-high heat until very hot. Pat steak dry and season with 3/4 teaspoon kosher salt and 1/2 teaspoon pepper.",
            "Add 1 1/2 teaspoons canola oil to skillet, then sear steak, turning once, 8 to 12 minutes total for medium-rare. During final minutes of cooking, add butter and thyme to skillet and baste steak with butter.",
            "Transfer steak to a cutting board and let rest 10 minutes.",
            "Add demi-glace to butter in skillet and simmer, scraping up brown bits, 30 seconds. Remove from heat and stir in olive oil. Cut meat from bone and slice. Serve steak with sauce spooned over it.◊"
        ],
        "picture_link": null
    }
}