{
    "recipe": {
        "title": "Halibut with Tomato-Sorrel Sauce ",
        "ingredients": [
            "1/4 cup finely chopped shallots",
            "1/4 cup white wine vinegar",
            "1/4 cup dry white wine",
            "1/2 cup whipping cream",
            "3 tablespoons vegetable oil",
            "12 ounces mushrooms, chopped",
            "1/2 teaspoon dried crushed red pepper",
            "2 medium zucchini, trimmed, cut into matchstick-size strips",
            "4 8-ounces halibut fillets (about 1 inch thick)",
            "1/2 cup (1 stick) chilled butter, cut into pieces",
            "2 medium tomatoes, peeled, seeded, chopped (about 1 cup)",
            "2 tablespoons chopped fresh sorrel or spinach"
        ],
        "instructions": [
            "For Sauce: Combine shallots and vinegar in heavy small saucepan. Boil until most of liquid evaporates, about 4 minutes. Add wine; boil until most of liquid evaporates, about 3 minutes. Whisk in cream. Set sauce aside.",
            "Combine shallots and vinegar in heavy small saucepan. Boil until most of liquid evaporates, about 4 minutes. Add wine; boil until most of liquid evaporates, about 3 minutes. Whisk in cream. Set sauce aside.",
            "For Halibut: Preheat oven to 400°F. Heat 2 tablespoons oil in heavy large skillet over medium-high heat. Add mushrooms and crushed red pepper. Cook until mushrooms are deep golden brown, stirring frequently, about 12 minutes. Add zucchini and sauté 2 minutes. Season to taste with salt and pepper. Meanwhile, lightly oil baking sheet. Place halibut on sheet and brush with remaining 1 tablespoon oil. Bake until fish is opaque in center, about 10 minutes. Bring sauce to simmer. Reduce heat; add butter and whisk just until melted. Remove from heat. Mix in tomatoes and sorrel. Season with salt and pepper. Spoon Garlic Mashed Potatoes onto center of 4 plates. Place halibut atop potatoes. Arrange mushroom mixture around potatoes. Spoon sauce over fish and serve.",
            "Preheat oven to 400°F. Heat 2 tablespoons oil in heavy large skillet over medium-high heat. Add mushrooms and crushed red pepper. Cook until mushrooms are deep golden brown, stirring frequently, about 12 minutes. Add zucchini and sauté 2 minutes. Season to taste with salt and pepper.",
            "Meanwhile, lightly oil baking sheet. Place halibut on sheet and brush with remaining 1 tablespoon oil. Bake until fish is opaque in center, about 10 minutes.",
            "Bring sauce to simmer. Reduce heat; add butter and whisk just until melted. Remove from heat. Mix in tomatoes and sorrel. Season with salt and pepper.",
            "Spoon Garlic Mashed Potatoes onto center of 4 plates. Place halibut atop potatoes. Arrange mushroom mixture around potatoes. Spoon sauce over fish and serve."
        ],
        "picture_link": null
    }
}