{
    "recipe": {
        "title": "Halibut Brochettes Provençale ",
        "ingredients": [
            "1 1/2 tablespoons minced fresh basil",
            "2 teaspoons minced fresh marjoram",
            "2 teaspoons minced fresh thyme",
            "1 teaspoon minced fresh rosemary",
            "1 teaspoon minced fresh sage",
            "1/2 teaspoon chopped fennel seeds",
            "1/4 teaspoon finely chopped dried lavender blossoms*",
            "1 1 1/2-inch-diameter zucchini, cut into eight 1/2-inch-thick rounds",
            "1 unpeeled slender eggplant, trimmed, halved lengthwise, cut into eight 1- to 1 1/4-inch pieces",
            "8 mini plum tomatoes or large cherry tomatoes",
            "16 mini bell peppers in assorted colors (from one 5-ounce package) or 1 bell pepper cut into 1-inch squares",
            "1 small red onion, cut into 4 wedges, each wedge halved crosswise, layers kept intact",
            "5 tablespoons extra-virgin olive oil, divided",
            "1 1/2 pounds halibut, cut into 1 1/2-inch cubes",
            "5 tablespoons fresh lemon juice, divided",
            "2 garlic cloves, pressed",
            "1/3 cup dry white wine",
            "Nonstick vegetable oil spray",
            "12 metal skewers"
        ],
        "instructions": [
            "Mix first 7 ingredients in small bowl. Place zucchini, eggplant, tomatoes, peppers, and onion in large bowl. Add 1 tablespoon herb mixture and 1 tablespoon oil to vegetables. Sprinkle with salt and pepper; toss to coat. Thread 1 mini pepper, 1 zucchini round, 1 eggplant piece, 1 tomato, 1 onion piece, and 1 more mini pepper onto each of 8 skewers. DO AHEAD: Herb mixture and vegetables can be made 4 hours ahead. Cover separately and refrigerate.",
            "Place fish in medium bowl; sprinkle 2 tablespoons herb mixture over. Add 3 tablespoons oil, 3 tablespoons lemon juice, and garlic; sprinkle with salt and pepper and toss to coat. Cover and chill at least 1 hour and up to 2 hours, tossing occasionally.",
            "Simmer wine, remaining 1 tablespoon oil, and remaining 2 tablespoons lemon juice in small saucepan until reduced to 1/3 cup, about 3 minutes. Stir in remaining herb mixture. Season sauce to taste with salt and pepper. Set aside.",
            "Spray grill rack with nonstick spray; prepare barbecue (medium-high heat). Divide fish cubes among remaining 4 skewers. Grill vegetable skewers until vegetables are slightly charred and tender, turning occasionally, 10 to 12 minutes. Grill fish skewers until fish is cooked through, turning occasionally, 8 to 10 minutes.",
            "Place 1 fish skewer and 2 vegetable skewers on each plate. Drizzle sauce over.",
            "Also called culinary lavender buds; available at some supermarkets and farmers' markets, at many natural foods stores, and from deandeluca.com.",
            "Also called culinary lavender buds; available at some supermarkets and farmers' markets, at many natural foods stores, and from deandeluca.com.",
            "Also called culinary lavender buds; available at some supermarkets and farmers' markets, at many natural foods stores, and from deandeluca.com."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55354a1567c3a7e837c3d183/6:4/w_274%2Ch_169/354296_halibut-brochettes-proven-ale_6x4.jpg"
    }
}