{
    "recipe": {
        "title": "Ham Hock and White Bean Stew ",
        "ingredients": [
            "3 medium shallots, thinly sliced into rings",
            "1/2 cup vegetable oil",
            "Kosher salt",
            "1/2 cup sour cream",
            "3 Tbsp. Dijon mustard",
            "1 1/2 tsp. honey",
            "Freshly ground black pepper",
            "3 Tbsp. extra-virgin olive oil",
            "2 medium onions, halved through root ends",
            "2 heads of garlic, halved crosswise",
            "2 small carrots, trimmed, scrubbed",
            "1/2 cup dry white wine",
            "2 1/2 lb. smoked ham hocks (about 4 medium)",
            "1 bunch of thyme, stems tied together with kitchen twine",
            "2 cups corona or gigante beans, soaked overnight, drained",
            "Kosher salt, freshly ground pepper",
            "Chopped cornichons and/or dill sprigs (for serving; optional)"
        ],
        "instructions": [
            "Heat shallots and oil in a small saucepan over medium, swirling often, until shallots are deep golden brown, 6–8 minutes. Pour into a fine-mesh sieve set over a heatproof measuring glass. Give sieve a good shake, then spread out shallots on a paper towel to drain. Season with salt; let cool.",
            "Honey-Mustard Cream: Stir sour cream, mustard, and honey in a small bowl until smooth; season with pepper. Cover and chill.",
            "Stir sour cream, mustard, and honey in a small bowl until smooth; season with pepper. Cover and chill.",
            "Stew and assembly: Heat oil in a large Dutch oven or other heavy pot over medium-high. Cook onions and garlic, cut side down, and carrots, turning carrots occasionally, until cut sides of onions and garlic are golden, about 4 minutes. Add wine, stirring to release any bits stuck on bottom of pot, and cook until reduced by two-thirds, about 2 minutes. Add ham hocks, thyme, beans, and 9 cups water. Season with several pinches of salt and lots of pepper and bring to a simmer. Cover with a lid, leaving slightly askew so steam can escape, and cook, adjusting heat to maintain a very gentle simmer and skimming foam from surface as needed, until beans are tender and creamy and broth is very flavorful, 2–2 1/2 hours. Remove pot from heat and transfer ham hocks to a cutting board. Let sit until cool enough to handle, then pull meat from bones and tear into bite-size pieces; discard fat, skin, and cartilage. Add meat and knuckle bones back to pot as you go. Let stew cool uncovered until no longer steaming. Cover pot and chill stew at least 12 hours (you can skip this step, but it will dramatically improve the flavor). Gently reheat stew, covered, until barely simmering. Pluck out and discard bones, thyme, and garlic heads (don't worry about any cloves that may have escaped into stew). Season with more salt and pepper if needed. Ladle into bowls and serve with Frizzled Shallots, Honey-Mustard Cream, cornichons, and/or dill as desired.",
            "Heat oil in a large Dutch oven or other heavy pot over medium-high. Cook onions and garlic, cut side down, and carrots, turning carrots occasionally, until cut sides of onions and garlic are golden, about 4 minutes. Add wine, stirring to release any bits stuck on bottom of pot, and cook until reduced by two-thirds, about 2 minutes. Add ham hocks, thyme, beans, and 9 cups water. Season with several pinches of salt and lots of pepper and bring to a simmer. Cover with a lid, leaving slightly askew so steam can escape, and cook, adjusting heat to maintain a very gentle simmer and skimming foam from surface as needed, until beans are tender and creamy and broth is very flavorful, 2–2 1/2 hours.",
            "Remove pot from heat and transfer ham hocks to a cutting board. Let sit until cool enough to handle, then pull meat from bones and tear into bite-size pieces; discard fat, skin, and cartilage. Add meat and knuckle bones back to pot as you go. Let stew cool uncovered until no longer steaming. Cover pot and chill stew at least 12 hours (you can skip this step, but it will dramatically improve the flavor).",
            "Gently reheat stew, covered, until barely simmering. Pluck out and discard bones, thyme, and garlic heads (don't worry about any cloves that may have escaped into stew). Season with more salt and pepper if needed. Ladle into bowls and serve with Frizzled Shallots, Honey-Mustard Cream, cornichons, and/or dill as desired.",
            "Do Ahead Cream can be made 2 days ahead. Keep chilled. Stew can be made 3 days ahead. Keep chilled.",
            "Cream can be made 2 days ahead. Keep chilled. Stew can be made 3 days ahead. Keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5bc4da278b762a2d0a11dc65/6:4/w_274%2Ch_169/ham-hock-and-white-bean-stew-bowl-recipe-BA-101518.jpg",
        "color": 6615118
    }
}