{
    "recipe": {
        "title": "Hamburger Buns ",
        "ingredients": [
            "2 cups whole milk",
            "1/4 cup warm water (105-115°F)",
            "2 (1/4-ounce) packages active dry yeast",
            "1/4 cup plus 1/2 tsp sugar, divided",
            "1/2 stick unsalted butter, cut into tablespoon pieces and softened",
            "2 large eggs, lightly beaten",
            "1 tablespoon salt",
            "6 cups all-purpose flour, divided",
            "1 large egg mixed with 1 tablespoon water for egg wash",
            "a stand mixer with paddle and dough-hook attachments; a 3-inch round cookie cutter"
        ],
        "instructions": [
            "Bring milk to a bare simmer in a small saucepan over medium heat. Remove from heat and cool to 105 to 115°F.",
            "Meanwhile, stir together warm water, yeast, and 1/2 tsp sugar in mixer bowl until yeast has dissolved. Let stand until foamy, about 5 minutes. (If mixture doesn't foam, start over with new yeast.)",
            "Add butter, warm milk, and remaining 1/4 cup sugar to yeast mixture and mix with paddle attachment at low speed until butter has melted, then mix in eggs until combined well. Add salt and 4 cups flour and mix, scraping down side of bowl as necessary, until flour is incorporated. Beat at medium speed 1 minute.",
            "Switch to dough hook and beat in remaining 2 cups flour at medium speed until dough pulls away from side of bowl, about 2 minutes; if necessary, add more flour, 1 Tbsp at a time. Beat 5 minutes more. (Dough will be sticky.)",
            "Transfer dough to a lightly oiled large bowl and turn to coat. Cover tightly with plastic wrap and let rise in a warm draft-free place until doubled, about 2 1/2 hours.",
            "Butter 2 large baking sheets. Punch down dough, then roll out on a lightly floured surface with a floured rolling pin into a 14-inch round (about 1/2 inch thick). Cut out as many rounds as possible with floured cutter and arrange 3 inches apart on baking sheets. Gather and reroll scraps, then cut out more rounds.",
            "Loosely cover buns with oiled plastic wrap and let rise in a draft-free place at warm room temperature until they hold a finger mark when gently poked, 1 1/2 to 2 hours.",
            "Preheat oven to 375°F with racks in upper and lower thirds.",
            "Brush buns with egg wash and bake, switching position of sheets halfway through baking, until tops are golden and undersides are golden brown and sound hollow when tapped, 14 to 20 minutes. Transfer to racks to cool completely."
        ],
        "picture_link": "https://assets.epicurious.com/photos/555dfd44100d9bda6d821e58/6:4/w_274%2Ch_169/buns9x4.jpg",
        "color": 6244697
    }
}