{
    "recipe": {
        "title": "Hamburger Soup ",
        "ingredients": [
            "2 1/2 pounds ground chuck or other ground beef",
            "1 large yellow onion, diced",
            "2 celery stalks, diced",
            "3 garlic cloves, minced",
            "1 (14.5-ounce can) whole tomatoes",
            "1 yellow bell pepper, seeded and diced",
            "1 red bell pepper, seeded and diced",
            "1 green bell pepper, seeded and diced",
            "4 carrots, peeled and sliced on the diagonal",
            "5 large red potatoes, scrubbed and cut into 1-inch chunks",
            "3 cups beef broth, more as needed",
            "3 tablespoons tomato paste",
            "1/2 teaspoon kosher salt, more to taste",
            "1/2 teaspoon black pepper",
            "2 teaspoons dried parsley",
            "1/2 teaspoon ground oregano",
            "1/4 teaspoon cayenne pepper"
        ],
        "instructions": [
            "1. In a large pot, combine the meat, onion, celery, and garlic. Cook the mixture over medium-high heat until the meat is totally browned, then drain off and discard as much fat as you can. 2. Add the tomatoes and their juices, bell peppers, and carrots. Throw in the potatoes, beef stock, tomato paste, salt, black pepper, parsley, oregano, and cayenne. Stir everything together, then bring the mixture to a boil. 3. Reduce the heat, cover the pot, and simmer the soup for 15 to 20 minutes, or until the potatoes are tender but not overly mushy. If the soup is too thick for your taste, just splash in a cup or two of beef broth until it's the consistency you like. 4. Dish it up and serve it piping hot!",
            "1. In a large pot, combine the meat, onion, celery, and garlic. Cook the mixture over medium-high heat until the meat is totally browned, then drain off and discard as much fat as you can.",
            "2. Add the tomatoes and their juices, bell peppers, and carrots. Throw in the potatoes, beef stock, tomato paste, salt, black pepper, parsley, oregano, and cayenne. Stir everything together, then bring the mixture to a boil.",
            "3. Reduce the heat, cover the pot, and simmer the soup for 15 to 20 minutes, or until the potatoes are tender but not overly mushy. If the soup is too thick for your taste, just splash in a cup or two of beef broth until it's the consistency you like.",
            "4. Dish it up and serve it piping hot!",
            "Make Ahead: For some reason, this soup always seems to taste better the next day! Feel free to make this ahead of time and store it in the fridge for up to 3 days. If soup is overly thick when reheated, add a little extra beef broth or water to thin it to your liking.",
            "For some reason, this soup always seems to taste better the next day! Feel free to make this ahead of time and store it in the fridge for up to 3 days. If soup is overly thick when reheated, add a little extra beef broth or water to thin it to your liking."
        ],
        "picture_link": "https://assets.epicurious.com/photos/565dcfe6c904d73378b4d529/6:4/w_274%2Ch_169/Hamburger-Soup_6x4.jpg"
    }
}