{
    "recipe": {
        "title": "Hanger Steak With Tangy Tomato Relish ",
        "ingredients": [
            "1 1/4 pounds hanger steak (about 2 pieces), center membrane removed, or flank steak",
            "Fine sea salt and freshly ground black pepper, to taste",
            "2 teaspoons canola or vegetable oil",
            "Flaky sea salt (optional)",
            "Fresh flat-leaf parsley leaves, for garnish",
            "Tangy tomato relish, recipe follows",
            "2 14-ounce cans cherry tomatoes, drained, or three cups fresh",
            "2 tablespoons olive oil",
            "Fine sea salt and freshly ground black pepper to taste",
            "1 teaspoon yellow mustard seeds",
            "1 medium red onion, chopped",
            "2 garlic cloves, minced",
            "1/8 teaspoon red pepper flakes, such as Aleppo or Marash",
            "1 1/2 tablespoons fresh ginger, peeled and minced",
            "1/4 cup fresh orange juice",
            "1 tablespoon Worcestershire sauce"
        ],
        "instructions": [
            "Season the hanger steak with fine sea salt and pepper. Let steak sit at room temperature for at least 20 minutes before cooking.",
            "Heat the oil in a heavy 9-or 10-inch skillet over high heat. Working in batches if necessary, add the steak to the pan and cook, turning once, until browned on both sides and an instant-read thermometer registers 130˚F for medium-rare, 7 to 8 minutes total.",
            "Let the steak rest at least 10 minutes, then slice it on a diagonal. Season with flaky sea salt, if desired, and serve with parsley leaves and tomato relish.",
            "For the Tangy Tomato Relish Preheat the oven to 425˚F. Toss the tomatoes with 1 tablespoon of the olive oil and spread them in a single layer in a baking dish. Season with salt and black pepper to taste and roast until the tomatoes are crinkled and browned and any liquid in the pan is reduced, 18 to 20 minutes. Let cool. In a wide nonreactive saucepan, heat the remaining 1 tablespoon oil over medium- high heat. Add the mustard seeds and cook until they pop, about 30 seconds. Add the onion, garlic, red pepper flakes, ginger, and a pinch of salt. Cook, stirring frequently, until the onion has softened, about 3 minutes. Add the roasted tomatoes and stir to combine, but take care to keep the tomatoes intact. Add the orange juice and Worcestershire sauce. Cook, stirring gently, until the juices have thickened to a jammy consistency, about 5 minutes. Taste and season with salt and black pepper.",
            "Preheat the oven to 425˚F.",
            "Toss the tomatoes with 1 tablespoon of the olive oil and spread them in a single layer in a baking dish. Season with salt and black pepper to taste and roast until the tomatoes are crinkled and browned and any liquid in the pan is reduced, 18 to 20 minutes. Let cool.",
            "In a wide nonreactive saucepan, heat the remaining 1 tablespoon oil over medium- high heat. Add the mustard seeds and cook until they pop, about 30 seconds. Add the onion, garlic, red pepper flakes, ginger, and a pinch of salt. Cook, stirring frequently, until the onion has softened, about 3 minutes. Add the roasted tomatoes and stir to combine, but take care to keep the tomatoes intact. Add the orange juice and Worcestershire sauce. Cook, stirring gently, until the juices have thickened to a jammy consistency, about 5 minutes. Taste and season with salt and black pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56702e32864271d93196397f/6:4/w_274%2Ch_169/hanger-2.jpg"
    }
}