{
    "recipe": {
        "title": "Hanger Steak with Charred Scallion Sauce ",
        "ingredients": [
            "1/2 cup crushed or coarsely chopped walnuts",
            "1 small garlic clove",
            "9 Tbsp. extra-virgin olive oil, divided",
            "1 (1 1/2-lb.) hanger steak, cut into 4 pieces, center membrane removed",
            "Kosher salt, freshly ground pepper",
            "3/4 tsp. Aleppo-style pepper, plus more for serving",
            "12 scallions",
            "5 tsp. sherry vinegar or red wine vinegar",
            "1 Tbsp. chopped cornichons",
            "1 Tbsp. chopped drained capers",
            "1 Tbsp. whole grain mustard",
            "3/4 tsp. chopped thyme",
            "Pinch of sugar",
            "Flaky sea salt"
        ],
        "instructions": [
            "Preheat oven to 350°F. Toast walnuts on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes. Transfer to a medium bowl. Finely grate garlic over warm walnuts and toss with 6 Tbsp. oil.",
            "Heat a large cast-iron skillet over medium-high. Season steaks with kosher salt and black pepper; sprinkle all over with Aleppo-style pepper. Rub with 2 Tbsp. oil and cook, turning occasionally, until deeply browned and an instant-read thermometer inserted into the thickest part registers 130° for medium-rare, 10–12 minutes. Transfer steaks to a cutting board.",
            "Wipe out skillet and reduce heat to medium. Place scallions and 1 Tbsp. oil in skillet, season with kosher salt, and cook, turning occasionally, until softened and deeply charred, about 4 minutes. Transfer to cutting board; trim and cut into 1\" pieces. Add to bowl with walnut mixture along with vinegar, cornichons, capers, mustard, thyme, and sugar and toss to combine; season with kosher salt and black pepper.",
            "Slice steak against the grain and sprinkle with sea salt. Serve with scallion sauce and more Aleppo-style pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b16fb09bf24904d9ece7fbe/6:4/w_274%2Ch_169/hanger-steak-with-charred-scallion-sauce-recipe-BA-060518.jpg"
    }
}