{
    "recipe": {
        "title": "Hanger Steak with Spicy Lemon Couscous ",
        "ingredients": [
            "1 pound hanger or skirt steak",
            "Kosher salt, freshly ground pepper",
            "3 tablespoons olive oil, divided, plus more for drizzling",
            "2 garlic cloves, thinly sliced",
            "1/4 teaspoons crushed red pepper flakes",
            "4 small carrots, peeled, cut into 1/4\" slices",
            "1 small fennel bulb, cut into 1/4\" wedges",
            "1/4 lemon, ends trimmed, seeded, finely chopped (with skin)",
            "1 1/2 cups low-sodium chicken broth",
            "3/4 cup couscous",
            "1/2 cup green olives (such as Castelvetrano), pitted, halved",
            "1/4 cup sprigs cilantro"
        ],
        "instructions": [
            "Season steak with salt and pepper. Heat 1 tablespoon oil in a large skillet over medium-high heat. Cook steak until medium-rare, about 4 minutes per side (or 2 minutes per side if using skirt steak). Transfer steak to a plate. Wipe out skillet; add remaining 2 tablespoons oil and heat over medium-high heat. Add garlic and red pepper flakes and cook, stirring, until garlic begins to brown, about 1 minute. Add carrots, fennel, and lemon; season with salt and pepper. Cook, tossing occasionally, until vegetables are crisp-tender, about 4 minutes. Add broth to skillet and bring to a boil. Stir in couscous. Remove from heat; cover and let steam until tender, 5-8 minutes. Add olives, season with salt and pepper, and fluff couscous with a fork. Slice steak against the grain; fold into couscous. Divide lemon couscous among plates, drizzle with oil, and garnish with cilantro.",
            "Season steak with salt and pepper. Heat 1 tablespoon oil in a large skillet over medium-high heat. Cook steak until medium-rare, about 4 minutes per side (or 2 minutes per side if using skirt steak). Transfer steak to a plate.",
            "Wipe out skillet; add remaining 2 tablespoons oil and heat over medium-high heat. Add garlic and red pepper flakes and cook, stirring, until garlic begins to brown, about 1 minute. Add carrots, fennel, and lemon; season with salt and pepper. Cook, tossing occasionally, until vegetables are crisp-tender, about 4 minutes.",
            "Add broth to skillet and bring to a boil. Stir in couscous. Remove from heat; cover and let steam until tender, 5-8 minutes. Add olives, season with salt and pepper, and fluff couscous with a fork. Slice steak against the grain; fold into couscous. Divide lemon couscous among plates, drizzle with oil, and garnish with cilantro."
        ],
        "picture_link": null
    }
}