{
    "recipe": {
        "title": "Hannah's Pancakes ",
        "ingredients": [
            "2 1/4 cups all purpose flour",
            "2 teaspoons baking powder",
            "1 teaspoon salt",
            "2 cups whole milk",
            "4 large eggs, separated",
            "2 tablespoons (1/4 stick) or more unsalted butter, melted",
            "2 tablespoons sugar",
            "Additional melted butter",
            "Pure maple syrup"
        ],
        "instructions": [
            "Whisk flour, baking powder, and salt in large bowl to blend. Whisk milk and egg yolks in medium bowl to blend. Whisk milk mixture into dry ingredients. Add 2 tablespoons melted butter and whisk until batter is smooth. Beat egg whites in another medium bowl until soft peaks form. Gradually add sugar, beating until stiff but not dry. Fold whites into batter in 2 additions. Heat nonstick griddle or large nonstick skillet over medium heat. Brush generously with additional melted butter. For each pancake, fill 1/4 cup measuring cup half full and drop batter onto griddle. Cook pancakes until bottoms are brown, about 3 minutes. Using spatula, turn pancakes over and cook until bottoms are brown and pancakes are cooked through, about 2 minutes. Transfer to plates. Serve warm with syrup.",
            "Whisk flour, baking powder, and salt in large bowl to blend. Whisk milk and egg yolks in medium bowl to blend. Whisk milk mixture into dry ingredients. Add 2 tablespoons melted butter and whisk until batter is smooth.",
            "Beat egg whites in another medium bowl until soft peaks form. Gradually add sugar, beating until stiff but not dry. Fold whites into batter in 2 additions. Heat nonstick griddle or large nonstick skillet over medium heat. Brush generously with additional melted butter. For each pancake, fill 1/4 cup measuring cup half full and drop batter onto griddle. Cook pancakes until bottoms are brown, about 3 minutes. Using spatula, turn pancakes over and cook until bottoms are brown and pancakes are cooked through, about 2 minutes. Transfer to plates. Serve warm with syrup."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de5297b55306961bfd6b4/6:4/w_274%2Ch_169/231584.jpg"
    }
}