{
    "recipe": {
        "title": "Hard-Boiled Eggs Florentine ",
        "ingredients": [
            "2 (10-ounce) boxes frozen chopped spinach",
            "4 large eggs",
            "1 medium onion, chopped",
            "2 tablespoons olive oil",
            "1 1/4 cups half-and-half",
            "1 teaspoon chopped fresh thyme",
            "1/8 teaspoon freshly grated nutmeg",
            "3/4 teaspoon salt",
            "1/2 teaspoon coarsely ground black pepper"
        ],
        "instructions": [
            "Cook spinach according to package directions. Cover eggs with cold water by 1 inch in a 2-quart heavy saucepan and bring to a rolling boil, partially covered. Reduce heat to low and cook, covered, 30 seconds. Remove from heat and let stand, covered, 15 minutes. Transfer eggs with a slotted spoon to a bowl of ice and cold water and cool 1 minute. Peel eggs and quarter lengthwise. While eggs are standing, cook onion in oil in a 12-inch heavy skillet over moderately high heat, stirring occasionally, until softened and browned, about 8 minutes. Add half-and-half, thyme, and nutmeg and briskly simmer, stirring occasionally, until liquid is reduced by one third and slightly thickened, 2 to 3 minutes. Add spinach, salt, and pepper and simmer, stirring occasionally, until spinach is heated through, about 2 minutes. Transfer spinach mixture to a serving dish, then top with eggs and season with salt and pepper.",
            "Cook spinach according to package directions.",
            "Cover eggs with cold water by 1 inch in a 2-quart heavy saucepan and bring to a rolling boil, partially covered. Reduce heat to low and cook, covered, 30 seconds. Remove from heat and let stand, covered, 15 minutes. Transfer eggs with a slotted spoon to a bowl of ice and cold water and cool 1 minute. Peel eggs and quarter lengthwise.",
            "While eggs are standing, cook onion in oil in a 12-inch heavy skillet over moderately high heat, stirring occasionally, until softened and browned, about 8 minutes. Add half-and-half, thyme, and nutmeg and briskly simmer, stirring occasionally, until liquid is reduced by one third and slightly thickened, 2 to 3 minutes. Add spinach, salt, and pepper and simmer, stirring occasionally, until spinach is heated through, about 2 minutes.",
            "Transfer spinach mixture to a serving dish, then top with eggs and season with salt and pepper."
        ],
        "picture_link": null
    }
}