{
    "recipe": {
        "title": "Hard Cider Gravy ",
        "ingredients": [
            "10 tablespoons (1 1/4 sticks) unsalted butter, divided",
            "Neck and giblets from 1 turkey (optional)",
            "8 garlic cloves, peeled, crushed",
            "4 sprigs rosemary",
            "4 cups low-sodium chicken broth",
            "1/2 cup all-purpose flour",
            "2 cups hard cider",
            "1/4—1/2 cup roast turkey pan drippings (optional)",
            "Kosher salt, freshly ground pepper"
        ],
        "instructions": [
            "Heat 1 tablespoon butter in a medium saucepan over medium-high heat. Add turkey neck and giblets, if using, and cook, turning occasionally, until golden brown and browned bits form on bottom of saucepan, 5–8 minutes. Add garlic and rosemary, and cook, stirring, until fragrant, about 2 minutes. Add broth and bring to a boil; reduce heat and simmer until reduced to about 2 1/2 cups, 20–25 minutes. Strain stock through a fine-mesh sieve into a large measuring cup or medium bowl; discard solids. Cover and keep stock warm. Heat remaining 9 tablespoons butter in another medium saucepan over medium heat. Add flour and cook, whisking constantly, until flour is a deep golden brown, 8–10 minutes. Gradually whisk in warm stock. Add cider and pan drippings and bring to a boil. Reduce heat and simmer until flavors meld and gravy is thickened, 25–30 minutes; season with salt and pepper.",
            "Heat 1 tablespoon butter in a medium saucepan over medium-high heat. Add turkey neck and giblets, if using, and cook, turning occasionally, until golden brown and browned bits form on bottom of saucepan, 5–8 minutes. Add garlic and rosemary, and cook, stirring, until fragrant, about 2 minutes.",
            "Add broth and bring to a boil; reduce heat and simmer until reduced to about 2 1/2 cups, 20–25 minutes. Strain stock through a fine-mesh sieve into a large measuring cup or medium bowl; discard solids. Cover and keep stock warm.",
            "Heat remaining 9 tablespoons butter in another medium saucepan over medium heat. Add flour and cook, whisking constantly, until flour is a deep golden brown, 8–10 minutes. Gradually whisk in warm stock. Add cider and pan drippings and bring to a boil. Reduce heat and simmer until flavors meld and gravy is thickened, 25–30 minutes; season with salt and pepper."
        ],
        "picture_link": null
    }
}