{
    "recipe": {
        "title": "Harissa-Crusted Tri-Tip Roast ",
        "ingredients": [
            "1 3/4 teaspoons caraway seeds",
            "1/4 cup extra-virgin olive oil",
            "6 garlic cloves",
            "1/4 cup chili paste (such as sambal oelek)*",
            "2 tablespoons tomato sauce",
            "1 1/2 teaspoons ground cumin",
            "1 1/4 teaspoons chili powder",
            "1 1 3/4- to 2-pound tri-tip beef roast, most of fat layer trimmed"
        ],
        "instructions": [
            "Preheat oven to 400°F. Toast caraway seeds in small nonstick skillet over medium heat until seeds darken and begin to smoke, stirring often, about 5 minutes. Add olive oil and garlic cloves to caraway seeds in skillet. Cover; remove from heat. Let stand 1 minute. Pour caraway mixture into processor. Add chili paste, tomato sauce, cumin, and chili powder and blend until garlic cloves are pureed. Season harissa to taste with salt. Sprinkle beef all over with salt and pepper; place beef, fat side down, on rack on rimmed baking sheet. Spread with half of harissa. Turn beef over; spread remaining harissa over top and sides. Roast beef until thermometer inserted into center registers 125°F to 130°F for medium-rare, about 35 minutes. Let rest 10 minutes. Slice and serve.",
            "Preheat oven to 400°F. Toast caraway seeds in small nonstick skillet over medium heat until seeds darken and begin to smoke, stirring often, about 5 minutes. Add olive oil and garlic cloves to caraway seeds in skillet. Cover; remove from heat. Let stand 1 minute. Pour caraway mixture into processor. Add chili paste, tomato sauce, cumin, and chili powder and blend until garlic cloves are pureed. Season harissa to taste with salt.",
            "Sprinkle beef all over with salt and pepper; place beef, fat side down, on rack on rimmed baking sheet. Spread with half of harissa. Turn beef over; spread remaining harissa over top and sides. Roast beef until thermometer inserted into center registers 125°F to 130°F for medium-rare, about 35 minutes. Let rest 10 minutes. Slice and serve.",
            "*Available in the Asian foods section of most supermarkets and at Asian markets.",
            "*Available in the Asian foods section of most supermarkets and at Asian markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd768f3a00aeb2f1d279e/6:4/w_274%2Ch_169/235155.jpg"
    }
}