{
    "recipe": {
        "title": "Hazelnut-Crusted Chicken with Raspberry Sauce ",
        "ingredients": [
            "3/4 cup lightly packed fresh raspberries (about 3 1/2 ounces)",
            "3 tablespoons white wine vinegar",
            "1 tablespoon sugar",
            "1/2 cup safflower oil",
            "3 to 6 teaspoons water (optional)",
            "1 cup chopped hazelnuts (about 4 1/2 ounces)",
            "3/4 cup panko (Japanese breadcrumbs) or plain dried breadcrumbs",
            "1 tablespoon plus 1 teaspoon coarse kosher salt",
            "3 teaspoons coarsely ground black pepper, divided",
            "1/3 cup honey mustard",
            "1/3 cup finely chopped fresh mint leaves",
            "1/4 cup mayonnaise",
            "1 tablespoon Dijon mustard",
            "4 large skinless boneless chicken breast halves, butterflied",
            "4 tablespoons (1/2 stick) unsalted butter",
            "3 tablespoons peanut oil",
            "4 cups baby salad greens",
            "1/2 cup fresh raspberries"
        ],
        "instructions": [
            "For raspberry sauce: Puree raspberries, white wine vinegar, and sugar in blender until smooth. With blender running, gradually add safflower oil. Add water by teaspoonfuls as needed to thin to desired consistency. Season raspberry sauce to taste with salt and pepper.",
            "Puree raspberries, white wine vinegar, and sugar in blender until smooth. With blender running, gradually add safflower oil. Add water by teaspoonfuls as needed to thin to desired consistency. Season raspberry sauce to taste with salt and pepper.",
            "For chicken: Preheat oven to 375°F. Mix hazelnuts, panko, 1 tablespoon coarse salt, and 2 teaspoons pepper in shallow bowl. Mix honey mustard, mint leaves, mayonnaise, Dijon mustard, remaining 1 teaspoon coarse salt, and remaining 1 teaspoon pepper in bowl. Add chicken; coat. Dip chicken pieces, 1 at a time, into crumb-nut mixture, coating both sides and pressing to adhere. Transfer coated chicken pieces to baking sheet. Divide equal amounts of butter and peanut oil between 2 large nonstick skillets; heat over medium-high heat. Add 2 chicken pieces to each skillet; reduce heat to medium and cook until chicken is light brown, about 4 minutes per side. Place chicken on rimmed baking sheet; transfer to oven. Roast chicken until cooked through, about 15 minutes.",
            "Preheat oven to 375°F. Mix hazelnuts, panko, 1 tablespoon coarse salt, and 2 teaspoons pepper in shallow bowl.",
            "Mix honey mustard, mint leaves, mayonnaise, Dijon mustard, remaining 1 teaspoon coarse salt, and remaining 1 teaspoon pepper in bowl. Add chicken; coat.",
            "Dip chicken pieces, 1 at a time, into crumb-nut mixture, coating both sides and pressing to adhere. Transfer coated chicken pieces to baking sheet.",
            "Divide equal amounts of butter and peanut oil between 2 large nonstick skillets; heat over medium-high heat. Add 2 chicken pieces to each skillet; reduce heat to medium and cook until chicken is light brown, about 4 minutes per side. Place chicken on rimmed baking sheet; transfer to oven. Roast chicken until cooked through, about 15 minutes.",
            "Divide salad greens among 4 plates; top with chicken. Garnish with fresh raspberries and serve raspberry sauce alongside.",
            "Divide salad greens among 4 plates; top with chicken. Garnish with fresh raspberries and serve raspberry sauce alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d789bf3a00aeb2f1cb5d0/6:4/w_274%2Ch_169/242700_hires.jpg"
    }
}