{
    "recipe": {
        "title": "Hazelnut Cookies ",
        "ingredients": [
            "1/2 cup hazelnuts (2 oz)",
            "1/4 cup plus 3 tablespoons sugar",
            "3/4 cup plus 2 tablespoons all-purpose flour",
            "1 stick (1/2 cup) cold unsalted butter, cut into small pieces"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 350°F. Toast hazelnuts in a shallow baking pan until fragrant and skins begin to loosen, about 6 minutes. Rub nuts in a kitchen towel to remove any loose skins (some skins may not come off) and cool to room temperature. Pulse nuts and 1/4 cup sugar in a food processor until nuts are finely ground, then add flour and a pinch of salt, pulsing until combined. Add butter and pulse until dough just forms a ball. Divide dough in half, then roll dough on a work surface lightly dusted with sugar and flour into 2 (11-inch-long) logs (each about 1 inch wide). Chill, wrapped in plastic wrap, 1 hour. Cut logs crosswise into 1/2-inch slices and arrange rounds 2 inches apart on 2 baking sheets. Bake, 1 sheet at a time, until bottom edges just begin to turn pale golden, 12 to 15 minutes. Cool cookies on sheet 2 minutes. Place remaining 3 tablespoons sugar in a small dish and dip tops of cookies in it, then cool sugared cookies on a rack.",
            "Put oven rack in middle position and preheat oven to 350°F.",
            "Toast hazelnuts in a shallow baking pan until fragrant and skins begin to loosen, about 6 minutes. Rub nuts in a kitchen towel to remove any loose skins (some skins may not come off) and cool to room temperature.",
            "Pulse nuts and 1/4 cup sugar in a food processor until nuts are finely ground, then add flour and a pinch of salt, pulsing until combined. Add butter and pulse until dough just forms a ball. Divide dough in half, then roll dough on a work surface lightly dusted with sugar and flour into 2 (11-inch-long) logs (each about 1 inch wide). Chill, wrapped in plastic wrap, 1 hour.",
            "Cut logs crosswise into 1/2-inch slices and arrange rounds 2 inches apart on 2 baking sheets.",
            "Bake, 1 sheet at a time, until bottom edges just begin to turn pale golden, 12 to 15 minutes. Cool cookies on sheet 2 minutes. Place remaining 3 tablespoons sugar in a small dish and dip tops of cookies in it, then cool sugared cookies on a rack."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df22cf9a84192308a8536/6:4/w_274%2Ch_169/109469.jpg"
    }
}