{
    "recipe": {
        "title": "Hazelnut Gelato Profiteroles with Warm Kahlua Sauce ",
        "ingredients": [
            "1 cup hazelnuts, toasted, husked",
            "1 quart half and half",
            "3/4 cup sugar",
            "3 large egg yolks",
            "1 1/2 teaspoons vanilla extract",
            "1 cup half and half",
            "3/4 cup sugar",
            "2 tablespoons (1/4 stick) unsalted butter",
            "1 1/4 pounds bittersweet (not unsweetened) or semisweet chocolate, chopped",
            "1/4 cup Kahlúa",
            "1 teaspoon vanilla extract",
            "1 cup whole milk",
            "1/2 cup (1 stick) unsalted butter, cut into 1/2-inch cubes",
            "1/2 teaspoon salt",
            "1 1/4 cups all purpose flour",
            "5 large eggs"
        ],
        "instructions": [
            "For gelato: Finely grind hazelnuts in processor. Bring half and half to simmer in large saucepan. Whisk sugar and egg yolks in large bowl to blend. Gradually whisk hot half and half into sugar mixture; return to saucepan. Stir over medium heat until custard thickens slightly, about 3 minutes (do not let mixture boil). Strain into large bowl. Stir in hazelnuts and vanilla extract. Refrigerate custard until cold, about 4 hours. Transfer custard to ice cream maker and process according to manufacturer's instructions. Transfer custard to container; cover and freeze.",
            "Finely grind hazelnuts in processor. Bring half and half to simmer in large saucepan. Whisk sugar and egg yolks in large bowl to blend. Gradually whisk hot half and half into sugar mixture; return to saucepan. Stir over medium heat until custard thickens slightly, about 3 minutes (do not let mixture boil). Strain into large bowl. Stir in hazelnuts and vanilla extract. Refrigerate custard until cold, about 4 hours. Transfer custard to ice cream maker and process according to manufacturer's instructions. Transfer custard to container; cover and freeze.",
            "For kahlúa sauce: Bring half and half, sugar, and butter to simmer in heavy medium saucepan, stirring until sugar dissolves. Remove from heat; add chocolate and whisk until melted and smooth. Stir in Kahlúa and vanilla. (Can be made 1 day ahead. Cool completely, cover, and refrigerate. Rewarm before serving.)",
            "Bring half and half, sugar, and butter to simmer in heavy medium saucepan, stirring until sugar dissolves. Remove from heat; add chocolate and whisk until melted and smooth. Stir in Kahlúa and vanilla. (Can be made 1 day ahead. Cool completely, cover, and refrigerate. Rewarm before serving.)",
            "For cream puffs: Preheat oven to 425°F. Bring milk, butter, and salt to boil in heavy medium saucepan. Remove from heat. Stir in flour. Cook over medium heat until mixture is smooth, pulls away from sides of pan, and forms ball, constantly stirring vigorously, about 1 1/2 minutes. Remove from heat. Using electric mixer, mix dough on low speed until dough cools slightly but is still very warm. Beat in eggs 1 at a time on medium speed, blending well after each addition. Line 2 large baking sheets with parchment. Drop walnut-size pieces of dough onto sheets. Bake until puffed and beginning to brown, about 15 minutes. Reduce oven temperature to 375°F; continue baking until puffs are brown and very crisp, about 10 minutes. Cool on sheets.",
            "Preheat oven to 425°F. Bring milk, butter, and salt to boil in heavy medium saucepan. Remove from heat. Stir in flour. Cook over medium heat until mixture is smooth, pulls away from sides of pan, and forms ball, constantly stirring vigorously, about 1 1/2 minutes. Remove from heat. Using electric mixer, mix dough on low speed until dough cools slightly but is still very warm. Beat in eggs 1 at a time on medium speed, blending well after each addition.",
            "Line 2 large baking sheets with parchment. Drop walnut-size pieces of dough onto sheets. Bake until puffed and beginning to brown, about 15 minutes. Reduce oven temperature to 375°F; continue baking until puffs are brown and very crisp, about 10 minutes. Cool on sheets.",
            "Cut 36 cream puffs in half horizontally. Place scoop of gelato in each cream puff. (Can be made 1 day ahead. Cover and freeze.) Divide profiteroles among plates. Drizzle with warm sauce.",
            "Cut 36 cream puffs in half horizontally. Place scoop of gelato in each cream puff. (Can be made 1 day ahead. Cover and freeze.) Divide profiteroles among plates. Drizzle with warm sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df2a37b55306961bfe1ed/6:4/w_274%2Ch_169/230665.jpg"
    }
}