{
    "recipe": {
        "title": "Heirloom Tomato Salad with Pickled Fennel ",
        "ingredients": [
            "1 whole star anise pod",
            "1 teaspoon aniseed",
            "1 teaspoon coriander seeds",
            "1 teaspoon fennel seeds",
            "1/4 teaspoon cumin seeds",
            "1/4 lemongrass stalk, tough outer layer removed, crushed",
            "Zest of 1/4 orange, removed with a vegetable peeler",
            "1 medium fennel bulb, cored, thinly sliced",
            "1 1/2 cups unseasoned rice vinegar",
            "1/2 cup sugar",
            "2 tablespoons kosher salt",
            "2 pounds large heirloom tomatoes (about 3), cut into wedges",
            "1 cup cherry tomatoes, preferably heirloom, halved",
            "2 tablespoons white balsamic or Sherry vinegar",
            "7 tablespoons extra-virgin olive oil, divided",
            "Kosher salt, freshly ground pepper",
            "2 Cubanelle peppers or Anaheim chiles, sliced into 3/4\" rings, seeded",
            "Fennel fronds (for serving)",
            "Cheesecloth"
        ],
        "instructions": [
            "For pickled fennel: Toast star anise, aniseed, coriander seeds, fennel seeds, and cumin seeds in a small skillet over medium-low heat, stirring often, until fragrant, about 3 minutes. Bundle toasted spices, lemongrass, and orange zest in a piece of cheesecloth and tie with kitchen twine to make a sachet. Place sachet and fennel in a 1-quart jar or bowl. Bring vinegar, sugar, salt, and 1/2 cup water to a boil in a medium saucepan, stirring to dissolve sugar and salt. Pour vinegar mixture over sachet and fennel and let cool; discard sachet. Cover fennel and chill at least 12 hours. DO AHEAD: Pickled fennel can be made 2 weeks ahead. Keep chilled.",
            "Toast star anise, aniseed, coriander seeds, fennel seeds, and cumin seeds in a small skillet over medium-low heat, stirring often, until fragrant, about 3 minutes. Bundle toasted spices, lemongrass, and orange zest in a piece of cheesecloth and tie with kitchen twine to make a sachet. Place sachet and fennel in a 1-quart jar or bowl.",
            "Bring vinegar, sugar, salt, and 1/2 cup water to a boil in a medium saucepan, stirring to dissolve sugar and salt. Pour vinegar mixture over sachet and fennel and let cool; discard sachet. Cover fennel and chill at least 12 hours.",
            "DO AHEAD: Pickled fennel can be made 2 weeks ahead. Keep chilled.",
            "For assembly: Combine large and cherry tomatoes, vinegar, and 6 tablespoons oil in a medium bowl; season with salt and pepper. Let sit at room temperature 30 minutes. Before serving, heat remaining 1 tablespoon oil in a medium skillet over high heat. Cook Cubanelle peppers, tossing often, until charred in spots, about 4 minutes. Serve tomato salad topped with peppers, pickled fennel, and fennel fronds.",
            "Combine large and cherry tomatoes, vinegar, and 6 tablespoons oil in a medium bowl; season with salt and pepper. Let sit at room temperature 30 minutes.",
            "Before serving, heat remaining 1 tablespoon oil in a medium skillet over high heat. Cook Cubanelle peppers, tossing often, until charred in spots, about 4 minutes.",
            "Serve tomato salad topped with peppers, pickled fennel, and fennel fronds."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54af4c5bc4a891cc44ccd8af/6:4/w_274%2Ch_169/51179150_tomato-fennel-salad_1x1.jpg"
    }
}