{
    "recipe": {
        "title": "Heirloom Squash Farrotto ",
        "ingredients": [
            "1 tablespoon cumin seeds",
            "1 cup plain whole-milk yogurt",
            "2 1/2 tablespoons (or more) fresh lemon juice, divided",
            "3 garlic cloves; 1 minced, 2 thinly sliced",
            "Nonstick vegetable oil spray",
            "4 cups 1/2-inch cubes peeled butternut squash",
            "4 tablespoons olive oil, divided",
            "2 cups semi-pearled farro",
            "2 tablespoons chopped Fresno chile or red jalapeño chile with seeds, divided",
            "3/4 cup 1/2-inch cubes red onion plus 1/4 cup thinly sliced",
            "1 15-ounce can garbanzo beans (chickpeas), drained",
            "1/2 cup fresh cilantro leaves",
            "Extra-virgin olive oil",
            "Ingredient info: Farro is available at specialty foods stores, natural foods stores, and Italian markets. Semi-pearled farro, or farro perlato, cooks faster. It can also be found online at gustiamo.com."
        ],
        "instructions": [
            "Toast cumin seeds in small skillet over medium heat until fragrant and beginning to smoke, 4 to 5 minutes. Cool; grind in spice grinder. Transfer 1 1/2 teaspoons cumin to small bowl. Mix in yogurt, 1 tablespoon lemon juice, and minced garlic. Season with salt and pepper. Cover and chill.",
            "Preheat oven to 400°F. Coat large rimmed baking sheet with nonstick spray. Place squash in large bowl. Add 2 tablespoons oil; toss to coat. Spread squash out on sheet. Sprinkle with salt and pepper. Roast until tender, about 25 minutes.",
            "Meanwhile, cook farro in large pot of boiling salted water until tender, 18 to 20 minutes. Drain farro and cool.",
            "Heat remaining 2 tablespoons oil in heavy large skillet over medium-high heat. Add sliced garlic and 1 tablespoon chile; sauté 1 minute. Add onion cubes and garbanzo beans; sauté 1 minute. Add roasted squash and cooked farro and toss to blend. Sprinkle with 1 1/2 teaspoons ground cumin and 1 1/2 tablespoons lemon juice; toss to blend. Season to taste with salt, pepper, and more lemon juice, if desired.",
            "Mound farro mixture on 4 plates. Spoon yogurt mixture over. Sprinkle with cilantro, sliced onion, and remaining chile. Drizzle with extra-virgin olive oil and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b31dca3edeef84363bc1e0/6:4/w_274%2Ch_169/361297_squash-farrotto_1x1.jpg",
        "color": 9480228
    }
}