{
    "recipe": {
        "title": "Herb and Garlic Baked Camembert ",
        "ingredients": [
            "1 [8-to-9-ounce (225-to-255-gram)] wheel Camembert",
            "1 tablespoon (15 ml) olive oil",
            "1 teaspoon minced fresh thyme leaves",
            "1 teaspoon minced fresh rosemary leaves",
            "1/4 teaspoon kosher salt",
            "1/4 teaspoon ground black pepper",
            "1 large garlic clove, sliced very thin",
            "Crackers, preferably long enough to dip with, for serving"
        ],
        "instructions": [
            "The oven to 350°F.",
            "Assemble: Most Camembert comes in a little wooden crate. If yours does, remove the crate lid and any packaging or wrappers around the cheese, and place it back inside the basket. Yes, it is safe to bake it right in there for the short time that this recipe calls for. If you're nervous about leakage, you can wrap the Camembert in foil or line the basket with parchment paper as a layer of protection. Place the cheese in the wooden crate on a baking tray. With a thin sharp knife, make gridlike cuts in the cheese, 3 or 4 in each direction, about 1 inch apart and going about 1 inch deep into the cheese but without cutting through the bottom rind. Use your knife tip to \"open\" each cut and your fingers to press a little sliver of garlic into each cut. Combine the olive oil with the thyme, rosemary, salt, and pepper in a small dish. Spread thickly on top of the cheese.",
            "Most Camembert comes in a little wooden crate. If yours does, remove the crate lid and any packaging or wrappers around the cheese, and place it back inside the basket. Yes, it is safe to bake it right in there for the short time that this recipe calls for. If you're nervous about leakage, you can wrap the Camembert in foil or line the basket with parchment paper as a layer of protection. Place the cheese in the wooden crate on a baking tray.",
            "With a thin sharp knife, make gridlike cuts in the cheese, 3 or 4 in each direction, about 1 inch apart and going about 1 inch deep into the cheese but without cutting through the bottom rind. Use your knife tip to \"open\" each cut and your fingers to press a little sliver of garlic into each cut. Combine the olive oil with the thyme, rosemary, salt, and pepper in a small dish. Spread thickly on top of the cheese.",
            "Bake: For 15 to 20 minutes, until the cheese is loose inside the rind. Serve immediately with crackers.",
            "For 15 to 20 minutes, until the cheese is loose inside the rind. Serve immediately with crackers."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59e4d2f4d0d0fa3a0951d642/6:4/w_274%2Ch_169/herb-and-garlic-baked-camembert-recipe-101617.jpg"
    }
}