{
    "recipe": {
        "title": "Herb-Rubbed Cast-Iron Chicken with Pan Sauce ",
        "ingredients": [
            "1 cup parsley leaves with tender stems",
            "1 Tbsp. rosemary leaves",
            "1 Tbsp. oregano leaves",
            "2 garlic cloves, smashed",
            "1/4 cup extra-virgin olive oil",
            "1 (3 1/2–4-lb.) chicken, split in half through breastbone, backbone and wing tips removed",
            "Kosher salt, freshly ground pepper",
            "2 Tbsp. vegetable oil",
            "1 Tbsp. fresh lemon juice"
        ],
        "instructions": [
            "Finely chop parsley, rosemary, oregano, and garlic in a food processor. With the motor running, stream in olive oil and process until a coarse paste forms. Season chicken with salt and pepper and rub flesh side with herb purée. Place, skin side up, on a rimmed baking sheet. Chill, uncovered, at least 3 hours and up to 1 day.",
            "Let sit at room temperature 1 hour before roasting. Place a rack in lower third of oven and set a large cast-iron skillet on rack; preheat oven to 450°F. Wrap the bottom of a medium cast-iron skillet in foil; set aside. As soon as oven is heated, carefully transfer skillet to stove and set over medium heat. Add vegetable oil. Once it begins to smoke, arrange both chicken halves skin side down with breasts touching in center and legs facing out. Place foil-wrapped skillet on top to weigh down. Cook, moving top skillet around to press on chicken in different spots, and shifting bottom skillet around burner every few minutes, until skin is deeply golden brown, 8–10 minutes.",
            "Position top skillet on chicken legs, transfer to oven, and roast 7 minutes. Slide top skillet over so that weight is on breasts and continue to roast until an instant-read thermometer inserted into the thickest part of legs registers 165°F, 7–9 minutes longer. Remove top skillet and spoon off all but 1 Tbsp. fat from skillet with chicken; discard. Add lemon juice and 3/4 cup water. Let sit off heat 2 minutes. Transfer chicken to a platter; let rest while you make the sauce.",
            "Bring liquid to a simmer over medium-high heat, stirring and scraping up browned bits; cook until an emulsified glossy sauce forms, 5–7 minutes. Season with salt. Pour sauce around chicken."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ba00b28b1754b7eaace5134/6:4/w_274%2Ch_169/herb-rubbed-cast-iron-chicken-with-pan-sauce-recipe-BA-091718.jpg"
    }
}