{
    "recipe": {
        "title": "Herb-Crusted Cauliflower Steaks with Beans and Tomatoes ",
        "ingredients": [
            "1 large head of cauliflower (about 2 pounds)",
            "1/2 cup olive oil, divided",
            "2 teaspoons kosher salt, divided",
            "1 teaspoon freshly ground black pepper, divided",
            "8 ounces green beans, trimmed",
            "3 garlic cloves, finely chopped",
            "3/4 teaspoon finely grated lemon zest",
            "1/3 cup chopped parsley, plus more for serving",
            "1/3 cup panko (Japanese breadcrumbs)",
            "1/4 cup freshly grated Parmesan",
            "1 (15-ounce) can white beans, rinsed, drained",
            "1 cup golden or red cherry tomatoes (about 6 ounces), halved",
            "3 tablespoons mayonnaise",
            "1 teaspoon Dijon mustard"
        ],
        "instructions": [
            "Arrange racks in middle and upper third of oven; preheat to 425°F. Remove leaves and trim stem end of cauliflower, leaving core intact. Place cauliflower core side down on a work surface. Using a large knife, slice in the center from top to bottom to yield 2 (1\") \"steaks\"; reserve remaining cauliflower for another use.",
            "Place cauliflower on a rimmed baking sheet. Brush both sides with 1 Tbsp. oil; season with 1/4 tsp. salt and 1/4 tsp. pepper. Roast on middle rack, turning halfway through, until cauliflower is tender and browned, about 30 minutes.",
            "Meanwhile, toss green beans with 1 Tbsp. oil, 1/2 tsp. salt, and 1/4 tsp. pepper on another rimmed baking sheet. Arrange in a single layer, then roast in upper third of oven until green beans begin to blister, about 15 minutes.",
            "Whisk garlic, lemon zest, 1/3 cup parsley, and remaining 6 Tbsp. oil, 1 1/4 tsp. salt, and 1/2 tsp. pepper in a medium bowl until smooth. Transfer half of mixture to another medium bowl. Add panko and Parmesan to first bowl and mix with your hands. Add white beans and tomatoes to second bowl and toss to coat. Whisk mayonnaise and mustard in a small bowl.",
            "Remove sheets from oven. Spread mayonnaise mixture over cauliflower. Sprinkle 1/4 cup panko mixture evenly over cauliflower. Add white bean mixture to sheet with green beans and toss to combine. Return sheets to oven and continue to roast until white beans begin to crisp and panko topping starts to brown, 5–7 minutes more.",
            "Divide cauliflower, green beans, white beans, and tomatoes among plates. Top with parsley."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58debd832e454164a736277f/6:4/w_274%2Ch_169/Sheet-Pan-Herb-Crusted-Cauliflower-Steaks-with-White-Beans-and-Green-Beans-23032017.jpg",
        "color": 16484225
    }
}