{
    "recipe": {
        "title": "Herbed Fish Cakes with Green Horseradish Sauce ",
        "ingredients": [
            "1 3/4 to 2 pounds skinless striped bass fillets, cut into 2-inch pieces",
            "1 cup (generous) minced red onion",
            "1/2 cup chopped fresh Italian parsley",
            "1/2 cup chopped fresh cilantro",
            "3 1/2 tablespoons extra-virgin olive oil plus more for frying",
            "1 1/2 teaspoons coarse kosher salt",
            "3/4 teaspoon coarsely ground black pepper",
            "Green Horseradish Sauce"
        ],
        "instructions": [
            "Line rimmed baking sheet with plastic wrap. Using/on off turns, finely chop 1/2 of fish in processor (do not puree to paste); transfer to bowl. Repeat with remaining fish. Mix in onion, parsley, cilantro, 3 1/2 tablespoons oil, salt, and pepper. Using wet hands and generous 1/4 cupful for each, shape mixture into 3x2x1/2-inch cakes. Arrange on prepared baking sheet. (Can be made 1 day ahead. Cover and chill.) Heat 1 tablespoon oil in large skillet over medium heat. Working in batches, sauté cakes until opaque in center, adding more oil to skillet by tablespoonfuls as needed, about 4 minutes per side. Transfer to platter. Serve warm or at room temperature with horseradish sauce.",
            "Line rimmed baking sheet with plastic wrap. Using/on off turns, finely chop 1/2 of fish in processor (do not puree to paste); transfer to bowl. Repeat with remaining fish. Mix in onion, parsley, cilantro, 3 1/2 tablespoons oil, salt, and pepper. Using wet hands and generous 1/4 cupful for each, shape mixture into 3x2x1/2-inch cakes. Arrange on prepared baking sheet. (Can be made 1 day ahead. Cover and chill.)",
            "Heat 1 tablespoon oil in large skillet over medium heat. Working in batches, sauté cakes until opaque in center, adding more oil to skillet by tablespoonfuls as needed, about 4 minutes per side. Transfer to platter. Serve warm or at room temperature with horseradish sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd734f3a00aeb2f1d26f6/6:4/w_274%2Ch_169/234403.jpg"
    }
}