{
    "recipe": {
        "title": "Herb-Rubbed Top Sirloin Steak with Peperonata ",
        "ingredients": [
            "3 tablespoons extra-virgin olive oil",
            "2 small red onions (about 12 ounces total), halved, sliced crosswise",
            "2 pounds mixed red and yellow bell peppers (about 4 large), cut lengthwise into 1/2-inch-wide strips",
            "1/4 teaspoon dried crushed red pepper",
            "Coarse kosher salt",
            "3 tablespoons red wine vinegar",
            "2 tablespoons salt-packed capers, rinsed, drained, or 2 tablespoons capers in brine, drained",
            "1 tablespoon chopped fresh oregano",
            "1 tablespoon chopped fresh thyme",
            "1 tablespoon chopped fresh oregano",
            "1 tablespoon chopped fresh thyme",
            "1 tablespoon freshly cracked black pepper",
            "1 1/2 teaspoons coarse kosher salt",
            "1 (3- to 3 1/4 -pound) top sirloin steak, 2 to 2 1/2 inches thick",
            "Extra-virgin olive oil (for drizzling)"
        ],
        "instructions": [
            "For peperonata: Heat olive oil in heavy large pot over medium heat. Add onions; sauté until almost tender, about 6 minutes. Mix in bell peppers and crushed red pepper; sprinkle lightly with coarse kosher salt. Reduce heat to low, cover, and cook until peppers are tender and silky, stirring occasionally, about 35 minutes. Stir in red wine vinegar, capers, oregano, and thyme. Increase heat to medium; stir uncovered 3 minutes. Season peperonata to taste with coarse salt and pepper. Transfer peperonata to bowl and cool to room temperature. DO AHEAD Can be made 3 days ahead. Cover and refrigerate. Bring to room temperature before serving.",
            "Heat olive oil in heavy large pot over medium heat. Add onions; sauté until almost tender, about 6 minutes. Mix in bell peppers and crushed red pepper; sprinkle lightly with coarse kosher salt. Reduce heat to low, cover, and cook until peppers are tender and silky, stirring occasionally, about 35 minutes. Stir in red wine vinegar, capers, oregano, and thyme. Increase heat to medium; stir uncovered 3 minutes. Season peperonata to taste with coarse salt and pepper. Transfer peperonata to bowl and cool to room temperature. DO AHEAD Can be made 3 days ahead. Cover and refrigerate. Bring to room temperature before serving.",
            "For steak: Mix oregano, thyme, pepper, and salt in small bowl. Sprinkle evenly over both sides of steak. Place on large plate; cover and refrigerate at least 4 hours and up to 6 hours. Let stand at room temperature 1 hour before grilling. Prepare barbecue (medium-high heat). Drizzle both sides of steak lightly with olive oil. Grill steak to desired doneness, about 15 minutes per side for medium-rare, or 17 minutes per side for medium. Transfer steak to cutting board; let rest 5 minutes. Cut steak crosswise into 1/4 - to 1/3 -inch-thick slices. Arrange steak slices on platter; surround with peperonata and serve.",
            "Mix oregano, thyme, pepper, and salt in small bowl. Sprinkle evenly over both sides of steak. Place on large plate; cover and refrigerate at least 4 hours and up to 6 hours. Let stand at room temperature 1 hour before grilling. Prepare barbecue (medium-high heat). Drizzle both sides of steak lightly with olive oil. Grill steak to desired doneness, about 15 minutes per side for medium-rare, or 17 minutes per side for medium. Transfer steak to cutting board; let rest 5 minutes. Cut steak crosswise into 1/4 - to 1/3 -inch-thick slices.",
            "Arrange steak slices on platter; surround with peperonata and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d99ec7b55306961bf7759/6:4/w_274%2Ch_169/239060.jpg"
    }
}