{
    "recipe": {
        "title": "Here Comes the Sun Breakfast Bowl ",
        "ingredients": [
            "2 small sweet potatoes",
            "1 tablespoon extra virgin olive oil",
            "1/2 cup uncooked farro, wild rice, or freekeh (whole or cracked)",
            "1 cup water",
            "1 tablespoon extra virgin olive oil",
            "Maldon sea salt",
            "1 cup chopped kale",
            "1 tablespoon extra virgin olive oil",
            "1 cup organic plain whole-milk kefir",
            "1 tablespoon chopped fresh flat-leaf parsley",
            "1/2 cup extra virgin olive oil",
            "2 tablespoons lemon juice or sherry vinegar",
            "4 large brown eggs",
            "1 tablespoon extra virgin olive oil",
            "1 (16-ounce) can black beans, drained",
            "1/2 cup diced Heirloom tomatoes (red, yellow, green), plus extra for garnish"
        ],
        "instructions": [
            "Preheat the oven to 450°F.",
            "Rub the sweet potatoes with 1 tablespoon of the olive oil, then wrap them in foil and roast until a small knife easily pierces the sweet potato, about 20 minutes. When cool enough to handle, cut them into 1/2-inch-thick slices",
            "For the farro, wild rice, or freekeh: In a rice cooker: Combine your chosen grain with the water, 1 tablespoon of the olive oil, and 1 pinch of the sea salt. Cook according to the rice cooker instructions. On the stovetop: In a saucepan, combine your chosen grain with the water, 1 tablespoon the olive oil, and 1 pinch of the salt and bring to a soft boil. Reduce to a simmer, cover, and cook over low heat until done, about 45 minutes for farro, wild rice and whole freekeh; 20 minutes for cracked freekeh.",
            "In a rice cooker: Combine your chosen grain with the water, 1 tablespoon of the olive oil, and 1 pinch of the sea salt. Cook according to the rice cooker instructions.",
            "On the stovetop: In a saucepan, combine your chosen grain with the water, 1 tablespoon the olive oil, and 1 pinch of the salt and bring to a soft boil. Reduce to a simmer, cover, and cook over low heat until done, about 45 minutes for farro, wild rice and whole freekeh; 20 minutes for cracked freekeh.",
            "For the kale: While the grains and sweet potatoes are cooking: In a medium sauté pan, heat 1 tablespoon of the olive oil over medium-high heat. Add the kale and sauté until soft, 3 to 4 minutes. (Add a small amount of water if the kale begins to stick or turn too brown.) Season with a pinch of salt and set aside.",
            "While the grains and sweet potatoes are cooking: In a medium sauté pan, heat 1 tablespoon of the olive oil over medium-high heat. Add the kale and sauté until soft, 3 to 4 minutes. (Add a small amount of water if the kale begins to stick or turn too brown.) Season with a pinch of salt and set aside.",
            "For the dressing: In a bowl, whisk together the kefir, parsley, 1/2 cup olive oil, a pinch of salt, and the lemon juice. Set aside.",
            "In a bowl, whisk together the kefir, parsley, 1/2 cup olive oil, a pinch of salt, and the lemon juice. Set aside.",
            "For the sunny-side up eggs: In the same pan as the kale, cook the eggs in the remaining 1 tablespoon olive oil to sunny-side up perfection, seasoning with sea salt toward the end.",
            "In the same pan as the kale, cook the eggs in the remaining 1 tablespoon olive oil to sunny-side up perfection, seasoning with sea salt toward the end.",
            "To plate: Place the sautéed kale in a wide, deep bowl. Sprinkle with black beans, cooked grains, tomatoes, and sweet potato. Drizzle with the dressing, then slide the eggs on top before enjoying.",
            "Place the sautéed kale in a wide, deep bowl. Sprinkle with black beans, cooked grains, tomatoes, and sweet potato. Drizzle with the dressing, then slide the eggs on top before enjoying."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aba904e6705e4552ff9112e/6:4/w_274%2Ch_169/breakfast-bowl-recipe-HC-032718.jpg"
    }
}