{
    "recipe": {
        "title": "Het Paa Naam Tok (Isaan-style Forest Mushroom Salad) ",
        "ingredients": [
            "A charcoal grill (highly recommended), grates oiled",
            "10 ounces meaty mixed mushrooms (such as oyster, king oyster, cremini, and/or wild mushrooms), tough stems trimmed and any large mushrooms halved through the stem (trimmings reserved; see NOTE)",
            "A generous drizzle of vegetable oil",
            "Kosher salt and freshly ground black pepper",
            "1 1/2 tablespoons lime juice (preferably from Key limes or spiked with a small squeeze of Meyer lemon juice)",
            "1 1/2 tablespoons Thai thin soy sauce",
            "1 tablespoon mushroom stock (purchased or homemade; see NOTE) or water",
            "1 teaspoon granulated sugar",
            "1 teaspoon Phrik Phon Khua (Toasted-chile powder)",
            "14 grams thinly sliced lemongrass (tender parts only), from about 2 large stalks (about 2 tablespoons)",
            "1 ounce peeled small shallots, preferably Asian, or very small red onions, halved lengthwise and thinly sliced with the grain (about 1/4 cup, lightly packed)",
            "1/4 cup coarsely chopped mint leaves (the smaller the better), lightly packed",
            "1/4 cup coarsely chopped cilantro (thin stems and leaves), lightly packed",
            "1 heaping teaspoon Khao Khua (Toasted-sticky rice powder) , plus a few pinches for finishing"
        ],
        "instructions": [
            "Prepare a grill, preferably charcoal, to cook with medium heat. Or preheat a grill pan or heavy skillet over medium heat.",
            "Toss the mushrooms in a bowl along with just enough oil to lightly coat them. Season generously with salt and pepper and toss again. Grill the mushrooms, turning them over occasionally, until they're cooked through and deep golden brown in spots, 5 to 10 minutes, depending on the size of the mushrooms, transferring them as they're cooked to a cutting board. Cut any large mushrooms into bite-size slices, about 1/2 inch thick. Leave any small mushrooms whole. You should have about 1 cup of chopped, cooked mushrooms. Let them cool slightly as you make the dressing.",
            "MAKE THE DRESSING Combine the lime juice, soy sauce, mushroom stock, sugar, chile powder, and lemongrass in a wok or medium pan, set it over medium heat, and heat the mixture just until it's warm to the touch, 15 seconds or so. Turn off the heat.",
            "Combine the lime juice, soy sauce, mushroom stock, sugar, chile powder, and lemongrass in a wok or medium pan, set it over medium heat, and heat the mixture just until it's warm to the touch, 15 seconds or so. Turn off the heat.",
            "ASSEMBLE THE SALAD Add the mushrooms to the pan along with the shallots, mint, cilantro, and rice powder, toss well, and transfer to a plate in a low heap so that most of the herbs end up near the top. Sprinkle on another pinch or two of rice powder, and serve.",
            "Add the mushrooms to the pan along with the shallots, mint, cilantro, and rice powder, toss well, and transfer to a plate in a low heap so that most of the herbs end up near the top. Sprinkle on another pinch or two of rice powder, and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54acbf0b6529d92b2c03f218/6:4/w_274%2Ch_169/51211430_mushroom-salad_1x1.jpg",
        "color": 771964
    }
}