{
    "recipe": {
        "title": "Hoisin-Marinated Filets Mignons with Nectarine Salsa ",
        "ingredients": [
            "1 scallion",
            "1/4 cup hoisin sauce",
            "1 1/2 tablespoons soy sauce (preferably Kikkoman)",
            "2 teaspoons grated peeled fresh gingerroot",
            "1 teaspoon Worcestershire sauce",
            "four 1 1/4-inch-thick filets mignons (tenderloin steaks)",
            "1 large firm-ripe nectarine",
            "1/2 green bell pepper",
            "2 medium tomatoes",
            "4 scallions",
            "2 garlic cloves",
            "1 small fresh chile (preferably habanero)",
            "2 tablespoons fresh lime juice, or to taste"
        ],
        "instructions": [
            "Finely chop scallion and in a bowl whisk together with remaining marinade ingredients.",
            "In a large heavy-duty sealable plastic bag combine marinade and steaks, turning steaks to coat with marinade, and seal bag, pressing out excess air. Marinate steaks at room temperature 1 hour.",
            "Make salsa while steaks are marinating: Finely chop nectarine and bell pepper. Seed and finely chop tomatoes. Thinly slice white and pale-green parts of scallions and mince garlic. Wearing protective gloves, discard seeds and ribs from chile and finely chop chile. In a bowl stir together all salsa ingredients and season with salt and pepper. Prepare grill. Remove steaks from marinade, discarding it, and grill steaks on an oiled rack set 5 to 6 inches over glowing coals, 3 to 4 minutes on each side for medium-rare. (Alternatively, grill steaks in a hot lightly oiled well-seasoned ridged grill pan over moderately high heat.) Transfer steaks with tongs to a platter and let stand 5 minutes. Serve steaks with salsa.",
            "Finely chop nectarine and bell pepper. Seed and finely chop tomatoes. Thinly slice white and pale-green parts of scallions and mince garlic. Wearing protective gloves, discard seeds and ribs from chile and finely chop chile. In a bowl stir together all salsa ingredients and season with salt and pepper.",
            "Prepare grill.",
            "Remove steaks from marinade, discarding it, and grill steaks on an oiled rack set 5 to 6 inches over glowing coals, 3 to 4 minutes on each side for medium-rare. (Alternatively, grill steaks in a hot lightly oiled well-seasoned ridged grill pan over moderately high heat.) Transfer steaks with tongs to a platter and let stand 5 minutes.",
            "Serve steaks with salsa."
        ],
        "picture_link": null
    }
}