{
    "recipe": {
        "title": "Hoisin-Glazed Pork Chops ",
        "ingredients": [
            "2 tablespoons vegetable oil",
            "3 garlic cloves, finely chopped",
            "1/3 cup soy sauce",
            "3 tablespoons honey",
            "2 tablespoons distilled white vinegar",
            "2 tablespoons tahini",
            "2 teaspoons Sriracha",
            "Kosher salt, freshly ground pepper",
            "2 (1 1/2-inch-thick) bone-in pork rib chops (about 1 pound each), patted dry"
        ],
        "instructions": [
            "Heat oil in a medium saucepan over medium. Cook garlic, stirring often, until golden brown, about 2 minutes. Add soy sauce, honey, vinegar, tahini, and Sriracha and whisk until smooth. Cook, whisking occasionally, until mixture is thick and smooth, about 5 minutes. Season hoisin sauce with salt and pepper; let cool.",
            "Season pork chops all over with salt and pepper. Place in a large resealable plastic bag and add half of hoisin sauce (reserve remaining sauce). Seal bag, pressing out air, and turn to coat pork. Chill at least 30 minutes. Set remaining sauce aside.",
            "Preheat a large skillet, preferably cast iron, or grill pan over medium. Remove pork from bag, shaking off excess marinade. Cook pork chops until bottom side is golden brown, about 1 minute. Turn and cook on other side about 1 minute, then turn again. Continue to cook, turning about every minute, until chops are deep golden brown and charred in spots and an instant-read thermometer inserted into the thickest part registers 135°F, 15–18 minutes (cooking time will depend on thickness of chops). Transfer to a cutting board and let rest at least 10 minutes (pork will come to 145°F as it sits). Serve with reserved hoisin sauce spooned over.",
            "Do Ahead Hoisin sauce can be made 4 days ahead; cover and chill. Thin with water if needed before using. Pork can be marinated 1 day ahead; keep chilled.",
            "Hoisin sauce can be made 4 days ahead; cover and chill. Thin with water if needed before using. Pork can be marinated 1 day ahead; keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56e0538ab6dcf82a5d27d24a/6:4/w_274%2Ch_169/0316-BA-MFEF-02.jpg"
    }
}