{
    "recipe": {
        "title": "Homemade Baked Tofu ",
        "ingredients": [
            "One (14- to 16- ounce) tub firm or extra- firm tofu (see Note)",
            "1/4 cup reduced-sodium natural soy sauce",
            "1/4 cup white wine, cooking sherry, vegetable broth, or water",
            "1 tablespoon dark sesame oil",
            "1 tablespoon agave nectar or other liquid sweetener",
            "2 tablespoons rice vinegar or white wine vinegar",
            "1 to 2 cloves garlic, crushed or minced (optional)",
            "1 teaspoon grated fresh or jarred ginger, or more to taste",
            "Fresh or dried thyme leaves (either regular or lemon thyme) or fresh or dried oregano leaves to taste (optional)"
        ],
        "instructions": [
            "Drain the tofu and cut into 8 slabs crosswise. Blot well between paper towels or clean kitchen towels (or use a tofu press). Cut each slab into strips. Combine the remaining ingredients in a small bowl and whisk together. Arrange the tofu slices in a single layer in a shallow container or baking dish and pour enough marinade over them to cover. Let stand for an hour or two—the longer the better. Shortly before you’d like to bake the tofu, preheat the oven to 400°F. If this is the only thing you’re making, use a toaster oven—it’s the perfect size. Remove the tofu slices from the marinade and transfer to a parchment-lined baking pan in a single layer. If you’re using the full-size oven, roast some veggies at the same time (I like to use the excess marinade to roast eggplant or green beans). Bake for 20 minutes, then turn the strips and bake for 15 to 20 minutes longer, or until the tofu is firm and starting to turn light brown along the edges.",
            "Drain the tofu and cut into 8 slabs crosswise. Blot well between paper towels or clean kitchen towels (or use a tofu press). Cut each slab into strips.",
            "Combine the remaining ingredients in a small bowl and whisk together. Arrange the tofu slices in a single layer in a shallow container or baking dish and pour enough marinade over them to cover. Let stand for an hour or two—the longer the better.",
            "Shortly before you’d like to bake the tofu, preheat the oven to 400°F. If this is the only thing you’re making, use a toaster oven—it’s the perfect size. Remove the tofu slices from the marinade and transfer to a parchment-lined baking pan in a single layer. If you’re using the full-size oven, roast some veggies at the same time (I like to use the excess marinade to roast eggplant or green beans).",
            "Bake for 20 minutes, then turn the strips and bake for 15 to 20 minutes longer, or until the tofu is firm and starting to turn light brown along the edges.",
            "Variations: Add 1 teaspoon liquid smoke (or more to taste) to the marinade for a subtle smoky flavor. Instead of baking, cook these tofu slices on a grill. About 5 minutes per side should do—make sure there are nice grill marks on each side.",
            "Add 1 teaspoon liquid smoke (or more to taste) to the marinade for a subtle smoky flavor.",
            "Instead of baking, cook these tofu slices on a grill. About 5 minutes per side should do—make sure there are nice grill marks on each side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/595eb4403f47b04a2c78ecb6/6:4/w_274%2Ch_169/baked-tofu-070617.jpg"
    }
}