{
    "recipe": {
        "title": "Honey-Garlic Noodles ",
        "ingredients": [
            "1/3 cup soy sauce",
            "1/2 cup mirin",
            "1 tablespoon toasted sesame oil",
            "4 garlic cloves, minced",
            "1 or 2 fresh bird’s-eye chiles, finely diced",
            "1 tablespoon honey",
            "12 ounces thin egg noodles",
            "2 tablespoons sunflower or vegetable oil",
            "1 tablespoon minced fresh ginger",
            "6 scallions, thinly sliced",
            "2 limes: 1 halved, 1 cut into wedges for serving",
            "1 tablespoon sesame seeds",
            "Fresh cilantro or your favorite spicy herbs, for serving"
        ],
        "instructions": [
            "In a small bowl, combine the sauce ingredients. Stir and set aside.",
            "Make the noodles and friends: Bring a large pot of salted water to a boil and cook the noodles according to the package directions. When 1 minute of cooking time remains and the noodles are softened but firm, drain. In a wok, heat the sunflower oil over medium-high heat. When the oil is hot, add the noodles and ginger and stir-fry for 2 minutes, keeping the noodles moving the entire time. Pour in the sauce and cook for 1 minute, tossing to ensure that the noodles are completely coated. Turn off the heat. Toss in the scallions, squeeze the juice of the halved lime on top, and sprinkle on the sesame seeds. Give everything a good toss to mix and combine. Serve with the lime wedges and fresh cilantro or spicy greens.",
            "Bring a large pot of salted water to a boil and cook the noodles according to the package directions. When 1 minute of cooking time remains and the noodles are softened but firm, drain.",
            "In a wok, heat the sunflower oil over medium-high heat. When the oil is hot, add the noodles and ginger and stir-fry for 2 minutes, keeping the noodles moving the entire time.",
            "Pour in the sauce and cook for 1 minute, tossing to ensure that the noodles are completely coated. Turn off the heat.",
            "Toss in the scallions, squeeze the juice of the halved lime on top, and sprinkle on the sesame seeds. Give everything a good toss to mix and combine.",
            "Serve with the lime wedges and fresh cilantro or spicy greens."
        ],
        "picture_link": "https://assets.epicurious.com/photos/593598ef28c138793bdd962b/6:4/w_274%2Ch_169/honey-garlic-noodles-HC-060517.jpg"
    }
}