{
    "recipe": {
        "title": "Honey Cake ",
        "ingredients": [
            "2 1/2 cups all-purpose flour",
            "2 teaspoons baking powder",
            "1/2 teaspoon baking soda",
            "1/2 teaspoon salt",
            "2 teaspoons cinnamon",
            "1/4 teaspoon ground ginger",
            "1/4 teaspoon ground clove",
            "3 large eggs",
            "1 cup sugar",
            "1 1/4 cups vegetable oil",
            "1 cup pure honey",
            "3/4 cup lukewarm coffee (brewed, or instant dissolved in water)",
            "1 1/2 teaspoons packed grated orange zest",
            "1/4 cup plus 2 tablespoons well-stirred canned unsweetened coconut milk (not light)",
            "2 teaspoons light corn syrup",
            "4 ounces bittersweet (60% cacao) chocolate, finely chopped",
            "Flaky sea salt, such as Maldon (optional)",
            "a 10-inch Bundt pan; nonstick baking spray (shake well first; see Cooks' Notes); cake tester or wooden skewer for testing cake doneness"
        ],
        "instructions": [
            "Heat oven to 350°F with rack in middle. Generously spray pan, including center tube, with baking spray.",
            "Whisk together flour, baking powder and soda, salt, and spices in a large bowl.",
            "Whisk eggs well in another large bowl and whisk in sugar, oil, honey, coffee, and zest until well combined.",
            "Make a well in the center of the flour mixture and add the honey mixture, then stir with the whisk until the batter is smooth.",
            "Pour batter into pan (it's liquid enough to level itself in the pan), and bake in oven until springy to the touch and a cake tester comes out clean, 45 to 50 minutes.",
            "Let cake cool in the pan on a rack for 20 minutes.",
            "Loosen cake from the pan with a thin rubber spatula, then invert cake onto the rack (see Cooks' Notes) and cool completely.",
            "For glaze: Bring coconut milk and corn syrup to a simmer in a small heavy pan, stirring until combined. Remove pan from heat and add chocolate. Let chocolate stand 1 minute, then stir until chocolate is melted and glaze is smooth. Let glaze stand, stirring occasionally, until thickened slightly, but still pourable. Transfer cake to a cake plate and slowly pour the chocolate glaze over the top of the cake, letting it drip down the sides. If desired, let the cake stand at room temperature until glaze is set. Just before serving, sprinkle glaze lightly with flaky sea salt, if using.",
            "Bring coconut milk and corn syrup to a simmer in a small heavy pan, stirring until combined.",
            "Remove pan from heat and add chocolate. Let chocolate stand 1 minute, then stir until chocolate is melted and glaze is smooth.",
            "Let glaze stand, stirring occasionally, until thickened slightly, but still pourable.",
            "Transfer cake to a cake plate and slowly pour the chocolate glaze over the top of the cake, letting it drip down the sides. If desired, let the cake stand at room temperature until glaze is set.",
            "Just before serving, sprinkle glaze lightly with flaky sea salt, if using."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b2a35111c5d6af478b14f7/6:4/w_274%2Ch_169/367189_honey-cake_1x1.jpg"
    }
}