{
    "recipe": {
        "title": "Honeycomb ",
        "ingredients": [
            "1 1/3 cups superfine sugar",
            "1/2 cup corn syrup",
            "Pinch of cream of tartar",
            "1 teaspoon white wine vinegar",
            "1 1/2 teaspoons baking soda",
            "5 1/2 oz (150g) dark or milk chocolate"
        ],
        "instructions": [
            "Line a 8in. square baking pan with lightly oiled foil. Half fill the sink with cold water and have ready a whisk and the baking soda. Place the sugar, syrup, cream of tartar, and vinegar into a medium-size, solid-based saucepan. Add 5 tablespoons water and set the saucepan over medium heat. Stir until the sugar has dissolved, then bring the mixture to a boil. Continue to cook until the mixture turns amber-colored and reaches \"hard crack\" stage, or 300°F (154°C) on a candy thermometer. As soon as the caramel reaches the right temperature, remove the saucepan from the heat and plunge into the sink of cold water to speed up the cooling process. Working quickly, pour the baking soda into the caramel and whisk to combine evenly; the mixture will foam up like a mini volcano. Pour into the prepared pan in an even layer and let cool. Melt the chocolate in a bowl set over a saucepan of barely simmering water and stir until smooth. Remove from the heat and cool slightly. Turn the honeycomb out of the pan, peel off the foil, and break into chunks. Half dip each piece into the melted chocolate. Let harden before packaging.",
            "Line a 8in. square baking pan with lightly oiled foil. Half fill the sink with cold water and have ready a whisk and the baking soda.",
            "Place the sugar, syrup, cream of tartar, and vinegar into a medium-size, solid-based saucepan. Add 5 tablespoons water and set the saucepan over medium heat. Stir until the sugar has dissolved, then bring the mixture to a boil. Continue to cook until the mixture turns amber-colored and reaches \"hard crack\" stage, or 300°F (154°C) on a candy thermometer.",
            "As soon as the caramel reaches the right temperature, remove the saucepan from the heat and plunge into the sink of cold water to speed up the cooling process. Working quickly, pour the baking soda into the caramel and whisk to combine evenly; the mixture will foam up like a mini volcano. Pour into the prepared pan in an even layer and let cool.",
            "Melt the chocolate in a bowl set over a saucepan of barely simmering water and stir until smooth. Remove from the heat and cool slightly. Turn the honeycomb out of the pan, peel off the foil, and break into chunks. Half dip each piece into the melted chocolate. Let harden before packaging."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55f1d914cf90d6663f728bf2/6:4/w_274%2Ch_169/367810_hires.jpg"
    }
}