{
    "recipe": {
        "title": "Honey-Glazed Roasted Carrots and Parsnips ",
        "ingredients": [
            "2 pounds carrots (1 to 1 1/2 inches in diameter), peeled, halved lengthwise",
            "2 pounds parsnips (1 to 1 1/2 inches in diameter), peeled, halved lengthwise",
            "6 tablespoons olive oil",
            "1 1/2 tablespoons butter",
            "1 1/2 tablespoons honey",
            "1 teaspoon balsamic vinegar"
        ],
        "instructions": [
            "Position 1 rack in center and 1 rack in bottom third of oven and preheat to 400°F. Line 2 rimmed baking sheets with foil. Divide carrots and parsnips between prepared sheets. Sprinkle generously with salt and pepper, then drizzle 3 tablespoons oil over vegetables on each sheet; toss to coat. Roast vegetables 10 minutes; stir. Roast vegetables 10 minutes longer, stir, and reverse sheets. Continue roasting until vegetables are tender and slightly charred, about 15 minutes longer. (Can be prepared 2 hours ahead. Tent with foil and let stand at room temperature. Rewarm uncovered in 350°F oven 10 minutes.) Melt butter in heavy small saucepan over medium heat. Stir in honey and vinegar. Drizzle honey glaze over vegetables and serve.",
            "Position 1 rack in center and 1 rack in bottom third of oven and preheat to 400°F. Line 2 rimmed baking sheets with foil. Divide carrots and parsnips between prepared sheets. Sprinkle generously with salt and pepper, then drizzle 3 tablespoons oil over vegetables on each sheet; toss to coat.",
            "Roast vegetables 10 minutes; stir. Roast vegetables 10 minutes longer, stir, and reverse sheets. Continue roasting until vegetables are tender and slightly charred, about 15 minutes longer. (Can be prepared 2 hours ahead. Tent with foil and let stand at room temperature. Rewarm uncovered in 350°F oven 10 minutes.)",
            "Melt butter in heavy small saucepan over medium heat. Stir in honey and vinegar. Drizzle honey glaze over vegetables and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/578e761795824bf90525e56d/6:4/w_274%2Ch_169/honey-glazed-roasted-carrots-and-parsnips.jpg"
    }
}