{
    "recipe": {
        "title": "Honey-Sriracha Chicken Skewers ",
        "ingredients": [
            "3 tablespoons rice vinegar",
            "2 tablespoons sriracha",
            "1 tablespoon honey",
            "1 teaspoon Dijon mustard",
            "4 boneless, skinless chicken thighs",
            "1/2 teaspoon paprika",
            "1/2 teaspoon granulated garlic",
            "1/2 teaspoon granulated onion",
            "1/2 teaspoon sea salt",
            "1 tablespoon olive oil",
            "1/4 cup crumbled blue cheese",
            "Handful of fresh flat-leaf parsley, chopped",
            "Skewers (if wooden, soak for 20 minutes before grilling)"
        ],
        "instructions": [
            "CLEAN and oil the grill grates (I like to use the end of a cut onion dipped in olive oil to oil my grates) and preheat the grill to high. IN a liquid measuring cup or small bowl, whisk together the vinegar, sriracha, honey, and mustard until smooth. Set aside. CUT the chicken thighs into small square pieces, 6 to 8 pieces per thigh. Put the chicken in a large bowl and season it with the paprika, granulated garlic, granulated onion, and salt. Add the oil and mix to coat the chicken. Divide the chicken among the skewers. GRILL the skewers until thoroughly cooked and slightly charred, 5 to 7 minutes on each side, lightly brushing the sauce over the skewers as they cook. PLATE the skewers and top with blue cheese and parsley.",
            "CLEAN and oil the grill grates (I like to use the end of a cut onion dipped in olive oil to oil my grates) and preheat the grill to high.",
            "IN a liquid measuring cup or small bowl, whisk together the vinegar, sriracha, honey, and mustard until smooth. Set aside.",
            "CUT the chicken thighs into small square pieces, 6 to 8 pieces per thigh. Put the chicken in a large bowl and season it with the paprika, granulated garlic, granulated onion, and salt. Add the oil and mix to coat the chicken. Divide the chicken among the skewers.",
            "GRILL the skewers until thoroughly cooked and slightly charred, 5 to 7 minutes on each side, lightly brushing the sauce over the skewers as they cook.",
            "PLATE the skewers and top with blue cheese and parsley."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ae38af046a4784fa17cec17/6:4/w_274%2Ch_169/honey-srirach-grilled-chicken-skewers-recipe-HC-042718.jpg"
    }
}