{
    "recipe": {
        "title": "Honey Brioche ",
        "ingredients": [
            "1/3 cup whole milk, lukewarm",
            "1 package (about 2 teaspoons) active dry yeast or instant yeast",
            "1 tablespoon mild, fragrant honey, such as lavender",
            "1 large egg, free-range and organic, lightly beaten",
            "2 cups unbleached, all-purpose flour",
            "1/3 cup mild, fragrant honey, such as lavender",
            "1 teaspoon fine sea salt",
            "4 large eggs, free-range and organic, lightly beaten",
            "1 1/2 cups unbleached, all-purpose flour",
            "3/4 cup unsalted butter, at room temperature",
            "1 large egg, free-range and organic, lightly beaten"
        ],
        "instructions": [
            "In the bowl of the heavy-duty mixer, combine the milk, yeast (see note if using instant yeast), and honey and stir to blend. Let stand until foamy, about 5 minutes. Add the egg and half the flour and stir to blend. The sponge will be soft and sticky. Sprinkle with the remaining flour, to cover the sponge dough, but don’t mix it in. Set aside to rest, uncovered, for 30 minutes. The sponge should erupt slightly, cracking the layer of flour. This indicates that the yeast is live and doing its job.",
            "Prepare the dough Add the honey, salt, eggs, and flour to the sponge. Mix at low speed just until the ingredients come together, about 1 minute. Increase the mixer speed to medium and beat for 5 minutes. When the butter is incorporated, it should be the same consistency as the dough. To prepare the butter, place it on a flat work surface, and with the pastry scraper, smear it bit by bit across the surface. (If you do not have a pastry scraper, use the back of a large metal spoon.) When it is ready, the butter should be smooth, soft, but still cool—not warm, oily, or greasy. With the mixer on medium-low speed, add the butter a few tablespoons at a time. When all the butter has been added, increase the mixer speed to medium-high for 1 minute, then reduce the speed to medium and continue to beat for 5 minutes more. The dough will be soft and pliable but shouldn’t stick to your hands.",
            "Add the honey, salt, eggs, and flour to the sponge. Mix at low speed just until the ingredients come together, about 1 minute. Increase the mixer speed to medium and beat for 5 minutes.",
            "When the butter is incorporated, it should be the same consistency as the dough. To prepare the butter, place it on a flat work surface, and with the pastry scraper, smear it bit by bit across the surface. (If you do not have a pastry scraper, use the back of a large metal spoon.) When it is ready, the butter should be smooth, soft, but still cool—not warm, oily, or greasy.",
            "With the mixer on medium-low speed, add the butter a few tablespoons at a time. When all the butter has been added, increase the mixer speed to medium-high for 1 minute, then reduce the speed to medium and continue to beat for 5 minutes more. The dough will be soft and pliable but shouldn’t stick to your hands.",
            "First rise Cover the bowl tightly with plastic wrap. Let the dough rise at room temperature until doubled in bulk, about 2 hours.",
            "Cover the bowl tightly with plastic wrap. Let the dough rise at room temperature until doubled in bulk, about 2 hours.",
            "Chilling and second rise Punch down the dough. Cover the bowl tightly with plastic wrap and refrigerate the dough overnight, or for at least 4 hours, during which time it should double in size again.",
            "Punch down the dough. Cover the bowl tightly with plastic wrap and refrigerate the dough overnight, or for at least 4 hours, during which time it should double in size again.",
            "Form the brioche Divide the dough into 12 equal pieces, each weighing about 2 1/2 ounces. Roll each piece of dough tightly into a ball and place 6 pieces in each bread pan, staggering them in two rows of 3; there will be some space left at either end of the loaf but it will fill up when the dough rises again. Cover the pans with a clean cloth and let the dough rise at room temperature until doubled in bulk, 1 to 1 1/2 hours. Center a rack in the oven. Preheat the oven to 375°F. Lightly brush the dough with the beaten egg. Working quickly, using the tip of a pair of sharp scissors, snip a cross on the top of each ball of dough; this will help the brioche rise evenly as it bakes. Bake until the loaves are puffed and deeply golden, 30 to 35 minutes. Place the pans on the baking rack to cool. Turn the loaves out after they have cooled.",
            "Divide the dough into 12 equal pieces, each weighing about 2 1/2 ounces. Roll each piece of dough tightly into a ball and place 6 pieces in each bread pan, staggering them in two rows of 3; there will be some space left at either end of the loaf but it will fill up when the dough rises again. Cover the pans with a clean cloth and let the dough rise at room temperature until doubled in bulk, 1 to 1 1/2 hours.",
            "Center a rack in the oven. Preheat the oven to 375°F.",
            "Lightly brush the dough with the beaten egg. Working quickly, using the tip of a pair of sharp scissors, snip a cross on the top of each ball of dough; this will help the brioche rise evenly as it bakes. Bake until the loaves are puffed and deeply golden, 30 to 35 minutes. Place the pans on the baking rack to cool. Turn the loaves out after they have cooled.",
            "Notes When using instant yeast, there is no need to let the yeast proof in warm milk; it can be added directly to the flour. Don’t omit the milk, however, as this will change the balance of liquid to dry ingredients in the recipe. Instant yeast and active dry yeast can be used interchangeably in the same quantities. Honey both enriches the flavor of this brioche and helps keep it moist. Top quality honey makes all the difference here. The brioche is best eaten the day it is baked, although it can be tightly wrapped and stored for a day or two or frozen for up to 1 month. Thaw, still wrapped, at room temperature.",
            "When using instant yeast, there is no need to let the yeast proof in warm milk; it can be added directly to the flour. Don’t omit the milk, however, as this will change the balance of liquid to dry ingredients in the recipe. Instant yeast and active dry yeast can be used interchangeably in the same quantities.",
            "Honey both enriches the flavor of this brioche and helps keep it moist. Top quality honey makes all the difference here.",
            "The brioche is best eaten the day it is baked, although it can be tightly wrapped and stored for a day or two or frozen for up to 1 month. Thaw, still wrapped, at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59824aa047c7920fc5163b5c/6:4/w_274%2Ch_169/honey-brioche-recipe-HC-080217.jpg"
    }
}