{
    "recipe": {
        "title": "Horseradish Soup ",
        "ingredients": [
            "5 tablespoons butter",
            "1/4 cup fresh white breadcrumbs",
            "1/4 cup minced shallots",
            "6 cups (or more) canned vegetable broth",
            "1 pound russet potatoes, peeled, cut into 1/2-inch cubes",
            "8 ounces fresh horseradish, peeled, finely grated (about 1 1/4 cups)",
            "2 tablespoons olive oil",
            "4 ounces pumpernickel bread slices, cut into small cubes",
            "4 ounces smoked turkey, cut into small cubes"
        ],
        "instructions": [
            "Melt butter in heavy large saucepan over medium-high heat. Add breadcrumbs and shallots and sauté 1 minute (do not brown). Add 6 cups broth, potatoes and horseradish are very tender, about 1 hour. Puree soup in batches in blender. Return soup to saucepan. Season to taste with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate.) Heat oil in heavy large skillet over medium-high heat. Add bread crumbs and turkey; sauté until bread is crisp and turkey is heated through, about 5 minutes. Bring soup to simmer, thinning with more vegetable broth if necessary. Ladle soup into bowls. Top with turkey and bread cubes.",
            "Melt butter in heavy large saucepan over medium-high heat. Add breadcrumbs and shallots and sauté 1 minute (do not brown). Add 6 cups broth, potatoes and horseradish are very tender, about 1 hour. Puree soup in batches in blender. Return soup to saucepan. Season to taste with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate.)",
            "Heat oil in heavy large skillet over medium-high heat. Add bread crumbs and turkey; sauté until bread is crisp and turkey is heated through, about 5 minutes.",
            "Bring soup to simmer, thinning with more vegetable broth if necessary. Ladle soup into bowls. Top with turkey and bread cubes."
        ],
        "picture_link": null
    }
}