{
    "recipe": {
        "title": "Hot Cross Buns ",
        "ingredients": [
            "2 cups (8.8 ounces/250g) white bread flour, plus extra for dusting",
            "2 cups (8.8 ounces/250g) all-purpose white flour",
            "1/2 cup warm water",
            "1/2 cup warm milk",
            "1 1/2 teaspoons (0.18 ounce/5g) instant yeast",
            "2/3 cup (3.5 ounces/100g) raisins, currants, or golden raisins (or a mixture)",
            "Finely grated zest of 1/2 orange",
            "1/4 heaping teaspoon each of cinnamon, nutmeg, and allspice",
            "2 teaspoons (0.35 ounce/10g) fine salt",
            "3 1/2 tablespoons (1.8 ounces/50g) superfine sugar",
            "1 medium free-range egg",
            "3 1/2 tablespoons (1.8 ounces/50g) butter",
            "6 tablespoons (1.8 ounces/50g) all-purpose white flour",
            "7 tablespoons water",
            "1 tablespoon apricot (or other) jam, sieved",
            "1 tablespoon water"
        ],
        "instructions": [
            "If you have a stand mixer, combine the flours, water, milk, yeast, salt, and sugar in the bowl and fit the dough hook. Add the egg and butter and mix to a sticky dough.",
            "Add the dried fruit, orange zest, and spices and knead on low speed until silky and smooth. (You can do this by hand, but it will be sticky to handle.) Cover the dough and let rise in a warm place for about 1 hour, until doubled in size.",
            "Deflate the risen dough and divide into 8 equal pieces. Shape into rounds and dust with flour. Place on a floured board, cover with plastic wrap or linen, and let proof for about 30 minutes, until roughly doubled in size.",
            "Preheat the oven to 400°F. To make the crosses, whisk together the flour and water until smooth, then transfer to a pastry bag and snip off the end to make a fine hole (or use a plastic food bag with a corner snipped off, as I do). Transfer the risen buns to a baking sheet and pipe a cross on top of each one, then bake for 15 to 20 minutes.",
            "Meanwhile, melt the jam with the water in a pan. Brush over the buns to glaze as you take them from the oven. Transfer to a wire rack to cool. Serve warm, cold, or toasted."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58d007bf4dd825764b291e39/6:4/w_274%2Ch_169/hot-cross-buns-032017.jpg"
    }
}