{
    "recipe": {
        "title": "Huachinango a la Veracruzana (Veracruz-Style Red Snapper) ",
        "ingredients": [
            "6 pounds whole gutted red snapper or 8 (7-ounce) fillets",
            "1 teaspoon kosher salt, plus more to taste",
            "1 teaspoon freshly ground black pepper",
            "1/2 cup freshly squeezed lime juice",
            "1/2 cup olive oil",
            "2 medium onions, diced",
            "6 cloves garlic, minced",
            "6 pounds Roma tomatoes, diced",
            "1 cup green Manzanilla olives, pitted",
            "1/2 cup Spanish capers",
            "1/2 cup black raisins",
            "1 teaspoon jalapeño chiles en escabèche, sliced (canned pickled jalapeños)",
            "4 dried bay leaves",
            "1/2 pound new potatoes, peeled, blanched, and sliced",
            "1/4 cup coarsely chopped fresh flat-leaf parsley",
            "Arroz Blanco"
        ],
        "instructions": [
            "Place fish in a nonreactive dish and season with salt and pepper. Pour the lime juice over the fish, cover with plastic wrap, and refrigerate for 1 hour.",
            "In a Dutch oven over moderate heat, heat the olive oil until hot but not smoking. Add the onion, season with salt, cover, and sweat until translucent, about 2 minutes. Add the garlic and sauté briefly, then add the tomatoes and more salt. Cover and cook until the tomatoes change color. Lower the heat and add the olives, capers, raisins, jalapeños, and bay leaves. Cover and simmer until the sauce thickens, about 10 to 15 minutes. Season with salt and pepper, remove the bay leaves, and keep warm until ready to serve.",
            "Preheat the oven to 350°F.",
            "Place 1/2 cup of the sauce in the bottom of an ovenproof dish. Remove the fish from the marinade and arrange it on top of the sauce. Pour the remaining sauce over the fish then scatter the potato slices on top. Cover and bake until the fish flakes when tested with a fork, about 45 minutes. Garnish with the parsley and serve with the Arroz Blanco."
        ],
        "picture_link": null
    }
}