{
    "recipe": {
        "title": "Hungarian Golden Pull-Apart Cake with Walnuts and Apricot Jam (Aranygaluska) ",
        "ingredients": [
            "1 tablespoon active dry yeast",
            "1 cup (235 ml) warm milk",
            "1/2 cup (100 grams) sugar, plus 2 tablespoons",
            "4 large eggs",
            "Zest of 1 orange",
            "1 teaspoon vanilla",
            "1 cup plus 4 tablespoons (2 1/2 sticks/282 grams) unsalted butter, at room temperature, divided",
            "4 1/2 cups (600 grams) unbleached all-purpose flour (about)",
            "1 teaspoon salt",
            "1 1/2 cups (180 grams) ground walnuts",
            "6 tablespoons (83 grams) brown sugar",
            "3/4 teaspoon cinnamon",
            "3 tablespoons cake or butter cookie crumbs",
            "3/4 cup (150 grams) apricot or plum jam"
        ],
        "instructions": [
            "Dissolve the yeast in the warm milk in the bowl of a standing mixer equipped with a paddle attachment. Add 1/4 cup of the sugar, the eggs, orange zest, vanilla, and 1 stick of butter. Gradually add the flour and salt, beating until mixed. Cover the bowl and leave for an hour, or until the dough has about doubled in size.",
            "Preheat the oven to 350°F and butter a 10-inch round pan with some of the second stick of butter.",
            "Melt what is left of the second stick of butter plus the remaining half stick and put it in a small bowl. In a separate bowl, mix the walnuts, brown sugar, remaining white sugar, cinnamon, and the cake or cookie crumbs.",
            "Roll the dough into a 1/2-inch-thick circle. Using a 1-inch cookie or biscuit cutter, cut circles of dough. Dip the circles first in the butter, then in the nut mixture and set in the pan, almost touching each other. After a layer is completed, spoon on dollops of jam. Make a second layer, filling in the holes with dough, then jam, continuing and rerolling until the dough is used up, ending with the walnut topping but not the jam. Bake in the oven for 35 to 40 minutes, or until golden brown and set. Leave in the pan for a few minutes, then turn onto a plate and serve warm. You can either cut the cake or pull the sections apart. Serve for a sweet breakfast treat, or as a dessert, served with good vanilla or rum raisin ice cream."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58e2ad1f2ebb9b1ae1fbffe1/6:4/w_274%2Ch_169/hungarian-golden-pull-apart-cake-040317.jpg",
        "color": 16678047
    }
}