{
    "recipe": {
        "title": "Ice Cream Sandwiches ",
        "ingredients": [
            "3/4 cup plus 2 tablespoons all-purpose flour",
            "1/4 cup natural unsweetened cocoa powder",
            "1/2 teaspoon baking soda",
            "1/2 teaspoon kosher salt",
            "6 tablespoons (3/4 stick) unsalted butter, room temperature",
            "1/2 cup sugar",
            "1 tablespoon light corn syrup",
            "1 large egg yolk",
            "1 teaspoon pure vanilla extract",
            "1 tablespoon sour cream",
            "1 pint ice cream (any flavor)"
        ],
        "instructions": [
            "Whisk flour, cocoa powder, baking soda, and salt in a medium bowl. Using an electric mixer, beat butter, sugar, and corn syrup in another medium bowl until light and fluffy, about 3 minutes. Add egg yolk and vanilla; beat until combined.",
            "Reduce mixer speed to low, add dry ingredients, and mix until just combined. Mix in sour cream. Form dough into a 3/4\"-thick square, wrap tightly in plastic, and chill until firm, 2-3 hours.",
            "Preheat oven to 350°F. Roll out dough between 2 sheets of parchment to about 1/8\" thickness. Transfer dough (still between parchment) to a large baking sheet and chill until firm, at least 30 minutes. Remove top sheet of parchment (it will come away easily if dough is well chilled) and trim to a 14x10\" rectangle. Bake cookie until dry and just set at edges, 8-10 minutes. Transfer baking sheet to a wire rack; let cookie cool.",
            "Trim cookie to a 12x9\" rectangle, then cut into twelve 3\" squares. Scoop ice cream into a medium bowl and mix just until softened, 2-3 minutes. Turn 6 cookies bottom side up. Dividing evenly, scoop ice cream on top and flatten slightly; top with remaining cookies, pressing down gently. Place sandwiches on a parchmentlined baking sheet and freeze until firm, at least 4 hours. Cut sandwiches in half on a diagonal to make triangles. Wrap in parchment, if desired, and freeze until ready to serve.",
            "DO AHEAD: Ice cream sandwiches can be made 1 week ahead. Keep frozen."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54af4ce4c4a891cc44ccdb6e/6:4/w_274%2Ch_169/51178660_ice-cream-sandwiches_1x1.jpg",
        "color": 12581202
    }
}