{
    "recipe": {
        "title": "If It Ain't Broke, Don't Fix It Stuffing ",
        "ingredients": [
            "1 cup (2 sticks) unsalted butter, plus more",
            "1 1/2 pound loaf sourdough bread, sliced 1\" thick, torn into 1/2\"–3/4\" pieces",
            "1 tablespoon extra-virgin olive oil",
            "1 pound breakfast sausage, casings removed if needed",
            "1 large onion, finely chopped",
            "1 fennel bulb, finely chopped",
            "4 celery stalks, finely chopped",
            "2 teaspoon Diamond Crystal or 1 1/4 tsp. Morton kosher salt, plus more",
            "1 tsp. freshly ground black pepper, plus more",
            "1/2 cup dry white wine",
            "1/4 cup finely chopped parsley",
            "1 tablespoon finely chopped sage",
            "1 tablespoon finely chopped thyme",
            "3 large eggs",
            "4 cups Thanksgiving Stock or low-sodium chicken broth, divided"
        ],
        "instructions": [
            "Place racks in middle and top of oven; preheat to 300°F. Butter a 3-qt. baking dish. Divide bread between 2 rimmed baking sheets and bake on middle rack, tossing occasionally, until dried out (do not let brown more than just a bit around the edges), 25–35 minutes. Let cool. Meanwhile, heat oil in a large skillet over medium-high. Arrange sausage in a single layer and cook, undisturbed, until browned underneath, about 3 minutes. Break up into bite-size pieces with 2 spatulas or spoons and continue to cook, tossing occasionally, until cooked through, about 5 minutes longer. Transfer sausage to a plate. Reduce heat to medium and melt 1 cup butter in same skillet. Add onion, fennel, and celery; season lightly with salt and pepper. Cook, stirring occasionally, until vegetables are very tender but not browned, 12–15 minutes. Add wine and scrape bottom of skillet to release any browned bits. Bring to a boil and cook until wine is evaporated, about 3 minutes. Toss in parsley, sage, and thyme and let mixture cool in skillet. Increase oven temperature to 350°F. Whisk eggs and 2 cups stock in a very large bowl. Add bread, sausage, and onion mixture and toss well to combine. Add 2 tsp. or 1 1/4 tsp. salt and 1 tsp. pepper. Drizzle remaining 2 cups stock over and toss again to combine. Let sit, tossing occasionally, until bread absorbs all of the liquid, about 10 minutes. Transfer stuffing to prepared dish; butter a sheet of foil and cover dish, butter side down. Bake on middle rack until very hot throughout (it should feel too hot to comfortably touch in the center; an instant-read thermometer inserted into the center should register 160°F), 35–40 minutes. Increase oven temperature to 425°F. Remove foil and transfer baking dish to top rack. Continue to bake stuffing until golden brown, 25–30 minutes longer.",
            "Place racks in middle and top of oven; preheat to 300°F. Butter a 3-qt. baking dish. Divide bread between 2 rimmed baking sheets and bake on middle rack, tossing occasionally, until dried out (do not let brown more than just a bit around the edges), 25–35 minutes. Let cool.",
            "Meanwhile, heat oil in a large skillet over medium-high. Arrange sausage in a single layer and cook, undisturbed, until browned underneath, about 3 minutes. Break up into bite-size pieces with 2 spatulas or spoons and continue to cook, tossing occasionally, until cooked through, about 5 minutes longer. Transfer sausage to a plate.",
            "Reduce heat to medium and melt 1 cup butter in same skillet. Add onion, fennel, and celery; season lightly with salt and pepper. Cook, stirring occasionally, until vegetables are very tender but not browned, 12–15 minutes. Add wine and scrape bottom of skillet to release any browned bits. Bring to a boil and cook until wine is evaporated, about 3 minutes. Toss in parsley, sage, and thyme and let mixture cool in skillet.",
            "Increase oven temperature to 350°F. Whisk eggs and 2 cups stock in a very large bowl. Add bread, sausage, and onion mixture and toss well to combine. Add 2 tsp. or 1 1/4 tsp. salt and 1 tsp. pepper. Drizzle remaining 2 cups stock over and toss again to combine. Let sit, tossing occasionally, until bread absorbs all of the liquid, about 10 minutes.",
            "Transfer stuffing to prepared dish; butter a sheet of foil and cover dish, butter side down. Bake on middle rack until very hot throughout (it should feel too hot to comfortably touch in the center; an instant-read thermometer inserted into the center should register 160°F), 35–40 minutes.",
            "Increase oven temperature to 425°F. Remove foil and transfer baking dish to top rack. Continue to bake stuffing until golden brown, 25–30 minutes longer.",
            "Do Ahead Stuffing can be assembled 1 day ahead. Cover and chill.",
            "Stuffing can be assembled 1 day ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a05db0bf819553e017bd988/6:4/w_274%2Ch_169/if-it-aint-broke-dont-fix-it-stuffing-recipe-BA-111017.jpg"
    }
}