{
    "recipe": {
        "title": "Indian-Spiced Chicken Kebabs with Cilantro-Mint Chutney ",
        "ingredients": [
            "1/2 cup (packed) fresh mint leaves",
            "1/2 cup (packed) fresh cilantro",
            "1 tablespoon fresh lemon juice",
            "2 1/2 teaspoons minced fresh ginger",
            "1 jalapeño chili, seeded, minced",
            "2 tablespoons (or more) plain yogurt",
            "1/2 cup plain yogurt",
            "3 tablespoons tikka paste or mild curry paste (such as Patak's)",
            "1 tablespoon olive oil",
            "2 garlic cloves, minced",
            "2 teaspoons minced fresh ginger",
            "1/4 teaspoon cayenne pepper",
            "1 1/2 pounds skinless boneless chicken breasts, cut into 2-inch cubes",
            "24 (about) 6-inch bamboo skewers, soaked 30 minutes in water",
            "Butter lettuce leaves",
            "1/2 small English hothouse cucumber, halved lengthwise, thinly sliced crosswise",
            "2 limes, cut into wedges"
        ],
        "instructions": [
            "For chutney: Blend first 5 ingredients and 2 tablespoons yogurt in blender or processor. Blend in more yogurt if necessary to make smooth paste. (Chutney can be made 1 day ahead. Cover and refrigerate.)",
            "Blend first 5 ingredients and 2 tablespoons yogurt in blender or processor. Blend in more yogurt if necessary to make smooth paste. (Chutney can be made 1 day ahead. Cover and refrigerate.)",
            "For chicken: Whisk first 6 ingredients in large bowl to blend. Add chicken and toss to coat. Cover and refrigerate at least 2 hours and up to 12 hours.",
            "Whisk first 6 ingredients in large bowl to blend. Add chicken and toss to coat. Cover and refrigerate at least 2 hours and up to 12 hours.",
            "Preheat broiler. Thread 1 chicken piece on each skewer. Cover exposed part of skewers with foil. Broil chicken until cooked through, turning occasionally, about 8 minutes. Arrange lettuce and cucumber on platter. Top with chicken. Squeeze lime over. Serve chicken with Cilantro-Mint Chutney.",
            "Preheat broiler. Thread 1 chicken piece on each skewer. Cover exposed part of skewers with foil. Broil chicken until cooked through, turning occasionally, about 8 minutes. Arrange lettuce and cucumber on platter. Top with chicken. Squeeze lime over. Serve chicken with Cilantro-Mint Chutney."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df86ff9a84192308a8b9a/6:4/w_274%2Ch_169/107682.jpg"
    }
}