{
    "recipe": {
        "title": "Individual Ginger Cakes with Apricot Sticky Sauce ",
        "ingredients": [
            "2/3 cup dried apricots, thinly sliced",
            "3 tablespoons chopped crystallized ginger",
            "1 cup sugar",
            "3 tablespoons water",
            "1 tablespoon light corn syrup",
            "1 tablespoon salted butter",
            "2/3 cup whipping cream",
            "1 teaspoon vanilla extract",
            "Nonstick vegetable oil spray",
            "2 1/2 cups all purpose flour",
            "4 teaspoons ground ginger",
            "2 teaspoons baking soda",
            "1 1/2 teaspoons ground allspice",
            "1 cup hot water",
            "1 tablespoon instant espresso powder",
            "1 cup (packed) golden brown sugar",
            "3/4 cup (1 1/2 sticks) salted butter, room temperature",
            "1 cup mild-flavored (light) molasses",
            "2 large eggs",
            "2 tablespoons finely grated peeled fresh ginger",
            "2 teaspoons sugar"
        ],
        "instructions": [
            "For sauce: Combine apricots and ginger in small bowl. Pour enough boiling water over just to cover; let soften 10 minutes. Drain; pat dry with paper towels. Combine sugar, 3 tablespoons water, and corn syrup in heavy medium skillet. Stir over low heat until sugar dissolves. Increase heat; boil until syrup is deep amber color, brushing down sides with wet pastry brush and swirling pan occasionally, about 10 minutes. Remove from heat. Mix in butter, apricots, and ginger. Add cream and vanilla. Stir over low heat until caramel bits dissolve and sauce is smooth. (Can be made 1 day ahead. Cover; chill. Rewarm over low heat before serving.)",
            "Combine apricots and ginger in small bowl. Pour enough boiling water over just to cover; let soften 10 minutes. Drain; pat dry with paper towels.",
            "Combine sugar, 3 tablespoons water, and corn syrup in heavy medium skillet. Stir over low heat until sugar dissolves. Increase heat; boil until syrup is deep amber color, brushing down sides with wet pastry brush and swirling pan occasionally, about 10 minutes. Remove from heat. Mix in butter, apricots, and ginger. Add cream and vanilla. Stir over low heat until caramel bits dissolve and sauce is smooth. (Can be made 1 day ahead. Cover; chill. Rewarm over low heat before serving.)",
            "For cakes: Preheat oven to 350°F. Spray 9 mini-Bundt molds with nonstick spray; generously butter same molds. Sift flour, ground ginger, baking soda, and allspice into medium bowl. Combine 1 cup hot water and espresso powder in small bowl and stir to dissolve. Using electric mixer, beat brown sugar and butter in large bowl until blended. Beat in molasses, then eggs and fresh ginger. Beat in flour mixture in 3 additions alternately with espresso mixture in 2 additions. Divide among 9 prepared molds. Sprinkle with 2 teaspoons sugar. Bake cakes until tester inserted near center comes out clean, about 20 minutes. Cool cakes in pans 10 minutes; turn out onto baking sheet. (Can be made 6 hours ahead; let stand at room temperature. Rewarm in 350°F oven 8 minutes.) Serve ginger cakes warm with warm apricot sauce.",
            "Preheat oven to 350°F. Spray 9 mini-Bundt molds with nonstick spray; generously butter same molds. Sift flour, ground ginger, baking soda, and allspice into medium bowl. Combine 1 cup hot water and espresso powder in small bowl and stir to dissolve. Using electric mixer, beat brown sugar and butter in large bowl until blended. Beat in molasses, then eggs and fresh ginger. Beat in flour mixture in 3 additions alternately with espresso mixture in 2 additions. Divide among 9 prepared molds. Sprinkle with 2 teaspoons sugar. Bake cakes until tester inserted near center comes out clean, about 20 minutes. Cool cakes in pans 10 minutes; turn out onto baking sheet. (Can be made 6 hours ahead; let stand at room temperature. Rewarm in 350°F oven 8 minutes.) Serve ginger cakes warm with warm apricot sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea09bf3a00aeb2f1d69fb/6:4/w_274%2Ch_169/106233.jpg"
    }
}