{
    "recipe": {
        "title": "Insalata Rustica ",
        "ingredients": [
            "1/2 cup plus 2 tablespoons extra-virgin olive oil, divided",
            "3 tablespoons fresh lemon juice",
            "4 ounces 1/8-inch-thick slices prosciutto, chopped",
            "1 1/2 cups stemmed seedless red grapes",
            "1/2 cup dried tart cherries",
            "10 cups (loosely packed) greens (such as frisée, arugula, and torn radicchio)",
            "2 Bosc pears, cored; 1 cut into matchstick-size pieces, 1 thinly sliced",
            "Aged balsamic vinegar (for drizzling)",
            "1/2 cup pine nuts, toasted",
            "4 ounces 1/8-inch-thick rectangular slices Pecorino Romano cheese, each slice cut on diagonal into triangles"
        ],
        "instructions": [
            "Preheat oven to 350°F. Whisk 1/2 cup oil and lemon juice in small bowl. Season dressing with salt and pepper. Heat 1 tablespoon oil in large skillet over medium heat. Add prosciutto to skillet and sauté until crisp. Using slotted spoon, transfer crisp prosciutto to paper towels to drain. Toss grapes with 1 tablespoon oil on rimmed baking sheet. Roast until grapes begin to shrivel, about 15 minutes. Cool grapes on baking sheet. Place cherries in small bowl. Add enough hot water to cover cherries by 1 inch. Let cherries soak in bowl 15 minutes to soften. Drain. DO AHEAD: Dressing, prosciutto, grapes, and cherries can be made 2 hours ahead. Let stand at room temperature. Mix greens, matchstick-size pear pieces, dressing, 2/3 of prosciutto, grapes, and cherries in large bowl. Season with salt and pepper. Divide among plates. Garnish with pear slices, drizzle with vinegar, and sprinkle with pine nuts and remaining prosciutto. Garnish with cheese.",
            "Preheat oven to 350°F. Whisk 1/2 cup oil and lemon juice in small bowl. Season dressing with salt and pepper. Heat 1 tablespoon oil in large skillet over medium heat. Add prosciutto to skillet and sauté until crisp. Using slotted spoon, transfer crisp prosciutto to paper towels to drain. Toss grapes with 1 tablespoon oil on rimmed baking sheet. Roast until grapes begin to shrivel, about 15 minutes. Cool grapes on baking sheet. Place cherries in small bowl. Add enough hot water to cover cherries by 1 inch. Let cherries soak in bowl 15 minutes to soften. Drain. DO AHEAD: Dressing, prosciutto, grapes, and cherries can be made 2 hours ahead. Let stand at room temperature.",
            "Mix greens, matchstick-size pear pieces, dressing, 2/3 of prosciutto, grapes, and cherries in large bowl. Season with salt and pepper. Divide among plates. Garnish with pear slices, drizzle with vinegar, and sprinkle with pine nuts and remaining prosciutto. Garnish with cheese."
        ],
        "picture_link": null
    }
}