{
    "recipe": {
        "title": "Instant Pot Mushroom Risotto ",
        "ingredients": [
            "2 Tbsp. extra-virgin olive oil",
            "1 lb. wild mushrooms, trimmed, sliced",
            "Kosher salt, freshly ground pepper",
            "1 medium onion, chopped",
            "2 cups carnaroli or arborio rice",
            "1/2 cup white wine",
            "4 1/2 cups vegetable or chicken stock",
            "Chopped parsley and finely grated Parmesan (for serving)",
            "An electric pressure cooker or Instant Pot"
        ],
        "instructions": [
            "Set Instant Pot on medium heat or \"Sauté\" and pour oil into cooker insert. Add mushrooms and cook until any moisture they've released is evaporated and they start to brown, about 10 minutes; season with salt and pepper. Add onion, stir to combine, and cook until translucent, about 8 minutes. Add rice and stir until chalky white, about 3 minutes. Add wine and cook until mostly evaporated, about 3 minutes. Stir in stock. Lock on lid, making sure steam-release valve is in the proper sealed position. Select “Manual” and program for 5 minutes at high pressure (it will take about 10 minutes for the pressure to build before cooking automatically begins). As soon as the time has elapsed, turn off cooker, “Quick Release” the steam, and unlock lid. Stir with a wooden spoon; season with salt and pepper. Divide risotto among bowls. Top with parsley and Parmesan and serve.",
            "Set Instant Pot on medium heat or \"Sauté\" and pour oil into cooker insert. Add mushrooms and cook until any moisture they've released is evaporated and they start to brown, about 10 minutes; season with salt and pepper. Add onion, stir to combine, and cook until translucent, about 8 minutes. Add rice and stir until chalky white, about 3 minutes. Add wine and cook until mostly evaporated, about 3 minutes. Stir in stock. Lock on lid, making sure steam-release valve is in the proper sealed position. Select “Manual” and program for 5 minutes at high pressure (it will take about 10 minutes for the pressure to build before cooking automatically begins).",
            "As soon as the time has elapsed, turn off cooker, “Quick Release” the steam, and unlock lid. Stir with a wooden spoon; season with salt and pepper.",
            "Divide risotto among bowls. Top with parsley and Parmesan and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b23da4e0a49d7772e40f353/6:4/w_274%2Ch_169/Pot-Mushroom-Risotto-17042018.jpg"
    }
}