{
    "recipe": {
        "title": "Instant Pot Bolognese ",
        "ingredients": [
            "1 Tbsp. extra-virgin olive oil",
            "1 Tbsp. unsalted butter",
            "4 oz. pancetta, chopped",
            "1 medium onion, chopped",
            "1 medium carrot, peeled, chopped",
            "1 celery stalk, chopped",
            "2 garlic cloves, finely chopped",
            "3/4 lb. ground beef",
            "3/4 lb. ground pork",
            "Kosher salt, freshly ground pepper",
            "1/4 cup tomato paste",
            "1/2 cup red wine",
            "1 1/2 cups chicken stock",
            "1 cup milk",
            "2 bay leaves",
            "2 Tbsp. heavy cream",
            "1 lb. pappardelle",
            "Finely grated Parmesan (for serving)"
        ],
        "instructions": [
            "Set pressure cooker to medium heat or \"Sauté,\" then heat oil and butter, stirring to combine. Add pancetta and cook, stirring often, until starting to crisp, about 10 minutes. Add onion, carrot, celery, and garlic and cook, stirring, until onion is softened, 8–10 minutes. Add ground beef and ground pork and cook, stirring often, until meat is fully cooked, 8–10 minutes. Carefully lift insert out of pressure cooker with a potholder and strain through a fine-mesh sieve set over a medium bowl. Return meat mixture to cooker insert; discard fat. Season with salt and pepper. Stir in tomato paste and cook, stirring, about 2 minutes. Pour in wine and cook until reduced by half. Stir in stock, milk, and bay leaves. Lock on lid, making sure steam-release valve is in the proper sealed position. Select “Manual” and program for 10 minutes at high pressure (it will take about 5 minutes for the pressure to build before cooking automatically begins). As soon as the time has elapsed, let pressure release naturally (this will take about 15 minutes). Unlock lid and stir in cream. Continue to cook, stirring often, until sauce is thick, 10–15 minutes more. Season with salt and pepper. Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain. Divide pasta among bowls. Spoon sauce over, then top with Parmesan.",
            "Set pressure cooker to medium heat or \"Sauté,\" then heat oil and butter, stirring to combine. Add pancetta and cook, stirring often, until starting to crisp, about 10 minutes. Add onion, carrot, celery, and garlic and cook, stirring, until onion is softened, 8–10 minutes. Add ground beef and ground pork and cook, stirring often, until meat is fully cooked, 8–10 minutes.",
            "Carefully lift insert out of pressure cooker with a potholder and strain through a fine-mesh sieve set over a medium bowl. Return meat mixture to cooker insert; discard fat. Season with salt and pepper. Stir in tomato paste and cook, stirring, about 2 minutes. Pour in wine and cook until reduced by half. Stir in stock, milk, and bay leaves. Lock on lid, making sure steam-release valve is in the proper sealed position. Select “Manual” and program for 10 minutes at high pressure (it will take about 5 minutes for the pressure to build before cooking automatically begins).",
            "As soon as the time has elapsed, let pressure release naturally (this will take about 15 minutes). Unlock lid and stir in cream. Continue to cook, stirring often, until sauce is thick, 10–15 minutes more. Season with salt and pepper.",
            "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain.",
            "Divide pasta among bowls. Spoon sauce over, then top with Parmesan."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54c52b47e231becc7f3dd492/6:4/w_274%2Ch_169/EP_20150120_masters-26_HERO.jpg"
    }
}