{
    "recipe": {
        "title": "Instant Pot Beef Barbacoa Tacos ",
        "ingredients": [
            "1/4 cup apple cider vinegar",
            "2 tablespoons freshly squeezed lime juice",
            "3 cloves garlic, minced",
            "1 chipotle chile in adobo, minced",
            "2 teaspoons ground cumin",
            "2 teaspoons dried oregano",
            "1 teaspoon salt",
            "1/2 teaspoon freshly ground black pepper",
            "1/4 teaspoon ground cloves",
            "2 tablespoons vegetable oil",
            "2 1/2 pounds boneless beef chuck roast, trimmed of most fat and cut into large chunks",
            "1/2 cup reduced-salt chicken broth or All-Purpose Chicken Stock",
            "2 bay leaves",
            "Small (6-inch) corn tortillas, for serving",
            "Salsa or pico de gallo, for serving",
            "Cotija cheese, for serving"
        ],
        "instructions": [
            "Whisk together the vinegar, lime juice, garlic, chipotle, cumin, oregano, salt, pepper, and cloves in a medium bowl. Set aside.",
            "Press Sauté and use the Sauté or Adjust button to select the highest temperature (“More”). Place the vegetable oil in the inner pot. Wait until the display reads “Hot,” about 5 minutes, then add the beef. Cook with the lid off, turning the beef every 2 minutes, until the beef is browned on most sides, about 8 minutes.",
            "Add the vinegar sauce and the chicken broth (be careful—steam may whoosh up!), and then the bay leaves. Stir to combine.",
            "Close and lock the lid. Set the valve to Sealing. Press Cancel, then press Manual or Pressure Cook and use the Pressure or Pressure Level button to select High Pressure. Use the – or + button to set the time to 30 minutes.",
            "When the cooking cycle ends, press Cancel. Allow the appliance to cool and release pressure naturally, about 20 minutes. (The pressure is released when the small metal float valve next to the pressure-release valve sinks back into the lid and the lid is no longer locked.)",
            "Remove the lid. Discard the bay leaves. Use tongs or a large spoon to remove the beef from the inner pot and place it on a cutting board. Shred the beef using two forks: Use one fork to pull off a chunk and then use two forks to shred that piece, holding down the meat with one fork and pulling at it with the other. Repeat with the remaining beef.",
            "Serve the beef hot, piled into corn tortillas and topped with salsa and a sprinkling of Cotija cheese, if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a666b30f7fd5e59b52319f9/6:4/w_274%2Ch_169/Beef%20Barbacoa%20Tacos.jpg"
    }
}