{
    "recipe": {
        "title": "Instant-Pot Korean Chile-Braised Brisket and Kimchi Coleslaw ",
        "ingredients": [
            "4 to 5 pounds beef brisket, cut into 3 or 4 pieces",
            "1 tablespoon dried red chile flakes, preferably Korean gochugaru",
            "1 tablespoon sweet paprika",
            "2 1/2 teaspoons kosher salt, plus more to taste",
            "1/2 teaspoon freshly ground black pepper",
            "1 to 3 tablespoons peanut or safflower oil, as needed",
            "1 large onion, diced",
            "4 garlic cloves, minced",
            "1 tablespoon grated peeled fresh ginger",
            "1 cup lager-style beer",
            "1/4 cup gochujang (Korean chile paste) or Sriracha",
            "2 tablespoons ketchup",
            "2 tablespoons soy sauce",
            "2 tablespoons light or dark brown sugar",
            "2 teaspoons Asian fish sauce",
            "1 teaspoon toasted sesame oil",
            "5 cups shredded cabbage (from 1 small cabbage)",
            "1/4 cup chopped kimchi, plus more to taste",
            "2 tablespoons peanut, grapeseed, or olive oil",
            "1 teaspoon toasted sesame oil",
            "Juice of 1/2 lime, plus more to taste",
            "1/2 teaspoon fine sea salt, plus more to taste"
        ],
        "instructions": [
            "Rub the beef with the chile flakes, paprika, salt, and pepper. Cover and refrigerate for 1 hour and up to 24 hours.",
            "Set the electric pressure cooker to sauté (or use a large skillet). Add a tablespoon of the oil, let it heat up for a few seconds, and then add a batch of the beef and sear until it’s browned all over, about 2 minutes per side, adding more oil as needed. Transfer the beef to a plate and repeat with the remaining batches.",
            "If the pot looks dry, add a bit more oil. Add the onion and sauté until golden, 3 to 5 minutes. Add the garlic and ginger and sauté for 1 minute longer. Add the beer, gochujang, ketchup, soy sauce, brown sugar, fish sauce, and sesame oil. Scrape the mixture into the pressure cooker if you have used a skillet.",
            "Cover and cook on high pressure for 90 minutes. Let the pressure release naturally for 20 minutes, and then release the remaining pressure manually.",
            "To make the kimchi coleslaw, combine the cabbage, kimchi, both oils, lime juice, and salt in a large bowl and toss well. Taste, and add more salt or lime juice if needed.",
            "Transfer the beef to a plate or a rimmed cutting board and tent with foil to keep warm. Set the pressure cooker to sauté and simmer the sauce for 15 to 20 minutes, until it is reduced by half or two-thirds (remember that it thickens as it cools). Use a fat separator to skim off the fat, or let the sauce settle and spoon the fat off the top. Serve the sauce alongside the beef, with the kimchi coleslaw.",
            "Slow Cooker Variation: Cut the beef into 6 to 8 pieces instead of 3 or 4 pieces. Marinate and brown as in steps 1 and 2. Place the meat in the pot and cover with the sautéed onion mixture from step 3. Cook on high for 7 to 9 hours or low for 10 to 12 hours.",
            "Cut the beef into 6 to 8 pieces instead of 3 or 4 pieces. Marinate and brown as in steps 1 and 2. Place the meat in the pot and cover with the sautéed onion mixture from step 3. Cook on high for 7 to 9 hours or low for 10 to 12 hours."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a68f314d011da3374a2ce91/6:4/w_274%2Ch_169/instant-pot-chile-brisket-recipe-012418.jpg"
    }
}