{
    "recipe": {
        "title": "Instant Pot Hummus ",
        "ingredients": [
            "1 cup dried chickpeas",
            "4 cups water, plus 3 cups if you soak and drain the beans",
            "1 teaspoon kosher salt",
            "1/2 cup tahini",
            "3 tablespoons fresh lemon juice (from 1 lemon)",
            "2 cloves garlic, chopped",
            "1/4 teaspoon ground cumin",
            "1 teaspoon kosher salt",
            "1 tablespoon chopped fresh flat-leaf parsley",
            "1/4 teaspoon paprika",
            "2 tablespoons extra-virgin olive oil"
        ],
        "instructions": [
            "If you decide to soak the beans, put them in the Instant Pot and add the 4 cups water and the salt. Leave the pot turned off and let the beans soak for 10 to 12 hours or up to overnight. You can then either drain the beans in a colander or not. If you drain them, return them to the pot and add the 3 cups water.",
            "If you decide to cook the beans without soaking them, put them in the Instant Pot and add the 4 cups water and the salt.",
            "When ready to cook the chickpeas, secure the lid and set the Pressure Release to Sealing. Select the Bean/Chili setting and set the cooking time for 25 minutes for soaked chickpeas or 40 minutes for unsoaked chickpeas.",
            "Let the pressure release naturally for at least 15 minutes, then move the Pressure Release to Venting to release any remaining steam. At this point, you can leave the chickpeas in the pot on the Keep Warm setting for up to 10 hours.",
            "When you are ready to make the hummus, open the pot. Ladle out 3/4 cup of the cooking liquid and set it aside. Wearing heat-resistant mitts, lift the inner pot out of the Instant Pot and drain the chickpeas in a colander.",
            "Transfer the drained chickpeas to a food processor or blender. Add the reserved ¾ cup cooking liquid, the tahini, lemon juice, garlic, cumin, and salt. Process at medium speed for about 1 minute, until the mixture is smooth and creamy.",
            "If serving as an appetizer, spoon the hummus into the center of a wide, shallow serving bowl and spread it out in a thick circle. Sprinkle the parsley and paprika on top, then drizzle with the oil."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a69003e1b1b671bb7580e92/6:4/w_274%2Ch_169/instant-pot-hummus-recipe-012418.jpg"
    }
}