{
    "recipe": {
        "title": "Instant Pot Brothy Farro with Sausage and Leeks ",
        "ingredients": [
            "4 large or 6 small leeks, white and pale-greens parts only",
            "1 Tbsp. extra-virgin olive oil, plus more for drizzling",
            "4 fully cooked spicy Italian sausage links (about 12 oz.), sliced crosswise into 1/3\"-thick rounds",
            "1 large bunch scallions (about 10)",
            "1/4 cup dry white wine",
            "1 cup farro",
            "1/2 tsp. kosher salt",
            "1/2 tsp. freshly ground black pepper",
            "4 sprigs thyme",
            "Thinly sliced radishes, peperoncini, and lemon wedges (for serving)",
            "An electric pressure cooker or Instant Pot"
        ],
        "instructions": [
            "Preheat cooker on “Sauté” setting. Trim roots off leeks and remove and discard tough outer layers, then cut leeks into 1/3\"-thick rounds. Rinse well, then pat dry. When pressure cooker is hot, pour 1 Tbsp. oil into insert, then add sausage and cook, stirring occasionally, until browned in places, about 5 minutes. Meanwhile, separate white and light green parts of scallions from dark green parts. Cut white and light green parts into 1/4\"-thick rounds. Finely chop dark green parts and set aside for serving. Add leeks and scallion white and light green parts to pressure cooker and stir to coat in oil. Add wine and cook, stirring occasionally, until wine is reduced by half and no longer smells like alcohol, about 1 minute. Add farro, salt, pepper, thyme, and 2 1/2 cups water and stir to combine, then turn off cooker. Lock on lid, making sure steam-release valve is in the proper sealed position. Select “Manual” and program for 3 minutes at high pressure. As soon as the time has elapsed, turn off cooker, \"Quick Release\" the steam, and unlock lid. Divide farro mixture among bowls. Top with radishes, peperoncini, and reserved scallion greens. Drizzle with oil and squeeze lemons over.",
            "Preheat cooker on “Sauté” setting. Trim roots off leeks and remove and discard tough outer layers, then cut leeks into 1/3\"-thick rounds. Rinse well, then pat dry.",
            "When pressure cooker is hot, pour 1 Tbsp. oil into insert, then add sausage and cook, stirring occasionally, until browned in places, about 5 minutes.",
            "Meanwhile, separate white and light green parts of scallions from dark green parts. Cut white and light green parts into 1/4\"-thick rounds. Finely chop dark green parts and set aside for serving.",
            "Add leeks and scallion white and light green parts to pressure cooker and stir to coat in oil. Add wine and cook, stirring occasionally, until wine is reduced by half and no longer smells like alcohol, about 1 minute. Add farro, salt, pepper, thyme, and 2 1/2 cups water and stir to combine, then turn off cooker.",
            "Lock on lid, making sure steam-release valve is in the proper sealed position. Select “Manual” and program for 3 minutes at high pressure.",
            "As soon as the time has elapsed, turn off cooker, \"Quick Release\" the steam, and unlock lid.",
            "Divide farro mixture among bowls. Top with radishes, peperoncini, and reserved scallion greens. Drizzle with oil and squeeze lemons over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ac7c8064389e039654dfb42/6:4/w_274%2Ch_169/Brothy-Farro-With-Sausage-and-Leeks-Instant-Pot-Dinner-04042018.jpg"
    }
}