{
    "recipe": {
        "title": "Instant Pot Sticky Hoisin Baby Back Ribs ",
        "ingredients": [
            "4 lb. baby back pork ribs (about 2 racks)",
            "2 tsp. kosher salt",
            "1 tsp. freshly ground black pepper",
            "1/3 cup hoisin sauce",
            "1/3 cup honey",
            "1/3 cup soy sauce, preferably dark",
            "2 Tbsp. Shaoxing rice wine or dry sherry",
            "1 Tbsp. finely chopped fresh ginger",
            "1/2 tsp. five-spice powder",
            "Flaky sea salt",
            "An Instant Pot"
        ],
        "instructions": [
            "Cut meat between bones into individual ribs; season with kosher salt and pepper. Let sit at room temperature at least 30 minutes and up to 1 hour. Whisk hoisin, honey, soy sauce, rice wine, ginger, and five-spice powder in cooker insert. Toss ribs in sauce to coat, then fit as many as possible in a single layer; set remaining ribs on top. Lock on lid, making sure steam release valve is in the proper sealed position. Select “Manual” and program for 12 minutes at high pressure. As soon as the time has elapsed, turn off cooker, “Quick Release” the steam, and unlock lid. The ribs should be tender enough to easily pierce with a sharp knife. Transfer ribs to a platter. Select “Sauté” and let cooking liquid simmer until reduced by about half, 10–15 minutes. Meanwhile, prepare a medium direct fire on a gas or charcoal grill (or preheat broiler). Brush ribs with sauce. Place ribs on grate directly over fire, meaty side down. Close lid and grill until browned and crisp in places, about 5 minutes (or transfer them to a baking sheet, meaty side up, and broil the same way). Return ribs to platter. Top with sea salt. Serve with remaining sauce alongside. Cooks’ Note: For a fruitier spin on the sauce, substitute pineapple or orange juice for the honey and use a pinch of cayenne or crushed red pepper flakes instead of the five-spice powder.",
            "Cut meat between bones into individual ribs; season with kosher salt and pepper. Let sit at room temperature at least 30 minutes and up to 1 hour.",
            "Whisk hoisin, honey, soy sauce, rice wine, ginger, and five-spice powder in cooker insert. Toss ribs in sauce to coat, then fit as many as possible in a single layer; set remaining ribs on top. Lock on lid, making sure steam release valve is in the proper sealed position. Select “Manual” and program for 12 minutes at high pressure.",
            "As soon as the time has elapsed, turn off cooker, “Quick Release” the steam, and unlock lid. The ribs should be tender enough to easily pierce with a sharp knife. Transfer ribs to a platter.",
            "Select “Sauté” and let cooking liquid simmer until reduced by about half, 10–15 minutes.",
            "Meanwhile, prepare a medium direct fire on a gas or charcoal grill (or preheat broiler). Brush ribs with sauce. Place ribs on grate directly over fire, meaty side down. Close lid and grill until browned and crisp in places, about 5 minutes (or transfer them to a baking sheet, meaty side up, and broil the same way).",
            "Return ribs to platter. Top with sea salt. Serve with remaining sauce alongside.",
            "Cooks’ Note: For a fruitier spin on the sauce, substitute pineapple or orange juice for the honey and use a pinch of cayenne or crushed red pepper flakes instead of the five-spice powder."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a68f33fd0a0ec7e6ce58d41/6:4/w_274%2Ch_169/Instant-Pot-sticky-hoisin-ribs-03012018.jpg"
    }
}