{
    "recipe": {
        "title": "Instant Pot Braised Lamb with White Beans and Spinach ",
        "ingredients": [
            "2 Tbsp. extra-virgin olive oil, plus more for drizzling",
            "4 bone-in lamb shoulder chops (about 1 1/2 lb.)",
            "1 tsp. freshly ground black pepper",
            "2 tsp. kosher salt, divided",
            "1 small onion, finely chopped",
            "3 garlic cloves, peeled, crushed",
            "1/4 cup red wine",
            "4 large sprigs rosemary",
            "2 (14.5-oz.) cans white beans, such as cannellini, navy, or butter, drained, rinsed",
            "1 bunch mature spinach, tough stems removed",
            "2 Tbsp. fresh lemon juice",
            "Lemon wedges and crusty bread (for serving; optional)",
            "An Instant Pot or pressure cooker"
        ],
        "instructions": [
            "Pour 2 Tbsp. oil into Instant Pot and heat on Sauté setting on high until shimmering. Season lamb chops on all sides with pepper and 1 1/2 tsp. salt. Working in two batches, cook lamb in Instant Pot until golden brown, about 2 minutes per side. Transfer to a plate.",
            "Add onion and garlic to hot oil in pot and cook, still on high Sauté setting and stirring occasionally, until fragrant, 1–2 minutes. Pour in wine and cook, scraping up browned bits from bottom of pot, until wine is slightly reduced and steam no longer smells boozy, 2–3 minutes. Pour in 2 cups hot water. Nestle chops and rosemary sprigs into pot, arranging in an even layer. Turn off Sauté setting. Lock on lid and cook at high pressure 20 minutes, then release pressure manually.",
            "Transfer lamb to a large bowl; discard rosemary stems. Return heat to high Sauté setting and reduce braising liquid slightly while you shred lamb into bite-size pieces; remove and discard bones. Stir lamb and beans back into liquid in pot, then turn off heat. Add spinach and remaining 1/2 tsp. salt and stir until spinach is just wilted. Stir in lemon juice.",
            "Divide lamb mixture among bowls. Drizzle with oil and serve with lemon wedges and bread alongside (if using)."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c3cbaf38084e8485f2d2dff/6:4/w_274%2Ch_169/Instant-Pot-Lamb-Braise-w-White-Beans-and-Spinach-11012019.jpg"
    }
}