{
    "recipe": {
        "title": "Instant Pot Choucroute Garnie ",
        "ingredients": [
            "1 lb. smoked slab bacon, cut crosswise into 4 pieces",
            "2 Tbsp. extra-virgin olive oil or rendered goose or duck fat",
            "1/2 head savoy cabbage, thinly sliced",
            "2 onions, thinly sliced",
            "4 large garlic cloves, chopped",
            "1 lb. sauerkraut, drained",
            "1 lb. medium Yukon Gold potatoes, pricked all over with a fork",
            "2 tsp. dried juniper berries (optional)",
            "1 tsp. caraway seeds",
            "1 1/2 tsp. kosher salt, divided",
            "1/2 tsp. freshly ground black pepper",
            "4 bay leaves",
            "1 1/2 lb. pork ribs (spare or baby back), cut into 2-rib pieces",
            "4 cooked knockwurst or bratwurst sausages (about 1 lb.)",
            "1 cup dry white wine, preferably Riesling",
            "Whole grain mustard and cornichons (for serving)",
            "An Instant Pot"
        ],
        "instructions": [
            "Toss bacon and oil in cooker insert and select “Sauté.” Cook, turning occasionally, until exterior of bacon pieces are golden brown and some of the fat is rendered, about 10 minutes. Transfer bacon to a plate; set aside.",
            "Add cabbage, onions, and garlic to cooker insert and stir to coat. Add sauerkraut, potatoes, juniper berries, if using, and caraway seeds; season with 1/2 tsp. salt and 1/2 tsp. pepper and stir to combine.",
            "Tuck in bay leaves, then push bacon down into mixture. Set ribs on top and season with 1 tsp. salt. Prick each sausage with a fork in a couple of places and layer over ribs. Pour in wine. Lock on lid, making sure steam release valve is in the proper position. Select “Manual” and program for 13 minutes at high pressure.",
            "As soon as the time has elapsed, turn off cooker, “Quick Release” the steam, and unlock lid. The ribs and bacon should be tender when pierced with a small sharp knife.",
            "Transfer meat to a cutting board and sauerkraut and potatoes to a platter. Cut bacon into 1/2\" slices, each sausage into 3 or 4 pieces (the skins might have burst but that’s fine), and pork into individual ribs. Set meat on top of sauerkraut and potatoes. Serve with mustard and cornichons alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a68f342d011da3374a2ce93/6:4/w_274%2Ch_169/Instant-Pot-Choucroute-Garnie-03012018.jpg"
    }
}