{
    "recipe": {
        "title": "Instant Pot Black Beans with Green Chiles and Cumin ",
        "ingredients": [
            "3 poblano chiles",
            "2 jalapeño or serrano chiles",
            "5 tablespoons extra-virgin olive oil",
            "1 large onion, diced",
            "2 tablespoons finely chopped fresh sage (or use marjoram or oregano)",
            "3 garlic cloves, minced",
            "1 teaspoon chili powder",
            "1 teaspoon ground cumin",
            "1 pound dried black beans",
            "1 tablespoon kosher salt, plus more as needed",
            "1 medium-size ripe tomato, quartered",
            "1 bunch fresh cilantro, stems and leaves separated",
            "1 small bunch scallions, white and green parts separated, thinly sliced",
            "Freshly ground black pepper, to taste",
            "Grated Monterey Jack cheese, for serving (optional)",
            "Lime wedges, for serving"
        ],
        "instructions": [
            "Roast the poblano and jalapeño chiles over an open flame on your stove, or under your broiler, until their skins are blistered and charred all over, about 10 minutes. Transfer them to a bowl, cover with a plate, and let them sit until they are cool enough to handle. Then rub the skins off with a paper towel, and seed and dice the chiles.",
            "Using the sauté function, heat 2 tablespoons of the oil in the pressure cooker. Stir in the onion and cook until golden, about 15 minutes. Stir in the sage, two-thirds of the minced garlic, and the chili powder and cumin; cook for 1 minute. Stir in the chopped poblanos, half the jalapeños, and the beans, salt, and 5 cups of water. Cover, and cook on high pressure for 40 minutes. Allow the pressure to release naturally. If the beans aren’t cooked through, cook on high pressure for 5 minutes, then manually release pressure.",
            "While the beans are cooking, in a blender combine the tomato, cilantro stems, half the cilantro leaves, the scallion whites, the remaining garlic, the remaining 3 tablespoons oil, the remaining jalapeños, and a large pinch of salt. Blend to puree; then taste and add more salt and pepper if necessary.",
            "When the beans finish cooking, stir in the tomato puree; let sit for 5 minutes. Then, if the mix seems thin, simmer it on the sauté setting for a few minutes to thicken it up.",
            "Transfer the beans to individual serving bowls, and top with the cheese if using, the remaining cilantro leaves, and thinly sliced scallion greens. Serve with lime wedges on the side.",
            "Slow Cooker Variation: Cook on high for 6 to 7 hours or on low for 8 to 10 hours. Add the tomato puree during the last 20 minutes.",
            "Cook on high for 6 to 7 hours or on low for 8 to 10 hours. Add the tomato puree during the last 20 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a948a8bd8f5fb6b3a2e1aef/6:4/w_274%2Ch_169/GettyImages-482649111.jpg"
    }
}