{
    "recipe": {
        "title": "Instant Pot Thai Coconut Clams ",
        "ingredients": [
            "1 tablespoon coconut oil",
            "3 shallots, halved lengthwise and sliced",
            "1 stalk fresh lemongrass",
            "1/2 cup vegetable broth or chicken stock, preferably homemade",
            "1 (1-inch) piece of fresh ginger, peeled and cut into matchsticks",
            "2 jalapeño peppers, seeded and sliced",
            "2 tablespoons Asian fish sauce",
            "1 tablespoon light brown sugar",
            "1/2 cup canned full-fat coconut milk (not refrigerated nondairy beverage)",
            "2 pounds clams, scrubbed",
            "Salt and freshly ground black pepper to taste",
            "1 scallion (white and green parts), chopped",
            "1/2 cup fresh cilantro leaves, chopped",
            "1 lime, cut into wedges, for squeezing"
        ],
        "instructions": [
            "Using the sauté function, heat the oil in the pressure cooker. Add the shallots and sauté until they are soft and browned at the edges, 3 to 5 minutes.",
            "Meanwhile, peel the outer layers from the lemongrass stalk and smash the inner core with the side of a heavy knife to bruise it (this helps release the flavor). Finely chop the core.",
            "Add the lemongrass to the pot along with the stock, ginger, jalapeños, fish sauce, and brown sugar. Stir until the sugar has dissolved, and then bring the sauce up to a simmer, and simmer for 1 minute. Stir in the coconut milk and simmer until it has reduced by a third and is beginning to thicken, 5 minutes.",
            "Add the clams, cover, and cook on low pressure for 1 minute. Release the pressure manually. Discard any clams that didn’t open. Taste the sauce, and season it with salt and pepper to taste.",
            "Serve the clams in bowls, spooning some broth over them and garnishing with the scallion, cilantro, and a squeeze of lime juice."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a68f675553f553fc8508a1a/6:4/w_274%2Ch_169/thai-coconut-clams-recipe-melissa-clark-012418.jpg"
    }
}