{
    "recipe": {
        "title": "Iron-Skillet Peach Crisp ",
        "ingredients": [
            "1 cup all-purpose flour",
            "2/3 cup (packed) light brown sugar",
            "1/2 teaspoon kosher salt",
            "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
            "1 1/2 cups pecans",
            "2 tablespoons unsalted butter, room temperature",
            "2 1/4 pounds peaches (about 7 medium), cut into 1/2\" wedges",
            "1/3 cup (packed) light brown sugar",
            "1/4 cup granulated sugar",
            "3 tablespoons fresh lemon juice",
            "1/2 teaspoon garam masala",
            "1/2 teaspoon kosher salt"
        ],
        "instructions": [
            "Topping: Whisk flour, brown sugar, and salt in a medium bowl. Rub in butter with your fingers until clumps form and no dry spots remain.",
            "Whisk flour, brown sugar, and salt in a medium bowl. Rub in butter with your fingers until clumps form and no dry spots remain.",
            "Assembly: Preheat oven to 350°F. Toast pecans on a rimmed baking sheet, tossing once, until slightly darkened in color, 8–10 minutes. Let cool, then coarsely chop. Smear bottom and sides of a 10\" cast-iron skillet with butter. Toss pecans, peaches, brown sugar, granulated sugar, lemon juice, garam masala, and salt in a large bowl to combine. Transfer to skillet and crumble topping, breaking up into large pieces, over filling. Bake crisp until topping is golden brown and juices are thick and bubbling around the edges, 25–35 minutes.",
            "Preheat oven to 350°F. Toast pecans on a rimmed baking sheet, tossing once, until slightly darkened in color, 8–10 minutes. Let cool, then coarsely chop.",
            "Smear bottom and sides of a 10\" cast-iron skillet with butter. Toss pecans, peaches, brown sugar, granulated sugar, lemon juice, garam masala, and salt in a large bowl to combine. Transfer to skillet and crumble topping, breaking up into large pieces, over filling.",
            "Bake crisp until topping is golden brown and juices are thick and bubbling around the edges, 25–35 minutes.",
            "Do Ahead Crisp can be made 1 day ahead. Store lightly covered at room temperature.",
            "Crisp can be made 1 day ahead. Store lightly covered at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55afe1876284773353bf3823/6:4/w_274%2Ch_169/56389711_iron-skillet-peach-crisp_1x1.jpg"
    }
}