{
    "recipe": {
        "title": "Istanbul-Style Wet Burger (Islak Burger) ",
        "ingredients": [
            "1 1/2 pounds ground beef chuck (20% fat)",
            "2 tablespoons chopped parsley",
            "2 large garlic cloves, finely chopped, divided",
            "1 1/2 teaspoons paprika, divided",
            "5 tablespoons (or more) unsalted butter, divided",
            "1/4 cup tomato paste",
            "4 hamburger or brioche buns",
            "1 tablespoon vegetable oil",
            "2 teaspoons kosher salt",
            "1 teaspoon freshly ground black pepper"
        ],
        "instructions": [
            "Preheat oven to 400°F. Mix beef, parsley, half of garlic, and 1 tsp. paprika in a large bowl. Divide into 4 loosely packed patties 4\" wide and 3/4\" thick. Make a small indentation in the center with your thumb to help keep it flat as it grills. Chill until ready to use. Meanwhile, cook 4 Tbsp. butter and remaining garlic in a medium saucepan over medium heat, swirling pan occasionally, until butter turns caramel-brown and smells nutty, about 5 minutes. Add tomato paste and remaining 1/2 tsp. paprika, whisk to combine, and cook until paste begins to caramelize, about 30 seconds. Add 3/4 cup water and whisk until smooth; simmer until mixture thickens slightly, about 5 minutes. Remove from heat. Heat a large cast-iron skillet over medium-high. Melt 1 Tbsp. butter and cook buns, cut side down, until cut sides are golden-brown, about 2 minutes (you may need to do this in 2 batches, using additional butter if needed). Using a brush, generously brush cut side of buns with tomato sauce. Transfer buns to a 13x9\" glass baking pan. Add oil to skillet and increase heat to high; heat until oil begins to smoke. Season patties on both sides with salt and pepper. Reduce heat to medium and cook burgers until lightly charred on the bottom, 2–3 minutes. Flip and cook to desired doneness, 2–3 minutes for medium-rare. Transfer burgers to pan with sauce and coat burgers in sauce. Transfer burgers to bun bottoms and top with top bun. Brush top of bun with sauce. Cover pan with foil, transfer to oven, and bake 5 minutes. Carefully remove foil and serve immediately.",
            "Preheat oven to 400°F. Mix beef, parsley, half of garlic, and 1 tsp. paprika in a large bowl. Divide into 4 loosely packed patties 4\" wide and 3/4\" thick. Make a small indentation in the center with your thumb to help keep it flat as it grills. Chill until ready to use.",
            "Meanwhile, cook 4 Tbsp. butter and remaining garlic in a medium saucepan over medium heat, swirling pan occasionally, until butter turns caramel-brown and smells nutty, about 5 minutes. Add tomato paste and remaining 1/2 tsp. paprika, whisk to combine, and cook until paste begins to caramelize, about 30 seconds. Add 3/4 cup water and whisk until smooth; simmer until mixture thickens slightly, about 5 minutes. Remove from heat.",
            "Heat a large cast-iron skillet over medium-high. Melt 1 Tbsp. butter and cook buns, cut side down, until cut sides are golden-brown, about 2 minutes (you may need to do this in 2 batches, using additional butter if needed). Using a brush, generously brush cut side of buns with tomato sauce. Transfer buns to a 13x9\" glass baking pan.",
            "Add oil to skillet and increase heat to high; heat until oil begins to smoke. Season patties on both sides with salt and pepper. Reduce heat to medium and cook burgers until lightly charred on the bottom, 2–3 minutes. Flip and cook to desired doneness, 2–3 minutes for medium-rare.",
            "Transfer burgers to pan with sauce and coat burgers in sauce. Transfer burgers to bun bottoms and top with top bun. Brush top of bun with sauce. Cover pan with foil, transfer to oven, and bake 5 minutes. Carefully remove foil and serve immediately.",
            "Do Ahead Raw burger patties and sauce can be made 3 days ahead; cover separately and chill. Reheat sauce in a medium saucepan over medium, whisking until smooth.",
            "Raw burger patties and sauce can be made 3 days ahead; cover separately and chill. Reheat sauce in a medium saucepan over medium, whisking until smooth."
        ],
        "picture_link": "https://assets.epicurious.com/photos/589e00796833cbab37a9c579/6:4/w_274%2Ch_169/Istanbul-Style-Wet-Burger-cooking-after-dark-09022017.jpg"
    }
}