{
    "recipe": {
        "title": "Italian Sausage Meatball Heroes ",
        "ingredients": [
            "1 pound spicy or sweet Italian sausages, casings removed",
            "1 (23- to 24-ounce) container purchased fresh marinara sauce, divided",
            "1/2 cup freshly grated Parmesan cheese (about 1 1/2 ounces)",
            "1/3 cup chopped fresh Italian parsley, divided",
            "1/3 cup chopped fresh basil, divided",
            "4 (5- to 6-inch-long) pieces French baguette, split horizontally",
            "1 cup (packed) coarsely grated whole-milk mozzarella cheese"
        ],
        "instructions": [
            "Preheat oven to 400°F. Mix sausage, 1/2 cup marinara, Parmesan, 2 tablespoons parsley, and 2 tablespoons basil in large bowl. Using wet hands, shape mixture into 8 meatballs. Bring 2 tablespoons parsley, 2 tablespoons basil, remaining marinara, and meatballs to boil in large skillet. Cover, reduce heat, and simmer until meatballs are cooked through, turning often, about 20 minutes. Place baguette bottoms on baking sheet; spread each with about 2 tablespoons sauce from skillet. Cut meatballs in half in skillet; overlap 4 halves on each baguette bottom. Spoon remaining sauce over meatballs, then sprinkle mozzarella over, dividing equally. Bake until cheese melts, about 5 minutes. Sprinkle with remaining parsley and basil and cover with baguette tops.",
            "Preheat oven to 400°F. Mix sausage, 1/2 cup marinara, Parmesan, 2 tablespoons parsley, and 2 tablespoons basil in large bowl. Using wet hands, shape mixture into 8 meatballs. Bring 2 tablespoons parsley, 2 tablespoons basil, remaining marinara, and meatballs to boil in large skillet. Cover, reduce heat, and simmer until meatballs are cooked through, turning often, about 20 minutes.",
            "Place baguette bottoms on baking sheet; spread each with about 2 tablespoons sauce from skillet. Cut meatballs in half in skillet; overlap 4 halves on each baguette bottom. Spoon remaining sauce over meatballs, then sprinkle mozzarella over, dividing equally. Bake until cheese melts, about 5 minutes. Sprinkle with remaining parsley and basil and cover with baguette tops."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d999ef9a84192308a1a5c/6:4/w_274%2Ch_169/238290.jpg"
    }
}