{
    "recipe": {
        "title": "Italian Parsley and Beet Salad ",
        "ingredients": [
            "1/4 cup fresh orange juice",
            "1 tablespoon fresh lemon juice",
            "1/4 cup extra-virgin olive oil plus more for drizzling",
            "2 1/4 pounds assorted beets with greens (such as Chioggia, white, golden, and red; 1 1/2 pounds if already trimmed)",
            "1/4 small red onion",
            "1 1/4 cups Italian (flat-leaf) parsley leaves (from 1 bunch), torn if desired",
            "Equipment: an adjustable-blade slicer",
            "Accompaniment: fresh ricotta or farmer cheese, or grated ricotta salata"
        ],
        "instructions": [
            "Whisk together juices, oil, and 1/2 teaspoon each of salt and pepper in a large bowl. Trim beets, leaving 1 inch of stems attached, then peel. Using stems as a handle, slice beets paper-thin (less than 1/8 inch thick) with slicer (wear protective gloves to avoid staining hands), then cut slices into very thin matchsticks. Thinly slice onion with slicer. Toss beets, onion, and parsley with dressing and season with salt. Let stand, tossing occasionally, 30 minutes to soften beets and allow flavors to develop. Toss again and season with salt and pepper before serving drizzled with additional oil.",
            "Whisk together juices, oil, and 1/2 teaspoon each of salt and pepper in a large bowl.",
            "Trim beets, leaving 1 inch of stems attached, then peel.",
            "Using stems as a handle, slice beets paper-thin (less than 1/8 inch thick) with slicer (wear protective gloves to avoid staining hands), then cut slices into very thin matchsticks.",
            "Thinly slice onion with slicer.",
            "Toss beets, onion, and parsley with dressing and season with salt. Let stand, tossing occasionally, 30 minutes to soften beets and allow flavors to develop.",
            "Toss again and season with salt and pepper before serving drizzled with additional oil."
        ],
        "picture_link": "https://assets.epicurious.com/photos/550b0804b1a50e633781b44a/6:4/w_274%2Ch_169/354973_italian-parsley-beet-salad_6x4.jpg"
    }
}