{
    "recipe": {
        "title": "Jade Dumplings with Soy-Sesame Dipping Sauce ",
        "ingredients": [
            "1/3 cup soy sauce",
            "1 green onion, very thinly sliced",
            "2 tablespoons rice vinegar",
            "2 teaspoons oriental sesame oil",
            "1 tablespoon minced fresh ginger",
            "1 garlic clove, peeled",
            "12 ounces fresh asparagus, trimmed, quartered crosswise",
            "1 8-ounce can whole water chestnuts, drained",
            "3 green onions, quartered",
            "1 teaspoon oriental sesame oil",
            "1 teaspoon soy sauce",
            "1/4 teaspoon coarse kosher salt",
            "All purpose flour",
            "36 wonton wrappers",
            "Romaine lettuce leaves"
        ],
        "instructions": [
            "Stir all ingredients in small bowl to blend.",
            "For dumplings: Finely mince ginger and garlic in food processor. Add asparagus and next 5 ingredients; using on/off turns, process until asparagus is finely chopped but not pureed. Sprinkle baking sheet with flour. Place 1 wonton wrapper on work surface. Spoon 2 teaspoons asparagus mixture into center. Moisten edges of wrapper with water; gather corners together over filling. Twist edges of wrapper together, enclosing filling completely. Place dumpling on baking sheet. Repeat with remaining wrappers and filling. (Sauce and dumplings can be made 8 hours ahead. Cover separately and chill.) Place steamer rack in large pot. Pour enough water into pot to reach depth of 1/2 inch. Line steamer rack with lettuce leaves. Bring water to simmer. Working in batches, arrange dumplings side by side (but not touching) on rack. Cover and steam 15 minutes. Serve dumplings with dipping sauce.",
            "Finely mince ginger and garlic in food processor. Add asparagus and next 5 ingredients; using on/off turns, process until asparagus is finely chopped but not pureed.",
            "Sprinkle baking sheet with flour. Place 1 wonton wrapper on work surface. Spoon 2 teaspoons asparagus mixture into center. Moisten edges of wrapper with water; gather corners together over filling. Twist edges of wrapper together, enclosing filling completely. Place dumpling on baking sheet. Repeat with remaining wrappers and filling. (Sauce and dumplings can be made 8 hours ahead. Cover separately and chill.)",
            "Place steamer rack in large pot. Pour enough water into pot to reach depth of 1/2 inch. Line steamer rack with lettuce leaves. Bring water to simmer. Working in batches, arrange dumplings side by side (but not touching) on rack. Cover and steam 15 minutes.",
            "Serve dumplings with dipping sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56ba76e7bfad96b72dbcc7c4/6:4/w_274%2Ch_169/107838.jpg"
    }
}