{
    "recipe": {
        "title": "Jalapeño Poppers with Smoked Gouda ",
        "ingredients": [
            "12 large jalapeño chiles",
            "4 ounces cream cheese",
            "1 cup finely shredded smoked Gouda",
            "Salt",
            "Chopped fresh cilantro for serving"
        ],
        "instructions": [
            "Start the coals or heat a gas grill for medium direct cooking. Make sure the grates are clean.",
            "Cut the jalapeños in half lengthwise but leave the halves connected at the stem. With your finger or a pointed spoon (like a grapefruit spoon), remove the seeds and white ribs from the halves. (Wear rubber gloves, or be careful not to touch your skin after handling the chiles.)",
            "Put the cream cheese and Gouda in a medium bowl with a little salt; mash until combined. Fill the jalapeño halves evenly with a small spoon and press the halves back together to close. (You can fill and refrigerate the jalapeños up to a day ahead.)",
            "Put the jalapeños on the grill directly over the fire. Close the lid and cook, carefully turning once, until the peppers have softened and browned (it’s okay if they char in spots) and the cheese has melted, 5 to 10 minutes. Transfer to a platter, sprinkle with cilantro, and serve.",
            "Variations: Honey-Orange Jalapeño Poppers: In Step 3, fill the jalapeños with a mixture of 1 1/2 cups crumbled fresh goat cheese (6 ounces), 2 tablespoons honey, 1 tablespoon grated orange zest, and salt to taste. Jalapeño Poppers with Pimento Cheese and Pepper Jelly: In Step 3, fill the jalapeños with with a mixture of 1 cup grated extra-sharp cheddar cheese (4 ounces), 1/4 cup each chopped drained pimentos and mayonnaise, and a dash of Worcestershire sauce. Serve topped with a dab of pepper jelly. Pesto Jalapeño Poppers with Mozzarella: In Step 3, fill the jalapeños with a mixture of 1 1/2 cups shredded mozzarella (6ounces) and 1/4 cup basil pesto. Serve the poppers topped with fresh basil leaves if you like.",
            "Honey-Orange Jalapeño Poppers: In Step 3, fill the jalapeños with a mixture of 1 1/2 cups crumbled fresh goat cheese (6 ounces), 2 tablespoons honey, 1 tablespoon grated orange zest, and salt to taste.",
            "Jalapeño Poppers with Pimento Cheese and Pepper Jelly: In Step 3, fill the jalapeños with with a mixture of 1 cup grated extra-sharp cheddar cheese (4 ounces), 1/4 cup each chopped drained pimentos and mayonnaise, and a dash of Worcestershire sauce. Serve topped with a dab of pepper jelly.",
            "Pesto Jalapeño Poppers with Mozzarella: In Step 3, fill the jalapeños with a mixture of 1 1/2 cups shredded mozzarella (6ounces) and 1/4 cup basil pesto. Serve the poppers topped with fresh basil leaves if you like."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5afb3dcf30e5845bbfbdaf26/6:4/w_274%2Ch_169/Jalapen%CC%83o%20Poppers%20with%20Smoked%20Gouda%20(c)%20Christina%20Holmes.jpg"
    }
}