{
    "recipe": {
        "title": "Jam Bars ",
        "ingredients": [
            "1/2 cup/110g unsalted butter or coconut oil, at room temperature",
            "1/3 cup/85g almond butter",
            "2 Tbsp brown rice syrup or maple syrup",
            "1 1/2 cups/150g rolled oats",
            "1 cup/120g almond flour",
            "1 cup/120g oat flour",
            "6 Tbsp/90g granulated sugar",
            "1 tsp baking powder",
            "1/2 tsp sea salt, plus one pinch",
            "1/2 tsp vanilla extract",
            "1/2 tsp almond extract",
            "1/2 tsp ground cinnamon",
            "1 cup plus 2 Tbsp/340g jam",
            "1 tsp lemon juice",
            "Pinch of sea salt"
        ],
        "instructions": [
            "Preheat the oven to 350°F/180°C. Line a 9 by 13-inch/23 by 33cm baking pan with parchment paper. Combine the butter or coconut oil, almond butter, and brown rice syrup or maple syrup in a large bowl and, using a wooden spoon, mix well.",
            "Add the rolled oats, almond flour, oat flour, sugar, baking powder, salt, vanilla and almond extracts, and cinnamon to the butter mixture and stir until a soft dough forms. Divide the dough into thirds. Press two-thirds of the dough into the bottom of the prepared pan and reserve the remaining one-third for the topping.",
            "Stir together the jam, lemon juice, and salt and then spread the mixture evenly over the bottom crust.",
            "Crumble the remaining one-third dough over the jam filling.",
            "Bake the jam bars until golden brown around the edges, about 35 minutes. Let the pastry cool completely in the pan on a wire rack before cutting into bars.",
            "The jam bars will keep, well wrapped, at room temperature for up to 4 days.",
            "Variation: Jam Bars with Chopped Nuts: If you’re after textural contrast, chopped nuts added to the top layer give these jam bars extra crunch. After separating the dough, set aside the slightly larger portion to be used for the bottom. Add 1/2 cup/40g sliced almonds or 1/2 cup/50g chopped walnuts to the other third, which will be used for the crumble on top.",
            "Jam Bars with Chopped Nuts: If you’re after textural contrast, chopped nuts added to the top layer give these jam bars extra crunch. After separating the dough, set aside the slightly larger portion to be used for the bottom. Add 1/2 cup/40g sliced almonds or 1/2 cup/50g chopped walnuts to the other third, which will be used for the crumble on top."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58d41e72cd9936798f01a0e6/6:4/w_274%2Ch_169/tartine-jam-bars-032317.jpg",
        "color": 15648338
    }
}