{
    "recipe": {
        "title": "Jam Crumb Cake ",
        "ingredients": [
            "1 cup all-purpose flour",
            "1/2 cup sugar",
            "1 3/4 teaspoons baking powder",
            "1/4 teaspoon salt",
            "3/4 stick unsalted butter, melted",
            "1/2 cup milk",
            "1 large egg",
            "1/2 cup raspberry jam or preserves",
            "3/4 stick unsalted butter, melted",
            "1/4 cup packed brown sugar",
            "1/4 cup granulated sugar",
            "3/4 teaspoon cinnamon",
            "1/8 teaspoon salt",
            "1 cup plus 2 tablespoons all-purpose flour"
        ],
        "instructions": [
            "Make cake: Preheat oven to 400°F with rack in middle. Generously butter a 9-inch square or round cake pan. Whisk together flour, sugar, baking powder, and salt. Whisk together butter, milk, and egg in a large bowl, then whisk in flour mixture until just combined. Pour batter into cake pan. Dollop jam all over surface, then swirl into batter with spoon.",
            "Preheat oven to 400°F with rack in middle. Generously butter a 9-inch square or round cake pan.",
            "Whisk together flour, sugar, baking powder, and salt.",
            "Whisk together butter, milk, and egg in a large bowl, then whisk in flour mixture until just combined. Pour batter into cake pan. Dollop jam all over surface, then swirl into batter with spoon.",
            "Make crumb topping: Whisk together butter, sugars, cinnamon, and salt until smooth. Stir in flour, then blend with your fingertips until incorporated. Sprinkle crumbs in large clumps over top of cake. Bake cake until a wooden pick inserted in center comes out clean and sides begin to pull away from pan, about 25 minutes. Cool in pan on a rack 5 minutes.",
            "Whisk together butter, sugars, cinnamon, and salt until smooth. Stir in flour, then blend with your fingertips until incorporated. Sprinkle crumbs in large clumps over top of cake.",
            "Bake cake until a wooden pick inserted in center comes out clean and sides begin to pull away from pan, about 25 minutes. Cool in pan on a rack 5 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9abcf9a84192308a1d34/6:4/w_274%2Ch_169/240948_hires.jpg"
    }
}