{
    "recipe": {
        "title": "Janet McCracken's Rib Roast with Tapenade ",
        "ingredients": [
            "1 cup brine-cured pitted black olives (such as Kalamata)",
            "1 cup brine-cured pitted green olives (such as Picholine)",
            "1/4 cup extra-virgin olive oil",
            "2 tablespoons chopped fresh thyme",
            "2 tablespoons drained capers",
            "1 tablespoon chopped fresh rosemary",
            "3 garlic cloves, chopped",
            "1 anchovy fillet packed in oil, drained",
            "1 four-bone standing beef rib-eye roast (about 11 pounds), chine bone removed, fat trimmed to 1/4\"-1/2\" thick",
            "1 1/2 tablespoons kosher salt plus more",
            "Freshly ground black pepper",
            "1 cup dry red wine (such as Merlot)",
            "2 cups reduced-sodium chicken or beef broth",
            "2 sprigs thyme",
            "2 tablespoons (1/4 stick) unsalted butter, room temperature, divided",
            "1 tablespoon all-purpose flour"
        ],
        "instructions": [
            "Pulse all ingredients in a food processor until a coarse purée forms. DO AHEAD: Tapenade can be made 1 week ahead. Place in a small bowl. Cover; chill.",
            "For roast and sauce: Line a rimmed baking sheet with plastic wrap, leaving a long overhang on both ends. Place roast on top. Season meat with salt and pepper, then rub tapenade all over roast. (If fat cap is thicker than 1/4\", cut in between fat and meat, starting on side of fat farthest from bones and continuing to within about 1\" of bones; your butcher can do this for you. Peel back layer of fat, leaving attached; season meat and spread some of tapenade under fat. This will help seasoning penetrate the meat. Lay fat back over meat.) Tie 2 pieces of kitchen twine crosswise and 2 pieces lengthwise around roast to secure. Wrap tightly with excess plastic wrap and chill overnight. Let roast stand at room temperature for 1 hour before cooking. Preheat oven to 425°F. Unwrap roast; set on a rack inside a deep roasting pan. Pour 2 cups water into bottom of pan. Roast meat until deep brown, about 40 minutes. Reduce heat to 325°F and continue to roast until an instant-read thermometer inserted into the thickest part of meat registers 120°F for medium-rare (temperature will climb to 125°F after removed from oven), about 1 1/2 hours longer. Transfer rack with roast to a cutting board; let rest for at least 30 minutes. Meanwhile, pour off fat from roasting pan; discard fat. Add wine to pan, set over medium heat, and cook, stirring to dissolve any browned bits from bottom of pan. Transfer liquid to a medium skillet and bring to a boil over medium-high heat. Reduce heat and simmer until wine is reduced to 1/4 cup, 7-8 minutes. Add broth and thyme sprigs; cook until reduced to 3/4 cup, about 15 minutes. Stir 1 tablespoon butter and flour in a small bowl until well blended. Whisk half of butter mixture into pan sauce. Return to a simmer and season to taste with salt and pepper. Sauce should be thick enough to coat a spoon but still runny. Whisk in remaining butter mixture to thicken more, if desired. Whisk in remaining 1 tablespoon butter. Carve roast. Serve sauce alongside.",
            "Line a rimmed baking sheet with plastic wrap, leaving a long overhang on both ends. Place roast on top. Season meat with salt and pepper, then rub tapenade all over roast. (If fat cap is thicker than 1/4\", cut in between fat and meat, starting on side of fat farthest from bones and continuing to within about 1\" of bones; your butcher can do this for you. Peel back layer of fat, leaving attached; season meat and spread some of tapenade under fat. This will help seasoning penetrate the meat. Lay fat back over meat.)",
            "Tie 2 pieces of kitchen twine crosswise and 2 pieces lengthwise around roast to secure. Wrap tightly with excess plastic wrap and chill overnight. Let roast stand at room temperature for 1 hour before cooking.",
            "Preheat oven to 425°F. Unwrap roast; set on a rack inside a deep roasting pan. Pour 2 cups water into bottom of pan. Roast meat until deep brown, about 40 minutes. Reduce heat to 325°F and continue to roast until an instant-read thermometer inserted into the thickest part of meat registers 120°F for medium-rare (temperature will climb to 125°F after removed from oven), about 1 1/2 hours longer. Transfer rack with roast to a cutting board; let rest for at least 30 minutes.",
            "Meanwhile, pour off fat from roasting pan; discard fat. Add wine to pan, set over medium heat, and cook, stirring to dissolve any browned bits from bottom of pan. Transfer liquid to a medium skillet and bring to a boil over medium-high heat. Reduce heat and simmer until wine is reduced to 1/4 cup, 7-8 minutes. Add broth and thyme sprigs; cook until reduced to 3/4 cup, about 15 minutes.",
            "Stir 1 tablespoon butter and flour in a small bowl until well blended. Whisk half of butter mixture into pan sauce. Return to a simmer and season to taste with salt and pepper. Sauce should be thick enough to coat a spoon but still runny. Whisk in remaining butter mixture to thicken more, if desired. Whisk in remaining 1 tablespoon butter.",
            "Carve roast. Serve sauce alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b053c7a7baf2e46eefc168/6:4/w_274%2Ch_169/51134520_rib-roast_1x1.jpg",
        "color": 8856235
    }
}