{
    "recipe": {
        "title": "Jerk-Spiced Duck ",
        "ingredients": [
            "2 (5–5 1/2-lb.) ducks",
            "Kosher salt",
            "2 Tbsp. allspice berries",
            "2 whole nutmegs",
            "16 habanero chiles, stems removed",
            "1 cup soy sauce",
            "1/2 cup spiced rum",
            "1/2 cup unseasoned rice vinegar",
            "4 tsp. sugar",
            "2 (2\") pieces ginger, scrubbed, crushed",
            "Hoisin sauce, small flour tortillas, sliced Napa cabbage, sliced scallions, julienned peeled ginger, sliced serrano chiles, mint sprigs, cilantro sprigs, and lime wedges (for serving)",
            "A razor blade and a spice mill or mortar and pestle"
        ],
        "instructions": [
            "Lightly score skin of both ducks using a clean razor blade, cutting most of the way through skin and fat but not into flesh below (a very sharp, thin knife will also work). Season ducks generously with salt and place each one in a large resealable plastic bag.",
            "Finely grind allspice in spice mill or with mortar and pestle and place in a blender. Finely grate nutmeg into blender. Add habanero chiles (we recommend keeping the seeds in as the ducks’ fat will keep it from absorbing too much heat), soy sauce, rum, vinegar, and sugar. Purée until smooth. Divide marinade between bags; add a piece of ginger to each. Seal bags, pressing out air, and work marinade around to coat ducks. Chill, breast side down, 12 hours.",
            "Preheat oven to 450°F. Remove ducks from marinade and place, breast side up, on a wire rack set inside a foil-lined rimmed baking sheet (don’t worry about any marinade that may be inside ducks; it will add flavor as they cook). Roast ducks just until beginning to brown, 10–12 minutes. Reduce oven temperature to 250°F and continue to roast until ducks are very dark brown, leg joints wiggle freely when flexed, and an instant-read thermometer inserted into the thickest part of breasts registers 195°F, 4 1/2–5 hours. Let rest 30 minutes before shredding.",
            "To serve, pile meat on hoisin-slicked tortillas and top with cabbage, scallions, ginger, serrano chiles, mint, and cilantro as desired; squeeze lime wedges over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c11460a76ebdc6941b82c3d/6:4/w_274%2Ch_169/jerk-spiced-duck-recipe-BA-121218.jpg"
    }
}