{
    "recipe": {
        "title": "Jumbo Shrimp Marsala Housewife-Style (Gamberoni alla Casalinga Siciliana) ",
        "ingredients": [
            "1/4 cup extra-virgin olive oil",
            "1 medium red onion, cut into 1/4-inch dice",
            "1 rib celery with leaves, cut into 1/2-inch pieces",
            "4 medium plum tomatoes, roughly chopped",
            "1 tablespoon pine nuts",
            "1 tablespoon currants",
            "2 tablespoons small capers, rinsed and drained",
            "1 cup dry marsala",
            "1/2 teaspoon fennel seeds",
            "1/2 teaspoon hot red pepper flakes",
            "1 bay leaf, preferably fresh",
            "2 pounds jumbo (U-12) shrimp, pealed and de veined",
            "Salt and freshly ground black pepper"
        ],
        "instructions": [
            "1. In a 10- to 12-inch sauté pan, heat the olive oil over medium-high heat until almost smoking. Add the onion and celery and cook until softened. Add the tomatoes, pine nuts, currants, capers, marsala, fennel seeds, red pepper flakes, and bay leaf and bring to a boil. 2. Remove the pan from heat and lay the shrimp in one layer in the tomato mixture. Cover, set over low heat, and simmer for 4 minutes. Remove from the heat, season with salt and pepper to taste, and allow to stand for 5 minutes, covered. 3. Serve warm, or allow to cool to room temperature.",
            "1. In a 10- to 12-inch sauté pan, heat the olive oil over medium-high heat until almost smoking. Add the onion and celery and cook until softened. Add the tomatoes, pine nuts, currants, capers, marsala, fennel seeds, red pepper flakes, and bay leaf and bring to a boil.",
            "2. Remove the pan from heat and lay the shrimp in one layer in the tomato mixture. Cover, set over low heat, and simmer for 4 minutes. Remove from the heat, season with salt and pepper to taste, and allow to stand for 5 minutes, covered.",
            "3. Serve warm, or allow to cool to room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5846f05703686d890b756b87/6:4/w_274%2Ch_169/Jumbo%20Shrimp%20Marsala%20Housewife-Style.jpg"
    }
}