{
    "recipe": {
        "title": "Kabocha Squash Cake with Brown Sugar Cream ",
        "ingredients": [
            "1 tablespoon water",
            "1/2 teaspoon unflavored gelatin",
            "2 cups heavy whipping cream",
            "1/3 cup (packed) golden brown sugar",
            "3 large egg whites",
            "2 cups 3/4-inch cubes peeled seeded kabocha squash (from one 3-pound squash)",
            "1 cup whole milk",
            "1 vanilla bean, split lengthwise",
            "Nonstick vegetable oil spray",
            "2/3 cup (packed) golden brown sugar",
            "6 tablespoons olive oil",
            "1/4 cup lager (mild-flavored beer)",
            "1 large egg",
            "3/4 cup all purpose flour",
            "1/2 teaspoon ground cinnamon",
            "1/4 teaspoon baking soda",
            "1/4 teaspoon salt"
        ],
        "instructions": [
            "Place 1 tablespoon water in cup. Sprinkle gelatin over. Let stand 10 minutes to soften.",
            "Stir cream and sugar in medium saucepan over medium heat until sugar dissolves. Add egg whites and whisk until mixture thickens, about 12 minutes (do not boil). Add gelatin mixture; whisk until dissolved. Strain into large clean bowl. Chill until cold. Cover and chill overnight.",
            "For cakes: Combine squash and milk in heavy small saucepan. Scrape in seeds from vanilla bean; add bean. Bring to simmer over medium heat. Partially cover, reduce heat to medium-low, and simmer until squash is very tender, about 20 minutes. Remove vanilla bean. Drain squash. Place in processor and blend until smooth. DO AHEAD: Can be made 1 day ahead. Cover and chill. Preheat oven to 375°F. Spray six 3/4cup ramekins with nonstick spray. Place 1/2 cup squash puree in large bowl (reserve remaining puree for another use). Add sugar, oil, beer, and egg to puree and beat to blend. Sift flour, cinnamon, baking soda, and salt over; beat to blend. Divide batter among prepared ramekins. Bake cakes until tester inserted into center comes out clean, about 18 minutes. Cool cakes in ramekins. Turn out onto plates. Beat brown sugar cream to firm peaks; spoon alongside cakes.",
            "Combine squash and milk in heavy small saucepan. Scrape in seeds from vanilla bean; add bean. Bring to simmer over medium heat. Partially cover, reduce heat to medium-low, and simmer until squash is very tender, about 20 minutes. Remove vanilla bean. Drain squash. Place in processor and blend until smooth. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
            "Preheat oven to 375°F. Spray six 3/4cup ramekins with nonstick spray. Place 1/2 cup squash puree in large bowl (reserve remaining puree for another use). Add sugar, oil, beer, and egg to puree and beat to blend. Sift flour, cinnamon, baking soda, and salt over; beat to blend. Divide batter among prepared ramekins.",
            "Bake cakes until tester inserted into center comes out clean, about 18 minutes. Cool cakes in ramekins. Turn out onto plates. Beat brown sugar cream to firm peaks; spoon alongside cakes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56016c6bbd6b8b837d72d4b7/6:4/w_274%2Ch_169/0907-BA-DES1-02.jpg"
    }
}