{
    "recipe": {
        "title": "Kale Salad with Persimmons, Feta, and Crisp Prosciutto ",
        "ingredients": [
            "3 ounces thinly sliced prosciutto",
            "1/3 cup pecans (1 1/2 ounces)",
            "1/4 cup fresh lime juice (from about 2 limes)",
            "1 tablespoon Dijon mustard",
            "1 tablespoon finely chopped shallot",
            "1 teaspoon honey",
            "1 small garlic clove, finely grated",
            "Kosher salt",
            "Freshly ground black pepper",
            "1/2 cup extra-virgin olive oil",
            "1 1/2 pounds Tuscan kale (about 2 large bunches), stemmed, leaves thinly sliced",
            "2 Fuyu persimmons, peeled, halved lengthwise, thinly sliced",
            "3 ounces firm, creamy feta cheese, such as Bulgarian, crumbled (about 3/4 cup)",
            "1 cup loosely packed mint leaves, thinly sliced, plus more for serving"
        ],
        "instructions": [
            "Heat oven to 350°F. Lay out prosciutto slices on a rimmed baking sheet. Bake until almost crisp, 16–18 minutes. Transfer to wire rack and let cool completely on baking sheet (prosciutto will continue to crisp as it cools). Crumble and set aside.",
            "Meanwhile, spread pecans on a rimmed baking sheet and toast in oven, tossing once or twice, until fragrant, 8–10 minutes. Let cool, then coarsely chop. Set aside.",
            "Whisk lime juice, mustard, shallot, honey, garlic, 1 tsp. salt, and 1/4 tsp. pepper in a medium bowl, then whisk in oil in a slow, steady stream. Set aside.",
            "In a large mixing bowl, combine kale with about 3/4 of the dressing and use your hands to massage dressing into kale. Add more dressing as needed (you may not need all of it). Reserve any leftover dressing for another use.",
            "Add half of the persimmons, feta, mint, and prosciutto, toss together to combine, and season with salt and pepper to taste. Transfer to a serving bowl, and top with pecans and remaining persimmons, feta, mint, and prosciutto.",
            "Do ahead Dressing can be prepared 3 days ahead; cover and chill. Nuts can be toasted and chopped 1 day ahead; cover and keep at room temperature. Kale can be sliced 1 day ahead; place in an airtight container and chill. Salad can be tossed together 30 minutes ahead; keep at room temperature.",
            "Dressing can be prepared 3 days ahead; cover and chill. Nuts can be toasted and chopped 1 day ahead; cover and keep at room temperature. Kale can be sliced 1 day ahead; place in an airtight container and chill. Salad can be tossed together 30 minutes ahead; keep at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/563240b2dfc2c10962dd9b2c/6:4/w_274%2Ch_169/EP_10272015_Kale-Salad-with-Persimmons%2C-Feta%2C-and-Crisp-Prosciutto.jpg"
    }
}