{
    "recipe": {
        "title": "Kansas City Spareribs ",
        "ingredients": [
            "3/4 cup (packed) golden brown sugar",
            "1/2 cup paprika",
            "2 1/2 tablespoons coarse salt",
            "2 1/2 tablespoons ground black pepper",
            "1 tablespoon onion powder",
            "1/2 teaspoon cayenne pepper",
            "3 large racks spareribs (about 9 pounds)",
            "8 pounds (about) 100% natural lump charcoal or charcoal briquettes",
            "4 cups (about) hickory wood smoke chips, soaked in cold water at least 30 minutes",
            "1 1/2 cups purchased tomato-based barbecue sauce (such as KC Masterpiece)"
        ],
        "instructions": [
            "Make dry rub: Mix brown sugar, paprika, coarse salt, black pepper, onion powder and cayenne pepper in small bowl for dry rub. Sprinkle 2/3 cup dry rub all over spareribs. Cover ribs with plastic wrap; refrigerate overnight. Cover remaining dry rub; store at room temperature. Unwrap seasoned spareribs; sprinkle all over with half of remaining dry rub. Let spareribs stand at room temperature 30 minutes. Following manufacturer's instructions and using natural lump charcoal and 1/2 cup drained wood chips for smoker or 1 cup for barbecue (see box at right), start fire and bring temperature of smoker to 200°F. to 225°F. or barbecue to 275°F. to 300°F. Arrange ribs on rack in smoker or barbecue. Cover and cook ribs 2 hours, turning occasionally. Add more charcoal as needed to maintain temperature and more drained wood chips (1/2 cup for smoker or 1 cup for barbecue with each addition) to maintain smoke level. Sprinkle ribs evenly with all remaining dry rub. Cover and cook 1 hour 15 minutes. Brush ribs generously with barbecue sauce. Continue cooking until meat is very tender and brown, about 30 minutes longer. Maintain temperature by adding more lump charcoal; maintain smoke level by adding more drained hickory wood chips as needed. Transfer ribs to large serving platter. Let stand 10 minutes. Cut rib racks between bones into individual ribs and serve immediately.",
            "Mix brown sugar, paprika, coarse salt, black pepper, onion powder and cayenne pepper in small bowl for dry rub. Sprinkle 2/3 cup dry rub all over spareribs. Cover ribs with plastic wrap; refrigerate overnight. Cover remaining dry rub; store at room temperature.",
            "Unwrap seasoned spareribs; sprinkle all over with half of remaining dry rub. Let spareribs stand at room temperature 30 minutes.",
            "Following manufacturer's instructions and using natural lump charcoal and 1/2 cup drained wood chips for smoker or 1 cup for barbecue (see box at right), start fire and bring temperature of smoker to 200°F. to 225°F. or barbecue to 275°F. to 300°F. Arrange ribs on rack in smoker or barbecue. Cover and cook ribs 2 hours, turning occasionally. Add more charcoal as needed to maintain temperature and more drained wood chips (1/2 cup for smoker or 1 cup for barbecue with each addition) to maintain smoke level.",
            "Sprinkle ribs evenly with all remaining dry rub. Cover and cook 1 hour 15 minutes. Brush ribs generously with barbecue sauce. Continue cooking until meat is very tender and brown, about 30 minutes longer. Maintain temperature by adding more lump charcoal; maintain smoke level by adding more drained hickory wood chips as needed.",
            "Transfer ribs to large serving platter. Let stand 10 minutes. Cut rib racks between bones into individual ribs and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5612e5dd928970611e0a802c/6:4/w_274%2Ch_169/101807.jpg"
    }
}