{
    "recipe": {
        "title": "Kefi Lamb Gyro ",
        "ingredients": [
            "2 1/4 inch thick slices Spanish or sweet onion",
            "Extra-virgin olive oil",
            "Kosher salt and coarsely cracked black pepper",
            "1 pound well-marbled, finely ground lamb (from the shoulder)",
            "8 ounces finely ground pork",
            "1 teaspoon Dijon mustard",
            "2 teaspoons minced garlic",
            "1 teaspoon ground coriander",
            "1 teaspoon espelette pepper or best-quality chile powder",
            "2 tablespoons minced fresh herbs, such as dill, parsley, and/or chives",
            "1 whole scallion, minced",
            "2 large eggs, beaten",
            "Greek Salad, for serving",
            "Tzatziki, for serving",
            "6 pitas, for serving"
        ],
        "instructions": [
            "Brush the onion slices with a little olive oil and season with kosher salt and pepper. On a hot griddle pan or in a cast-iron skillet, grill the onion until tender. Separate into rings and chop very fine.",
            "Lightly brush a 7 1/2 X 11-inch baking dish with olive oil and preheat the oven to 375°F.",
            "In a large mixing bowl, combine the chopped grilled onion, lamb, pork, mustard, garlic, coriander, espelette, fresh herbs, scallion, and eggs. Season liberally with kosher salt and pepper and thoroughly combine the mixture with clean hands. Transfer to the baking dish and spread out evenly to the edges, smoothing the top flat. Place the dish inside a larger roasting pan and add boiling water to about halfway up the sides of the baking dish.",
            "Bake for 45 minutes, or until the gyro shrinks away from the sides and is quite hot in the middle when pierced with a metal skewer (around 150°F). Remove the pan from the water bath and cool to room temperature. Cover and refrigerate for at least 3 hours or, ideally, 24 hours, to develop the flavors.",
            "Place a large, flat platter upside down over the baking dish. Turn both over, and carefully remove the gyro. With a hot, sharp knife, slice the gyro about 3/8 inch thick. In a very large skillet, warm 1/3 cup oil over medium-high heat. When the oil is very hot, add the gyro slices and sauté for about 2 minutes, shaking the pan around to thoroughly coat the slices with the oil.",
            "Paint the pita with extra-virgin olive oil, season with kosher salt and pepper, and grill until firm and char-marked on all sides. Smear some Tzatziki in the center of each pita round. Divide the gyro meat among the pitas, on top of the tzatziki. Add some Greek Salad. Pull the sides of the pita up to meet in the center, like a taco. Serve like a taco, or wrap and secure with a wide strip of parchment. Messy and great!"
        ],
        "picture_link": "https://assets.epicurious.com/photos/59513832a5db170587cf62b9/6:4/w_274%2Ch_169/shutterstock_220309672.jpg"
    }
}