{
    "recipe": {
        "title": "Key Lime Chia Cheesecake ",
        "ingredients": [
            "6 ounces all-natural or organic graham crackers",
            "2 tablespoons virgin coconut oil or melted unsalted butter",
            "2 teaspoons honey or agave nectar",
            "3 tablespoons freshly squeezed Key lime or regular lime juice (from about 4 1/2 Key limes or 1 1/2 limes)",
            "1/4 cup white chia seeds",
            "1/4 cup purified water",
            "10 ounces Neufchâtel (light cream cheese), at room temperature",
            "1/4 cup raw sugar",
            "1 teaspoon pure vanilla extract",
            "1/8 teaspoon sea salt",
            "1/2 cup heavy whipping cream, well chilled",
            "1 tablespoon honey or agave nectar",
            "6 thin slices Key lime or small lime"
        ],
        "instructions": [
            "Preheat the oven to 350°F.",
            "Place the graham crackers in a food processor. Pulse until coarsely crumbled. Add the oil and honey and blend until finely crumbled. Pour into a standard 9-inch pie pan, pressing firmly to cover the bottom and sides of the pan. Bake until fragrant and firm, about 10 minutes. Transfer the pan to a wire rack to cool completely before filling.",
            "Lower oven to 325°F.",
            "Filling: In a liquid measuring cup or small bowl, whisk together the Key lime juice, 3 1/2 tablespoons of the chia seeds, and water and let stand for about 20 minutes. (Makes 2/3 cup lime-chia gel.) In a large bowl, with an electric mixer on medium speed, mix together the Neufchâtel, sugar, vanilla, and salt until smooth. Add the lime-chia gel and blend until well combined. Pour the batter into the crust and shake gently to settle. Bake until center is nearly set, about 25 minutes. Cool in the pan on a wire rack. Transfer to the refrigerator until well chilled, at least 3 hours.",
            "In a liquid measuring cup or small bowl, whisk together the Key lime juice, 3 1/2 tablespoons of the chia seeds, and water and let stand for about 20 minutes. (Makes 2/3 cup lime-chia gel.)",
            "In a large bowl, with an electric mixer on medium speed, mix together the Neufchâtel, sugar, vanilla, and salt until smooth. Add the lime-chia gel and blend until well combined. Pour the batter into the crust and shake gently to settle. Bake until center is nearly set, about 25 minutes.",
            "Cool in the pan on a wire rack. Transfer to the refrigerator until well chilled, at least 3 hours.",
            "Honey whipped cream: Once the cheesecake has chilled, make the whipped cream. Pour cream into a chilled mixing bowl. Using the wire whisk attachment of an electric mixer, whip the cream on medium speed until it begins to thicken. Drizzle in the honey and whip on medium-high speed until soft peaks form.",
            "Once the cheesecake has chilled, make the whipped cream. Pour cream into a chilled mixing bowl. Using the wire whisk attachment of an electric mixer, whip the cream on medium speed until it begins to thicken. Drizzle in the honey and whip on medium-high speed until soft peaks form.",
            "Presentation: Top the cheesecake with the whipped cream, sprinkle with desired amount of the remaining 1/2 tablespoon of chia seeds, and garnish with Key lime slices. Cut cheesecake into 6 wedges and serve.",
            "Top the cheesecake with the whipped cream, sprinkle with desired amount of the remaining 1/2 tablespoon of chia seeds, and garnish with Key lime slices. Cut cheesecake into 6 wedges and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/555b5a94644d45515b756ddc/6:4/w_274%2Ch_169/51250220_key-lime-chia-cheesecake_6x4.jpg",
        "color": 12735063
    }
}