{
    "recipe": {
        "title": "Kibbutz Vegetable Salad ",
        "ingredients": [
            "1 green bell pepper",
            "1 red bell pepper",
            "1 yellow bell pepper",
            "2 tomatoes",
            "1 onion",
            "1 cucumber",
            "Salt and freshly ground pepper to taste",
            "Juice of 1 lemon",
            "2 cloves garlic, minced",
            "3 tablespoons olive oil",
            "1/2 teaspoon ground sumac or za'atar (optional)"
        ],
        "instructions": [
            "1. Remove the pith and seeds from the peppers and dice them along with the tomatoes, onion, and cucumber. Toss together in a wooden or ceramic bowl. 2. In a separate small bowl, stir together the salt, pepper, lemon juice, and garlic. Slowly whisk in the olive oil. Pour over the vegetables, mix, sprinkle with sumac or za'atar, and serve.",
            "1. Remove the pith and seeds from the peppers and dice them along with the tomatoes, onion, and cucumber. Toss together in a wooden or ceramic bowl.",
            "2. In a separate small bowl, stir together the salt, pepper, lemon juice, and garlic. Slowly whisk in the olive oil. Pour over the vegetables, mix, sprinkle with sumac or za'atar, and serve.",
            "Joan Nathan shares her tips with Epicurious: •Sumac powder, the ground berry of a Turkish evergreen tree, is available at www.ethnicgrocer.com. This Arabic ingredient, which was adopted into Israeli cooking, has a sour, fruity flavor. •Za'atar, a spice mix made from wild oregano, sesame seeds, salt, and ground sumac, is ubiquitous in Middle Eastern cooking, often sprinkled on pita bread that's been drizzled with olive oil. Za'atar is available at www.penzeys.com.",
            "•Sumac powder, the ground berry of a Turkish evergreen tree, is available at www.ethnicgrocer.com. This Arabic ingredient, which was adopted into Israeli cooking, has a sour, fruity flavor. •Za'atar, a spice mix made from wild oregano, sesame seeds, salt, and ground sumac, is ubiquitous in Middle Eastern cooking, often sprinkled on pita bread that's been drizzled with olive oil. Za'atar is available at www.penzeys.com."
        ],
        "picture_link": null
    }
}