{
    "recipe": {
        "title": "Kids' Chicken Katsu ",
        "ingredients": [
            "1/2 cup ketchup",
            "2 tablespoons Worcestershire sauce",
            "2 teaspoons strawberry jam",
            "1 1/2 pounds chicken cutlets, pounded 1/3 inch thick",
            "Kosher salt",
            "3/4 cup all-purpose flour",
            "3 large eggs, beaten to blend",
            "2 cups panko (Japanese breadcrumbs)",
            "8 tablespoons vegetable or grapeseed oil, divided",
            "Cooked short-grain rice (for serving)"
        ],
        "instructions": [
            "Whisk ketchup, Worcestershire sauce, and strawberry jam in a small bowl to combine. Set sauce aside.",
            "Season chicken with salt. Place flour in a shallow bowl. Place eggs in another shallow bowl. Place panko in a third shallow bowl. Season each bowl with salt.",
            "Working one at a time, dredge chicken in flour, shaking off excess. Dip in egg, turning to coat and allowing excess to drip back into bowl, then coat with panko. Place on a large plate.",
            "Heat 6 Tbsp. oil in a large heavy skillet over medium-low until it sizzles when a pinch of flour is added. Cook half of chicken until just cooked through and golden brown, about 2 minutes per side. Transfer to paper towels to drain. Add another 2 Tbsp. oil to skillet and repeat with remaining chicken. Season with salt.",
            "Slice chicken crosswise into 1\"-thick slices. Serve over rice with reserved sauce alongside for dipping.",
            "Do Ahead: Chicken can be breaded 3 months ahead. Place between sheets of freezer paper or waxed paper in resealable plastic freezer bags; freeze. Thaw before cooking.",
            "Chicken can be breaded 3 months ahead. Place between sheets of freezer paper or waxed paper in resealable plastic freezer bags; freeze. Thaw before cooking."
        ],
        "picture_link": "https://assets.epicurious.com/photos/593ee2bba55f291646ff79dc/6:4/w_274%2Ch_169/kids-chicken-katsu.jpg"
    }
}