{
    "recipe": {
        "title": "Kielbasa and Cabbage Soup ",
        "ingredients": [
            "3 large red potatoes",
            "Salt",
            "2 medium onions, chopped",
            "2 tablespoons rendered bacon fat, lard, or butter",
            "3 large garlic cloves, finely chopped",
            "3 1/2 cups beef stock or low-sodium broth",
            "14 ounces smoked kielbasa, halved lengthwise and cut into 3/4\" pieces",
            "1 pound savoy cabbage (about 1/2 medium), chopped",
            "3 medium carrots, halved lengthwise and cut into 1/2\" pieces",
            "2 celery stalks, halved lengthwise and cut into 1/2\" pieces",
            "Sour cream",
            "Chopped dill"
        ],
        "instructions": [
            "Generously cover potatoes with water in a large saucepan and season well with salt. Bring to a boil, partially covered, then reduce heat and simmer until tender, 30-40 minutes. Drain and cool until warm, then peel. Keep warm, covered. Cook onions in fat with 1/4 teaspoon salt in a heavy 5-6-quart pot over medium-low heat, covered, stirring occasionally, until beginning to brown. Add garlic and cook, stirring, 1 minute. Add stock, 1 1/2 cups water, kielbasa, cabbage, carrots, and celery and simmer, partially covered, until vegetables are tender, 15-20 minutes. Halve or quarter potatoes and put 1 or 2 pieces in each bowl. Ladle soup over potato and top with a dollop of sour cream and some dill.",
            "Generously cover potatoes with water in a large saucepan and season well with salt. Bring to a boil, partially covered, then reduce heat and simmer until tender, 30-40 minutes. Drain and cool until warm, then peel. Keep warm, covered.",
            "Cook onions in fat with 1/4 teaspoon salt in a heavy 5-6-quart pot over medium-low heat, covered, stirring occasionally, until beginning to brown. Add garlic and cook, stirring, 1 minute.",
            "Add stock, 1 1/2 cups water, kielbasa, cabbage, carrots, and celery and simmer, partially covered, until vegetables are tender, 15-20 minutes.",
            "Halve or quarter potatoes and put 1 or 2 pieces in each bowl. Ladle soup over potato and top with a dollop of sour cream and some dill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac05116529d92b2c035769/6:4/w_274%2Ch_169/51238220_kielbasa-cabbage-soup_1x1.jpg"
    }
}