{
    "recipe": {
        "title": "King Oyster Mushrooms with Pistachio Purée ",
        "ingredients": [
            "1/2 lb Jerusalem artichokes (also called Sun Chokes) or crosnes",
            "1 cup water",
            "1/2 cup rice vinegar (not seasoned)",
            "1/2 cup sugar",
            "1/2 teaspoon kosher salt",
            "3/4 teaspoon shichimi togarashi (Japanese seven-spice blend)",
            "1 cup shelled roasted pistachios (preferably Sicilian or Turkish)",
            "5 1/2 cups water, divided",
            "1/4 cup mirin (Japanese sweet rice wine)",
            "1/4 cup instant dashi powder (also called hon dashi)",
            "8 radishes",
            "1 tablespoon sugar",
            "1 tablespoon kosher salt",
            "1 1/2 lb king oyster mushrooms (sometimes called Trumpet Royale)",
            "1 (3 1/2-ounce) package enoki mushrooms",
            "6 to 7 tablespoons canola oil, divided",
            "3/4 to 1 teaspoon kosher salt, divided",
            "1 tablespoon unsalted butter",
            "2 garlic cloves, smashed",
            "3 tablespoons Sherry vinegar",
            "Garnish: microgreens or mesclun; flaky sea salt; pistachio oil (optional)"
        ],
        "instructions": [
            "Peel artichokes and cut into 1/4-inch-thick sticks, then transfer to a nonreactive heatproof bowl.",
            "Bring remaining artichoke ingredients to a boil in a small nonreactive saucepan, stirring until salt has dissolved, then pour over artichokes. Cool to room temperature, keeping vegetables submerged with a small plate. Transfer with liquid to an airtight container and chill, shaking occasionally, at least 1 day.",
            "Make pistachio purée: Cook pistachios in 2 cups boiling water in a small saucepan 2 minutes. Drain and transfer to a bowl of ice water to stop cooking. Drain again and peel off skins. Bring mirin, dashi powder, and 3 cups water to a boil in a small saucepan, stirring until powder has dissolved, then add pistachios and simmer, stirring occasionally, until nuts are very tender, about 1 hour. Drain nuts, discarding dashi, then reserve 1/3 cup nuts for garnish. Purée remaining nuts with remaining 1/2 cup water in a blender into a very smooth but thick paste.",
            "Cook pistachios in 2 cups boiling water in a small saucepan 2 minutes. Drain and transfer to a bowl of ice water to stop cooking. Drain again and peel off skins.",
            "Bring mirin, dashi powder, and 3 cups water to a boil in a small saucepan, stirring until powder has dissolved, then add pistachios and simmer, stirring occasionally, until nuts are very tender, about 1 hour. Drain nuts, discarding dashi, then reserve 1/3 cup nuts for garnish. Purée remaining nuts with remaining 1/2 cup water in a blender into a very smooth but thick paste.",
            "Prepare radishes: Trim radishes, then cut each into 6 wedges. Toss with sugar and kosher salt in a bowl until sugar and salt have dissolved.",
            "Trim radishes, then cut each into 6 wedges. Toss with sugar and kosher salt in a bowl until sugar and salt have dissolved.",
            "Prepare mushrooms and assemble dish: Trim oyster mushrooms, keeping stems intact, then cut lengthwise into 1/4-inch-thick slices. Trim enoki mushrooms, leaving 3 inches of stem, and reserve for garnish. Heat 1 tablespoon oil in a 12-inch heavy nonstick skillet over medium-high heat until hot. Add enough oyster mushrooms to cover skillet in 1 layer, then sprinkle with 1/8 teaspoon kosher salt and 1/8 teaspoon pepper and sauté, turning once, until golden on edges, 2 to 4 minutes. Transfer to a bowl. Sauté remaining oyster mushrooms in 5 or 6 more batches, using 1 tablespoon oil, 1/8 teaspoon kosher salt, and 1/8 teaspoon pepper per batch. When all oyster mushrooms are sautéed, return to skillet, then add butter and garlic and heat, swirling skillet, until butter is melted. Add vinegar and boil, stirring, until evaporated. Remove from heat and discard garlic. Divide pistachio purée among plates, then top with oyster mushrooms. Remove artichokes from container with a slotted spoon and arrange, along with radishes, around oyster mushrooms. Sprinkle with enoki mushrooms, greens, reserved pistachios, and sea salt.",
            "Trim oyster mushrooms, keeping stems intact, then cut lengthwise into 1/4-inch-thick slices.",
            "Trim enoki mushrooms, leaving 3 inches of stem, and reserve for garnish.",
            "Heat 1 tablespoon oil in a 12-inch heavy nonstick skillet over medium-high heat until hot. Add enough oyster mushrooms to cover skillet in 1 layer, then sprinkle with 1/8 teaspoon kosher salt and 1/8 teaspoon pepper and sauté, turning once, until golden on edges, 2 to 4 minutes. Transfer to a bowl. Sauté remaining oyster mushrooms in 5 or 6 more batches, using 1 tablespoon oil, 1/8 teaspoon kosher salt, and 1/8 teaspoon pepper per batch.",
            "When all oyster mushrooms are sautéed, return to skillet, then add butter and garlic and heat, swirling skillet, until butter is melted. Add vinegar and boil, stirring, until evaporated. Remove from heat and discard garlic.",
            "Divide pistachio purée among plates, then top with oyster mushrooms. Remove artichokes from container with a slotted spoon and arrange, along with radishes, around oyster mushrooms. Sprinkle with enoki mushrooms, greens, reserved pistachios, and sea salt."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a41f3a00aeb2f1cf7ae/6:4/w_274%2Ch_169/240259_hires.jpg"
    }
}