{
    "recipe": {
        "title": "King Cake Eclairs ",
        "ingredients": [
            "1 cup plus 1 teaspoon whole milk",
            "1/2 cup (1 stick) unsalted butter, cut into cubes",
            "1 tablespoon sugar",
            "1 teaspoon cinnamon, preferably freshly grated",
            "1 teaspoon nutmeg, freshly grated",
            "1 teaspoon salt",
            "1 1/2 cups all-purpose flour",
            "6 to 7 large eggs",
            "4 large egg yolks",
            "1/2 cup granulated sugar",
            "6 tablespoons cornstarch",
            "4 cups heavy cream",
            "4 ounces cream cheese, room temperature",
            "2 tablespoons freshly squeezed satsuma* juice (from 1 satsuma)",
            "1 teaspoon satsuma zest (from 2 satsumas)",
            "1 cup confectioner's sugar, sifted",
            "Gold-tinted sugar sprinkles** (optional)",
            "*Satsumas, a member of the mandarin orange family, are native to Japan but grow profusely in Louisiana. The small, sweet fruit is available at some supermarkets, but if unavailable, tangerines make a good substitute.",
            "**Gold-tinted sugar sprinkles are available at www.wilton.com.",
            "large pastry bag, 1/2-inch-tip, and 1/4-inch tip."
        ],
        "instructions": [
            "Preheat oven to 400°F. Line 2 large baking sheets with parchment paper.",
            "In medium saucepan, combine 1 cup milk, butter, sugar, cinnamon, nutmeg, and salt. Bring to boil over moderate heat, stirring with wooden spoon until butter is melted. Add flour all at once and cook, beating constantly with wooden spoon, until mixture pulls away from sides of pan and forms ball, about 15 seconds.",
            "Transfer dough to bowl of standing electric mixer fitted with paddle attachment. Beat in 5 eggs one at a time, beating well after each addition. Check consistency by lifting spoonful of dough; dough should form soft peaks and fall from spoon in slow, bending hook. If dough is too stiff, beat in 6th egg.",
            "Spoon batter into large pastry bag fitted with 1/2-inch tip. Pipe 5-inch-long, 1-inch-wide logs onto baking sheets, leaving 2 inches between each log.",
            "In small bowl, whisk together 1 egg and 1 teaspoon milk to make egg wash. Brush each éclair with egg wash and bake 15 minutes, switching position of sheets halfway through baking. Lower oven temperature to 325°F and bake until puffed and golden brown, about 10 more minutes.",
            "Remove éclairs and turn off oven. Using small, sharp knife, cut small slit in 1 long side of each éclair. Return éclairs to oven, propping door slightly open, for 5 minutes. Transfer baking sheets to rack to cool.",
            "Make pastry cream: Have ready large bowl half full of ice water. In medium bowl, whisk together egg yolks, sugar, and cornstarch. In heavy medium saucepan over moderate heat, bring cream to boil. In stream, pour 2 cups hot cream into egg mixture, whisking constantly to prevent curdling. Whisk mixture into remaining cream in saucepan and place over medium heat. Cook, stirring constantly with wooden spoon to prevent boiling, until pastry cream thickens enough to coat back of spoon, about 3 to 4 minutes. Remove pan from heat and set in bowl filled with ice water. Cool pastry cream, stirring occasionally, until thick and cool, about 30 minutes. In large mixing bowl, whisk together cream cheese and cooled pastry cream. Transfer to pastry bag fitted with a 1/4-inch-tip and set aside.",
            "Have ready large bowl half full of ice water. In medium bowl, whisk together egg yolks, sugar, and cornstarch. In heavy medium saucepan over moderate heat, bring cream to boil. In stream, pour 2 cups hot cream into egg mixture, whisking constantly to prevent curdling. Whisk mixture into remaining cream in saucepan and place over medium heat. Cook, stirring constantly with wooden spoon to prevent boiling, until pastry cream thickens enough to coat back of spoon, about 3 to 4 minutes. Remove pan from heat and set in bowl filled with ice water. Cool pastry cream, stirring occasionally, until thick and cool, about 30 minutes.",
            "In large mixing bowl, whisk together cream cheese and cooled pastry cream. Transfer to pastry bag fitted with a 1/4-inch-tip and set aside.",
            "Make glaze: In medium bowl, combine satsuma juice and zest. Slowly whisk in confectioner's sugar until thoroughly combined.",
            "In medium bowl, combine satsuma juice and zest. Slowly whisk in confectioner's sugar until thoroughly combined.",
            "Assemble: Pipe pastry cream into éclairs through slits in sides. Using small pastry brush, spread glaze over top of each éclair, then dust with gold sugar sprinkles, if desired, and serve.",
            "Pipe pastry cream into éclairs through slits in sides. Using small pastry brush, spread glaze over top of each éclair, then dust with gold sugar sprinkles, if desired, and serve."
        ],
        "picture_link": null
    }
}