{
    "recipe": {
        "title": "King Cake Old Fashioned ",
        "ingredients": [
            "1 1/2 cups sugar",
            "1 cup water",
            "6 to 8 (3-inch) cinnamon sticks",
            "1 (2 1/2-inch) ice cube or ice ball",
            "2 ounces Rougaroux 13 Pennies Praline Rum*",
            "2 dashes of El Guapo Chicory-Pecan Bitters**",
            "1 (1/2- by 3-inch) piece orange peel and 2 to 3 golden raisins for garnish",
            "*Rougaroux 13 Pennies Praline Rum is available throughout Louisiana, and has limited availability in Kentucky and Montana. It can be ordered and shipped to most states by calling or emailing Donner-Peltier Distillers (985-446-0002; info@dpdspirits.com). To make your own praline-infused rum, see the Cook's Notes below.",
            "**El Guapo Chicory-Pecan bitters can be ordered from Amazon.com. Alternatively, Dale Degroff's Pimento Aromatic Bitters make a good substitute.",
            "1 (2 1/2-inch) ice cube mold; 1 cocktail pick"
        ],
        "instructions": [
            "Make the cinnamon syrup: In a small saucepan, bring the sugar, water, and cinnamon sticks to a boil, stirring occasionally, and continue boiling until the sugar is completely dissolved, 10 to 15 minutes. Cool the syrup then remove and discard the cinnamon sticks. DO AHEAD: Cinnamon syrup can be made ahead and refrigerated, in an airtight container, for up to 1 week.",
            "In a small saucepan, bring the sugar, water, and cinnamon sticks to a boil, stirring occasionally, and continue boiling until the sugar is completely dissolved, 10 to 15 minutes. Cool the syrup then remove and discard the cinnamon sticks. DO AHEAD: Cinnamon syrup can be made ahead and refrigerated, in an airtight container, for up to 1 week.",
            "Make the King Cake Old Fashioned: Place 1 (2 1/2-inch) ice cube in a rocks glass. Add the rum, the bitters, and 1/2 teaspoon (1/4 ounce) cinnamon syrup, and stir until well chilled. Squeeze the orange peel over the drink, making sure the oils fall into the glass, then thread the peel, along with the raisins, onto a cocktail pick. Place the pick in the drink and serve.",
            "Place 1 (2 1/2-inch) ice cube in a rocks glass. Add the rum, the bitters, and 1/2 teaspoon (1/4 ounce) cinnamon syrup, and stir until well chilled. Squeeze the orange peel over the drink, making sure the oils fall into the glass, then thread the peel, along with the raisins, onto a cocktail pick. Place the pick in the drink and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3fb2921388ef838b10ee3/6:4/w_274%2Ch_169/51225610_king-cake-old-fashioned_1x1.jpg"
    }
}