{
    "recipe": {
        "title": "Klobasnek (Sausage Kolaches) ",
        "ingredients": [
            "1 cup whole milk",
            "8 tablespoons (1 stick) unsalted butter",
            "1 tablespoon (1 packet) active dry yeast",
            "1/4 cup sugar",
            "1/2 teaspoon kosher salt",
            "3 1/2 to 4 cups all-purpose flour",
            "2 tablespoons vegetable oil",
            "2 egg yolks",
            "1/2 cup (2 ounces) grated cheddar cheese",
            "2 whole pickled jalapeños, cut into 16 slices (optional)",
            "1 pound smoked kielbasa sausage, cut into 8 (2-inch) pieces"
        ],
        "instructions": [
            "Over medium heat, warm the milk and 4 tablespoons of the butter until the milk is just beginning to steam, but is not boiling, and the butter is melted. Remove from the heat. In a large mixing bowl, whisk together the yeast, sugar, salt, and 1 1/2 cups of the flour. Pour in the warm milk mixture and stir until a sticky dough has formed. Cover the dough and let it rest for 30 minutes. Meanwhile, beat together the oil and egg yolks. Pour the eggs into the flour mixture and blend until fully incorporated. Slowly stir in enough of the remaining 2 to 2 1/2 cups flour until the dough comes together and is soft but not sticky. Turn the dough out onto a floured surface and knead for about 10 minutes, or until it is smooth. Place the kneaded dough in a lightly oiled bowl and cover. Allow to rise until doubled in size, about 1 hour. Grease or line a baking sheet with parchment paper. After the dough has risen, punch it down and divide into 8 even-size pieces. In your hands, roll the pieces of dough into balls and then flatten them into disks 4 inches in diameter. In the center of each piece of dough, place 1/2 tablespoon of the cheddar cheese, 2 slices of jalapeño, and a piece of sausage. Fold one side of the dough over the other and roll, then seal by pinching on all sides. Place on the baking sheet 1 inch apart, seam side down. Cover and allow to rise for 45 more minutes. Preheat the oven to 375°F. Melt the remaining 4 tablespoons of butter. Brush the tops of the klobasneks with half the melted butter. Bake, uncovered, for 15 to 18 minutes, or until lightly browned. After you remove them from the oven, brush each klobasnek with the remaining melted butter. Serve warm. They are best on the day they are made, but they can be tightly wrapped and then reheated, up to 2 days after baking. They can also be frozen.",
            "Over medium heat, warm the milk and 4 tablespoons of the butter until the milk is just beginning to steam, but is not boiling, and the butter is melted. Remove from the heat.",
            "In a large mixing bowl, whisk together the yeast, sugar, salt, and 1 1/2 cups of the flour. Pour in the warm milk mixture and stir until a sticky dough has formed. Cover the dough and let it rest for 30 minutes.",
            "Meanwhile, beat together the oil and egg yolks. Pour the eggs into the flour mixture and blend until fully incorporated. Slowly stir in enough of the remaining 2 to 2 1/2 cups flour until the dough comes together and is soft but not sticky. Turn the dough out onto a floured surface and knead for about 10 minutes, or until it is smooth.",
            "Place the kneaded dough in a lightly oiled bowl and cover. Allow to rise until doubled in size, about 1 hour.",
            "Grease or line a baking sheet with parchment paper. After the dough has risen, punch it down and divide into 8 even-size pieces. In your hands, roll the pieces of dough into balls and then flatten them into disks 4 inches in diameter. In the center of each piece of dough, place 1/2 tablespoon of the cheddar cheese, 2 slices of jalapeño, and a piece of sausage. Fold one side of the dough over the other and roll, then seal by pinching on all sides. Place on the baking sheet 1 inch apart, seam side down. Cover and allow to rise for 45 more minutes.",
            "Preheat the oven to 375°F.",
            "Melt the remaining 4 tablespoons of butter. Brush the tops of the klobasneks with half the melted butter. Bake, uncovered, for 15 to 18 minutes, or until lightly browned. After you remove them from the oven, brush each klobasnek with the remaining melted butter. Serve warm. They are best on the day they are made, but they can be tightly wrapped and then reheated, up to 2 days after baking. They can also be frozen."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56033a2dc301a9f945ef83ac/6:4/w_274%2Ch_169/51230810.jpg"
    }
}