{
    "recipe": {
        "title": "Kolacky ",
        "ingredients": [
            "6 ounces (about 3/4 cup) cream cheese, at room temperature",
            "1 cup (2 sticks) unsalted butter, at room temperature",
            "1 tablespoon granulated sugar",
            "2 1/2 cups all-purpose flour",
            "About 3/4 cup prepared poppy-seed, apricot, or prune filling or thick jam of choice",
            "Sifted confectioners' sugar for dusting"
        ],
        "instructions": [
            "1. In a large bowl, with an electric mixer, beat together the cream cheese, butter, and sugar on medium speed until light, about 2 minutes. On low speed, gradually beat in the flour just until mixed. The dough will be soft and sticky.",
            "2. Divide the dough in half. Pat each half into a thick disk and wrap separately in plastic wrap. Refrigerate until firm enough to handle, at least 1 hour or up to 1 day.",
            "3. Preheat the oven to 350°F. Lightly grease or spray cookie sheets.",
            "4. Dust a pastry cloth or board with flour or confectioners' sugar. Remove 1 dough disk from the refrigerator and place it on the pastry cloth. Keep the remaining dough disk refrigerated. Roll out the dough into a square or rectangle 1/8 inch thick. Cut into 2 1/2-inch squares.",
            "5. Place 1 teaspoon of the filling in the center of each square. Pull 2 opposite corners of the square into the middle, and pinch the edges together to seal. Place the cookies on the prepared cookie sheets, spacing them about 1 1/2 inches apart. Repeat with the remaining dough and filling.",
            "6. Bake in the center of the oven until lightly golden, 12 to 15 minutes. Let cool on the cookie sheets for 1 to 2 minutes, then transfer to wire racks. Dust the tops with sifted confectioners' sugar while still warm, then let cool completely."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b30ca43edeef84363b90ea/6:4/w_274%2Ch_169/362410_kolacky_1x1.jpg"
    }
}