{
    "recipe": {
        "title": "Korean Steak Tacos ",
        "ingredients": [
            "1/2 cup finely chopped fresh cilantro",
            "1/4 cup packed dark brown sugar",
            "3 tablespoons canola oil",
            "3 tablespoons soy sauce",
            "1 tablespoon toasted sesame oil",
            "2 large garlic cloves, minced",
            "1 jalapeño pepper, seeded and finely chopped",
            "1 teaspoon freshly ground black pepper",
            "1 teaspoon ground coriander",
            "One 2-pound flank steak (about 1 1/2 inches thick), fat trimmed",
            "1/2 head napa cabbage, halved lengthwise and shredded crosswise (about 3 cups)",
            "1 large carrot, cut into 2-inch-long matchstick-size strips",
            "8 scallions (white and green parts), thinly sliced on a sharp diagonal",
            "1/2 cup lightly packed fresh cilantro sprigs",
            "Twelve 6-inch corn tortillas",
            "Guacamole for Lindsay"
        ],
        "instructions": [
            "1. To marinate the steak: In a large baking dish, whisk the cilantro, brown sugar, canola oil, soy sauce, sesame oil, garlic, jalapeños, black pepper, and coriander to blend well. Reserve 1/4 cup of the mixture in a small bowl for serving. Place the steak in the remaining marinade and turn to coat. Marinate for at least 20 minutes at room temperature, or cover and refrigerate for up to 1 day, turning occasionally. Cover and refrigerate the reserved marinade. 2. Prepare an outdoor grill for medium-high cooking over direct heat. 3. Remove the steak from the marinade (discard the marinade) and grill, turning halfway through cooking, for a total of about 10 minutes, until the meat feels only slightly resilient when pressed with a fingertip for medium-rare. Transfer the steak to a cutting board and let stand for 5 to 10 minutes. 4. Meanwhile, prepare the tacos: In a large bowl, toss the cabbage, carrots, scallions, and cilantro together. 5. Heat the tortillas on the grill, turning occasionally, for about 1 minute, or until hot. Transfer to a serving bowl and cover to keep warm. 6. To serve: Cut the steak across the grain into 1/4-inch-thick slices. Transfer the steak slices and any carving juices to a platter. Serve the steak with the reserved marinade, tortillas, cabbage mixture, and guacamole. Let each guest fill two tortillas with some steak and cabbage mixture and top with some of the marinade and guacamole.",
            "1. To marinate the steak: In a large baking dish, whisk the cilantro, brown sugar, canola oil, soy sauce, sesame oil, garlic, jalapeños, black pepper, and coriander to blend well. Reserve 1/4 cup of the mixture in a small bowl for serving. Place the steak in the remaining marinade and turn to coat. Marinate for at least 20 minutes at room temperature, or cover and refrigerate for up to 1 day, turning occasionally. Cover and refrigerate the reserved marinade.",
            "2. Prepare an outdoor grill for medium-high cooking over direct heat.",
            "3. Remove the steak from the marinade (discard the marinade) and grill, turning halfway through cooking, for a total of about 10 minutes, until the meat feels only slightly resilient when pressed with a fingertip for medium-rare. Transfer the steak to a cutting board and let stand for 5 to 10 minutes.",
            "4. Meanwhile, prepare the tacos: In a large bowl, toss the cabbage, carrots, scallions, and cilantro together.",
            "5. Heat the tortillas on the grill, turning occasionally, for about 1 minute, or until hot. Transfer to a serving bowl and cover to keep warm.",
            "6. To serve: Cut the steak across the grain into 1/4-inch-thick slices. Transfer the steak slices and any carving juices to a platter. Serve the steak with the reserved marinade, tortillas, cabbage mixture, and guacamole. Let each guest fill two tortillas with some steak and cabbage mixture and top with some of the marinade and guacamole."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3fd302413537c0d456375/6:4/w_274%2Ch_169/51221610_korean-steak-tacos_1x1.jpg"
    }
}