{
    "recipe": {
        "title": "Korean Pancakes ",
        "ingredients": [
            "3 tablespoons soy sauce",
            "2 teaspoons rice vinegar (not seasoned)",
            "1 tablespoon sesame seeds, toasted",
            "1/4 teaspoon dried hot red pepper flakes",
            "1/4 teaspoon Asian sesame oil",
            "1 cup dried peeled (yellow) mung beans*",
            "2 medium carrots",
            "1 bunch scallions (white and pale green parts only)",
            "1 (5-inch) fresh red chile, thinly sliced crosswise (2 tablespoons), including seeds",
            "1 tablespoon minced garlic (about 3 cloves)",
            "1 cup water",
            "2 large eggs",
            "2 tablespoons all-purpose flour",
            "1 teaspoon salt",
            "4 tablespoons vegetable oil",
            "a Japanese Benriner** or other adjustable-blade slicer"
        ],
        "instructions": [
            "Make dipping sauce: Stir together all dipping-sauce ingredients in a small bowl.",
            "Stir together all dipping-sauce ingredients in a small bowl.",
            "Make pancakes: Rinse mung beans in a sieve under cold running water until water runs clear. Cover beans with cold water by 2 inches in a bowl and soak, chilled, at least 2 hours. Cut carrots into thin matchsticks, preferably using slicer.Halve scallions lengthwise and cut into 2-inch pieces. Combine carrots, scallions, chile, and garlic in a large bowl. Drain mung beans and purée with water in a food processor until smooth, about 1 minute. Add eggs, flour, and salt and blend until smooth, about 30 seconds. Pour mixture over vegetables in bowl and stir with a flexible spatula. (Batter will be thick.) Heat 1 tablespoon oil in a large heavy nonstick skillet (at least 8 inches across bottom) over moderate heat until hot but not smoking, then swirl to coat. Stir batter, then ladle 1 cup batter into skillet, pressing down lightly with a large spatula to flatten and evenly distribute vegetables, to make an 8-inch pancake (less than 1/2 inch thick). Cook until edges begin to bubble and turn golden, 1 to 2 minutes, then turn over with spatula and cook until other side is golden, 1 to 2 minutes more. Transfer pancake to paper towels to drain. Make 3 more pancakes in same manner, stacking them (after draining briefly) if desired. Transfer pancakes, 1 at a time, to a cutting board and cut each into 6 wedges. Serve warm or at room temperature with dipping sauce.",
            "Rinse mung beans in a sieve under cold running water until water runs clear. Cover beans with cold water by 2 inches in a bowl and soak, chilled, at least 2 hours.",
            "Cut carrots into thin matchsticks, preferably using slicer.Halve scallions lengthwise and cut into 2-inch pieces. Combine carrots, scallions, chile, and garlic in a large bowl.",
            "Drain mung beans and purée with water in a food processor until smooth, about 1 minute. Add eggs, flour, and salt and blend until smooth, about 30 seconds. Pour mixture over vegetables in bowl and stir with a flexible spatula. (Batter will be thick.)",
            "Heat 1 tablespoon oil in a large heavy nonstick skillet (at least 8 inches across bottom) over moderate heat until hot but not smoking, then swirl to coat. Stir batter, then ladle 1 cup batter into skillet, pressing down lightly with a large spatula to flatten and evenly distribute vegetables, to make an 8-inch pancake (less than 1/2 inch thick). Cook until edges begin to bubble and turn golden, 1 to 2 minutes, then turn over with spatula and cook until other side is golden, 1 to 2 minutes more. Transfer pancake to paper towels to drain. Make 3 more pancakes in same manner, stacking them (after draining briefly) if desired. Transfer pancakes, 1 at a time, to a cutting board and cut each into 6 wedges. Serve warm or at room temperature with dipping sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df2b7f3a00aeb2f1d5dc4/6:4/w_274%2Ch_169/230986.jpg"
    }
}