{
    "recipe": {
        "title": "Kouign-Amann ",
        "ingredients": [
            "2 tablespoons (30 g) European-style butter (at least 82% fat), melted, slightly cooled, plus more for bowl",
            "1 tablespoon (10 g) active dry yeast",
            "3 cups (400 g) all-purpose flour, plus more for surface",
            "3 tablespoons (40 g) sugar",
            "1 teaspoon (5 g) kosher salt",
            "12 ounces (340 g) chilled unsalted European-style butter (at least 82% fat), cut into pieces",
            "1/2 cup (100 g) sugar",
            "1 teaspoon (5 g) kosher salt",
            "All-purpose flour",
            "3/4 cup (150 g) sugar, divided",
            "Nonstick vegetable oil spray"
        ],
        "instructions": [
            "Make Dough Brush a large bowl with butter. Whisk yeast and 1/4 cup very warm water (110°F–115°F) in another large bowl to dissolve. Let stand until yeast starts to foam, about 5 minutes. Add 3 cups flour, 3 tablespoons sugar, 1 teaspoon salt, 2 tablespoons butter, and 3/4 cup cold water. Mix until a shaggy dough forms. Turn out onto a lightly floured surface and knead, adding flour as needed, until dough is supple, soft, and slightly tacky, about 5 minutes.",
            "Make Dough",
            "Brush a large bowl with butter. Whisk yeast and 1/4 cup very warm water (110°F–115°F) in another large bowl to dissolve. Let stand until yeast starts to foam, about 5 minutes. Add 3 cups flour, 3 tablespoons sugar, 1 teaspoon salt, 2 tablespoons butter, and 3/4 cup cold water. Mix until a shaggy dough forms. Turn out onto a lightly floured surface and knead, adding flour as needed, until dough is supple, soft, and slightly tacky, about 5 minutes.",
            "Proof Dough Twice Place dough in prepared bowl and turn to coat with butter. Cover bowl with plastic wrap, place in a warm, draft-free spot, and let dough rise until doubled in size, 1–1 1/2 hours. (This process of resting and rising is known as proofing.) Punch down dough and knead lightly a few times inside bowl. Cover again with plastic wrap and chill in refrigerator until dough is again doubled in size, 45–60 minutes.",
            "Proof Dough Twice",
            "Place dough in prepared bowl and turn to coat with butter. Cover bowl with plastic wrap, place in a warm, draft-free spot, and let dough rise until doubled in size, 1–1 1/2 hours. (This process of resting and rising is known as proofing.) Punch down dough and knead lightly a few times inside bowl. Cover again with plastic wrap and chill in refrigerator until dough is again doubled in size, 45–60 minutes.",
            "Shape & Chill Dough Turn out dough onto a lightly floured surface and pat into a 6x6\" square. Wrap in plastic and chill in freezer until dough is very firm but not frozen, 30–35 minutes. (Heads up: You'll want it to be about as firm as the chilled butter block in step 5.)",
            "Shape & Chill Dough",
            "Turn out dough onto a lightly floured surface and pat into a 6x6\" square. Wrap in plastic and chill in freezer until dough is very firm but not frozen, 30–35 minutes. (Heads up: You'll want it to be about as firm as the chilled butter block in step 5.)",
            "Mix & Form Butter Block Beat 12 ounces butter, 1/2 cup sugar, and 1 teaspoon salt with an electric mixer on low speed just until homogeneous and waxy-looking, about 3 minutes. Scrape butter mixture onto a large sheet of parchment. Shape into a 12x6\" rectangle 1/4\" thick.",
            "Mix & Form Butter Block",
            "Beat 12 ounces butter, 1/2 cup sugar, and 1 teaspoon salt with an electric mixer on low speed just until homogeneous and waxy-looking, about 3 minutes. Scrape butter mixture onto a large sheet of parchment. Shape into a 12x6\" rectangle 1/4\" thick.",
            "Wrap & Chill Butter Block Neatly wrap up butter, pressing out air. Roll packet gently with a rolling pin to push butter into corners and create an evenly thick rectangle. Chill in refrigerator until firm but pliable, 25–30 minutes.",
            "Wrap & Chill Butter Block",
            "Neatly wrap up butter, pressing out air. Roll packet gently with a rolling pin to push butter into corners and create an evenly thick rectangle. Chill in refrigerator until firm but pliable, 25–30 minutes.",
            "Roll Out Dough & Enclose Butter Block Roll out dough on a lightly floured surface into a 19x7\" rectangle (a bit wider and about 50 percent longer than the butter block). Place butter block on upper two-thirds of dough, leaving a thin border along top and sides. Fold dough like a letter: Bring lower third of dough up and over lower half of butter. Then fold exposed upper half of butter and dough over lower half (butter should bend, not break). Press edges of dough to seal, enclosing butter.",
            "Roll Out Dough & Enclose Butter Block",
            "Roll out dough on a lightly floured surface into a 19x7\" rectangle (a bit wider and about 50 percent longer than the butter block). Place butter block on upper two-thirds of dough, leaving a thin border along top and sides. Fold dough like a letter: Bring lower third of dough up and over lower half of butter. Then fold exposed upper half of butter and dough over lower half (butter should bend, not break). Press edges of dough to seal, enclosing butter.",
            "Make First Turn Rotate dough package 90°F counterclockwise so flap opening is on your right. Roll out dough, dusting with flour as needed, to a 24x8\" rectangle about 3/8\" thick. Fold rectangle into thirds like a letter (as in step 6), bringing lower third up, then upper third down (this completes the first turn). Dust dough lightly with flour, wrap in plastic, and chill in freezer until firm but not frozen, about 30 minutes. Transfer to refrigerator; continue to chill until very firm, about 1 hour longer. (Freezing dough first cuts down on chilling time.)",
            "Make First Turn",
            "Rotate dough package 90°F counterclockwise so flap opening is on your right. Roll out dough, dusting with flour as needed, to a 24x8\" rectangle about 3/8\" thick. Fold rectangle into thirds like a letter (as in step 6), bringing lower third up, then upper third down (this completes the first turn). Dust dough lightly with flour, wrap in plastic, and chill in freezer until firm but not frozen, about 30 minutes. Transfer to refrigerator; continue to chill until very firm, about 1 hour longer. (Freezing dough first cuts down on chilling time.)",
            "Make Second & Third Turns Place dough on surface so flap opening is on your right. Roll out dough, dusting with flour as needed, to a 24x8\" rectangle, about 3/8\" thick. Fold into thirds (same way as before), rotate 90°F counterclockwise so flap opening is on your right, and roll out again to a 24x8\" rectangle. Sprinkle surface of dough with 2 tablespoons sugar; fold into thirds. Dust lightly with flour, wrap in plastic, and chill in freezer until firm but not frozen, about 30 minutes. Transfer to refrigerator; continue to chill until very firm, about 1 hour longer.",
            "Make Second & Third Turns",
            "Place dough on surface so flap opening is on your right. Roll out dough, dusting with flour as needed, to a 24x8\" rectangle, about 3/8\" thick. Fold into thirds (same way as before), rotate 90°F counterclockwise so flap opening is on your right, and roll out again to a 24x8\" rectangle. Sprinkle surface of dough with 2 tablespoons sugar; fold into thirds. Dust lightly with flour, wrap in plastic, and chill in freezer until firm but not frozen, about 30 minutes. Transfer to refrigerator; continue to chill until very firm, about 1 hour longer.",
            "Roll Out & Cut Dough Place dough on surface so flap opening is on your right. Roll out dough, dusting with flour as needed, to a rectangle slightly larger than 16x12\". Trim to 16x12\". Cut into 12 squares (you'll want a 4x3 grid). Brush excess flour from dough and surface.",
            "Roll Out & Cut Dough",
            "Place dough on surface so flap opening is on your right. Roll out dough, dusting with flour as needed, to a rectangle slightly larger than 16x12\". Trim to 16x12\". Cut into 12 squares (you'll want a 4x3 grid). Brush excess flour from dough and surface.",
            "Form & Proof Kouign-Amann Lightly coat muffin cups with nonstick spray. Sprinkle squares with a total of 1/4 cup sugar, dividing evenly, and press gently to adhere. Turn over and repeat with another 1/4 cup sugar, pressing gently to adhere. Shake off excess. Lift corners of each square and press into the center. Place each in a muffin cup. Wrap pans with plastic and chill in refrigerator at least 8 hours and up to 12 hours (dough will be puffed with slightly separated layers).",
            "Form & Proof Kouign-Amann",
            "Lightly coat muffin cups with nonstick spray. Sprinkle squares with a total of 1/4 cup sugar, dividing evenly, and press gently to adhere. Turn over and repeat with another 1/4 cup sugar, pressing gently to adhere. Shake off excess. Lift corners of each square and press into the center. Place each in a muffin cup. Wrap pans with plastic and chill in refrigerator at least 8 hours and up to 12 hours (dough will be puffed with slightly separated layers).",
            "Bake Kouign-Amann Preheat oven to 375°F. Unwrap pans and sprinkle kouign-amann with remaining 2 tablespoons sugar, dividing evenly. Bake until pastry is golden brown all over and sugar is deeply caramelized, 25–30 minutes (make sure to bake pastries while dough is still cold). Immediately remove from pan and transfer to a wire rack; let cool.",
            "Bake Kouign-Amann",
            "Preheat oven to 375°F. Unwrap pans and sprinkle kouign-amann with remaining 2 tablespoons sugar, dividing evenly. Bake until pastry is golden brown all over and sugar is deeply caramelized, 25–30 minutes (make sure to bake pastries while dough is still cold). Immediately remove from pan and transfer to a wire rack; let cool."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac94fc6529d92b2c03cc54/6:4/w_274%2Ch_169/51231670_kouign-amann_1x1.jpg"
    }
}