{
    "recipe": {
        "title": "Kumamoto Oysters with Ponzu Granita and Tobiko ",
        "ingredients": [
            "1 (1-inch-wide) piece kombu (dried kelp), rinsed",
            "1 cup water",
            "3 tablespoons mirin (Japanese sweet rice wine)",
            "3 tablespoons soy sauce",
            "3 tablespoons rice vinegar (not seasoned)",
            "2 tablespoons fresh or bottled yuzu juice",
            "1 teaspoon sugar",
            "18 small oysters (preferably Kumamoto or Prince Edward Island), not shucked",
            "1 oz tobiko (flying-fish roe)",
            "1 oyster knife",
            "Garnish: a bed of seaweed (1 lb)",
            "a protective glove; an oyster knife"
        ],
        "instructions": [
            "Bring kombu and water to a simmer in a small saucepan over moderate heat, then remove from heat and cool completely, about 30 minutes. Discard kombu. Transfer 5 tablespoons kombu broth to a bowl along with remaining granita ingredients and stir until sugar is dissolved. (Reserve remaining broth for another use.)",
            "Pour granita mixture into an 8-inch metal baking pan and freeze, stirring and crushing lumps with a fork every 20 minutes, until evenly frozen, about 1 hour. Scrape with a fork to lighten texture, crushing any lumps.",
            "Open oysters and assemble dish: Wearing protective glove, hold an oyster, flat side up, and open it at its narrow point with oyster knife. Loosen oyster from top shell with oyster knife if necessary, discarding top shell, then loosen oyster meat within curved bottom shell, keeping it in shell. Discard any loose bits of shell. Arrange oyster on bed of seaweed and repeat with remaining oysters in same manner. Top each oyster with a scant 1/4 teaspoon tobiko. Serve granita on the side.",
            "Wearing protective glove, hold an oyster, flat side up, and open it at its narrow point with oyster knife. Loosen oyster from top shell with oyster knife if necessary, discarding top shell, then loosen oyster meat within curved bottom shell, keeping it in shell. Discard any loose bits of shell. Arrange oyster on bed of seaweed and repeat with remaining oysters in same manner.",
            "Top each oyster with a scant 1/4 teaspoon tobiko. Serve granita on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de5c17b55306961bfd88c/6:4/w_274%2Ch_169/232781.jpg"
    }
}