{
    "recipe": {
        "title": "Kyler's Cascadian Dark Ale ",
        "ingredients": [
            "2 pounds Maris Otter",
            "8 ounces C60",
            "8 ounces Carafa Special II",
            "8 ounces Roasted Barley",
            "6.6 pounds Gold Liquid Malt Extract",
            "1 pound Extra Light Dry Malt Extract",
            "1 ounce Warrior (Bittering, 60 minutes)",
            "1 ounce Cascade (Flavor, 15 minutes)",
            "1 ounce Mt. Hood (Aroma, 5 minutes)",
            "1 ounce Centennial (Aroma, 1 minute)",
            "1 ounce Cascade",
            "1 ounce Centennial",
            "1/2 tablet Whirlfloc (clarifying aid)",
            "Wyeast #1056 American Ale",
            "1332 Northwest Ale",
            "1272 American Ale II",
            "Safale US-05",
            "3/4 cup Dextrose (corn sugar) OR 1 1/4 cup Dried Malt Extract",
            "*After the first 3 days of active fermentation, add the dry hop additions into the fermentor. Let sit for another 5 days, then rack (transfer) to a secondary vessel. Allow to sit for another 5 days, or until the hops particles have settled to the bottom and the final gravity is reached."
        ],
        "instructions": [
            "Steep grains in 1.5 gallons water at 152°F for 50 minutes. After 50 minutes, add the second bag of roasted grain, and continue steeping for 10 minutes more. Next, remove all of the grains and rinse them with 1 to 2 gallons of very hot (170°F) water, saving the rinse water and adding it to the kettle. Discard the grains. Top off kettle with water to make 3-5 gallons (dependent on kettle size).",
            "Bring water to a boil then stir in malt extract until dissolved.",
            "Add bittering hops and boil wort vigorously for 45 minutes. After 45 minutes, add the flavor hops and boil for 10 minutes. After 10 minutes add the first addition of aroma hops and boil for 4 minutes. After the 4 minutes add the last addition of aroma hops and boil for 1 minute.",
            "Add bittering hops and boil wort vigorously for 45 minutes.",
            "After 45 minutes, add the flavor hops and boil for 10 minutes.",
            "After 10 minutes add the first addition of aroma hops and boil for 4 minutes.",
            "After the 4 minutes add the last addition of aroma hops and boil for 1 minute.",
            "During the final 10 minutes of the boil add Whirlfloc, or similar clarifying aid.",
            "During the final 10 minutes of the boil add Whirlfloc, or similar clarifying aid.",
            "Rapidly cool wort to below 70°F; from this point on, use only properly sanitized utensils and equipment! Transfer the wort to the sanitized fermenting bucket or carboy. Top off with water to make 5 gallons, making sure that any water you add gets thoroughly mixed with the wort before taking a test sample. Take sample of wort and measure the Original Gravity with a hydrometer (with sample at 60°F). DO NOT add sample back to cooled wort. Pitch the yeast into cooled wort. Aerate the wort thoroughly. If you don't own an aeration pump or pure-oxygen system then aerate wort by vigorously stirring with a sanitized utensil or shaking/rocking the sealed fermenter back and forth for 5 or 10 minutes. Ferment for approximately 3 days at the temperature recommended by the yeast manufacturer. Generally, for Ales: 55°F to 78°F, and for Lagers: 46°F to 58°F.",
            "Rapidly cool wort to below 70°F; from this point on, use only properly sanitized utensils and equipment! Transfer the wort to the sanitized fermenting bucket or carboy. Top off with water to make 5 gallons, making sure that any water you add gets thoroughly mixed with the wort before taking a test sample.",
            "Take sample of wort and measure the Original Gravity with a hydrometer (with sample at 60°F). DO NOT add sample back to cooled wort.",
            "Pitch the yeast into cooled wort. Aerate the wort thoroughly. If you don't own an aeration pump or pure-oxygen system then aerate wort by vigorously stirring with a sanitized utensil or shaking/rocking the sealed fermenter back and forth for 5 or 10 minutes.",
            "Ferment for approximately 3 days at the temperature recommended by the yeast manufacturer. Generally, for Ales: 55°F to 78°F, and for Lagers: 46°F to 58°F.",
            "Bottling: Boil the priming sugar with a small amount of water for 5 to 10 minutes then add to the bottling bucket. Siphon the finished beer off from the layer of sediment into the bottling bucket. Fill sanitized bottles and cap.",
            "Boil the priming sugar with a small amount of water for 5 to 10 minutes then add to the bottling bucket. Siphon the finished beer off from the layer of sediment into the bottling bucket. Fill sanitized bottles and cap."
        ],
        "picture_link": null,
        "color": 6887390
    }
}