{
    "recipe": {
        "title": "Lamb Shoulder Chops with Apples and Prunes ",
        "ingredients": [
            "1/4 cup brandy",
            "1 teaspoon cider vinegar",
            "10 pitted prunes, chopped",
            "1 Turkish or 1/2 California bay leaf",
            "4 (1/2-inch-thick) lamb shoulder chops (about 1/2 pound each)",
            "1 tablespoon olive oil",
            "1 tablespoon unsalted butter",
            "1 Gala apple, peeled and cut into 1/2-inch pieces",
            "1/4 cup finely chopped shallot",
            "2 garlic cloves, finely chopped",
            "1 cup reduced-sodium chicken broth"
        ],
        "instructions": [
            "Combine brandy, vinegar, prunes, and bay leaf and let stand until ready to use. Pat lamb chops dry and season with 1 teaspoon salt and 1/2 teaspoon pepper. Heat oil in a 12-inch heavy skillet over high heat until it shimmers. Cook lamb, turning once, 6 to 7 minutes total for medium-rare. Transfer to a plate and let stand, loosely covered. Discard fat from skillet. Add butter and apple to skillet and sauté over medium-high heat until beginning to brown, about 3 minutes. Add shallot and garlic and sauté 2 minutes. Remove from heat and add prune mixture. Boil until liquid is reduced to a glaze. Add chicken broth and any meat juices from plate and simmer, crushing prunes with a fork, until slightly thickened, about 2 minutes. Season with salt and pepper and discard bay leaf. Serve over lamb.",
            "Combine brandy, vinegar, prunes, and bay leaf and let stand until ready to use.",
            "Pat lamb chops dry and season with 1 teaspoon salt and 1/2 teaspoon pepper. Heat oil in a 12-inch heavy skillet over high heat until it shimmers. Cook lamb, turning once, 6 to 7 minutes total for medium-rare. Transfer to a plate and let stand, loosely covered. Discard fat from skillet.",
            "Add butter and apple to skillet and sauté over medium-high heat until beginning to brown, about 3 minutes. Add shallot and garlic and sauté 2 minutes. Remove from heat and add prune mixture. Boil until liquid is reduced to a glaze. Add chicken broth and any meat juices from plate and simmer, crushing prunes with a fork, until slightly thickened, about 2 minutes. Season with salt and pepper and discard bay leaf. Serve over lamb."
        ],
        "picture_link": null
    }
}