{
    "recipe": {
        "title": "Lamb Chili with Masa Harina Dumplings ",
        "ingredients": [
            "10 dried mild New Mexico chiles (2 1/2 to 3 oz)",
            "5 cups water",
            "3 1/4 lb boneless lamb shoulder, trimmed and cut into 1 1/2-inch pieces",
            "1/2 teaspoon black pepper",
            "1 1/4 teaspoons salt",
            "3 tablespoons lard or vegetable oil",
            "1 large onion, chopped (2 cups)",
            "4 garlic cloves, minced",
            "2 Turkish bay leaves or 1 California",
            "2 teaspoons ground cumin",
            "1 1/2 teaspoons dried oregano, crumbled",
            "3 tablespoons finely chopped canned chipotle chiles in adobo",
            "3/4 cup masa harina (corn tortilla mix)",
            "1/4 cup all-purpose flour",
            "1 teaspoon baking powder",
            "1/4 teaspoon baking soda",
            "1/4 teaspoon salt",
            "1/4 cup chilled lard or unsalted butter, cut into small pieces",
            "3/4 cup well-shaken buttermilk",
            "2 tablespoons chopped fresh cilantro"
        ],
        "instructions": [
            "Simmer dried chiles in 2 cups water, covered, in a 2-quart heavy saucepan until very soft, about 20 minutes. Reserve 3/4 cup cooking liquid, then drain in a colander. Stem chiles (do not remove seeds), then purée in a blender with reserved cooking liquid until smooth (use caution when blending hot liquids). Force purée through a fine-mesh sieve into a bowl. Reserve purée.",
            "Pat lamb dry, then sprinkle with pepper and 1 teaspoon salt. Heat 2 tablespoons lard in a 6-quart wide heavy pot or a 3-inch-deep straight-sided skillet over moderately high heat until hot but not smoking, then brown lamb in 4 batches (without crowding), turning occasionally, about 5 minutes per batch. Transfer to a bowl.",
            "Add remaining tablespoon lard to pot, then cook onion, garlic, bay leaves, and remaining 1/4 teaspoon salt over moderate heat, stirring occasionally, until softened, 4 to 5 minutes. Add cumin and oregano and cook, stirring frequently, 1 minute. Stir in reserved chile purée and chipotles and simmer, stirring frequently and scraping up brown bits from bottom of pot, 5 minutes. Add lamb along with any juices accumulated in bowl and remaining 3 cups water, then bring to a boil. Reduce heat and simmer, covered, until lamb is tender, about 2 1/2 hours.",
            "Make dumplings: Stir together masa harina, flour, baking powder, baking soda, and salt in a bowl. Blend in lard pieces with a pastry blender or your fingertips until mixture resembles coarse meal. Add buttermilk, stirring just until dough is moistened (do not overmix). Skim fat off chili and discard bay leaves, then drop 8 or 9 heaping tablespoons of dough onto simmering chili, about 2 inches apart. Reduce heat to low and gently simmer, covered, until tops of dumplings are dry to the touch, 15 to 20 minutes. Sprinkle with cilantro.",
            "Stir together masa harina, flour, baking powder, baking soda, and salt in a bowl. Blend in lard pieces with a pastry blender or your fingertips until mixture resembles coarse meal. Add buttermilk, stirring just until dough is moistened (do not overmix).",
            "Skim fat off chili and discard bay leaves, then drop 8 or 9 heaping tablespoons of dough onto simmering chili, about 2 inches apart. Reduce heat to low and gently simmer, covered, until tops of dumplings are dry to the touch, 15 to 20 minutes. Sprinkle with cilantro."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd6f9f3a00aeb2f1d2666/6:4/w_274%2Ch_169/233796.jpg"
    }
}