{
    "recipe": {
        "title": "Lamb Chops with Polenta and Grilled Scallion Sauce ",
        "ingredients": [
            "8 lamb rib or loin chops (about 2 pounds)",
            "1 1/2 teaspoons plus 1/8 teaspoon kosher salt, divided",
            "1/2 teaspoon freshly ground black pepper",
            "1 pound prepared polenta, sliced into 1/2\" rounds",
            "1/2 cup olive oil, plus more for brushing",
            "1 bunch of scallions, roots trimmed",
            "1 jalapeño, halved lengthwise",
            "1 cup basil leaves, finely chopped",
            "1/4 cup fresh lemon juice",
            "3 tablespoons plain yogurt",
            "6 cups torn leafy lettuce, such as green leaf lettuce",
            "1 cup cherries (about 6 ounces), pitted, halved"
        ],
        "instructions": [
            "Season lamb chops with 1 tsp. salt and 1/2 tsp. pepper. Prepare a grill or grill pan for medium-high heat. Brush polenta slices lightly with oil on both sides.",
            "Working in batches if needed, grill scallions, jalapeño, lamb chops, and polenta slices until lightly charred and an instant-read thermometer inserted into the thickest part of lamb registers 125°F for medium-rare, 2–3 minutes per side. The scallions may take a couple minutes longer; you want them to be nice and tender before you remove them from the grill.",
            "Finely chop scallions and jalapeño. Transfer to a medium bowl. Add basil, lemon juice, 1/2 cup oil, and 1/2 tsp. salt and whisk to combine. Transfer 1/4 cup scallion sauce to a large bowl and whisk in yogurt and remaining 1/8 tsp. salt. Add lettuce and cherries and gently toss with your hands until thoroughly coated.",
            "Divide salad among plates. Arrange lamb and polenta alongside, then top both with remaining scallion sauce.",
            "Do Ahead Scallion sauce can be made 2 days ahead. Transfer to an airtight container and chill.",
            "Scallion sauce can be made 2 days ahead. Transfer to an airtight container and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/594062e96c15d005a3037963/6:4/w_274%2Ch_169/LAMB-CHOPS-WITH-POLENTA-AND-GRILLED-SCALLION-SAUCE-hero-09062017.jpg",
        "color": 5639005
    }
}