{
    "recipe": {
        "title": "Lamb Shoulder with Citrus-Fennel Salad ",
        "ingredients": [
            "1 (5 1/2–6-lb.) lamb shoulder (not tied)",
            "Kosher salt, freshly ground black pepper",
            "6 garlic cloves, finely grated, plus 2 heads, halved crosswise",
            "2 Tbsp. extra-virgin olive oil",
            "1 tsp. crushed red pepper flakes",
            "1 tsp. finely grated orange zest, plus one (3x1\") strip zest",
            "2 Tbsp. finely chopped rosemary, plus more for serving",
            "1 cup dry white wine",
            "6–8 mixed small oranges (such as blood, mandarin, and navel), peeled, halved, sliced or torn into small sections",
            "1 large fennel bulb with fronds, thinly sliced",
            "2 Tbsp. fresh lemon juice"
        ],
        "instructions": [
            "Preheat oven to 300°F. Using a sharp knife, score fat across the top of lamb shoulder to create a crosshatch pattern, cutting about 1/4\" deep and spacing cuts about 3/4\" apart. Season generously all over with salt and pepper. Combine grated garlic, oil, red pepper flakes, grated zest, and 2 Tbsp. rosemary in a small bowl. Rub all over lamb, working into score marks and anywhere there is an opening. Place lamb in a large cast-iron skillet or baking dish. (At this point the lamb can be covered and chilled up to 1 day if you want to break up the prep.) Arrange garlic heads, cut side down, around lamb and add strip of zest. Pour in wine and cover tightly with foil. Roast until meat is falling off the bone and fork-tender, 5–5 1/2 hours. Keep covered and let rest 30 minutes. Gently toss orange pieces and fennel with lemon juice in a medium bowl; season lightly with salt. Tear the meat off the bones in large pieces and mound on a platter. Arrange citrus and fennel salad next to meat. Top meat with more rosemary and drizzle pan juices over.",
            "Preheat oven to 300°F. Using a sharp knife, score fat across the top of lamb shoulder to create a crosshatch pattern, cutting about 1/4\" deep and spacing cuts about 3/4\" apart. Season generously all over with salt and pepper.",
            "Combine grated garlic, oil, red pepper flakes, grated zest, and 2 Tbsp. rosemary in a small bowl. Rub all over lamb, working into score marks and anywhere there is an opening. Place lamb in a large cast-iron skillet or baking dish. (At this point the lamb can be covered and chilled up to 1 day if you want to break up the prep.)",
            "Arrange garlic heads, cut side down, around lamb and add strip of zest. Pour in wine and cover tightly with foil. Roast until meat is falling off the bone and fork-tender, 5–5 1/2 hours. Keep covered and let rest 30 minutes.",
            "Gently toss orange pieces and fennel with lemon juice in a medium bowl; season lightly with salt.",
            "Tear the meat off the bones in large pieces and mound on a platter. Arrange citrus and fennel salad next to meat. Top meat with more rosemary and drizzle pan juices over.",
            "Do Ahead Lamb can be roasted 1 day ahead. Let cool; cover and chill. Gently reheat, covered, in a 300°F oven until warmed all the way through, at least 1 hour, before serving.",
            "Lamb can be roasted 1 day ahead. Let cool; cover and chill. Gently reheat, covered, in a 300°F oven until warmed all the way through, at least 1 hour, before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aa0123e0417870523468fc0/6:4/w_274%2Ch_169/lamb-shoulder-with-citrus-fennel-salad-recipe-BA-030718.jpg"
    }
}