{
    "recipe": {
        "title": "Lamb Chops with Greens and Sorrel Salsa Verde ",
        "ingredients": [
            "8 1 1/2-2\"-thick lamb loin chops (about 3 pounds)",
            "Kosher salt, freshly ground pepper",
            "2/3 cup sorrel or spinach leaves",
            "1/3 cup mint leaves",
            "1/3 cup parsley leaves",
            "1 tablespoon finely grated lemon zest",
            "1 teaspoon crushed red pepper flakes",
            "5 garlic cloves, thinly sliced, divided",
            "1/3 cup plus 2 tablespoons olive oil",
            "4 ounces king oyster or maitake mushrooms, cut into 1/2\" pieces",
            "1 shallot, thinly sliced",
            "1 bunch mustard greens, ribs and stems removed, leaves torn into pieces",
            "1 tablespoon white balsamic vinegar",
            "1 tablespoon fresh lemon juice (add up to 3 tablespoons total if using spinach)"
        ],
        "instructions": [
            "Pat lamb dry; season with salt and pepper. Let sit at room temperature 1 hour.",
            "Meanwhile, puree sorrel, mint, parsley, lemon zest, red pepper flakes, about 1 garlic clove, and 1/3 cup oil in a blender, scraping down sides as needed, until mixture is smooth. Season salsa verde with salt and pepper; set aside.",
            "Prepare grill for high heat (or heat a grill pan over high). Grill chops, turning every 2 minutes or so, until well browned and beginning to char and a thermometer inserted into the thickest part registers 125°, 8–10 minutes. Let lamb rest at least 10 minutes.",
            "While lamb is resting, heat remaining 2 tablespoons oil in a large skillet over medium-high. Cook mushrooms, tossing occasionally, until well browned, about 4 minutes. Transfer to a large plate.",
            "Reduce heat to medium and add shallot and remaining garlic to skillet. Cook, stirring occasionally, until shallot is softened and starting to brown, about 2 minutes. Add greens; season with salt and pepper. Cook, stirring occasionally, until wilted and bright green, about 2 minutes. Return mushrooms to skillet and toss to combine. Stir in vinegar; season with salt and pepper.",
            "Stir lemon juice into salsa verde; taste and adjust seasoning with salt and pepper. Serve lamb chops over mustard greens with salsa verde.",
            "Do ahead: Salsa verde (without lemon juice) can be made 1 day ahead. Cover and chill. Add lemon juice before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5537e4c967c3a7e837c3f27f/6:4/w_274%2Ch_169/56389422_lamb-chops_1x1.jpg",
        "color": 2745820
    }
}