{
    "recipe": {
        "title": "Lamb Stew with Sautéed Morning Glory ",
        "ingredients": [
            "3 pounds boneless leg of lamb cut into 1-inch pieces",
            "2 tablespoons olive oil, plus more for drizzling",
            "4 garlic cloves chopped",
            "2 red onions sliced",
            "2 habanero chiles seeds and ribs removed, chopped",
            "1 teaspoon coriander seeds",
            "1 teaspoon ground cumin",
            "1 tablespoon chopped thyme",
            "1 cup unsalted, roasted, skinless peanuts coarsely chopped",
            "5 cups chicken stock",
            "1 cup coconut milk",
            "Zest of 1 lemon",
            "Juice of 2 lemons",
            "About 1 yam peeled and cut into 1/2-inch cubes (1 cup)",
            "About 1 medium Yukon Gold potato peeled and cut into 1/2-inch cubes (1 cup)",
            "1 cup canned crushed tomatoes",
            "1 tablespoon Dijon mustard",
            "2 teaspoons salt",
            "2 tablespoons chopped parsley",
            "2 avocados each halved, peeled, pitted, and cut into 6 wedges",
            "2 teaspoons peanut oil",
            "2 cups shiitake mushrooms sliced",
            "One 1-inch piece ginger peeled and minced",
            "3 garlic cloves chopped",
            "2 teaspoons sesame seeds",
            "1/2 teaspoon toasted sesame oil",
            "2 pounds roughly chopped morning glory (about 4 cups; see Tip)",
            "2 tablespoons soy sauce",
            "2 tablespoons fresh lime juice",
            "Salt and freshly ground black pepper"
        ],
        "instructions": [
            "1 Bring 4 quarts water to a boil in a large pot. Add the lamb and reduce the heat to a simmer. Cook for 10 minutes. Strain and pat dry. 2 Heat the 2 tablespoons olive oil in a large Dutch oven over medium heat. Add the garlic, onions, chiles, coriander seeds, cumin, thyme, and peanuts and toast until the peanuts are golden and the onions are translucent, about 5 minutes. Add the lamb, chicken stock, and coconut milk and bring to a simmer. Cook for 1 hour. 3 Add the lemon zest, lemon juice, yams, potatoes, and tomatoes and simmer until the potatoes are tender, about another 20 minutes. Stir in the mustard, salt, and parsley and simmer for 5 more minutes. Fold in the avocado. Drizzle with olive oil and serve with the sautéed morning glory.",
            "1 Bring 4 quarts water to a boil in a large pot. Add the lamb and reduce the heat to a simmer. Cook for 10 minutes. Strain and pat dry.",
            "2 Heat the 2 tablespoons olive oil in a large Dutch oven over medium heat. Add the garlic, onions, chiles, coriander seeds, cumin, thyme, and peanuts and toast until the peanuts are golden and the onions are translucent, about 5 minutes. Add the lamb, chicken stock, and coconut milk and bring to a simmer. Cook for 1 hour.",
            "3 Add the lemon zest, lemon juice, yams, potatoes, and tomatoes and simmer until the potatoes are tender, about another 20 minutes. Stir in the mustard, salt, and parsley and simmer for 5 more minutes. Fold in the avocado. Drizzle with olive oil and serve with the sautéed morning glory.",
            "Sautéed Morning Glory: 1 Heat the peanut oil in a wok or large sauté pan over high heat. Add the mushrooms and cook until caramelized, about 3 minutes. Add ginger and garlic and cook until fragrant, about 2 minutes. Add the sesame seeds and sesame oil and toss to coat. Add the morning glory and sauté until the leaves begin to wilt, about 2 minutes. Stir in the soy sauce and lime juice and season with salt and pepper.",
            "1 Heat the peanut oil in a wok or large sauté pan over high heat. Add the mushrooms and cook until caramelized, about 3 minutes. Add ginger and garlic and cook until fragrant, about 2 minutes. Add the sesame seeds and sesame oil and toss to coat. Add the morning glory and sauté until the leaves begin to wilt, about 2 minutes. Stir in the soy sauce and lime juice and season with salt and pepper."
        ],
        "picture_link": null
    }
}