{
    "recipe": {
        "title": "Lamb Burgers with Lemon-Caper Aioli and Fennel Slaw ",
        "ingredients": [
            "1/4 cup rinsed salt-packed capers",
            "1 cup mayonnaise",
            "2 tablespoons olive oil",
            "1 teaspoon finely grated lemon zest",
            "3 tablespoons (or more) fresh lemon juice",
            "1 teaspoon Dijon mustard",
            "2 garlic cloves, finely grated",
            "Kosher salt",
            "1 1/2 pounds ground lamb, preferably grass-fed",
            "Kosher salt",
            "4 tablespoons olive oil, divided",
            "3 celery stalks, thinly sliced on the diagonal",
            "1/2 fennel bulb, thinly sliced; plus 1/4 cup chopped fennel fronds (optional)",
            "1/4 large sweet onion, thinly sliced",
            "3 tablespoons fresh lemon juice",
            "2 teaspoons crushed dried mint",
            "Freshly ground black pepper",
            "4 potato or ciabatta rolls, toasted",
            "Boquerones (marinated white anchovies; for serving)"
        ],
        "instructions": [
            "Lemon-Caper Aioli: Place capers in a small bowl and pour in warm water to cover. Let soak 20 minutes. Drain, rinse, and pat dry. Coarsely chop. Whisk capers, mayonnaise, oil, lemon zest, lemon juice, mustard, and garlic in a medium bowl; taste and season with salt and more lemon juice, if desired.",
            "Place capers in a small bowl and pour in warm water to cover. Let soak 20 minutes. Drain, rinse, and pat dry. Coarsely chop.",
            "Whisk capers, mayonnaise, oil, lemon zest, lemon juice, mustard, and garlic in a medium bowl; taste and season with salt and more lemon juice, if desired.",
            "Assembly: Shape lamb into 4 patties about 1\" thick, season with salt, and let sit at room temperature 30 minutes. Heat 2 Tbsp. oil in a large skillet, ideally cast iron, over medium. Cook lamb patties, working in batches if needed, until browned (they won’t take on as much color as a beef burger), 5–7 minutes. Turn and cook until browned on second side, about 5 minutes for medium-rare. Transfer patties to a plate and let rest 10 minutes. Meanwhile, toss celery, fennel, fennel fronds (if using), onion, lemon juice, dried mint, and remaining 2 Tbsp. oil in a medium bowl. Season slaw with salt and pepper. Generously spread aioli on cut sides of buns and build each burger with a lamb patty, 3 or 4 boquerones, and a mound of slaw. This is a messy burger, so the bib is not optional.",
            "Shape lamb into 4 patties about 1\" thick, season with salt, and let sit at room temperature 30 minutes.",
            "Heat 2 Tbsp. oil in a large skillet, ideally cast iron, over medium. Cook lamb patties, working in batches if needed, until browned (they won’t take on as much color as a beef burger), 5–7 minutes. Turn and cook until browned on second side, about 5 minutes for medium-rare. Transfer patties to a plate and let rest 10 minutes.",
            "Meanwhile, toss celery, fennel, fennel fronds (if using), onion, lemon juice, dried mint, and remaining 2 Tbsp. oil in a medium bowl. Season slaw with salt and pepper.",
            "Generously spread aioli on cut sides of buns and build each burger with a lamb patty, 3 or 4 boquerones, and a mound of slaw. This is a messy burger, so the bib is not optional.",
            "Do Ahead Aioli can be made 1 day ahead. Cover and chill.",
            "Aioli can be made 1 day ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59693928ca5db8038f8fa811/6:4/w_274%2Ch_169/lamb-burgers-with-lemon-caper-aioli-and-fennel-slaw-recipe-BA-071417.jpg"
    }
}