{
    "recipe": {
        "title": "Latke Reubens ",
        "ingredients": [
            "2 tablespoons apple cider vinegar",
            "1 tablespoon spicy brown mustard",
            "1 1/2 teaspoons light or dark brown sugar",
            "1/4 teaspoon kosher salt",
            "Freshly ground black pepper",
            "2 tablespoons canola oil",
            "1 1/2 cups shredded green cabbage (about a quarter of a small head)",
            "1 Granny Smith apple, cut into matchsticks",
            "3/4 cup thinly sliced red onion (about half small onion)",
            "2 celery ribs, thinly sliced",
            "2 tablespoons chopped fresh dill",
            "3/4 cup sour cream",
            "1/4 cup ketchup",
            "1 tablespoon prepared white horseradish",
            "1 teaspoon hot sauce",
            "3 1/2 pounds baking potatoes, peeled and quartered lengthwise",
            "1 large yellow onion, peeled and cut into 8 wedges",
            "1/2 cup unbleached all-purpose flour",
            "2 large eggs, lightly beaten",
            "2 tablespoons chopped fresh dill",
            "1/4 teaspoon baking powder",
            "Kosher salt",
            "Canola oil for frying",
            "1/2 pound thinly sliced pastrami, slices cut in half crosswise",
            "Chopped fresh dill"
        ],
        "instructions": [
            "Slaw: In a large bowl, stir together the vinegar, mustard, sugar, salt, and a generous pinch of pepper. Slowly whisk in the oil until well combined. Add the cabbage, apple, onion, celery, and dill to the dressing; toss thoroughly to combine. Adjust the seasoning to taste. Let the slaw stand at room temperature for 30 minutes before serving.",
            "In a large bowl, stir together the vinegar, mustard, sugar, salt, and a generous pinch of pepper. Slowly whisk in the oil until well combined.",
            "Add the cabbage, apple, onion, celery, and dill to the dressing; toss thoroughly to combine. Adjust the seasoning to taste. Let the slaw stand at room temperature for 30 minutes before serving.",
            "Dressing: In a medium bowl, stir together all of the ingredients. Adjust the hot sauce to taste. The dressing can be refrigerated in an airtight container for up to 2 weeks.",
            "In a medium bowl, stir together all of the ingredients. Adjust the hot sauce to taste. The dressing can be refrigerated in an airtight container for up to 2 weeks.",
            "Latkes: Set a large strainer over a bowl. In a food processor fitted with the shredding disk, shred the potatoes and onion in batches. Add each batch to the strainer and let stand for 5 minutes, then squeeze dry. Pour off the liquid and rinse the bowl, then add the shredded potato mixture. Stir in the flour, eggs, dill, baking powder, and 1 1/2 teaspoons salt. Scrape the mixture back into the strainer and set it over the bowl again; let stand for another 5 minutes. In a large skillet, heat 1/4 inch of canola oil over medium-high heat until shimmering. Working in batches, spoon a scant 1/4 cup of the potato mixture into the hot oil for each latke, pressing slightly to flatten. Fry over moderate heat, turning once, until the latkes are golden and crisp on both sides, about 7 minutes. Drain the latkes on a paper towel–lined baking sheet. Season well with salt.",
            "Set a large strainer over a bowl. In a food processor fitted with the shredding disk, shred the potatoes and onion in batches. Add each batch to the strainer and let stand for 5 minutes, then squeeze dry. Pour off the liquid and rinse the bowl, then add the shredded potato mixture. Stir in the flour, eggs, dill, baking powder, and 1 1/2 teaspoons salt. Scrape the mixture back into the strainer and set it over the bowl again; let stand for another 5 minutes.",
            "In a large skillet, heat 1/4 inch of canola oil over medium-high heat until shimmering. Working in batches, spoon a scant 1/4 cup of the potato mixture into the hot oil for each latke, pressing slightly to flatten. Fry over moderate heat, turning once, until the latkes are golden and crisp on both sides, about 7 minutes. Drain the latkes on a paper towel–lined baking sheet. Season well with salt.",
            "To assemble: Spread about 1 teaspoon of the dressing on each latke. Top with a folded slice of pastrami and a heaping tablespoon of the slaw. Garnish with dill and serve.",
            "Spread about 1 teaspoon of the dressing on each latke. Top with a folded slice of pastrami and a heaping tablespoon of the slaw. Garnish with dill and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a666363b3eacc1899e1a4d7/6:4/w_274%2Ch_169/latke-reubens-recipe-gail-simmons.jpg"
    }
}