{
    "recipe": {
        "title": "Latkes with Lots of Sauces ",
        "ingredients": [
            "1 cup (8 oz/250 g) sour cream",
            "3 oz (90 g) lox, diced",
            "1 Tbsp minced fresh chives",
            "1 cup (9 oz/280 g) applesauce",
            "1 Tbsp ground cinnamon",
            "1 Tbsp light brown sugar",
            "1 Tbsp granulated sugar",
            "1 tsp ground ginger",
            "4 Russet potatoes, peeled",
            "1 yellow onion, minced",
            "3 large eggs, lightly beaten",
            "1/4 cup (1 1/2 oz/45 g) plus 2 Tbsp all-purpose flour",
            "2 Tbsp minced fresh chives",
            "1 garlic clove, minced",
            "Salt and freshly ground pepper",
            "Olive oil for frying"
        ],
        "instructions": [
            "1. Preheat the oven to 200°F (95°C). Fit a baking sheet with a wire rack and set aside.",
            "2. To make the sauces, stir together the ingredients for each in separate small bowls. Transfer to serving dishes and refrigerate.",
            "3. Using the large holes on a box grater, shred the potatoes into a large bowl of water. Drain the potatoes and rinse under cold running water. Drain again thoroughly, squeezing to remove as much liquid as possible. Transfer the potatoes to a clean kitchen towel and squeeze to dry even further, and then place in a large bowl. Wrap the minced onion in a double thickness of paper towels, squeeze to remove as much moisture as possible, and add to the bowl. Add the eggs, flour, chives, garlic, and salt and pepper to taste and stir to mix well.",
            "4. Pour the oil into a large frying pan to a depth of about 1/2 inch (12 mm) and heat over medium heat. Using your hands, scoop up a portion of the potato mixture and shape it into a ball slightly larger than a golf ball. Flatten into a very thin pancake, still blotting with paper towels as needed to remove any remaining moisture, and place in the hot oil. Repeat to add 2 or 3 more latkes to the pan, making sure not to overlap them or crowd the pan. Cook until golden brown on the first side, about 3 minutes. Using a slotted spatula, turn the latkes and cook until golden brown on the second side, 2-3 minutes longer. Transfer to the wire rack on the baking sheet and place the baking sheet in the warm oven. Repeat to cook the remaining latkes, adding them to the oven as they are finished. When all of the latkes are cooked, serve right away with the sauces."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b07d7e1cc76a014cfa956e/6:4/w_274%2Ch_169/51116000_latkes_1x1.jpg"
    }
}