{
    "recipe": {
        "title": "Laurie Osteen's Coconut Cake ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "All-purpose flour (for pans)",
            "1 15 to 16-ounce box yellow cake mix",
            "4 large eggs",
            "1/2 cup vegetable oil",
            "1 cup plus 1 tablespoon whole milk",
            "2 cups unsweetened shredded coconut",
            "1 cup sugar",
            "1/2 cup sour cream",
            "1/2 teaspoons kosher salt",
            "Three 8\"-diameter cake pans"
        ],
        "instructions": [
            "Preheat oven to 350°F. Coat cake pans with nonstick spray. Dust with flour, tapping out excess. Whisk cake mix, eggs, oil, and 1 cup milk in a large bowl until no lumps remain. Divide batter evenly among prepared pans; smooth tops. Bake cakes until a tester inserted into the centers comes out clean, 10-15 minutes. Meanwhile, mix coconut, sugar, sour cream, salt, and remaining 1 tablespoon milk in a medium bowl to combine; set frosting aside. Transfer pans to wire racks; let cool 5 minutes. Turn cakes out onto racks and spread frosting over tops of warm cakes, dividing evenly. Stack cakes. Let stand at room temperature, covered with a cake dome, or loosely tented with foil, at least 4 hours before serving. DO AHEAD: Cake can be made 2 days ahead. Store airtight at room temperature.",
            "Preheat oven to 350°F. Coat cake pans with nonstick spray. Dust with flour, tapping out excess.",
            "Whisk cake mix, eggs, oil, and 1 cup milk in a large bowl until no lumps remain. Divide batter evenly among prepared pans; smooth tops.",
            "Bake cakes until a tester inserted into the centers comes out clean, 10-15 minutes.",
            "Meanwhile, mix coconut, sugar, sour cream, salt, and remaining 1 tablespoon milk in a medium bowl to combine; set frosting aside.",
            "Transfer pans to wire racks; let cool 5 minutes. Turn cakes out onto racks and spread frosting over tops of warm cakes, dividing evenly. Stack cakes. Let stand at room temperature, covered with a cake dome, or loosely tented with foil, at least 4 hours before serving.",
            "DO AHEAD: Cake can be made 2 days ahead. Store airtight at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55fc7343cb84959337fd4773/6:4/w_274%2Ch_169/51161060_laurie-osteens-coconut-cake.jpg"
    }
}