{
    "recipe": {
        "title": "Lauren's Peanut Butter Kiss Cookies ",
        "ingredients": [
            "1 3/4 cups all-purpose flour",
            "1 teaspoon baking soda",
            "1/2 teaspoon salt",
            "1 cup sugar",
            "1/2 cup packed dark brown sugar",
            "8 tablespoons (1 stick) unsalted butter, cut into small pieces",
            "1/2 cup smooth or chunky peanut butter (not natural)",
            "1 large egg",
            "1 teaspoon pure vanilla or almond extract",
            "30 chocolate kisses, unwrapped",
            "2 large baking sheets"
        ],
        "instructions": [
            "Position a rack in the upper third of the oven and a second rack in the lower third then preheat to 350°F.",
            "In a large bowl, sift together the flour, baking soda, and salt.",
            "Place 1/2 cup sugar in a small bowl.",
            "In the bowl of a stand mixer fitted with the paddle attachment, combine the remaining 1/2 cup sugar with the brown sugar, butter, and peanut butter and beat on medium speed, scraping the bowl occasionally, until light and fluffy, 2 to 3 minutes. Add the egg and vanilla or almond extract and beat on medium until fully incorporated, about 1 minute. With the mixer on low, add the flour mixture and stir until just combined. Roll the dough into walnut-size balls, roll in sugar, and arrange on baking sheets, leaving about 2 inches between cookies. Bake, switching the cookies between the upper and lower racks about halfway through baking, until just starting to brown, 8 to 10 minutes. Remove the cookies from the oven and press a chocolate kiss into the center of each. Cool the cookies on baking sheets for 10 minutes before transferring to a wire rack to cool completely. Continue baking cookies on cooled baking sheets. DO AHEAD: The cookies can be baked ahead and stored, in an airtight container at room temperature, up to 3 days."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b281f99a93d64c380b0951/6:4/w_274%2Ch_169/368711_peanut-butter-kiss-cookies_1x1.jpg",
        "color": 12933366
    }
}