{
    "recipe": {
        "title": "Layered Apple Pie With Phyllo Crust ",
        "ingredients": [
            "1/2 cup (1 stick) unsalted butter, melted, divided",
            "1 cup granulated sugar",
            "1/4 cup (packed) dark brown sugar",
            "2 1/2 teaspoons ground cinnamon",
            "10 sheets frozen phyllo pastry, thawed (each about 13x18 inches)",
            "1/4 cup fresh lemon juice",
            "2 1/2 pounds Gala apples, preferably small (about 6)",
            "A 9\" pie pan (not deep dish), pastry brush, mandoline"
        ],
        "instructions": [
            "Preheat oven to 325°F. Brush pie pan with about 1 Tbsp. butter.",
            "Whisk granulated sugar, brown sugar, and cinnamon in a medium bowl.",
            "Place 2 phyllo sheets on a work surface with the long side facing you; keep remaining phyllo covered with plastic wrap. Using pastry brush, lightly brush entire surface with butter, then sprinkle 1 Tbsp. cinnamon sugar on right half of phyllo. Fold left half of both sheets over to enclose sugar. Brush surface lightly with butter. Press folded phyllo, buttered side down, into center and edges of prepared pan, leaving an equal overhang on two opposite sides. Repeat with remaining phyllo sheets, rotating where the overhang lies to create a star-like pattern.",
            "Pour lemon juice into a large bowl. Very thinly slice apples crosswise into rounds with mandoline (about 1 mm thick), transferring to lemon juice and tossing gently to coat as you go.",
            "Layer apple slices in phyllo-lined pan, overlapping in concentric circles to form a single even layer. Sprinkle with 1 Tbsp. cinnamon sugar. Repeat with remaining apple slices, sprinkling with 1 Tbsp. cinnamon sugar between each layer and pressing firmly with clean hands to compact. Repeat until pan is full, then sprinkle top with 2 Tbsp. cinnamon sugar (you may have leftover cinnamon sugar depending on the size of your apples; save for another use).",
            "Place pie pan on a rimmed baking sheet and tent with 2 pieces of overlapping foil, making sure phyllo crust is fully covered. Bake pie 2 hours. Remove foil and continue to bake until crust is golden brown, 15–20 more minutes. Transfer to a wire rack. Using a clean pastry brush, brush juices from the edges of filling over top to create a shiny glaze. Let cool completely (apples will collapse and set as pie cools; this is okay) before serving.",
            "Do Ahead Pie can be made 1 day ahead; store at room temperature.",
            "Pie can be made 1 day ahead; store at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/561d75b153de6d0d5cde359f/6:4/w_274%2Ch_169/EP_09292015_thanksgivingpie_apple.jpg",
        "color": 13441973
    }
}