{
    "recipe": {
        "title": "Lemon Curd Marbled Cheesecake ",
        "ingredients": [
            "1 teaspoon finely grated fresh lemon zest",
            "1/2 cup fresh lemon juice",
            "1/2 cup sugar",
            "3 large eggs",
            "1/2 stick (1/4 cup) unsalted butter, cut into small pieces",
            "1 1/3 cups finely ground graham cracker crumbs (5 oz)",
            "1/3 cup sugar",
            "1/8 teaspoon salt",
            "5 tablespoons unsalted butter, melted",
            "3 (8-oz) packages cream cheese, softened",
            "1 cup sugar",
            "3 large eggs",
            "3/4 cup sour cream",
            "1 teaspoon vanilla",
            "Accompaniment: blueberries",
            "a 9- to 91/2-inch (24-cm) springform pan"
        ],
        "instructions": [
            "Make lemon curd: Whisk together zest, juice, sugar, and eggs in a 2-quart heavy saucepan. Add butter and cook over moderately low heat, whisking frequently, until curd is thick enough to hold marks of whisk and first bubbles appear on surface, about 6 minutes. Force lemon curd through a fine-mesh sieve into a wide shallow dish, scraping bottom of sieve, then cover surface with wax paper. Cool completely, stirring occasionally, about 30 minutes.",
            "Whisk together zest, juice, sugar, and eggs in a 2-quart heavy saucepan. Add butter and cook over moderately low heat, whisking frequently, until curd is thick enough to hold marks of whisk and first bubbles appear on surface, about 6 minutes.",
            "Force lemon curd through a fine-mesh sieve into a wide shallow dish, scraping bottom of sieve, then cover surface with wax paper. Cool completely, stirring occasionally, about 30 minutes.",
            "Make and bake crust: Put oven rack in middle position and preheat oven to 350°F. Invert bottom of springform pan (to make it easier to slide cake off bottom), then lock on side. 3Stir together crust ingredients in a bowl, then press onto bottom and 1 inch up side of springform pan. Place springform pan in a shallow baking pan and bake 10 minutes, then cool crust completely in springform pan on a rack.",
            "Put oven rack in middle position and preheat oven to 350°F. Invert bottom of springform pan (to make it easier to slide cake off bottom), then lock on side. 3Stir together crust ingredients in a bowl, then press onto bottom and 1 inch up side of springform pan. Place springform pan in a shallow baking pan and bake 10 minutes, then cool crust completely in springform pan on a rack.",
            "Make filling and bake cheesecake: Reduce oven temperature to 300°F. Beat together cream cheese and sugar in a bowl with an electric mixer at medium speed until smooth, 1 to 2 minutes. Reduce speed to low and add eggs 1 at a time, beating until incorporated. Beat in sour cream and vanilla until combined. Pour two thirds of cream cheese filling into crust, then spoon half of lemon curd over filling and swirl curd into filling with a small knife. (Avoid touching crust with knife to prevent crumbs getting into filling.) Repeat with remaining filling and curd. Bake cheesecake until set 1 1/2 inches from edge but center trembles when pan is gently shaken, about 45 minutes. (Center of cake will appear very loose but will continue to set as it cools.) Transfer springform pan to a rack and immediately run a knife around top edge of cake to loosen. Cool completely, about 2 hours, then chill, uncovered, at least 4 hours. Remove side of springform pan before serving.",
            "Reduce oven temperature to 300°F.",
            "Beat together cream cheese and sugar in a bowl with an electric mixer at medium speed until smooth, 1 to 2 minutes. Reduce speed to low and add eggs 1 at a time, beating until incorporated. Beat in sour cream and vanilla until combined.",
            "Pour two thirds of cream cheese filling into crust, then spoon half of lemon curd over filling and swirl curd into filling with a small knife. (Avoid touching crust with knife to prevent crumbs getting into filling.) Repeat with remaining filling and curd.",
            "Bake cheesecake until set 1 1/2 inches from edge but center trembles when pan is gently shaken, about 45 minutes. (Center of cake will appear very loose but will continue to set as it cools.) Transfer springform pan to a rack and immediately run a knife around top edge of cake to loosen. Cool completely, about 2 hours, then chill, uncovered, at least 4 hours. Remove side of springform pan before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5528063f20ca5d650ed21d50/6:4/w_274%2Ch_169/1-6x4.jpg"
    }
}