{
    "recipe": {
        "title": "Lemon Meringue Pie with Graham Crust ",
        "ingredients": [
            "1 cup whole wheat graham flour (such as Bob's Red Mill whole grain stone-ground graham flour)",
            "1/2 cup unbleached all purpose flour",
            "1/4 cup sugar",
            "1/2 teaspoon finely grated lemon peel",
            "10 tablespoons (1 1/4 sticks) unsalted butter, melted, cooled slightly",
            "1 cup sugar",
            "4 teaspoons cornstarch",
            "2/3 cup fresh lemon juice",
            "4 large eggs",
            "1 tablespoon finely grated lemon peel",
            "6 large egg whites, room temperature",
            "1/4 teaspoon cream of tartar",
            "1/4 teaspoon coarse kosher salt",
            "1 cup sugar",
            "Blackberry sauce",
            "Ingredient info: Whole wheat graham flour can be found at some supermarkets and at natural foods stores."
        ],
        "instructions": [
            "Preheat oven to 375°. Butter bottom and sides of 9-inch-diameter glass pie plate. Stir first 4 ingredients in medium bowl to blend. Gradually add butter, stirring until moist clumps form. Press dough evenly onto bottom and up sides of prepared pie plate. Bake crust until golden brown and firm to touch, about 20 minutes. Maintain oven temperature.",
            "For filling: Meanwhile, whisk sugar and cornstarch in heavy medium saucepan until no lumps remain. Gradually whisk in lemon juice. Add eggs 1 at a time, whisking to blend well after each addition. Stir in finely grated lemon peel. Whisk mixture constantly over medium heat until filling thickens and boils. Remove from heat; whisk to smooth if necessary. Transfer filling to prepared crust. Smooth top.",
            "Meanwhile, whisk sugar and cornstarch in heavy medium saucepan until no lumps remain. Gradually whisk in lemon juice. Add eggs 1 at a time, whisking to blend well after each addition. Stir in finely grated lemon peel. Whisk mixture constantly over medium heat until filling thickens and boils. Remove from heat; whisk to smooth if necessary. Transfer filling to prepared crust. Smooth top.",
            "For meringue: Using electric mixer, beat egg whites, cream of tartar, and coarse salt in large bowl until frothy. With mixer running, gradually beat in sugar. Continue beating until stiff and glossy. Spread meringue over warm filling, sealing meringue to crust at edges. Using spatula, form peaks and swirls in meringue. Bake pie until meringue is golden brown, about 15 minutes. Cool pie completely on rack. Cut pie into wedges and serve with blackberry sauce.",
            "Using electric mixer, beat egg whites, cream of tartar, and coarse salt in large bowl until frothy. With mixer running, gradually beat in sugar. Continue beating until stiff and glossy.",
            "Spread meringue over warm filling, sealing meringue to crust at edges. Using spatula, form peaks and swirls in meringue. Bake pie until meringue is golden brown, about 15 minutes. Cool pie completely on rack.",
            "Cut pie into wedges and serve with blackberry sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b2f0813edeef84363b4072/6:4/w_274%2Ch_169/364673_lemon-meringue-pie_1x1.jpg"
    }
}