{
    "recipe": {
        "title": "Lemon Chicken Thighs ",
        "ingredients": [
            "4 skin-on, bone-in chicken thighs",
            "Kosher salt, freshly ground pepper",
            "1/4 cup white wine vinegar",
            "4 garlic cloves, crushed",
            "2 lemons, halved",
            "1 1/2 tsp. honey",
            "1/2 tsp. Aleppo-style pepper",
            "3 Tbsp. extra-virgin olive oil"
        ],
        "instructions": [
            "Pat chicken thighs dry and season well with salt and black pepper. Place in a large resealable plastic bag and add vinegar. Seal bag and gently massage chicken to ensure all thighs are coated in vinegar. Chill 1 hour.",
            "Preheat oven to 400°F. Remove chicken thighs from bag and pat dry with paper towels. The drier the skin, the crispier it will be when cooked.",
            "Place chicken thighs, skin side down, in a dry large cast-iron skillet and set over medium heat. Cook undisturbed until they easily release from the pan, about 4 minutes. Continue to cook, moving chicken around occasionally to ensure the skin is cooking evenly, until golden brown, 8–10 minutes. Add garlic and transfer skillet to oven. Bake until chicken is cooked through, 10–12 minutes. Transfer chicken and garlic to a plate.",
            "Set skillet over medium-high heat and cook lemons, cut side down, until edges are deeply charred (they should be almost black), about 5 minutes. Transfer to plate with chicken and garlic and let cool slightly.",
            "Squeeze lemon juice into a small bowl; add garlic, honey, and Aleppo-style pepper and whisk to combine. Whisk in oil and any accumulated juices on plate with chicken. Season vinaigrette with salt and black pepper.",
            "Drizzle half of vinaigrette on a platter and set chicken on top. Serve with remaining vinaigrette alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ac271f5968b1f5f9f70b52a/6:4/w_274%2Ch_169/lemon-chicken-thighs-recipe-BA-032918.jpg"
    }
}