{
    "recipe": {
        "title": "Lemon-Souffle Pudding Cake ",
        "ingredients": [
            "4 tablespoons (1/2 stick) unsalted butter, room temperature, plus more for baking dish",
            "3/4 cup granulated sugar, plus more for baking dish",
            "1 cup buttermilk",
            "1/2 cup creme fraiche or sour cream",
            "2 teaspoons finely grated lemon zest",
            "1/2 cup fresh lemon juice",
            "3 large eggs, separated",
            "1/3 cup all-purpose flour",
            "1/4 teaspoon kosher salt",
            "Powdered sugar (for serving)",
            "Fresh blackberries (for serving; optional)"
        ],
        "instructions": [
            "Preheat oven to 325\u0081°. Butter a shallow 1 1/2–2-quart baking dish, then sprinkle with granulated sugar. Stir buttermilk, creme fraiche, lemon zest, and lemon juice in a medium bowl just to combine and set aside.",
            "Using an electric mixer on high speed, beat 4 tablespoons butter and 3/4 cup granulated sugar in a large bowl until well combined, about 4 minutes. Add egg yolks 1 at a time, beating to blend between additions and scraping down sides of bowl as needed.",
            "Reduce mixer speed to low and, with motor running, add reserved buttermilk mixture in 3 additions, alternating with flour in 2 additions, beginning and ending with buttermilk mixture (batter will be extremely loose).",
            "Using an electric mixer with clean, dry beaters, beat egg whites and salt on high speed in a medium bowl until soft peaks form. Fold egg whites into pudding cake batter in 3 additions, just barely blending after each addition.",
            "Scrape pudding cake batter into prepared baking dish and place on a rimmed baking sheet. Bake until top is puffed and golden brown and center barely jiggles, 35–45 minutes. Transfer baking dish to a wire rack and let pudding cake cool at least 30 minutes.",
            "Serve pudding cake dusted with powdered sugar and topped with blackberries, if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ab56f26529d92b2c0340d3/6:4/w_274%2Ch_169/51248490_lemon-souffle-pudding-cake_1x1.jpg",
        "color": 9126563
    }
}