{
    "recipe": {
        "title": "Lemon Custard Pie ",
        "ingredients": [
            "1 1/4 cups graham cracker crumbs (from nine 5-by 2 1/2-inch graham crackers)",
            "3 tablespoons sugar",
            "5 tablespoons unsalted butter, melted",
            "1 cup sugar",
            "10 (3- by 1-inch) strips lemon zest (from 2 lemons)",
            "1/4 cup water",
            "3/4 cup heavy cream",
            "Rounded 1/8 teaspoon salt",
            "5 large eggs",
            "1/2 cup fresh lemon juice",
            "Equipment: a 9-inch pie plate (4-cup capacity)",
            "Accompaniment: lightly sweetened whipped cream"
        ],
        "instructions": [
            "Preheat oven to 350°F with rack in middle. Lightly butter pie plate.",
            "Stir together all crust ingredients, then press onto bottom and up side of pie plate. Bake until crisp, 12 to 15 minutes, then cool completely, about 45 minutes.",
            "Make lemon custard filling: Reduce oven temperature to 325°F. Pulse sugar and zest in a food processor until zest is finely chopped, then transfer to a small heavy saucepan with water. Bring to a boil over medium heat, stirring until sugar has dissolved, then boil, without stirring, 5 minutes. Stir in cream and salt, then cook until hot (do not let boil). Whisk eggs in a large bowl. Add hot cream mixture in a slow stream, whisking constantly, then whisk in lemon juice. Strain custard through a fine sieve into another bowl, then pour into crust. Bake until filling is set 2 inches from edge but center is still wobbly, 25 to 30 minutes. Cool completely (filling will continue to set as it cools).",
            "Reduce oven temperature to 325°F.",
            "Pulse sugar and zest in a food processor until zest is finely chopped, then transfer to a small heavy saucepan with water. Bring to a boil over medium heat, stirring until sugar has dissolved, then boil, without stirring, 5 minutes. Stir in cream and salt, then cook until hot (do not let boil).",
            "Whisk eggs in a large bowl. Add hot cream mixture in a slow stream, whisking constantly, then whisk in lemon juice.",
            "Strain custard through a fine sieve into another bowl, then pour into crust.",
            "Bake until filling is set 2 inches from edge but center is still wobbly, 25 to 30 minutes. Cool completely (filling will continue to set as it cools)."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a7736a59cdb91b5ff6ff/6:4/w_274%2Ch_169/355991_hires.jpg"
    }
}