{
    "recipe": {
        "title": "Lemony Brussels Sprouts With Bacon and Breadcrumbs ",
        "ingredients": [
            "2 1/2 pounds brussels sprouts, trimmed",
            "4 ounces slab bacon or pancetta (Italian bacon), coarsely chopped",
            "3 tablespoons olive oil, divided, plus more for serving",
            "1 cup coarse fresh breadcrumbs",
            "1 small Fresno chile, seeds removed, finely chopped",
            "1 tablespoon thyme leaves",
            "1 teaspoon finely grated lemon zest",
            "Kosher salt",
            "2 tablespoons fresh lemon juice, divided"
        ],
        "instructions": [
            "Remove outer leaves from brussels sprouts; set aside. Halve sprouts; set aside. Pulse bacon in a food processor until finely ground. Heat 1 Tbsp. oil in a large skillet over medium-low. Cook bacon, stirring often, until browned around edges and fat is rendered, about 4 minutes. Add breadcrumbs and cook, stirring often, until brown and crisp, about 5 minutes. Transfer breadcrumb mixture to paper towels and let cool slightly. Toss in a medium bowl with chile, thyme, and lemon zest; set aside.",
            "Increase heat to medium-high and heat 2 Tbsp. oil in same skillet. Add reserved halved brussels sprouts; season with salt. Cook, tossing occasionally, until deeply browned all over, 5–8 minutes. Reduce heat to low, cover skillet, and cook until tender, about 5 minutes. Uncover skillet, add reserved leaves and 1 Tbsp. lemon juice, and toss to combine. Cover skillet and cook, tossing occasionally, until leaves are bright green and just wilted, 4–5 minutes. Uncover; add remaining 1 Tbsp. lemon juice and season with salt.",
            "Transfer brussels sprouts to a platter, drizzle with more oil, and top with reserved breadcrumb mixture (reheat breadcrumb mixture if needed in a small skillet or in microwave).",
            "Do Ahead Breadcrumb mixture can be made 3 hours ahead; store uncovered at room temperature. Brussels sprouts (without leaves) can be cooked 2 hours ahead; store covered at room temperature. Reheat before adding leaves.",
            "Breadcrumb mixture can be made 3 hours ahead; store uncovered at room temperature. Brussels sprouts (without leaves) can be cooked 2 hours ahead; store covered at room temperature. Reheat before adding leaves."
        ],
        "picture_link": "https://assets.epicurious.com/photos/582cc7ae31bd0b471cece708/6:4/w_274%2Ch_169/lemony-brussels-sprouts-with-bacon-and-breadcrumbs-BA-101416.jpg",
        "color": 7975228
    }
}