{
    "recipe": {
        "title": "Lemongrass Bars with Coconut Shortbread Crust ",
        "ingredients": [
            "1 1/2 cups all-purpose flour",
            "1 cup sweetened shredded coconut (about 3 ounces)",
            "1/2 cup powdered sugar",
            "1/2 cup plus 3 tablespoons unsalted butter, room temperature",
            "1 1/4 cups sugar",
            "3 lemongrass stalks, bottom 4 inches only, tough outer layer removed, finely chopped (scant 1/2 cup)",
            "5 tablespoons fresh lemon juice",
            "3 large eggs",
            "1/4 cup all purpose flour",
            "Powdered sugar"
        ],
        "instructions": [
            "Preheat oven to 350°F. Butter 13 x 9 x 2- inch metal baking pan. Using electric mixer, beat flour, coconut, powdered sugar, and 1/2 teaspoon salt in large bowl until well blended, 30 seconds. Add butter; beat on low speed until moist clumps form. Press dough onto bottom and 1/2 inch up sides of pan. Bake crust until golden (edges will be darker), about 25 minutes.",
            "For filling: Meanwhile, place sugar and lemongrass in processor; pulse until lemongrass is finely ground, about 1 minute. Add lemon juice; process until well blended, about 30 seconds. Add eggs; process to blend, 10 to 15 seconds. Add flour and pinch of salt; pulse until smooth. Reduce oven temperature to 325°F. Pour filling over hot crust; bake until filling is firm, 22 to 23 minutes. Cool in pan on rack. Cut lemongrass bars lengthwise into 4 strips, then crosswise into 6 pieces. Dust bars with powdered sugar and serve.",
            "Meanwhile, place sugar and lemongrass in processor; pulse until lemongrass is finely ground, about 1 minute. Add lemon juice; process until well blended, about 30 seconds. Add eggs; process to blend, 10 to 15 seconds. Add flour and pinch of salt; pulse until smooth.",
            "Reduce oven temperature to 325°F. Pour filling over hot crust; bake until filling is firm, 22 to 23 minutes. Cool in pan on rack.",
            "Cut lemongrass bars lengthwise into 4 strips, then crosswise into 6 pieces. Dust bars with powdered sugar and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b2f8333edeef84363b577b/6:4/w_274%2Ch_169/364029_lemongrass-bars_1x1.jpg"
    }
}