{
    "recipe": {
        "title": "Lemonade Jelly with Basil ",
        "ingredients": [
            "4 to 5 large lemons, juiced (3/4 cup / 180 ml)",
            "3/4 cup (150 g) sugar",
            "1 1/2 cups (25 g) loosely packed basil leaves, plus more to serve",
            "1/2 cup (120 ml) pulp-free orange juice",
            "3 teaspoons powdered gelatin",
            "Whipped cream, to serve"
        ],
        "instructions": [
            "Warm the lemon juice, 1 1/2 cups (360 ml) water, and the sugar to boiling. Stir until the sugar is completely dissolved. Roughly tear the basil leaves and put them in a small bowl. Pour the lemon juice mixture over the basil leaves and let steep for at least 15 minutes.",
            "Pour the orange juice into a small saucepan and sprinkle the gelatin over its surface. Let the gelatin soften for 5 minutes, then warm the pan over medium heat, stirring frequently, until the gelatin is fully dissolved. Turn off the heat.",
            "Strain the basil out of the lemon juice and whisk the juice into the gelatin mixture. Pour the liquid into six small cups or a 1-quart (1-L) dish. Refrigerate for 2 hours, or until softly set. Garnish with whipped cream and basil leaves to serve.",
            "Lemon-Basil Jelly Skewers To make little bites for a party, double the amount of gelatin in this recipe to 6 full teaspoons. Pour the mixture into an 8- or 9-inch (20- or 23-cm) square baking dish and let it set overnight in the refrigerator. Cut it into 1-inch (2.5-cm) squares, or use a small cookie cutter to cut out 1-inch (2.5-cm) circles. Skewer one or two pieces on a toothpick or party pick with a leaf of fresh basil folded and skewered at one end. Chill until ready to serve, and pass a bowl of whipped cream for dipping.",
            "To make little bites for a party, double the amount of gelatin in this recipe to 6 full teaspoons. Pour the mixture into an 8- or 9-inch (20- or 23-cm) square baking dish and let it set overnight in the refrigerator. Cut it into 1-inch (2.5-cm) squares, or use a small cookie cutter to cut out 1-inch (2.5-cm) circles. Skewer one or two pieces on a toothpick or party pick with a leaf of fresh basil folded and skewered at one end. Chill until ready to serve, and pass a bowl of whipped cream for dipping.",
            "Easy Flavor Variations Real Lime Jelly For real lime jelly (with the taste of fresh limes and no nasty green food coloring), substitute juice from 7 to 8 limes for the lemon juice. Substitute water for the orange juice. Meyer Lemon Jelly with Lavender Extra-sweet, less acidic Meyer lemons are also wonderful in this jelly, especially with the herbal-floral taste of lavender. Simply substitute Meyers for the regular lemons. You may need one or two extra lemons, as Meyer lemons are generally smaller. Instead of steeping basil in the juice, steep 1 tablespoon dried food-grade lavender buds. Strain after 10 minutes and proceed as directed above.",
            "Real Lime Jelly For real lime jelly (with the taste of fresh limes and no nasty green food coloring), substitute juice from 7 to 8 limes for the lemon juice. Substitute water for the orange juice. Meyer Lemon Jelly with Lavender Extra-sweet, less acidic Meyer lemons are also wonderful in this jelly, especially with the herbal-floral taste of lavender. Simply substitute Meyers for the regular lemons. You may need one or two extra lemons, as Meyer lemons are generally smaller. Instead of steeping basil in the juice, steep 1 tablespoon dried food-grade lavender buds. Strain after 10 minutes and proceed as directed above."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54af4fb24074bdfd06839923/6:4/w_274%2Ch_169/51176800_lemonade-jelly_1x1.jpg"
    }
}