{
    "recipe": {
        "title": "Lemony Mushroom Risotto ",
        "ingredients": [
            "2 2/3 cups boiling-hot water",
            "1/2 oz dried porcini mushrooms",
            "3 cups chicken broth",
            "1/2 stick (1/4 cup) unsalted butter",
            "1/2 lb small cremini mushrooms, quartered",
            "1 small onion, finely chopped",
            "1 cup plus 2 tablespoons Arborio rice (8 oz)",
            "1/4 cup dry white wine",
            "1 teaspoon finely grated fresh lemon zest",
            "1/4 cup finely grated parmesan",
            "2 tablespoons chopped fresh flat-leaf parsley"
        ],
        "instructions": [
            "Pour 2/3 cup hot water over porcini in a heatproof cup and let stand until softened, about 10 minutes. Lift porcini out of water, squeezing excess liquid back into cup, and rinse well to remove any grit. Coarsely chop porcini. Pour soaking liquid through a paper-towel-lined sieve into a glass measure and reserve. Meanwhile, bring broth and remaining 2 cups hot water to a simmer. Keep at a bare simmer, covered. Heat 1 tablespoon butter in a heavy skillet over moderately high heat until foam subsides, then sauté cremini, stirring, until browned, about 7 minutes. Add porcini and reserved soaking liquid to skillet and boil, stirring, 1 minute. Remove from heat. Cook onion in 1 1/2 tablespoons butter in a 3-quart heavy saucepan over moderate heat, stirring occasionally, until softened, 3 to 4 minutes. Add rice and cook, stirring constantly, 1 minute. Add wine and simmer, stirring constantly, until absorbed. Stir in 1/2 cup simmering broth mixture and cook at a strong simmer, stirring frequently, until broth is absorbed. Continue simmering and adding broth 1/2 cup at a time, stirring frequently and letting each addition become absorbed before adding the next, until rice is tender but still al dente and creamy (it should be the consistency of a thick soup), 18 minutes. (There will be leftover broth.) Stir in zest, mushrooms, remaining 1 1/2 tablespoons butter, parmesan, parsley, and pepper to taste. (If necessary, thin risotto with some of remaining broth.) Serve immediately.",
            "Pour 2/3 cup hot water over porcini in a heatproof cup and let stand until softened, about 10 minutes. Lift porcini out of water, squeezing excess liquid back into cup, and rinse well to remove any grit. Coarsely chop porcini. Pour soaking liquid through a paper-towel-lined sieve into a glass measure and reserve.",
            "Meanwhile, bring broth and remaining 2 cups hot water to a simmer. Keep at a bare simmer, covered.",
            "Heat 1 tablespoon butter in a heavy skillet over moderately high heat until foam subsides, then sauté cremini, stirring, until browned, about 7 minutes. Add porcini and reserved soaking liquid to skillet and boil, stirring, 1 minute. Remove from heat.",
            "Cook onion in 1 1/2 tablespoons butter in a 3-quart heavy saucepan over moderate heat, stirring occasionally, until softened, 3 to 4 minutes.",
            "Add rice and cook, stirring constantly, 1 minute. Add wine and simmer, stirring constantly, until absorbed.",
            "Stir in 1/2 cup simmering broth mixture and cook at a strong simmer, stirring frequently, until broth is absorbed. Continue simmering and adding broth 1/2 cup at a time, stirring frequently and letting each addition become absorbed before adding the next, until rice is tender but still al dente and creamy (it should be the consistency of a thick soup), 18 minutes. (There will be leftover broth.)",
            "Stir in zest, mushrooms, remaining 1 1/2 tablespoons butter, parmesan, parsley, and pepper to taste. (If necessary, thin risotto with some of remaining broth.) Serve immediately."
        ],
        "picture_link": null
    }
}