{
    "recipe": {
        "title": "Lemon Soufflé Tartlets with Sugared Almonds and Blackberry Sauce ",
        "ingredients": [
            "1 cup plus 3 to 4 tablespoons sugar, divided",
            "2 teaspoons cornstarch",
            "1/2 cup fresh lemon juice",
            "6 large egg yolks",
            "Pinch of coarse kosher salt",
            "1/2 cup (1 stick) pareve margarine (such as Nucoa), diced",
            "1/2 cup sliced almonds",
            "1/2 tablespoon water",
            "1 16-ounce bag frozen blackberries, thawed",
            "1 1/3 cups all purpose flour",
            "2/3 cup (packed) powdered sugar",
            "1 teaspoon finely grated lemon peel",
            "1/4 teaspoon salt",
            "10 tablespoons (1 1/4 sticks) chilled pareve margarine (such as nucoa), diced",
            "4 large egg whites",
            "1/2 teaspoon cream of tartar",
            "Pinch of coarse kosher salt",
            "1/4 cup sugar",
            "Powdered sugar (optional)",
            "6 4 1/2 x 3/4-inch tartlet pans with removable bottom"
        ],
        "instructions": [
            "Combine 1 cup sugar and cornstarch in medium saucepan; stir until no lumps remain. Gradually whisk in lemon juice, then egg yolks and salt. Add margarine. Cook over medium heat until curd thickens and boils, whisking constantly, 4 to 5 minutes. Transfer to bowl. Press plastic wrap directly onto surface. Chill until firm, at least 8 hours and up to 1 day.",
            "Preheat oven to 350°F. Scatter almonds on rimmed baking sheet. Sprinkle with 1/2 tablespoon water, then 1 tablespoon sugar; toss to coat. Bake almonds until golden and crisp, 5 to 6 minutes. Cool on baking sheet.",
            "Puree blackberries in blender. Press enough blackberry puree through strainer into bowl to measure 1 1/3 to 1 1/2 cups sauce; sweeten with 2 to 3 tablespoons sugar. DO AHEAD: curd, almonds, and sauce can be made 3 days ahead. Keep curd chilled. Cover and chill sauce. Store almonds airtight at room temperature.",
            "For crusts: Preheat oven to 350°F. Combine flour, sugar, lemon peel, and salt in processor; blend 5 seconds. Add margarine and blend until moist clumps form. Gather dough into ball. Divide into 6 equal pieces. Press dough onto bottom and up sides of 4 1/2 x 3/4-inch tartlet pans with removable bottom; arrange pans on rimmed baking sheet. Bake crusts until golden, about 25 minutes (crusts may crack a bit). Cool on sheet. DO AHEAD: can be made 3 days ahead. Cover and place crusts in pans in freezer.",
            "Preheat oven to 350°F. Combine flour, sugar, lemon peel, and salt in processor; blend 5 seconds. Add margarine and blend until moist clumps form. Gather dough into ball. Divide into 6 equal pieces. Press dough onto bottom and up sides of 4 1/2 x 3/4-inch tartlet pans with removable bottom; arrange pans on rimmed baking sheet.",
            "Bake crusts until golden, about 25 minutes (crusts may crack a bit). Cool on sheet. DO AHEAD: can be made 3 days ahead. Cover and place crusts in pans in freezer.",
            "For soufflé filling; Place 1 cup lemon curd in medium bowl. Using electric mixer, beat egg whites, cream of tartar, and pinch of coarse salt in another medium bowl until soft peaks form. Gradually add 1/4 cup sugar, beating until whites are stiff but not dry. Fold whites into lemon curd in 3 additions. Divide soufflé filling among crusts, mounding in center. Freeze until firm, at least 4 hours. DO AHEAD: <me>can be made 3 days ahead. Cover and keep frozen.</me> Preheat oven to 375°F. Push bottoms of pans up, releasing tartlets from pan sides. Arrange tartlets, still on pan bottoms, on rimmed baking sheet. Scatter 1 tablespoon sugared almonds over each tartlet. Bake tartlets until filling is puffed, golden brown, and no longer soft in center, about 20 minutes. Transfer tartlets to plates. Dust with powdered sugar, if desired. Drizzle some sauce around. Pass remaining sauce.",
            "Place 1 cup lemon curd in medium bowl. Using electric mixer, beat egg whites, cream of tartar, and pinch of coarse salt in another medium bowl until soft peaks form. Gradually add 1/4 cup sugar, beating until whites are stiff but not dry. Fold whites into lemon curd in 3 additions. Divide soufflé filling among crusts, mounding in center. Freeze until firm, at least 4 hours. DO AHEAD: <me>can be made 3 days ahead. Cover and keep frozen.</me>",
            "Preheat oven to 375°F. Push bottoms of pans up, releasing tartlets from pan sides. Arrange tartlets, still on pan bottoms, on rimmed baking sheet. Scatter 1 tablespoon sugared almonds over each tartlet. Bake tartlets until filling is puffed, golden brown, and no longer soft in center, about 20 minutes.",
            "Transfer tartlets to plates. Dust with powdered sugar, if desired. Drizzle some sauce around. Pass remaining sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56098f1a62fa7a9917c1d916/6:4/w_274%2Ch_169/362570.jpg"
    }
}