{
    "recipe": {
        "title": "Lemon Coconut Mousse ",
        "ingredients": [
            "400g tin of coconut milk",
            "3 medium eggs, separated",
            "75g local organic honey (or less)",
            "Juice and zest of 2 unwaxed organic lemons",
            "A pinch of salt"
        ],
        "instructions": [
            "Chill the coconut tin in the fridge for at least 2 hours, so that the coconut cream floats to the top. You only need to use the cream, so keep the rest of the milk to flavor a soup or a smoothie. Place the egg yolks, honey, lemon zest and lemon juice in a heatproof bowl set over a pan of simmering water and whisk constantly for about 10 minutes until the mixture thickens. Remove from the heat and chill in the fridge for about 30 minutes. Meanwhile, scoop out the chilled coconut cream from the top of the tin into a bowl and beat with a whisk or spoon until stiff. In separate clean bowl, beat the egg whites and sea salt until stiff. Fold the lemon mixture into the coconut cream, then gently fold in the egg whites. Chill in the fridge for at least 2 hours, then spoon into pretty glasses or bowls to serve.",
            "Chill the coconut tin in the fridge for at least 2 hours, so that the coconut cream floats to the top. You only need to use the cream, so keep the rest of the milk to flavor a soup or a smoothie.",
            "Place the egg yolks, honey, lemon zest and lemon juice in a heatproof bowl set over a pan of simmering water and whisk constantly for about 10 minutes until the mixture thickens. Remove from the heat and chill in the fridge for about 30 minutes.",
            "Meanwhile, scoop out the chilled coconut cream from the top of the tin into a bowl and beat with a whisk or spoon until stiff.",
            "In separate clean bowl, beat the egg whites and sea salt until stiff.",
            "Fold the lemon mixture into the coconut cream, then gently fold in the egg whites.",
            "Chill in the fridge for at least 2 hours, then spoon into pretty glasses or bowls to serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5548e0bf6997a6ba1fd2a617/6:4/w_274%2Ch_169/56389509_lemon-coconut-mousse_1x1.jpg"
    }
}