{
    "recipe": {
        "title": "Lemon-Roasted Green Beans with Marcona Almonds ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "2 pounds green beans, trimmed",
            "1 onion, peeled, cut into 8 wedges",
            "6 large fresh marjoram sprigs",
            "2 tablespoons extra-virgin olive oil",
            "Coarse kosher salt",
            "1 tablespoon fresh lemon juice",
            "1 teaspoon (packed) finely grated lemon peel",
            "1/2 cup coarsely chopped Marcona almonds or roasted regular almonds"
        ],
        "instructions": [
            "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 450°F. Spray 2 large rimmed baking sheets with nonstick spray. Combine green beans, onion wedges, and marjoram in large bowl. Drizzle with oil, then sprinkle with coarse kosher salt and pepper. Toss; divide between prepared sheets. Roast vegetables 15 minutes. Reverse sheets. Continue to roast until beans are tender and beginning to brown in spots, about 10 minutes longer. Transfer vegetables to bowl. Add lemon juice, grated lemon peel, and half of chopped almonds. Toss to coat; season with salt and pepper. Sprinkle with remaining almonds.",
            "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 450°F. Spray 2 large rimmed baking sheets with nonstick spray. Combine green beans, onion wedges, and marjoram in large bowl. Drizzle with oil, then sprinkle with coarse kosher salt and pepper. Toss; divide between prepared sheets.",
            "Roast vegetables 15 minutes. Reverse sheets. Continue to roast until beans are tender and beginning to brown in spots, about 10 minutes longer.",
            "Transfer vegetables to bowl. Add lemon juice, grated lemon peel, and half of chopped almonds. Toss to coat; season with salt and pepper. Sprinkle with remaining almonds."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a5e7b55306961bf78a1/6:4/w_274%2Ch_169/240415_hires.jpg"
    }
}