{
    "recipe": {
        "title": "Lemon and Elderflower Tart ",
        "ingredients": [
            "Butter, for greasing",
            "1 x My Favorite Sweet Shortcrust Pastry recipe",
            "3 eggs",
            "125g (2/3 cup) caster (superfine) sugar",
            "Zest and juice of 3 unwaxed lemons",
            "150ml (2/3 cup) heavy cream",
            "75ml (5 tbsp) elderflower cordial",
            "Confectioners' sugar, to dust"
        ],
        "instructions": [
            "Butter a 23cm/9-inch loose-bottomed tart tin, make the pastry, then use it to line the tin and blind bake it according to the instructions. Lower the oven temperature to 340°F/170°C/150°C fan/gas 3. Lightly whisk together the eggs, sugar and lemon juice, then add the cream and elderflower cordial. Stir in two-thirds of the lemon zest, reserving the rest for the top. Try to pop any bubbles that appear on the surface with a skewer or skim them off with a spoon. Pour half the lemon mixture into the tart case then put it in the oven. Once it is safely in, fill it completely to the top with the rest of the mixture (this half and half approach helps to prevent spillage) then bake for 30—35 minutes or until the tart has just set. It should still have a slight wobble in the middle. Leave the tart to cool completely before removing it from the tin and chilling it in the fridge. To serve, dust with confectioners' sugar and the remaining lemon zest and if you like you can add a big dollop of mascarpone mixed with whipped cream on the side.",
            "Butter a 23cm/9-inch loose-bottomed tart tin, make the pastry, then use it to line the tin and blind bake it according to the instructions. Lower the oven temperature to 340°F/170°C/150°C fan/gas 3.",
            "Lightly whisk together the eggs, sugar and lemon juice, then add the cream and elderflower cordial. Stir in two-thirds of the lemon zest, reserving the rest for the top. Try to pop any bubbles that appear on the surface with a skewer or skim them off with a spoon.",
            "Pour half the lemon mixture into the tart case then put it in the oven. Once it is safely in, fill it completely to the top with the rest of the mixture (this half and half approach helps to prevent spillage) then bake for 30—35 minutes or until the tart has just set. It should still have a slight wobble in the middle.",
            "Leave the tart to cool completely before removing it from the tin and chilling it in the fridge. To serve, dust with confectioners' sugar and the remaining lemon zest and if you like you can add a big dollop of mascarpone mixed with whipped cream on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59824aa18fa2e80d2014870d/6:4/w_274%2Ch_169/lemon-elderflower-tart-recipe-HC-080217.jpg"
    }
}