{
    "recipe": {
        "title": "Lemon Snow Pudding with Basil Custard Sauce ",
        "ingredients": [
            "1 (1/4-ounce) envelope unflavored gelatin",
            "1/4 cup cold water",
            "1 cup boiling-hot water",
            "3/4 cup sugar",
            "1 tablespoon grated lemon zest",
            "1/3 cup fresh lemon juice",
            "3 large egg whites at room temperature 30 minutes",
            "2 cups whole milk",
            "1/3 cup sugar",
            "1 cup packed basil leaves",
            "3 large egg yolks",
            "Garnish: basil leaves"
        ],
        "instructions": [
            "Stir gelatin into cold water in a large bowl and let stand 5 minutes. Stir in hot water, sugar, and lemon zest and juice until sugar has dissolved. Set bowl in an ice bath and stir often until mixture is cold and thickened (consistency will be similar to that of raw egg whites), about 45 minutes.",
            "Beat gelatin mixture with an electric mixer at medium-high speed until very frothy, 1 to 2 minutes. In a separate bowl, beat whites until they hold soft peaks.",
            "Add whites to gelatin mixture and beat at high speed until tripled in volume and thick enough to form a wide flat ribbon that holds its shape on top of mixture when beater is lifted, about 5 minutes (longer if using a hand-held mixer). Transfer to a large serving bowl and chill until set, about 3 hours.",
            "Make custard while snow pudding sets: Bring milk, sugar, and a pinch of salt just to a boil in a small saucepan, stirring until sugar has dissolved. Remove from heat and stir in basil. Let steep, covered, 30 minutes. Put yolks in a small bowl. Strain milk mixture through a sieve into another bowl, pressing hard on and then discarding basil, and return to saucepan. Whisk about 1/2 cup warm milk mixture into yolks, then whisk into remaining milk in saucepan. Cook over medium-low heat, stirring constantly with a wooden spoon, until custard coats back of spoon and registers 170°F on an instant-read thermometer. Transfer custard sauce to a bowl and chill, stirring occasionally, until cold, about 2 hours.",
            "Bring milk, sugar, and a pinch of salt just to a boil in a small saucepan, stirring until sugar has dissolved. Remove from heat and stir in basil. Let steep, covered, 30 minutes.",
            "Put yolks in a small bowl. Strain milk mixture through a sieve into another bowl, pressing hard on and then discarding basil, and return to saucepan. Whisk about 1/2 cup warm milk mixture into yolks, then whisk into remaining milk in saucepan. Cook over medium-low heat, stirring constantly with a wooden spoon, until custard coats back of spoon and registers 170°F on an instant-read thermometer.",
            "Transfer custard sauce to a bowl and chill, stirring occasionally, until cold, about 2 hours.",
            "Assemble dessert: Spoon snow pudding into glasses or bowls and top with custard sauce.",
            "Spoon snow pudding into glasses or bowls and top with custard sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ff420168c26ece304514bf/6:4/w_274%2Ch_169/352321_lemon-snow-pudding-basil-custard_6x4.jpg"
    }
}