{
    "recipe": {
        "title": "Lemon-Raspberry Cupcakes ",
        "ingredients": [
            "3/4 cup (12 tablespoons) unsalted butter, room temperature",
            "3 cups powdered sugar, divided",
            "4 1/2 teaspoons finely grated lemon peel, divided",
            "2 large eggs",
            "1 1/4 cups self-rising flour",
            "1/4 cup buttermilk",
            "4 tablespoons fresh lemon juice, divided",
            "12 teaspoons plus 1 tablespoon seedless raspberry jam",
            "Fresh raspberries (for garnish)"
        ],
        "instructions": [
            "Preheat oven to 350°F. Line 12 muffin cups with paper liners. Using electric mixer, beat butter, 1 1/2 cups powdered sugar, and 3 teaspoons lemon peel in large bowl until blended, then beat until fluffy and pale yellow. Add eggs 1 at a time, beating to blend after each addition. Beat in half of flour. Add buttermilk and 2 tablespoons lemon juice; beat to blend. Beat in remaining flour. Drop 1 rounded tablespoonful batter into each muffin liner. Spoon 1 teaspoon raspberry jam over. Cover with remaining batter, dividing equally. Bake cupcakes until tester inserted halfway into centers comes out clean, about 23 minutes. Cool cupcakes in pan on rack. Meanwhile, whisk remaining 1 1/2 cups powdered sugar, 2 tablespoons lemon juice, and 1 1/2 teaspoons lemon peel in small bowl. Spoon half of icing over 6 cupcakes. Whisk 1 tablespoon raspberry jam into remaining icing. Spoon over remaining cupcakes. Let stand until icing sets, about 30 minutes. Garnish with raspberries.",
            "Preheat oven to 350°F. Line 12 muffin cups with paper liners. Using electric mixer, beat butter, 1 1/2 cups powdered sugar, and 3 teaspoons lemon peel in large bowl until blended, then beat until fluffy and pale yellow. Add eggs 1 at a time, beating to blend after each addition. Beat in half of flour. Add buttermilk and 2 tablespoons lemon juice; beat to blend. Beat in remaining flour.",
            "Drop 1 rounded tablespoonful batter into each muffin liner. Spoon 1 teaspoon raspberry jam over. Cover with remaining batter, dividing equally.",
            "Bake cupcakes until tester inserted halfway into centers comes out clean, about 23 minutes. Cool cupcakes in pan on rack. Meanwhile, whisk remaining 1 1/2 cups powdered sugar, 2 tablespoons lemon juice, and 1 1/2 teaspoons lemon peel in small bowl. Spoon half of icing over 6 cupcakes. Whisk 1 tablespoon raspberry jam into remaining icing. Spoon over remaining cupcakes. Let stand until icing sets, about 30 minutes. Garnish with raspberries."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5553a7bf100d9bda6d81b118/6:4/w_274%2Ch_169/0408-BA-COV1-1A-CP.jpg"
    }
}