{
    "recipe": {
        "title": "Lentil Soup with Wheat Berries and Kale ",
        "ingredients": [
            "2 medium carrots, coarsely chopped",
            "1 large onion, coarsely chopped",
            "5 garlic cloves, peeled",
            "1/2 cup extra-virgin olive oil",
            "2 1/2 tsp. kosher salt, divided, plus more",
            "1/2 tsp. freshly ground black pepper",
            "3/4 cup wheat berries, spelt, unhulled barley, or short grain brown rice (do not use pearled grains)",
            "1 tsp. coriander seeds, coarsely crushed",
            "1 tsp. ground turmeric",
            "2 dried bay leaves",
            "3/4 cup French green lentils, rinsed",
            "2 bunches curly green kale, stems and ribs removed, leaves torn into 2\" pieces",
            "Finely grated Parmesan and toasted crusty bread (for serving)"
        ],
        "instructions": [
            "Pulse carrots, onion, and garlic in a food processor until finely chopped. Heat oil in a 6-quart stockpot or Dutch oven over medium, then add vegetables; season with 1 tsp. salt and 1/2 tsp. pepper, stirring to coat. Cook, stirring occasionally, until vegetables begin to look juicy, about 3 minutes. Partially cover with a lid, reduce heat to medium-low, and cook, stirring occasionally, until vegetables are completely tender but have not taken on any color, 10–12 minutes. Add wheat berries, coriander, turmeric, and bay leaves and stir to combine. Cook until bottom of pot is just starting to brown, about 2 minutes. Add 10 cups water and bring to a boil over medium-high heat. Season with 1 1/2 tsp. salt, then reduce heat to medium-low and bring to a simmer. Cook, uncovered and stirring occasionally, until grains show signs of softening but are nowhere near done, about 15 minutes. Add lentils and kale and stir well to combine. Kale should be submerged; add another cup of water if needed. Partially cover pot and cook, stirring occasionally, until lentils and grains are tender and kale is very silky, 40–45 minutes more. Pluck out bay leaves. Taste and season with more salt and pepper if needed. Divide soup among bowls. Serve with Parmesan for sprinkling over and bread for dunking.",
            "Pulse carrots, onion, and garlic in a food processor until finely chopped. Heat oil in a 6-quart stockpot or Dutch oven over medium, then add vegetables; season with 1 tsp. salt and 1/2 tsp. pepper, stirring to coat. Cook, stirring occasionally, until vegetables begin to look juicy, about 3 minutes. Partially cover with a lid, reduce heat to medium-low, and cook, stirring occasionally, until vegetables are completely tender but have not taken on any color, 10–12 minutes.",
            "Add wheat berries, coriander, turmeric, and bay leaves and stir to combine. Cook until bottom of pot is just starting to brown, about 2 minutes. Add 10 cups water and bring to a boil over medium-high heat. Season with 1 1/2 tsp. salt, then reduce heat to medium-low and bring to a simmer. Cook, uncovered and stirring occasionally, until grains show signs of softening but are nowhere near done, about 15 minutes. Add lentils and kale and stir well to combine. Kale should be submerged; add another cup of water if needed. Partially cover pot and cook, stirring occasionally, until lentils and grains are tender and kale is very silky, 40–45 minutes more. Pluck out bay leaves. Taste and season with more salt and pepper if needed.",
            "Divide soup among bowls. Serve with Parmesan for sprinkling over and bread for dunking."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c5082f2cbdbeb2cc490e215/6:4/w_274%2Ch_169/Carla's-Lentil-and-Greens-Soup-recipe-2-01162019.jpg"
    }
}