{
    "recipe": {
        "title": "Lime Ice Cream ",
        "ingredients": [
            "2 tablespoons finely grated fresh lime zest",
            "1 cup sugar",
            "1 1/2 cups heavy cream",
            "1 1/2 cups whole milk",
            "1/2 cup plus 2 tablespoons fresh lime juice",
            "6 large egg yolks",
            "1/8 teaspoon salt",
            "a candy or instant-read thermometer; an ice cream maker"
        ],
        "instructions": [
            "Blend zest and 1/2 cup sugar in a food processor 30 seconds, then stir together with cream and milk in a heavy saucepan. Bring to a boil over moderate heat, stirring occasionally, and remove from heat. Steep, covered, 30 minutes. Bring remaining 1/2 cup sugar and 1/4 cup plus 2 tablespoons lime juice to a boil in a 2-quart heavy saucepan, stirring until sugar is dissolved, then boil, swirling pan occasionally, until syrup just begins to turn very pale golden. Remove from heat and whisk in steeped cream. Whisk yolks with salt in a large bowl and add cream mixture in a slow stream, whisking. Return to saucepan and cook over moderately low heat, stirring constantly with a wooden spoon, until custard coats back of spoon and thermometer registers 170°F (do not let boil). Pour through a very fine sieve into a clean bowl and cool, stirring occasionally. Stir in remaining 1/4 cup lime juice and chill custard, covered, until cold, at least 3 hours. Freeze custard in ice cream maker. Transfer ice cream to an airtight container and put in freezer to harden.",
            "Blend zest and 1/2 cup sugar in a food processor 30 seconds, then stir together with cream and milk in a heavy saucepan. Bring to a boil over moderate heat, stirring occasionally, and remove from heat. Steep, covered, 30 minutes.",
            "Bring remaining 1/2 cup sugar and 1/4 cup plus 2 tablespoons lime juice to a boil in a 2-quart heavy saucepan, stirring until sugar is dissolved, then boil, swirling pan occasionally, until syrup just begins to turn very pale golden. Remove from heat and whisk in steeped cream.",
            "Whisk yolks with salt in a large bowl and add cream mixture in a slow stream, whisking. Return to saucepan and cook over moderately low heat, stirring constantly with a wooden spoon, until custard coats back of spoon and thermometer registers 170°F (do not let boil).",
            "Pour through a very fine sieve into a clean bowl and cool, stirring occasionally. Stir in remaining 1/4 cup lime juice and chill custard, covered, until cold, at least 3 hours.",
            "Freeze custard in ice cream maker. Transfer ice cream to an airtight container and put in freezer to harden."
        ],
        "picture_link": null
    }
}