{
    "recipe": {
        "title": "Little Gem Salad with Lemon Cream and Hazelnuts ",
        "ingredients": [
            "4 garlic cloves, smashed",
            "1/2 cup heavy cream",
            "Kosher salt",
            "1/2 teaspoon freshly ground pepper, plus more",
            "1/4 cup blanched hazelnuts",
            "4 small carrots, scrubbed",
            "6 heads Little Gem lettuce",
            "3 tablespoons olive oil",
            "2 tablespoons fresh lemon juice, divided",
            "1/2 cup mint leaves",
            "1 1/2 ounces SarVecchio or Parmesan, shaved",
            "Flaky sea salt"
        ],
        "instructions": [
            "Boost the Cream:",
            "Combine garlic and cream in a small bowl. Season with salt and 1/2 teaspoon pepper. Cover and chill 1 hour.",
            "Go Nuts: Toast the hazelnuts on a rimmed baking sheet in a 350° oven, tossing occasionally, until golden, 8–10 minutes. Let cool; coarsely chop.",
            "Go Nuts:",
            "Toast the hazelnuts on a rimmed baking sheet in a 350° oven, tossing occasionally, until golden, 8–10 minutes. Let cool; coarsely chop.",
            "Veg Out: Thinly slice the carrots lengthwise on a mandoline and separate leaves from lettuce.",
            "Veg Out:",
            "Thinly slice the carrots lengthwise on a mandoline and separate leaves from lettuce.",
            "Get Dressed: Strain the infused cream into a medium bowl and add the oil. Whip to very soft peaks, then whisk in 1 tablespoon lemon juice. Taste and season with more salt and pepper if needed.",
            "Get Dressed:",
            "Strain the infused cream into a medium bowl and add the oil. Whip to very soft peaks, then whisk in 1 tablespoon lemon juice. Taste and season with more salt and pepper if needed.",
            "Bring It Home: Toss the carrots, lettuce, mint leaves, and half of hazelnuts with remaining 1 tablespoon lemon juice in a large bowl; season with salt and pepper. Add a few dollops of lemon cream and gently toss to coat. Spoon remaining lemon cream onto a platter and mound salad over. Top with cheese, remaining hazelnuts, and some cracked pepper and flaky sea salt.",
            "Bring It Home:",
            "Toss the carrots, lettuce, mint leaves, and half of hazelnuts with remaining 1 tablespoon lemon juice in a large bowl; season with salt and pepper. Add a few dollops of lemon cream and gently toss to coat. Spoon remaining lemon cream onto a platter and mound salad over. Top with cheese, remaining hazelnuts, and some cracked pepper and flaky sea salt."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5537e38367c3a7e837c3ed7b/6:4/w_274%2Ch_169/56389398_little-gem-salad_1x1.jpg",
        "color": 10293384
    }
}