{
    "recipe": {
        "title": "Liver and Mushroom Pirozhki ",
        "ingredients": [
            "1 1/2 cups all-purpose flour plus additional for rolling out dough",
            "1 stick (1/2 cup) cold unsalted butter, cut into 1/2-inch cubes",
            "1 teaspoon salt",
            "Pinch of sugar",
            "7 tablespoons sour cream",
            "1 large egg beaten with 1 tablespoon water for egg wash",
            "1/2 small onion, finely chopped",
            "1/2 lb cremini mushrooms, finely chopped (1 1/4 cups)",
            "3 tablespoons unsalted butter",
            "1/4 lb chicken livers, rinsed, trimmed, and finely chopped",
            "1/4 teaspoon salt",
            "3/4 teaspoon black pepper",
            "a (2 1/2-inch) round cookie or biscuit cutter"
        ],
        "instructions": [
            "Blend together flour, butter, salt, and sugar in a bowl with your fingertips or a pastry blender (or pulse in a food processor) just until mixture resembles coarse meal with some roughly pea-size butter lumps. Stir in sour cream with a fork just until a dough forms. Turn out dough on a lightly floured work surface and roll out with a lightly floured rolling pin into a 6- by 4-inch rectangle. Fold into thirds like a letter, then roll out and fold in same manner 2 more times. Chill dough, wrapped in plastic wrap, until firm, at least 1 hour.",
            "Make filling: Cook onion and mushrooms in butter in a 10-inch heavy skillet over moderate heat, stirring occasionally, until browned well and mushrooms are completely dry, about 15 minutes. Add livers and cook, stirring frequently, until just browned, 2 to 3 minutes. Cool slightly, then pulse in food processor just until mixture holds together. Stir in salt and pepper and cool completely, uncovered, about 20 minutes.",
            "Cook onion and mushrooms in butter in a 10-inch heavy skillet over moderate heat, stirring occasionally, until browned well and mushrooms are completely dry, about 15 minutes. Add livers and cook, stirring frequently, until just browned, 2 to 3 minutes. Cool slightly, then pulse in food processor just until mixture holds together. Stir in salt and pepper and cool completely, uncovered, about 20 minutes.",
            "Assemble and bake pirozhki: Put oven rack in middle position and preheat oven to 375°F. Roll out dough on a lightly floured work surface with a lightly floured rolling pin into a roughly 13-inch round (3/4 inch thick). Cut out rounds with cutter. Put 1 level teaspoon filling in center of 1 round, then fold round over filling to form a half moon, pressing edges with your fingers to seal. Repeat with remaining rounds and filling in same manner, rerolling and cutting scraps once. Arrange 1/2 inch apart on an ungreased baking sheet, then brush tops of dough lightly with egg wash. Bake until pirozhki are golden, about 25 minutes (edges will open slightly during baking). Cool on a rack to warm, about 15 minutes.",
            "Put oven rack in middle position and preheat oven to 375°F.",
            "Roll out dough on a lightly floured work surface with a lightly floured rolling pin into a roughly 13-inch round (3/4 inch thick). Cut out rounds with cutter. Put 1 level teaspoon filling in center of 1 round, then fold round over filling to form a half moon, pressing edges with your fingers to seal. Repeat with remaining rounds and filling in same manner, rerolling and cutting scraps once. Arrange 1/2 inch apart on an ungreased baking sheet, then brush tops of dough lightly with egg wash. Bake until pirozhki are golden, about 25 minutes (edges will open slightly during baking). Cool on a rack to warm, about 15 minutes."
        ],
        "picture_link": null,
        "color": 12650236
    }
}