{
    "recipe": {
        "title": "Lobster Toasts With Avocado and Espelette Pepper ",
        "ingredients": [
            "Kosher salt",
            "One (1 1/2-pound) live lobster or 8 ounces pre-cooked lobster meat",
            "3 tablespoons mayonnaise",
            "1 tablespoon crème fraîche",
            "2 teaspoons lemon juice, divided",
            "1/2 teaspoon finely grated lemon zest",
            "1 teaspoon finely chopped tarragon, plus more (for sprinkling)",
            "1 teaspoon finely sliced chives",
            "1 Hass avocado",
            "Six (1/2-inch thick) slices brioche (4 ounces), crusts removed",
            "Piment d'Espelette or cayenne pepper (for sprinkling)"
        ],
        "instructions": [
            "If using live lobster, bring a large pot of generously salted water to a boil and prepare a large bowl of ice water. Add lobster to boiling water, cover, and cook for 9 minutes, until shell is bright red all over. Drain and transfer lobster to ice water to cool. Remove meat from claws, knuckles, and tail; pat lobster meat dry with paper towels and cut into 1/4\" pieces.",
            "Combine mayonnaise, crème fraîche, 1 tsp. lemon juice, lemon zest, 1 tsp. tarragon, and chives in a medium bowl. Fold in lobster meat and season with salt.",
            "Mash avocado in a small bowl with remaining 1 tsp. lemon juice and season with salt.",
            "Meanwhile, preheat oven to 350°F. Cut brioche into twenty-four 1 1/2\" squares. Toast on rimmed baking sheet until lightly browned and dry, about 12 minutes.",
            "Spread avocado on toasts and top with lobster salad. Sprinkle with espelette pepper and tarragon and serve.",
            "Do ahead Lobster salad can be made up to 2 days in advance; refrigerate in an airtight container. Toasts can be made up to 2 days in advance; store in airtight container at room temperature.",
            "Lobster salad can be made up to 2 days in advance; refrigerate in an airtight container. Toasts can be made up to 2 days in advance; store in airtight container at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/566863dedfc05f4039b5d7a9/6:4/w_274%2Ch_169/EP_12012015_dannymeyers_-NYE_lobster.jpg"
    }
}