{
    "recipe": {
        "title": "Lobster Shepherd's Pie ",
        "ingredients": [
            "2 lb. russet potatoes, scrubbed, pricked all over with a fork",
            "8 Tbsp. (1 stick) unsalted butter, divided",
            "1 1/2 lb. lobster tails, meat removed from shells and cut into 2\" pieces, shells broken into 2\" pieces",
            "2 Tbsp. tomato paste",
            "1/2 cup dry white wine",
            "1 medium yellow onion, peeled, halved through root end",
            "1 head of garlic, halved crosswise",
            "2 celery stalks, halved crosswise",
            "2 bay leaves",
            "1 tsp. black peppercorns",
            "Kosher salt",
            "4 medium carrots, peeled, cut on a diagonal into 2\" pieces, divided",
            "1 1/2 cups half-and-half, divided",
            "Freshly ground black pepper",
            "2 large egg yolks",
            "¼ cup chopped dill",
            "2 Tbsp. prepared horseradish",
            "8 oz. pearl onions, peeled",
            "1/4 cup all-purpose flour",
            "Flaky sea salt"
        ],
        "instructions": [
            "Place a rack in top-most position of oven; preheat to 400°F. Roast potatoes directly on rack until tender, 60–70 minutes. Let sit until cool enough to handle. Meanwhile, heat 2 Tbsp. butter in a large saucepan over medium-high until melted and foaming. Add lobster shells and cook, stirring often, until bright red, about 5 minutes. Add tomato paste and cook, stirring, until it starts to brown and stick to pot, about 1 minute. Add wine and cook, scraping up browned bits, until almost completely evaporated, about 3 minutes. Add yellow onion, garlic, celery, bay leaves, peppercorns, 1 carrot, and 4 cups water. Toss in a generous pinch of kosher salt and bring to a boil over medium-high. Reduce heat and simmer briskly until liquid is reduced by two-thirds, 50–60 minutes. Strain stock through a fine-mesh sieve into a heatproof measuring glass; discard solids. (You should have about 1 1/2 cups.) While the potatoes are cooling, warm 1 cup half-and-half and 2 Tbsp. butter in a medium saucepan over low heat just to melt butter. Split potatoes lengthwise and scoop flesh into half-and-half mixture. Smash with a potato masher until mixture is smooth and lump-free; season generously with kosher salt and pepper. Remove from heat and mix in egg yolks, dill, and horseradish; cover with plastic wrap and set aside. Melt remaining 4 Tbsp. butter in a clean large saucepan over medium. Add pearl onions and remaining carrots and cook, stirring, until onions start to turn translucent, 5–8 minutes. Sprinkle flour over; stir to combine. Cook, stirring, until flour leaves a film on bottom of pot, about 4 minutes. Stirring constantly, gradually stream in stock, then bring to a simmer. Remove from heat and stir in remaining 1/2 cup half-and-half; season sauce with kosher salt and pepper. Let cool slightly. Arrange lobster pieces in a shallow 1 1/2-qt. baking dish and ladle sauce over. Dollop mashed potatoes on top and use the back of the spoon to spread across surface, creating decorative swirls. Sprinkle with sea salt. Bake on a foil-lined baking sheet until lobster is cooked through and filling is bubbling around the edges, 20–25 minutes. Turn on broiler and broil pie just until topping is browned in spots, about 1 minute. Let rest 5–10 minutes before serving.",
            "Place a rack in top-most position of oven; preheat to 400°F. Roast potatoes directly on rack until tender, 60–70 minutes. Let sit until cool enough to handle.",
            "Meanwhile, heat 2 Tbsp. butter in a large saucepan over medium-high until melted and foaming. Add lobster shells and cook, stirring often, until bright red, about 5 minutes. Add tomato paste and cook, stirring, until it starts to brown and stick to pot, about 1 minute. Add wine and cook, scraping up browned bits, until almost completely evaporated, about 3 minutes. Add yellow onion, garlic, celery, bay leaves, peppercorns, 1 carrot, and 4 cups water. Toss in a generous pinch of kosher salt and bring to a boil over medium-high. Reduce heat and simmer briskly until liquid is reduced by two-thirds, 50–60 minutes. Strain stock through a fine-mesh sieve into a heatproof measuring glass; discard solids. (You should have about 1 1/2 cups.)",
            "While the potatoes are cooling, warm 1 cup half-and-half and 2 Tbsp. butter in a medium saucepan over low heat just to melt butter.",
            "Split potatoes lengthwise and scoop flesh into half-and-half mixture. Smash with a potato masher until mixture is smooth and lump-free; season generously with kosher salt and pepper. Remove from heat and mix in egg yolks, dill, and horseradish; cover with plastic wrap and set aside.",
            "Melt remaining 4 Tbsp. butter in a clean large saucepan over medium. Add pearl onions and remaining carrots and cook, stirring, until onions start to turn translucent, 5–8 minutes. Sprinkle flour over; stir to combine. Cook, stirring, until flour leaves a film on bottom of pot, about 4 minutes. Stirring constantly, gradually stream in stock, then bring to a simmer. Remove from heat and stir in remaining 1/2 cup half-and-half; season sauce with kosher salt and pepper. Let cool slightly.",
            "Arrange lobster pieces in a shallow 1 1/2-qt. baking dish and ladle sauce over. Dollop mashed potatoes on top and use the back of the spoon to spread across surface, creating decorative swirls. Sprinkle with sea salt. Bake on a foil-lined baking sheet until lobster is cooked through and filling is bubbling around the edges, 20–25 minutes. Turn on broiler and broil pie just until topping is browned in spots, about 1 minute. Let rest 5–10 minutes before serving.",
            "Do Ahead Pie can be assembled 1 day ahead; cover and chill. Bring to room temperature and uncover before baking.",
            "Pie can be assembled 1 day ahead; cover and chill. Bring to room temperature and uncover before baking."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aa012387cb776670c1d4f99/6:4/w_274%2Ch_169/lobster-shepherds-pie-recipe-BA-030718.jpg"
    }
}