{
    "recipe": {
        "title": "Loofah and Chicken Stir-Fry ",
        "ingredients": [
            "1/2 lb skinless boneless chicken breast, cut across grain into 1/8-inch-thick slices",
            "2 teaspoons cornstarch",
            "1 1/4 teaspoons Asian sesame oil",
            "2 tablespoons oyster sauce",
            "1 tablespoon light soy sauce",
            "1 teaspoon sugar",
            "1/2 cup chicken stock or low-sodium chicken broth",
            "1/2 pound fresh angled loofah* (about 12 inches long)",
            "1 cup peanut oil",
            "3 small fresh shiitakes, stems discarded and caps sliced 1/8 inch thick",
            "1 teaspoon Chinese fermented black beans**",
            "5 small (2-inch) fresh red chiles such as Thai, seeded and cut into fine julienne (2 teaspoons)",
            "2 teaspoons finely chopped garlic",
            "2 teaspoons finely chopped peeled fresh ginger",
            "2 teaspoons cornstarch mixed with 2 tablespoons water",
            "Accompaniment: cooked white rice",
            "a deep-fat thermometer"
        ],
        "instructions": [
            "Stir together chicken, cornstarch, and 1 teaspoon sesame oil in a small bowl.",
            "Stir together oyster sauce, soy sauce, sugar, and stock in another bowl until sugar is dissolved.",
            "Remove ridges from loofah with a vegetable peeler, then scrape skin lightly with a sharp small knife (a little green skin should remain). Cut loofah lengthwise into 2- by 1/2-inch sticks.",
            "Heat peanut oil in a wok over moderate heat until it registers 350°F on thermometer, then cook chicken, stirring, just until no longer pink, about 11/2 minutes. Transfer to a bowl with a slotted spoon, then pour oil into a heatproof container and reserve.",
            "Heat wok over high heat until a bead of water dropped onto cooking surface evaporates immediately. Add 3 tablespoons reserved peanut oil, swirling wok to coat evenly, and heat until it just begins to smoke. Stir-fry mushrooms until lightly browned and tender, 1 to 2 minutes. Add beans, chiles, garlic, and ginger and stir-fry until fragrant, about 30 seconds.",
            "Add loofah and toss until well coated.",
            "Add stock mixture and bring to a boil. Add chicken and return sauce to a boil. Stir cornstarch mixture and add to sauce, then boil, stirring, until sauce thickens slightly and becomes translucent.",
            "Serve drizzled with remaining 1/4 teaspoon sesame oil.",
            "Also known as \"ridged gourd\" and \"Chinese okra.\" ** Available at Asian markets and by mail order from Uwajimaya (800-889-1928).",
            "Also known as \"ridged gourd\" and \"Chinese okra.\"",
            "Also known as \"ridged gourd\" and \"Chinese okra.\"",
            "** Available at Asian markets and by mail order from Uwajimaya (800-889-1928)."
        ],
        "picture_link": null
    }
}