{
    "recipe": {
        "title": "Low-Country Boil with Shrimp, Corn, and Sausage ",
        "ingredients": [
            "2 lemons, quartered",
            "2 bay leaves",
            "3 tablespoons kosher salt",
            "2 tablespoons whole black peppercorns",
            "1/2-3/4 cup crab and shrimp boil seasoning, such as Old Bay, plus more, or 4 (3-ounce) bags Zatarain's Crawfish, Shrimp, and Crab Boil (See Cooks' Note)",
            "4 pounds small new potatoes (about 1 1/2\" in diameter)",
            "2 pounds smoked pork sausage (about 4 links), such as kielbasa, cut into 2\" pieces",
            "2 sweet or yellow onions, peeled, quartered",
            "8 ears of corn, shucked, cut in half",
            "4 pounds fresh large shrimp (31–35 count; preferably wild-caught), unpeeled",
            "1 cup ketchup",
            "2 tablespoons plus 2 teaspoons prepared horseradish",
            "2 tablespoons plus 2 teaspoons Worcestershire sauce",
            "1 tablespoon fresh lemon juice",
            "Louisiana-style hot sauce, such as Crystal (to taste; optional)",
            "1/4 cup (1/2 stick) unsalted butter, melted",
            "2 tablespoons (or more) fresh lemon juice",
            "Louisiana-style hot sauce, such as Crystal (to taste; optional)",
            "A large (at least 12-quart) stockpot, preferably with a perforated insert, or 2 large (at least 6-quart) pots"
        ],
        "instructions": [
            "Fill stockpot with 6 qt. water (if using 2 pots, divide ingredients and water between them). Add lemons, bay leaves, salt, peppercorns, and 1/2 cup seasoning, cover, and bring to a rolling boil. Add potatoes, return to a boil, and cook 7 minutes. Add sausage and onions, return to a boil, and cook 5 minutes. Add corn, return to a boil, and cook until corn is cooked and potatoes are tender when pierced with a knife, about 5 minutes more.",
            "Add shrimp and cook (no need to return to a boil), stirring gently, until shrimp turn pink, about 3 minutes. Remove insert or drain through a very large colander.",
            "Make the cocktail sauce: Stir ketchup, horseradish, Worcestershire, lemon juice, and hot sauce, if using, in a medium bowl.",
            "Stir ketchup, horseradish, Worcestershire, lemon juice, and hot sauce, if using, in a medium bowl.",
            "Make the lemon-butter sauce: Melt butter in a small saucepan over medium-high heat. Transfer to a medium bowl and stir in lemon juice and hot sauce, if using. Taste and add more lemon juice, if needed. Cover and let sit in a warm place.",
            "Melt butter in a small saucepan over medium-high heat. Transfer to a medium bowl and stir in lemon juice and hot sauce, if using. Taste and add more lemon juice, if needed. Cover and let sit in a warm place.",
            "Serve the shrimp boil: Serve shrimp boil on a newspaper-lined table or large platters. Dust with additional Old Bay, if using. Serve with sauces alongside, if desired.",
            "Serve shrimp boil on a newspaper-lined table or large platters. Dust with additional Old Bay, if using. Serve with sauces alongside, if desired.",
            "Do Ahead Cocktail sauce can be made 1 week ahead. Transfer to an airtight container and chill.",
            "Cocktail sauce can be made 1 week ahead. Transfer to an airtight container and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59541920d52ca90dc28200e4/6:4/w_274%2Ch_169/Low-Country-Shrimp-Boil-15062017.jpg",
        "color": 7783625
    }
}