{
    "recipe": {
        "title": "Low-Fuss Crispy Roast Chicken ",
        "ingredients": [
            "1 4–4 1/2-lb. whole chicken",
            "5 sprigs thyme, rosemary, marjoram, or sage",
            "1 Tbsp. plus 1 1/2 tsp. kosher salt, divided",
            "1/2 tsp. freshly ground pepper, plus more",
            "1 1/4 lb. medium red-skinned or Yukon Gold potatoes, cut into 1/2\" wedges",
            "2 small onions, cut into 1/2\" wedges, leaving root end intact",
            "1 1/2 Tbsp. extra-virgin olive oil"
        ],
        "instructions": [
            "Place a rack in lower third of oven; preheat to 450°F. Place a 12\" cast-iron or stainless-steel skillet in oven.",
            "Pull off excess fat around cavities of chicken; discard. Using paper towels, thoroughly pat dry chicken inside and out. Arrange chicken breast side up on a cutting board. Gently loosen skin covering breasts and thighs. Tuck 4 thyme sprigs under loosened skin, 1 sprig for each breast and thigh.",
            "Combine 1 Tbsp. plus 1 tsp. salt and 1/2 tsp. pepper in a small bowl. Pat dry cutting board and chicken again, then tie legs together with kitchen twine.",
            "Using a metal skewer or paring knife, poke 20–30 holes all over chicken, paying special attention to fatty (thickest) parts of skin. Season chicken with salt mixture, placing a pinch inside cavity, but primarily covering outside of bird.",
            "Cut remaining thyme sprig crosswise into 3–4 pieces and place in a large bowl. Add potatoes, onions, oil, 1/2 tsp. salt, and a generous pinch of pepper. Toss to combine.",
            "Carefully remove skillet from oven. Transfer potato mixture to skillet (mixture will sizzle), then place chicken, breast side up, on potato mixture. Return skillet to oven (remember, handle is hot!). Roast until an instant-read thermometer inserted into thickest part of breast registers 160°F and thickest part of thigh registers 175°F, 45–55 minutes.",
            "Remove skillet from oven. Using tongs or a large wooden spoon inserted into cavity, transfer chicken to a large plate. Give potato mixture a stir, then return to oven. Let chicken rest about 5 minutes.",
            "Using a sharp knife, slash stretched skin between thighs and breasts to let steam escape. Carefully tilt bird and plate over a large bowl to drain juices; reserve juices. Let chicken rest until potatoes are fork-tender, 15–25 minutes more.",
            "Tilt chicken and plate again over bowl with juices to drain any last bits, then transfer chicken to a cutting board and carve. (If juices have cooled and congealed, gently rewarm over low heat or for 10 seconds in the microwave.)",
            "Arrange chicken on a platter. Serve with roasted potatoes and onions alongside, spooning juices over.",
            "Cooks’ Note: If time allows, after patting dry and salting chicken, place on a wire rack set in a rimmed baking sheet, or on a V-rack set in a roasting pan, and chill, uncovered, at least 12 hours or up to 2 days. This ‘dry brine’ will result in a flavorful juicy chicken with even crispier skin."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5acb86a7265d7e23b7b9f9f6/6:4/w_274%2Ch_169/Mindy's-Roast-Chicken-recipe-04042018.jpg"
    }
}