{
    "recipe": {
        "title": "Ludo's Omelet ",
        "ingredients": [
            "2 large eggs (insanely fresh)",
            "2 tablespoons unsalted Europeanstyle butter, room temperature, plus more for serving",
            "Kosher salt",
            "Freshly ground white pepper",
            "1 ounce Boursin Pepper Cheese",
            "Fleur de sel",
            "1 tablespoon finely chopped fresh chives"
        ],
        "instructions": [
            "Whisk It Good:",
            "This omelet is as smooth as crème brûlée. To achieve this texture, whisk eggs—and fresh eggs are key—in a medium bowl until very, very well combined (we're talking no strands of egg white remaining, but be careful not to incorporate too much air). Want to get super fussy about it? Strain beaten eggs though a fine-mesh sieve into a small bowl.",
            "Butter Better: Place 1 tablespoon butter in a cold 8\" nonstick skillet and melt over medium heat. The butter doesn't just keep the omelet from sticking, it also adds savoriness, so use the good stuff. Oh, and if it sizzles, it's too hot.",
            "Butter Better:",
            "Place 1 tablespoon butter in a cold 8\" nonstick skillet and melt over medium heat. The butter doesn't just keep the omelet from sticking, it also adds savoriness, so use the good stuff. Oh, and if it sizzles, it's too hot.",
            "Season Subtly: Pour eggs into the pan and season with kosher salt and white pepper (not black, so you don't overwhelm the flavor of the eggs). \"An omelet is as much about tasting the eggs as the fillings,\" Lefebvre says.",
            "Season Subtly:",
            "Pour eggs into the pan and season with kosher salt and white pepper (not black, so you don't overwhelm the flavor of the eggs). \"An omelet is as much about tasting the eggs as the fillings,\" Lefebvre says.",
            "Get Moving: Using a rubber spatula, stir eggs quickly and constantly in a rough figure-eight pattern while moving skillet in a circular motion. Periodically scrape down the sides of the pan so that overcooked bits won't ruin your omelet.",
            "Get Moving:",
            "Using a rubber spatula, stir eggs quickly and constantly in a rough figure-eight pattern while moving skillet in a circular motion. Periodically scrape down the sides of the pan so that overcooked bits won't ruin your omelet.",
            "Barely There: As soon as the eggs begin to coagulate, about 2 minutes, shake the skillet to settle any uncooked egg. The eggs should be nearly cooked through underneath but still runny on top. Lift an edge of the omelet to check that it's holding together. If it does, it's ready to fill. Take pan off the heat and let sit 1 minute.",
            "Barely There:",
            "As soon as the eggs begin to coagulate, about 2 minutes, shake the skillet to settle any uncooked egg. The eggs should be nearly cooked through underneath but still runny on top. Lift an edge of the omelet to check that it's holding together. If it does, it's ready to fill. Take pan off the heat and let sit 1 minute.",
            "Cheese It: Dollop the Boursin across the center of the eggs (\"it melts so smoothly,\" Lefebvre says) at a slight angle from the skillet's handle. This positioning cleverly sets you up to grip the handle with your left hand and flip the omelet onto your plate when the time comes.",
            "Cheese It:",
            "Dollop the Boursin across the center of the eggs (\"it melts so smoothly,\" Lefebvre says) at a slight angle from the skillet's handle. This positioning cleverly sets you up to grip the handle with your left hand and flip the omelet onto your plate when the time comes.",
            "Let's Roll: Starting at the edge closest to you, use your spatula to gently roll up the omelet at about 1 1/2\" intervals. When you're about halfway through, add 1 tablespoon butter to the skillet. It will help prevent any sticking and adds a pretty sheen to the eggs.",
            "Let's Roll:",
            "Starting at the edge closest to you, use your spatula to gently roll up the omelet at about 1 1/2\" intervals. When you're about halfway through, add 1 tablespoon butter to the skillet. It will help prevent any sticking and adds a pretty sheen to the eggs.",
            "Tip and Flip: With your spatula, finish rolling up the omelet, then tip the skillet up and over the plate, using the spatula to help you flip over the omelet so it sits seam side down on the (warmed) plate. To finish, top with fleur de sel and chives.",
            "Tip and Flip:",
            "With your spatula, finish rolling up the omelet, then tip the skillet up and over the plate, using the spatula to help you flip over the omelet so it sits seam side down on the (warmed) plate. To finish, top with fleur de sel and chives."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5537e2f867c3a7e837c3eb6b/6:4/w_274%2Ch_169/56389381_ludos-omelet_1x1.jpg"
    }
}