{
    "recipe": {
        "title": "Lumaconi with Prosciutto and Lemon Breadcrumbs ",
        "ingredients": [
            "1/4 cup olive oil",
            "1 garlic clove",
            "1/2 cup coarse fresh breadcrumbs",
            "1 teaspoon finely grated lemon zest",
            "Kosher salt",
            "4 ounces prosciutto, cut into 1/4\" pieces",
            "1 tablespoons olive oil",
            "1 small shallot, thinly sliced",
            "4 garlic cloves, smashed",
            "1/4 cup brandy",
            "2 sprigs thyme",
            "1 bay leaf",
            "Zest of 1 lemon, removed in strips with a vegetable peeler",
            "2 cups heavy cream",
            "4 ounces prosciutto, cut into 1/4\" pieces",
            "1 tablespoons olive oil, plus more for serving",
            "12 ounces lumaconi (snail shells) or other medium shell pasta",
            "Kosher salt",
            "1 cup thinly sliced Treviso radicchio",
            "1/4 cup coarsely chopped fresh flat-leaf parsley",
            "1 tablespoons fresh lemon juice"
        ],
        "instructions": [
            "Pulse prosciutto in a food processor until finely ground. Heat oil in a large skillet over medium heat. Cook prosciutto, stirring often, until brown and crisp, 5–8 minutes.",
            "Add shallot and garlic to skillet and cook, stirring often, until shallot is soft and garlic is golden brown, about 3 minutes. Add brandy and cook until skillet is almost dry, about 30 seconds.",
            "Add thyme, bay leaf, lemon zest, and cream to skillet and bring to a boil. Reduce heat and simmer until cream is slightly reduced, about 5 minutes. Remove from heat and let steep 30 minutes. Strain through a fine-mesh sieve into a medium bowl; discard solids.",
            "Do ahead: Prosciutto cream can be made 1 day ahead. Cover and chill.",
            "Breadcrumbs: Heat oil in a medium skillet over medium-high heat. Add garlic and cook just until golden, about 2 minutes. Add breadcrumbs and cook, stirring constantly, until golden brown, about 4 minutes. Using a slotted spoon, transfer to paper towels to drain; let cool. Discard garlic and transfer breadcrumbs to a medium bowl. Add lemon zest and toss to combine; season with salt. Do ahead: Breadcrumbs (without lemon zest) can be cooked 1 day ahead. Store airtight at room temperature. Add lemon zest just before serving.",
            "Heat oil in a medium skillet over medium-high heat. Add garlic and cook just until golden, about 2 minutes. Add breadcrumbs and cook, stirring constantly, until golden brown, about 4 minutes. Using a slotted spoon, transfer to paper towels to drain; let cool.",
            "Discard garlic and transfer breadcrumbs to a medium bowl. Add lemon zest and toss to combine; season with salt.",
            "Do ahead: Breadcrumbs (without lemon zest) can be cooked 1 day ahead. Store airtight at room temperature. Add lemon zest just before serving.",
            "Assembly: Pulse prosciutto in a food processor until finely ground. Heat 1 tablespoons oil in a large skillet over medium heat. Cook prosciutto, stirring often, until brown and crisp, 5–8 minutes. Add prosciutto cream to skillet and bring to a boil. Reduce heat and simmer, stirring often, until cream is thickened and coats the back of a spoon, about 5 minutes. Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente, 8–10 minutes; drain. Add pasta to sauce. Cook over medium heat, tossing, until pasta is well coated, about 2 minutes. Add radicchio, parsley, and lemon juice and toss to combine; season with salt. Serve pasta topped with breadcrumbs and drizzled with more oil.",
            "Pulse prosciutto in a food processor until finely ground. Heat 1 tablespoons oil in a large skillet over medium heat.",
            "Cook prosciutto, stirring often, until brown and crisp, 5–8 minutes. Add prosciutto cream to skillet and bring to a boil. Reduce heat and simmer, stirring often, until cream is thickened and coats the back of a spoon, about 5 minutes.",
            "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente, 8–10 minutes; drain.",
            "Add pasta to sauce. Cook over medium heat, tossing, until pasta is well coated, about 2 minutes. Add radicchio, parsley, and lemon juice and toss to combine; season with salt.",
            "Serve pasta topped with breadcrumbs and drizzled with more oil."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ab562b6529d92b2c033ef7/6:4/w_274%2Ch_169/51248450_bucatini_1x1.jpg"
    }
}