{
    "recipe": {
        "title": "Luxe Truffle Deviled Eggs ",
        "ingredients": [
            "1 dozen hard-cooked eggs",
            "2 tablespoons mayonnaise",
            "2 tablespoons sour cream or crème fraîche",
            "2 tablespoons truffle oil",
            "1/4 teaspoon salt",
            "Black lava salt",
            "Fresh-cracked black pepper",
            "20 tiny chive flowers (optional)"
        ],
        "instructions": [
            "Halve the eggs lengthwise and transfer the yolks to a mixing bowl. Set 20 egg white halves on a platter, cover, and refrigerate. This recipe uses 12 egg yolks, but only yields enough filling for 20 halves; reserve the extra 4 whites for another use. With a fork, mash the yolks to a smooth consistency. Add the mayonnaise, sour cream, truffle oil, and salt, and mix until smooth. (You can also do this using an electric mixer with a whip attachment.) Taste and season accordingly. Spoon the mixture into a pastry bag fitted with a plain or large star tip, then pipe the mixture evenly into the egg white halves. Or fill the eggs with a spoon, dividing the filling evenly. Top each egg half with a tiny sprinkle of black lava salt, a grind of fresh-cracked black pepper, and a chive flower, if using.",
            "Halve the eggs lengthwise and transfer the yolks to a mixing bowl. Set 20 egg white halves on a platter, cover, and refrigerate. This recipe uses 12 egg yolks, but only yields enough filling for 20 halves; reserve the extra 4 whites for another use.",
            "With a fork, mash the yolks to a smooth consistency. Add the mayonnaise, sour cream, truffle oil, and salt, and mix until smooth. (You can also do this using an electric mixer with a whip attachment.) Taste and season accordingly.",
            "Spoon the mixture into a pastry bag fitted with a plain or large star tip, then pipe the mixture evenly into the egg white halves. Or fill the eggs with a spoon, dividing the filling evenly.",
            "Top each egg half with a tiny sprinkle of black lava salt, a grind of fresh-cracked black pepper, and a chive flower, if using."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b02a86766062b203447520/6:4/w_274%2Ch_169/51158600_deviled-eggs_1x1.jpg"
    }
}