{
    "recipe": {
        "title": "Mackerel with Cauliflower \"Couscous\" and Tahini ",
        "ingredients": [
            "1 garlic clove, finely grated",
            "1/4 cup tahini",
            "2 tablespoons fresh lemon juice",
            "2 tablespoons olive oil",
            "Kosher salt",
            "3 tablespoons olive oil, divided",
            "1 small head cauliflower, cored, cut into large florets",
            "1 tablespoon fresh lemon juice",
            "Kosher salt",
            "2 tablespoons raw pumpkin seeds",
            "2 teaspoons sesame seeds",
            "1 teaspoon nigella seeds",
            "2 whole small Spanish mackerel (about 1 pound each), cleaned",
            "1 tablespoon olive oil",
            "Kosher salt",
            "1 lemon, thinly sliced, seeds removed",
            "1 bunch thyme",
            "1/2 cup pomegranate seeds",
            "1/2 cup fresh cilantro leaves with tender stems",
            "Nigella seeds are available at Indian markets or online. Tahini sauce Stir garlic, tahini, lemon juice, oil, and 1/4 cup water in a small bowl; season with salt."
        ],
        "instructions": [
            "Cauliflower and seeds: Heat 2 tablespoons oil in a large heavy skillet over mediumhigh. Working in batches if needed, cook cauliflower, tossing occasionally, until florets are browned in spots but still crunchy, about 5 minutes. Transfer to a large bowl and let cool. Reserve skillet. Working in 2 batches, pulse cauliflower in a food processor until the size of rice grains. Transfer back to bowl, toss with lemon juice, and season with salt. Cook pumpkin seeds and remaining 1 tablespoon oil in reserved skillet over medium heat, stirring, until seeds are golden brown, about 1 minute. Season with salt. Toss in a small bowl with sesame and nigella seeds.",
            "Heat 2 tablespoons oil in a large heavy skillet over mediumhigh. Working in batches if needed, cook cauliflower, tossing occasionally, until florets are browned in spots but still crunchy, about 5 minutes. Transfer to a large bowl and let cool. Reserve skillet.",
            "Working in 2 batches, pulse cauliflower in a food processor until the size of rice grains. Transfer back to bowl, toss with lemon juice, and season with salt.",
            "Cook pumpkin seeds and remaining 1 tablespoon oil in reserved skillet over medium heat, stirring, until seeds are golden brown, about 1 minute. Season with salt. Toss in a small bowl with sesame and nigella seeds.",
            "Mackerel and assembly: Heat broiler. Place fish on a rimmed baking sheet and rub with oil; season all over with salt. Stuff cavity with lemon and thyme. Broil, turning once, until cooked through, 10–12 minutes. Let rest 5 minutes. Spoon cauliflower onto plates; drizzle with tahini sauce. Top with seed mixture and pomegranate seeds. Remove fillets from fish and place, skin side up, on top. Add cilantro and a sprinkle of salt.",
            "Heat broiler. Place fish on a rimmed baking sheet and rub with oil; season all over with salt. Stuff cavity with lemon and thyme. Broil, turning once, until cooked through, 10–12 minutes. Let rest 5 minutes.",
            "Spoon cauliflower onto plates; drizzle with tahini sauce. Top with seed mixture and pomegranate seeds. Remove fillets from fish and place, skin side up, on top. Add cilantro and a sprinkle of salt."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b72074ac90eb2c34cfc13f/6:4/w_274%2Ch_169/51260660_mackerel-cauliflower-couscous_1x1.jpg"
    }
}