{
    "recipe": {
        "title": "Magic Cèpe Mushroom Soup ",
        "ingredients": [
            "2 ounces (30 g) best-quality dried cèpe (porcini) mushrooms (or substitute dried morels)",
            "2 cups (500 ml) heavy cream",
            "2 tablespoons Cèpe Mushroom Powder",
            "1/2 teaspoon fine sea salt",
            "3 cups (750 ml) chicken stock or vegetable stock",
            "Chopped fresh chives, for garnish",
            "Extra-virgin olive oil or chive oil, for garnish",
            "An electric spice mill; a small jar with a lid; a large jar with a lid; a 3-quart (3 l) heavy-duty saucepan with a lid; 8 warmed, shallow soup bowls."
        ],
        "instructions": [
            "Coarsely chop the dried mushrooms or cut them into pieces with scissors. Working in batches, grind them to a fine powder in the spice mill. [Makes 1/2 cup (8 tablespoons) powder.]",
            "For the soup: If time permits, combine the cream and 2 tablespoons mushroom powder in a jar, seal, and refrigerate for 24 hours to infuse the cream with the mushroom flavor and aroma. (Alternatively, combine the cream and mushroom powder in the heavy-duty saucepan, bring just to a simmer, cover, remove from the heat, and set aside for 30 minutes to infuse the cream.) At serving time, in heavy-duty saucepan, combine the infused cream, salt, and stock and bring to a gentle simmer over medium heat. Remove from the heat and taste for seasoning. Serve in the warmed soup bowls, garnished with chives and a drizzle of oil.",
            "If time permits, combine the cream and 2 tablespoons mushroom powder in a jar, seal, and refrigerate for 24 hours to infuse the cream with the mushroom flavor and aroma. (Alternatively, combine the cream and mushroom powder in the heavy-duty saucepan, bring just to a simmer, cover, remove from the heat, and set aside for 30 minutes to infuse the cream.)",
            "At serving time, in heavy-duty saucepan, combine the infused cream, salt, and stock and bring to a gentle simmer over medium heat. Remove from the heat and taste for seasoning.",
            "Serve in the warmed soup bowls, garnished with chives and a drizzle of oil.",
            "Do Ahead The soup can be prepared up to 3 days in advance and stored in airtight containers in the refrigerator.",
            "The soup can be prepared up to 3 days in advance and stored in airtight containers in the refrigerator.",
            "Variations: Add sliced raw domestic or wild mushrooms to the soup and cook for several minutes; add grilled, sliced fresh cèpes or domestic mushrooms; add truffle matchsticks at serving time.",
            "Add sliced raw domestic or wild mushrooms to the soup and cook for several minutes; add grilled, sliced fresh cèpes or domestic mushrooms; add truffle matchsticks at serving time."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58b6fdac1c5fbd604af1023a/6:4/w_274%2Ch_169/porcini-mushroom-cream-soup-022817.jpg",
        "color": 11316382
    }
}