{
    "recipe": {
        "title": "Mahi-Mahi Skewers with Tapenade and Couscous ",
        "ingredients": [
            "1 cup plain couscous (about 6 ounces)",
            "1 teaspoon coarse kosher salt, divided",
            "1/3 cup purchased tapenade",
            "3 tablespoons fresh lemon juice",
            "1 teaspoon freshly ground black pepper",
            "1 pound mahi-mahi fillets, cut into 1-inch cubes",
            "1 cup purchased pico de gallo, drained",
            "Metal skewers"
        ],
        "instructions": [
            "Preheat broiler. Bring 1 cup plus 2 tablespoons water to boil in heavy medium saucepan. Stir in couscous and 1/2 teaspoon coarse salt. Remove from heat. Cover and let stand until water is absorbed and couscous is tender, about 10 minutes. Meanwhile, stir tapenade, lemon juice, 1 teaspoon pepper, and 1/2 teaspoon coarse salt in small bowl to blend. Transfer 31/2 tablespoons tapenade mixture to another small bowl and reserve for couscous. Thread fish pieces onto 4 metal skewers; arrange on broiler tray. Brush fish on both sides with remaining tapenade mixture. Broil fish until just opaque in center, about 4 minutes per side. Fluff couscous with fork. Gently stir in reserved tapenade mixture. Stir in pico de gallo or serve it alongside. Mound couscous on plates. Top with fish skewers.",
            "Preheat broiler. Bring 1 cup plus 2 tablespoons water to boil in heavy medium saucepan. Stir in couscous and 1/2 teaspoon coarse salt. Remove from heat. Cover and let stand until water is absorbed and couscous is tender, about 10 minutes.",
            "Meanwhile, stir tapenade, lemon juice, 1 teaspoon pepper, and 1/2 teaspoon coarse salt in small bowl to blend. Transfer 31/2 tablespoons tapenade mixture to another small bowl and reserve for couscous.",
            "Thread fish pieces onto 4 metal skewers; arrange on broiler tray. Brush fish on both sides with remaining tapenade mixture. Broil fish until just opaque in center, about 4 minutes per side.",
            "Fluff couscous with fork. Gently stir in reserved tapenade mixture. Stir in pico de gallo or serve it alongside. Mound couscous on plates. Top with fish skewers."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a586e0acd286555db852/6:4/w_274%2Ch_169/353375_hires.jpg"
    }
}