{
    "recipe": {
        "title": "Mahi Mahi Fish Tacos with Chipotle Slaw and Roasted Pineapple Sauce ",
        "ingredients": [
            "2 cups chopped peeled and cored fresh pineapple",
            "1/2 yellow bell pepper, halved lengthwise again and seeded",
            "1 fresh red jalapeño, halved lengthwise and seeded",
            "Juice of 1 lime juice",
            "Salt and freshly ground black pepper to taste",
            "1/2 head white cabbage, thinly sliced",
            "1/2 head red cabbage, thinly sliced",
            "1 bunch red radishes, greens trimmed and radishes sliced thin",
            "1 bunch cilantro, stems reserved for another use and leaves thinly sliced or minced",
            "1 cup mayonnaise",
            "1 cup sour cream",
            "3 chipotles in adobo, minced, plus 4 tablespoons adobo sauce",
            "1 teaspoon garlic powder",
            "Salt and freshly ground black pepper to taste",
            "1 pound mahi mahi fillet, skinned",
            "1 tablespoon sweet paprika",
            "1 tablespoon cayenne pepper",
            "Salt and freshly ground black pepper to taste",
            "8 corn or flour tortillas",
            "cilantro sprigs for garnish"
        ],
        "instructions": [
            "Make the pineapple sauce: In a grill pan over moderately high heat, sear and soften the pineapple, bell pepper, and jalapeño, turning occasionally with tongs. Transfer the pineapple, bell pepper, and jalapeño to a blender and add the lime juice, then purée the mixture. Season the sauce with salt and freshly ground black pepper and keep at room temperature.",
            "In a grill pan over moderately high heat, sear and soften the pineapple, bell pepper, and jalapeño, turning occasionally with tongs. Transfer the pineapple, bell pepper, and jalapeño to a blender and add the lime juice, then purée the mixture. Season the sauce with salt and freshly ground black pepper and keep at room temperature.",
            "Prepare the slaw: In a large bowl toss together the cabbages, the radishes, and the cilantro.",
            "In a large bowl toss together the cabbages, the radishes, and the cilantro.",
            "Prepare the dressing: In a medium bowl whisk together the dressing ingredients and season it with salt and freshly ground black pepper to taste.",
            "In a medium bowl whisk together the dressing ingredients and season it with salt and freshly ground black pepper to taste.",
            "Prepare the fish and warm the tortillas: Prepare a grill for moderately high heat. While the grill is heating, cut the fish crosswise into 1-inch wide strips. In a small bowl whisk together the paprika and the cayenne and sprinkle it evenly all over the strips. Season the strips well with salt and freshly ground black pepper. Divide the tortillas into 2 stacks and wrap each stack in foil. Warm the tortillas on the grill, turning once or twice, until heated through, about 3 minutes. Remove the packets from the grill and keep warm in a kitchen towel. Oil the grill rack, then grill the fish, covered, turning it once, until it is opaque and just cooked through, about 6 minutes total. Transfer the fish to a platter and keep it warm, covered.",
            "Prepare a grill for moderately high heat.",
            "While the grill is heating, cut the fish crosswise into 1-inch wide strips. In a small bowl whisk together the paprika and the cayenne and sprinkle it evenly all over the strips. Season the strips well with salt and freshly ground black pepper.",
            "Divide the tortillas into 2 stacks and wrap each stack in foil. Warm the tortillas on the grill, turning once or twice, until heated through, about 3 minutes. Remove the packets from the grill and keep warm in a kitchen towel.",
            "Oil the grill rack, then grill the fish, covered, turning it once, until it is opaque and just cooked through, about 6 minutes total. Transfer the fish to a platter and keep it warm, covered.",
            "Assemble the tacos: Drizzle the dressing over the slaw and toss it well. Divide the fish among the warm tortillas and top it with the slaw. Garnish the tacos with the cilantro sprigs and serve them with the pineapple sauce on the side.",
            "Drizzle the dressing over the slaw and toss it well. Divide the fish among the warm tortillas and top it with the slaw. Garnish the tacos with the cilantro sprigs and serve them with the pineapple sauce on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54af326fc4a891cc44ccac75/6:4/w_274%2Ch_169/51180230_mahi-mahi-fish-tacos_1x1.jpg"
    }
}