{
    "recipe": {
        "title": "Make-Ahead Gravy ",
        "ingredients": [
            "1 tablespoon vegetable oil",
            "1 pound chicken wings",
            "1 large onion, unpeeled, coarsely chopped",
            "1 large carrot, peeled, coarsely chopped",
            "1 celery stalk, coarsely chopped",
            "A small handful of rosemary, thyme, and/or bay leaves",
            "1 cup dry white wine",
            "6 cups (or more) Thanksgiving Stock or low-sodium chicken broth",
            "3 tablespoons unsalted butter",
            "1/4 cup Wondra or all-purpose flour",
            "1/2 teaspoon Worcestershire sauce",
            "Kosher salt, freshly ground pepper"
        ],
        "instructions": [
            "Heat oil in a large saucepan over medium-high. Cook chicken wings, turning occasionally, until golden brown, 10–12 minutes. Add onion, carrot, and celery and cook, stirring and turning wings often, until everything in pan is deeply browned, 14–16 minutes. Add herbs and cook, stirring, until fragrant, about 1 minute. Pour in wine and use a wooden spoon to scrape up any browned bits stuck to the bottom of pan. Bring to a boil and cook until wine is reduced by half, about 5 minutes. Add stock and return to a boil. Reduce heat and simmer, stirring occasionally, until liquid is reduced by a third, 35–40 minutes.",
            "Strain fortified stock through a fine-mesh sieve into a heatproof bowl. (You should have about 4 cups. If you don’t, add enough stock or water to get you there.) Discard solids. Keep fortified stock warm while you make your roux.",
            "Heat butter in a medium saucepan over medium. Whisk in flour and cook, whisking constantly, until roux is golden brown and looks smooth and shiny, about 4 minutes.",
            "Whisking constantly, ladle fortified stock into roux, pouring in gradually and making sure to incorporate after each addition before adding more. Simmer, whisking often, until gravy is thickened and reduced to about 3 cups (it should coat a spoon), 8–10 minutes. Stir in Worcestershire sauce, taste, and season with salt and pepper",
            "Do Ahead Gravy can be made 5 days ahead. Let cool; cover and chill. Reheat over low before serving.",
            "Gravy can be made 5 days ahead. Let cool; cover and chill. Reheat over low before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a05db10543d902dfd5e062a/6:4/w_274%2Ch_169/make-ahead-thanksgiving-gravy-recipe-BA-111017.jpg"
    }
}