{
    "recipe": {
        "title": "Make-Ahead Sheet-Pan Meatballs ",
        "ingredients": [
            "2 cups coarsely torn white sandwich bread (from 2–3 slices)",
            "1 1/2 cups whole milk",
            "3 lb. ground beef",
            "1 lb. sweet Italian sausage",
            "4 large eggs, beaten to blend",
            "1 1/2 cups finely grated Parmesan",
            "2 tsp. kosher salt",
            "Extra-virgin olive oil (for greasing)"
        ],
        "instructions": [
            "Place bread in a large bowl, pour milk over, and let sit until moistened, about 5 minutes. Squeeze bread with your hands to remove excess milk; discard milk. Tear bread into pea-size pieces and return to bowl.",
            "Add beef, sausage, eggs, Parmesan, and salt to bread. Using your hands, gently mix until evenly distributed (do not overmix).",
            "To serve immediately: Arrange racks in upper and lower thirds of oven; preheat to 500°F. Lightly coat three 18x13\" rimmed baking sheets with oil. Fill a small bowl with cool water. Moisten your hands and roll meat mixture between palms into ping pong–size balls (about 1.5\" diameter; 1.2 oz. each), occasionally moistening hands as needed. Arrange meatballs 1/2\" apart on prepared sheets. Roast meatballs, rotating racks top to bottom once halfway through, until lightly browned and cooked through, 8–10 minutes.",
            "Arrange racks in upper and lower thirds of oven; preheat to 500°F. Lightly coat three 18x13\" rimmed baking sheets with oil. Fill a small bowl with cool water. Moisten your hands and roll meat mixture between palms into ping pong–size balls (about 1.5\" diameter; 1.2 oz. each), occasionally moistening hands as needed. Arrange meatballs 1/2\" apart on prepared sheets.",
            "Roast meatballs, rotating racks top to bottom once halfway through, until lightly browned and cooked through, 8–10 minutes.",
            "To freeze to serve later: Line two 18x13\" rimmed baking sheets with parchment. Fill a small bowl with cool water. Moisten your hands and roll meat mixture between palms into ping pong–size balls (about 1.5\" diameter; 1.2 oz. each), occasionally moistening hands as needed. Arrange meatballs 1/4\" apart on prepared sheets. Freeze on sheets until firm, about 1 hour. Transfer to an airtight container or resealable plastic bag and freeze up to 3 months. To cook meatballs from frozen, preheat oven to 500°F. Lightly coat a rimmed baking sheet with oil. Transfer desired amount of frozen meatballs to prepared sheet and roast, turning once halfway through, until lightly browned and cooked through, 10–12 minutes.",
            "Line two 18x13\" rimmed baking sheets with parchment. Fill a small bowl with cool water. Moisten your hands and roll meat mixture between palms into ping pong–size balls (about 1.5\" diameter; 1.2 oz. each), occasionally moistening hands as needed. Arrange meatballs 1/4\" apart on prepared sheets. Freeze on sheets until firm, about 1 hour. Transfer to an airtight container or resealable plastic bag and freeze up to 3 months.",
            "To cook meatballs from frozen, preheat oven to 500°F. Lightly coat a rimmed baking sheet with oil. Transfer desired amount of frozen meatballs to prepared sheet and roast, turning once halfway through, until lightly browned and cooked through, 10–12 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b886dc9e053ef27ab4702c5/6:4/w_274%2Ch_169/Sunday-Stash-Sheet-Pan-Meatballs-process-29302018.jpg"
    }
}