{
    "recipe": {
        "title": "Make-Ahead Crispy Chicken Cutlets ",
        "ingredients": [
            "2 large egg yolks",
            "1/2 cup mayonnaise",
            "2 tsp. kosher salt",
            "4 lb. skinless, boneless chicken cutlets, pounded 1/4\" thick (for smaller pieces, quarter cutlet before pounding)",
            "3/4 cup extra-virgin olive oil",
            "6 cups panko (Japanese breadcrumbs)",
            "2 Tbsp. mustard powder, garlic powder, finely grated Parmesan, or dried herbs (optional)"
        ],
        "instructions": [
            "Whisk egg yolks, mayonnaise, and salt in a large bowl until smooth. Add chicken and turn several times with tongs until evenly coated.",
            "Heat oil in a large skillet over medium-high until shimmering. Add panko and cook, stirring constantly with a wooden spoon, making sure to get around the edges to incorporate darker breadcrumbs, until golden brown, about 5 minutes. Let cool slightly, then stir in mustard powder, if using.",
            "Using tongs, place a cutlet in skillet. Pat surrounding toasted panko onto cutlet with one of your hands, pressing firmly to adhere. Turn and repeat on the other side with more breadcrumbs. Lightly shake off excess breadcrumbs. Transfer to a wire rack set inside a rimmed baking sheet (if you are making these ahead and freezing, skip wire rack and place directly on a baking sheet). Repeat with remaining cutlets, spacing evenly apart on baking sheet. Discard any remaining panko. At this point, breaded cutlets can be frozen up to 3 months. Freeze chicken on baking sheets until firm, about 1 hour, then transfer to resealable freezer bags or layer in an airtight container with sheets of parchment between cutlets.",
            "Preheat oven to 450°F and bake cutlets until cooked through and juices run clear when pierced with a knife, 10–12 minutes. If cutlets are frozen, they will take a little longer, 14–16 minutes. You can also bake chicken 1 or 2 at a time in a toaster oven at 450°F. Bake directly on rack, 12–14 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ac79fe3ada0b51f73de75c0/6:4/w_274%2Ch_169/SUNDAY-STASH-Crispy-Chicken-Cutlets-hero-09032018.jpg"
    }
}