{
    "recipe": {
        "title": "Make-Ahead Mashed Potatoes ",
        "ingredients": [
            "4 lb. medium Yukon Gold potatoes, scrubbed",
            "Kosher salt",
            "2/3–1 cup heavy cream",
            "2/3–1 cup whole milk",
            "1 1/4 cups (2 1/2 sticks) unsalted butter, cut into pieces",
            "1/2 cup sour cream",
            "Freshly ground black pepper",
            "A potato ricer or food mill fitted with fine disk"
        ],
        "instructions": [
            "Place potatoes in a large pot and pour in cold water to cover by 1\". Add a large handful of salt (water should taste briny, like the ocean) and bring to a boil. Reduce heat and simmer until potatoes are very tender but not crumbly, 30–40 minutes. Drain and return potatoes to warm pot to dry (off heat). Meanwhile, heat 2/3 cup cream and 2/3 cup milk in a small saucepan over medium until just about to simmer. Reduce heat to low and keep warm until ready to add to potatoes. Pass hot potatoes and butter through ricer into a large bowl (this will help combine them quickly; most of the skins should stay behind but pick out any small pieces that get through if you want); season generously with salt. Mix with a potato masher until butter is melted and combined. Mixing constantly, gradually add warm cream mixture to potatoes, then mix in sour cream. Taste and season with salt and pepper as desired.",
            "Place potatoes in a large pot and pour in cold water to cover by 1\". Add a large handful of salt (water should taste briny, like the ocean) and bring to a boil. Reduce heat and simmer until potatoes are very tender but not crumbly, 30–40 minutes. Drain and return potatoes to warm pot to dry (off heat).",
            "Meanwhile, heat 2/3 cup cream and 2/3 cup milk in a small saucepan over medium until just about to simmer. Reduce heat to low and keep warm until ready to add to potatoes.",
            "Pass hot potatoes and butter through ricer into a large bowl (this will help combine them quickly; most of the skins should stay behind but pick out any small pieces that get through if you want); season generously with salt. Mix with a potato masher until butter is melted and combined.",
            "Mixing constantly, gradually add warm cream mixture to potatoes, then mix in sour cream. Taste and season with salt and pepper as desired.",
            "Do Ahead Potatoes can be made 2 days ahead. Let cool; cover and chill. To serve, transfer potatoes to a small pot and add 1/3 cup heavy cream and 1/3 cup whole milk; reheat over medium-low, stirring often to prevent scorching.",
            "Potatoes can be made 2 days ahead. Let cool; cover and chill. To serve, transfer potatoes to a small pot and add 1/3 cup heavy cream and 1/3 cup whole milk; reheat over medium-low, stirring often to prevent scorching."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5be07fc09d2c4c2d684d74ec/6:4/w_274%2Ch_169/make-ahead-mashed-potatoes-recipe-BA-110518.jpg"
    }
}