{
    "recipe": {
        "title": "Malfatti with Pancetta and Cherry Tomatoes ",
        "ingredients": [
            "1 cup all-purpose flour, plus more",
            "2 cups whole-milk fresh ricotta, preferably box-drained",
            "1 large egg, room temperature",
            "6 oz. Parmesan, finely grated, plus more for serving",
            "1 1/2 tsp. kosher salt, plus more",
            "4 oz. pancetta (Italian bacon), thinly sliced",
            "3 Tbsp. extra-virgin olive oil, plus more for drizzling",
            "2 cups Sun Gold and/or cherry tomatoes",
            "2 Tbsp. unsalted butter, cut into pieces",
            "Freshly ground black pepper",
            "1/2 lemon",
            "A sheet of cheesecloth"
        ],
        "instructions": [
            "Dust a parchment-lined rimmed baking sheet generously with flour; set aside. Place ricotta in the center of cheesecloth. Gather up the sides in your hands and wring out excess liquid. Transfer ricotta to a few sheets of paper towels and pat dry with more paper towels.",
            "Pulse ricotta, egg, 6 oz. Parmesan, and 1 1/2 tsp. salt in a food processor to combine. Transfer to a large bowl; sift in 1 cup flour and mix until just barely combined (try not to overmix). Scrape ricotta mixture onto a floured surface and divide into 4 pieces. Roll each piece into a 22x3/4\" rope. Cut into 3/4\" pieces and place dumplings on prepared baking sheet.",
            "Combine pancetta and 3 Tbsp. oil in a cold large skillet and set over medium heat. Cook, stirring often, until pancetta is brown and crisp, 6–8 minutes. Using a slotted spoon, transfer to a bowl; reserve skillet.",
            "Meanwhile, bring a large pot of water to a simmer (do not let it boil). Working in batches if needed, cook dumplings until they expand in size and float to the surface, about 3 minutes.",
            "Ladle about 3/4 cup pasta cooking liquid into reserved skillet and add dumplings, tomatoes, and butter. Increase heat to medium-high and cook, stirring gently (don’t toss), until sauce thickens slightly and coats dumplings, about 4 minutes. Remove from heat and season with salt and pepper.",
            "Divide malfatti among bowls. Finely grate lemon zest over, drizzle with oil, and top with pancetta and Parmesan."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ad786329f41e5405c5afbd8/6:4/w_274%2Ch_169/malfatti-pasta-with-pancetta-and-cherry-tomatoes-recipe-BA-041818.jpg"
    }
}