{
    "recipe": {
        "title": "Malt Chocolate Doughnuts ",
        "ingredients": [
            "1/4 cup sugar, plus 2-3 heaping Tbsp for dusting",
            "2/3 cup whole milk",
            "One 1/4-ounce package active dry yeast",
            "3 1/2 Tbsp unsalted butter",
            "2 1/2 cups all-purpose flour, plus extra for dusting",
            "Pinch of sea salt",
            "2 egg yolks",
            "2-3 heaping Tbsp malt powder, such as Ovaltine, for dusting",
            "Vegetable oil, for deep-frying",
            "1 cup heavy cream",
            "2-4 Tbsp runny honey, to taste",
            "9 ounces dark chocolate, chopped",
            "4 Tbsp unsalted cold butter, cubed"
        ],
        "instructions": [
            "1. Heat the sugar and milk in a pan for about 5 minutes until the milk is warm—105-115°F—and the sugar has dissolved. Place the yeast into a bowl, pour in half the warm milk, then mix and set aside. Place the remaining milk back on the heat and add the butter. Heat gently for about 3 minutes (be careful not to let the milk boil). 2. Sift the flour and salt into a large bowl and make a well in the center. Add the egg yolks, yeasted milk, and the hot milk. Mix together, drawing in the surrounding flour to make a dough. 3. Tip the dough onto a floured work surface and knead with floured hands for a few minutes until the dough is smooth and elastic. Dust with a little extra flour if the mix is too sticky. Place in a clean bowl dusted with flour. Cover with plastic wrap to keep the dough from forming a skin on top and leave to rise in a warm place for 1-11/2 hours until doubled in size. 4. When the dough has risen, knock it back by giving it a thump and knead lightly on a floured work surface. Roll out the dough with a floured rolling pin to a thickness of about 3/4 inch and shape it into a 9 x 6-inch rectangle. Using a sharp knife, cut the dough into 12 rectangular pillows, then place on a baking sheet lined with parchment paper and leave to rise again for 30-40 minutes until doubled in size. (This will make the doughnuts light and fluffy once cooked.) 5. Meanwhile, make the filling. Put the cream in a pan and mix in the honey to taste. Put the chocolate and butter into a heatproof bowl. When the cream is almost boiling, pour it over the chocolate mixture and stir until well mixed, smooth, and glossy. 6. Combine the remaining sugar with the malt powder in a bowl and set aside. Put the oil in a deep-fat fryer and heat to 340°F, or fill a large saucepan one third full with vegetable oil and heat over medium-high heat until a cube of bread dropped in it sizzles and turns golden brown in 30 seconds. Fry the doughnuts, in batches, for 3-4 minutes until evenly golden brown and cooked through, turning them in the oil once or twice. (You will need to moderate the heat between batches according to whether the doughnuts brown too quickly or too slowly.) Using a slotted spoon, remove the doughnuts from the hot oil and roll in the malt sugar to coat. 7. To fill the doughnuts, spoon the warm chocolate filling into a piping bag fitted with a small plain nozzle. Make sure you pipe the chocolate filling while it's still warm. If it cools down too much, it will set and be difficult to work with. Insert the nozzle into the doughnut and gently squeeze in the filling. Serve right away.",
            "1. Heat the sugar and milk in a pan for about 5 minutes until the milk is warm—105-115°F—and the sugar has dissolved. Place the yeast into a bowl, pour in half the warm milk, then mix and set aside. Place the remaining milk back on the heat and add the butter. Heat gently for about 3 minutes (be careful not to let the milk boil).",
            "2. Sift the flour and salt into a large bowl and make a well in the center. Add the egg yolks, yeasted milk, and the hot milk. Mix together, drawing in the surrounding flour to make a dough.",
            "3. Tip the dough onto a floured work surface and knead with floured hands for a few minutes until the dough is smooth and elastic. Dust with a little extra flour if the mix is too sticky. Place in a clean bowl dusted with flour. Cover with plastic wrap to keep the dough from forming a skin on top and leave to rise in a warm place for 1-11/2 hours until doubled in size.",
            "4. When the dough has risen, knock it back by giving it a thump and knead lightly on a floured work surface. Roll out the dough with a floured rolling pin to a thickness of about 3/4 inch and shape it into a 9 x 6-inch rectangle. Using a sharp knife, cut the dough into 12 rectangular pillows, then place on a baking sheet lined with parchment paper and leave to rise again for 30-40 minutes until doubled in size. (This will make the doughnuts light and fluffy once cooked.)",
            "5. Meanwhile, make the filling. Put the cream in a pan and mix in the honey to taste. Put the chocolate and butter into a heatproof bowl. When the cream is almost boiling, pour it over the chocolate mixture and stir until well mixed, smooth, and glossy.",
            "6. Combine the remaining sugar with the malt powder in a bowl and set aside. Put the oil in a deep-fat fryer and heat to 340°F, or fill a large saucepan one third full with vegetable oil and heat over medium-high heat until a cube of bread dropped in it sizzles and turns golden brown in 30 seconds. Fry the doughnuts, in batches, for 3-4 minutes until evenly golden brown and cooked through, turning them in the oil once or twice. (You will need to moderate the heat between batches according to whether the doughnuts brown too quickly or too slowly.) Using a slotted spoon, remove the doughnuts from the hot oil and roll in the malt sugar to coat.",
            "7. To fill the doughnuts, spoon the warm chocolate filling into a piping bag fitted with a small plain nozzle. Make sure you pipe the chocolate filling while it's still warm. If it cools down too much, it will set and be difficult to work with. Insert the nozzle into the doughnut and gently squeeze in the filling. Serve right away."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560347077bdffb1205b62e8e/6:4/w_274%2Ch_169/51162000_hires.jpg"
    }
}