{
    "recipe": {
        "title": "Malted Chocolate Cake ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "1 1/3 cups all-purpose flour",
            "3/4 cup unsweetened cocoa powder",
            "1/4 cup malted milk powder",
            "1 teaspoon kosher salt",
            "1 teaspoon baking soda",
            "3/4 teaspoon baking powder",
            "2 large eggs",
            "1 large egg yolk",
            "1 1/2 cups plus 2 tablespoons granulated sugar",
            "1 cup buttermilk",
            "1/3 cup vegetable oil",
            "1/2 teaspoon vanilla extract",
            "3/4 cup coffee, cooled, divided",
            "2 tablespoons light brown sugar",
            "3 ounces bittersweet chocolate, chopped",
            "1/2 teaspoon vanilla extract",
            "1/2 cup heavy cream",
            "1/4 cup malted milk powder",
            "1/4 teaspoon kosher salt",
            "Chocolate pearls; coarsely chopped malt balls (for serving; optional)"
        ],
        "instructions": [
            "Cake: Preheat oven to 350°F. Lightly coat a 9x5\" loaf pan with nonstick spray, then line with parchment paper, leaving overhang on long sides. Whisk flour, cocoa powder, malted milk powder, salt, baking soda, and baking powder in a large bowl. Whisk eggs, egg yolk, and 1 1/2 cups granulated sugar in a medium bowl just to blend. Add buttermilk, oil, vanilla extract, and 1/2 cup coffee, whisking just to blend. Gradually add buttermilk mixture to dry ingredients, stirring with a rubber spatula or a wooden spoon until just combined (batter will be a little lumpy; you don't want to overmix). Scrape batter into prepared pan (hold back a little if using a slightly smaller loaf pan) and smooth surface. Bake until cake pulls away from sides of pan and a tester inserted into center comes out clean, 60–70 minutes. Meanwhile, combine brown sugar, remaining 1/4 cup coffee, and remaining 2 tablespoons granulated sugar in a small bowl, stirring to dissolve sugar. Transfer cake pan to a wire rack set inside a rimmed baking sheet and brush with coffee mixture (use all of it). Let cake cool completely in pan before turning out onto rack.",
            "Preheat oven to 350°F. Lightly coat a 9x5\" loaf pan with nonstick spray, then line with parchment paper, leaving overhang on long sides. Whisk flour, cocoa powder, malted milk powder, salt, baking soda, and baking powder in a large bowl.",
            "Whisk eggs, egg yolk, and 1 1/2 cups granulated sugar in a medium bowl just to blend. Add buttermilk, oil, vanilla extract, and 1/2 cup coffee, whisking just to blend. Gradually add buttermilk mixture to dry ingredients, stirring with a rubber spatula or a wooden spoon until just combined (batter will be a little lumpy; you don't want to overmix).",
            "Scrape batter into prepared pan (hold back a little if using a slightly smaller loaf pan) and smooth surface. Bake until cake pulls away from sides of pan and a tester inserted into center comes out clean, 60–70 minutes.",
            "Meanwhile, combine brown sugar, remaining 1/4 cup coffee, and remaining 2 tablespoons granulated sugar in a small bowl, stirring to dissolve sugar.",
            "Transfer cake pan to a wire rack set inside a rimmed baking sheet and brush with coffee mixture (use all of it). Let cake cool completely in pan before turning out onto rack.",
            "Glaze: Place chocolate and vanilla in a medium bowl. Bring cream, malted milk powder, and salt to a bare simmer in a small saucepan. Pour over chocolate mixture and let sit 5 minutes. Gently stir with a rubber spatula until chocolate is melted and mixture is combined. While still warm, pour glaze over turned-out cake on wire rack, letting it drip over the sides (any extra glaze will pool in baking sheet). Decorate with chocolate pearls and malt balls, if desired. Let cake sit until glaze is set, about 30 minutes.",
            "Place chocolate and vanilla in a medium bowl. Bring cream, malted milk powder, and salt to a bare simmer in a small saucepan. Pour over chocolate mixture and let sit 5 minutes.",
            "Gently stir with a rubber spatula until chocolate is melted and mixture is combined. While still warm, pour glaze over turned-out cake on wire rack, letting it drip over the sides (any extra glaze will pool in baking sheet). Decorate with chocolate pearls and malt balls, if desired. Let cake sit until glaze is set, about 30 minutes.",
            "Do ahead: Cake can be baked and glazed 3 days ahead. Store tightly wrapped at room temperature.",
            "Cake can be baked and glazed 3 days ahead. Store tightly wrapped at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/555b5f20644d45515b757d9b/6:4/w_274%2Ch_169/56389554_malted-chocolate-cake_1x1.jpg"
    }
}