{
    "recipe": {
        "title": "Mamaleh's Brisket ",
        "ingredients": [
            "1 (6–8-pound) piece untrimmed point- or flat-cut beef brisket",
            "1 tablespoon freshly ground black pepper",
            "1/4 cup Diamond Crystal or 2 tablespoons plus 2 teaspoons Morton kosher salt; plus more",
            "1/4 cup schmaltz (chicken fat) or vegetable oil",
            "2 large onions, coarsely chopped",
            "5 large carrots, peeled, coarsely chopped",
            "5 celery stalks, coarsely chopped",
            "1 1/2 cups Manischewitz Concord grape wine or Concord grape juice",
            "2 heads of garlic, halved crosswise",
            "8 sprigs thyme",
            "4 fresh bay leaves",
            "2 tablespoons black peppercorns",
            "3 quarts low-sodium chicken broth"
        ],
        "instructions": [
            "Season brisket all over with ground pepper and 1/4 cup Diamond Crystal or 2 tablespoons plus 2 teaspoons Morton salt, rubbing into the grain. Wrap tightly in plastic and chill at least 3 hours and up to 3 days.",
            "Place a rack in lower third of oven; preheat to 275°F. Heat schmaltz in a large roasting pan set over 2 burners on high. Unwrap brisket; cook, reducing heat if needed, until browned, 7–10 minutes per side. Transfer to a baking sheet.",
            "Reduce heat to medium-high. Add onions, carrots, and celery to pan; season with salt. Cook, stirring occasionally, until browned and just softened, 15–18 minutes. Add wine, bring to a boil, and cook until evaporated, 8–10 minutes. Add garlic, thyme, bay leaves, peppercorns, and broth; bring to a boil. Nestle brisket into aromatics and cover tightly with foil; braise in oven until meat is very tender but still holds its shape, 2–3 hours. Let cool, then chill at least 8 hours and up to 2 days.",
            "Preheat oven to 250°F. Remove solidified fat from surface of braising liquid; discard. Transfer brisket to a platter. Strain braising liquid into a large measuring glass; discard solids. Return liquid to pan and cook over medium-high heat, stirring occasionally, until reduced by half, velvety and intensely flavored, but not overly salty, about 30 minutes.",
            "Return brisket to pan, cover with foil, and heat in oven until warmed through, 60–90 minutes. Transfer to a cutting board and slice against the grain. Arrange on platter and pour braising liquid over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a3002b604072728dadcd319/6:4/w_274%2Ch_169/mamalehs-brisket-recipe-BA-121217.jpg",
        "color": 11169475
    }
}