{
    "recipe": {
        "title": "Mango Bread Pudding ",
        "ingredients": [
            "4 tablespoons salted butter",
            "2 cups whole milk",
            "1/2 cup heavy cream",
            "1/3 cup sugar",
            "2 teaspoons vanilla extract",
            "2 teaspoons ground cardamom",
            "1 teaspoon ground ginger",
            "3 large eggs",
            "2 large mangoes, pitted, peeled, and cut into 1/2-inch cubes, or two 10-ounce bags frozen mangoes, thawed",
            "6 slices country bread, cut into 1/2-inch cubes (about 6 cups)",
            "Whipped Cream or vanilla ice cream for serving"
        ],
        "instructions": [
            "1. Preheat the oven to 350 degrees F. Butter a 9-by-11-inch ceramic baking dish. 2. In a medium saucepan combine the butter, milk, cream, sugar, vanilla, cardamom, and ginger and simmer over low heat, stirring occasionally, until the butter melts and the milk is hot. Remove from the heat and set aside to cool slightly for about 4 to 5 minutes. 3. In a small bowl, whisk the eggs and then whisk them steadily into the milk mixture. Continue whisking until blended. 4. Combine the mangoes and bread in a large bowl and mix well. Transfer to the baking dish and pour the milk mixture evenly over the top. Make sure all of the bread pieces are soaked with the mixture, and let sit for 5 minutes. 5. Bake for 45 to 50 minutes, until bubbly and brown. Serve warm but not hot, with whipped cream or vanilla ice cream.",
            "1. Preheat the oven to 350 degrees F. Butter a 9-by-11-inch ceramic baking dish.",
            "2. In a medium saucepan combine the butter, milk, cream, sugar, vanilla, cardamom, and ginger and simmer over low heat, stirring occasionally, until the butter melts and the milk is hot. Remove from the heat and set aside to cool slightly for about 4 to 5 minutes.",
            "3. In a small bowl, whisk the eggs and then whisk them steadily into the milk mixture. Continue whisking until blended.",
            "4. Combine the mangoes and bread in a large bowl and mix well. Transfer to the baking dish and pour the milk mixture evenly over the top. Make sure all of the bread pieces are soaked with the mixture, and let sit for 5 minutes.",
            "5. Bake for 45 to 50 minutes, until bubbly and brown. Serve warm but not hot, with whipped cream or vanilla ice cream."
        ],
        "picture_link": "https://assets.epicurious.com/photos/561c1a3f219057901cc5b9ae/6:4/w_274%2Ch_169/358629_hires.jpg"
    }
}