{
    "recipe": {
        "title": "Manicotti ",
        "ingredients": [
            "3 tablespoons olive oil",
            "1 medium onion, chopped",
            "3 garlic cloves, minced",
            "2 (28- to 32-oz) cans Italian tomatoes in juice, drained, reserving juice, and finely chopped",
            "1/2 cup water",
            "1 teaspoon sugar",
            "1 teaspoon salt",
            "1/4 cup chopped fresh basil",
            "3 large eggs",
            "1 1/2 cups water",
            "1 1/4 cups all-purpose flour",
            "1/2 teaspoon salt",
            "1 tablespoon unsalted butter, melted",
            "2 lb fresh ricotta (3 cups)",
            "2 large eggs",
            "1 oz finely grated Parmigiano-Reggiano (1/2 cup)",
            "1/3 cup chopped fresh parsley",
            "1/2 teaspoon salt",
            "1/2 teaspoon black pepper",
            "1/2 lb fresh mozzarella",
            "2 glass or ceramic baking dishes, one 13 by 9 inches and one 8 inches square"
        ],
        "instructions": [
            "Make sauce: Heat oil in a 5- to 6-quart heavy pot over moderately high heat until hot but not smoking, then sauté onion, stirring occasionally, until golden, about 6 minutes. Add garlic and sauté, stirring, until golden, about 1 minute. Add tomatoes with juice, water, sugar, and salt and simmer, uncovered, stirring occasionally, until thickened, about 30 minutes. Stir in basil and remove from heat.",
            "Heat oil in a 5- to 6-quart heavy pot over moderately high heat until hot but not smoking, then sauté onion, stirring occasionally, until golden, about 6 minutes. Add garlic and sauté, stirring, until golden, about 1 minute. Add tomatoes with juice, water, sugar, and salt and simmer, uncovered, stirring occasionally, until thickened, about 30 minutes. Stir in basil and remove from heat.",
            "Make crêpes: Break up eggs with a wooden spoon in a medium bowl and stir in water until combined (don't beat). Sift in flour and salt, then stir batter until just combined. Force through a medium-mesh sieve into another bowl. Lightly brush an 8-inch nonstick skillet with melted butter and heat over moderate heat until hot. Ladle about 1/4 cup batter into skillet, tilting and rotating skillet to coat bottom, then pour excess batter back into bowl. (If batter sets before skillet is coated, reduce heat slightly for next crêpe.) Cook until underside is just set and lightly browned, about 30 seconds, then invert crêpe onto a clean kitchen towel to cool completely. Make at least 11 more crêpes in same manner, brushing skillet with butter as needed and stacking crêpes in 3 piles.",
            "Break up eggs with a wooden spoon in a medium bowl and stir in water until combined (don't beat). Sift in flour and salt, then stir batter until just combined. Force through a medium-mesh sieve into another bowl.",
            "Lightly brush an 8-inch nonstick skillet with melted butter and heat over moderate heat until hot. Ladle about 1/4 cup batter into skillet, tilting and rotating skillet to coat bottom, then pour excess batter back into bowl. (If batter sets before skillet is coated, reduce heat slightly for next crêpe.) Cook until underside is just set and lightly browned, about 30 seconds, then invert crêpe onto a clean kitchen towel to cool completely. Make at least 11 more crêpes in same manner, brushing skillet with butter as needed and stacking crêpes in 3 piles.",
            "Make filling and assemble manicotti: Stir together ricotta, eggs, Parmigiano-Reggiano, parsley, salt, and pepper. Put oven rack in middle position and preheat oven to 425°F. Cut mozzarella lengthwise into 1/4-inch-thick sticks. Spread 2 cups sauce in larger baking dish and 1 cup in smaller one. Arrange 1 crêpe, browned side up, on a work surface, then spread about 1/4 cup filling in a line across center and top with a mozzarella strip. Fold in sides to enclose filling, leaving ends open, and transfer, seam side down, to either baking dish. Fill 11 more crêpes in same manner, arranging snugly in 1 layer in both dishes (8 in larger dish and 4 in smaller). Spread 1 cup sauce over manicotti in larger dish and 1/2 cup in smaller dish. Tightly cover dishes with foil and bake until sauce is bubbling and filling is hot, 15 to 20 minutes. Serve remaining sauce on the side.",
            "Stir together ricotta, eggs, Parmigiano-Reggiano, parsley, salt, and pepper.",
            "Put oven rack in middle position and preheat oven to 425°F.",
            "Cut mozzarella lengthwise into 1/4-inch-thick sticks.",
            "Spread 2 cups sauce in larger baking dish and 1 cup in smaller one. Arrange 1 crêpe, browned side up, on a work surface, then spread about 1/4 cup filling in a line across center and top with a mozzarella strip. Fold in sides to enclose filling, leaving ends open, and transfer, seam side down, to either baking dish. Fill 11 more crêpes in same manner, arranging snugly in 1 layer in both dishes (8 in larger dish and 4 in smaller). Spread 1 cup sauce over manicotti in larger dish and 1/2 cup in smaller dish. Tightly cover dishes with foil and bake until sauce is bubbling and filling is hot, 15 to 20 minutes. Serve remaining sauce on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5cad313d58fdd6210e2e3605/6:4/w_274%2Ch_169/Manicotti-recipe-03042019.jpg"
    }
}