{
    "recipe": {
        "title": "Maple Pots de Crème with Almond Praline ",
        "ingredients": [
            "6 large egg yolks",
            "1/3 cup maple sugar",
            "2 tablespoons (packed) dark brown sugar",
            "1/8 teaspoon imitation maple extract",
            "Pinch of coarse kosher salt",
            "1 1/2 cups heavy whipping cream",
            "2 tablespoons sliced almonds",
            "3 tablespoons sugar",
            "1 tablespoon water",
            "1 teaspoon light corn syrup",
            "Pinch of coarse kosher salt",
            "4 3/4-cup ramekins or custard cups"
        ],
        "instructions": [
            "Preheat oven to 375°F. Scatter almonds on small rimmed baking sheet. Bake almonds until golden brown, about 3 minutes. Remove from oven. Push almonds together in 4-inch square on sheet and cool.",
            "Stir sugar, 1 tablespoon water, corn syrup, and coarse salt in small heavy saucepan over low heat until sugar dissolves. Increase heat; boil without stirring until syrup is dark amber, occasionally swirling pan and brushing down sides with wet pastry brush, about 5 minutes. Immediately pour caramel evenly over almonds, coating completely. Let stand until cold and hard, about 30 minutes. Break praline into pieces or process to coarse crumbs. DO AHEAD: Can be made 4 days ahead. Store airtight at room temperature.",
            "For custard: Preheat oven to 325°F. Arrange four 3/4-cup ramekins or custard cups in 13 x 9 x 2-inch metal baking pan. Whisk yolks, both sugars, extract, and salt in medium bowl to blend. Gradually whisk in cream. Divide custard among ramekins. Pour enough hot water into baking pan to come halfway up sides of ramekins. Bake custards until center is just set, about 35 minutes. Transfer to work surface; let stand 15 minutes. Chill uncovered until cold, at least 2 hours. Cover; chill overnight. Sprinkle praline over custards.",
            "Preheat oven to 325°F.",
            "Arrange four 3/4-cup ramekins or custard cups in 13 x 9 x 2-inch metal baking pan. Whisk yolks, both sugars, extract, and salt in medium bowl to blend. Gradually whisk in cream. Divide custard among ramekins. Pour enough hot water into baking pan to come halfway up sides of ramekins.",
            "Bake custards until center is just set, about 35 minutes. Transfer to work surface; let stand 15 minutes. Chill uncovered until cold, at least 2 hours. Cover; chill overnight.",
            "Sprinkle praline over custards."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b306323edeef84363b7eba/6:4/w_274%2Ch_169/361272_maple-pots-de-creme_1x1.jpg"
    }
}