{
    "recipe": {
        "title": "Maple-Pear Sheet Tart ",
        "ingredients": [
            "1 large egg",
            "1 14- to 17-ounce box of puff pastry (preferably all-butter puff), defrosted according to package directions",
            "2 large Anjou pears (about 1 1/4 pounds), skin on",
            "1/4 cup granulated sugar",
            "2 tablespoons maple syrup",
            "13\"x18\" baking sheet"
        ],
        "instructions": [
            "Preheat the oven to 375°F. Line a 13x18-inch baking sheet with parchment paper. In a small bowl, beat the egg with 1 tablespoon water. If using a 14-ounce puff pastry package, roll the sheet to a 13-x18-inch rectangle on a floured surface. If using a 17-ounce puff pastry package, roll each sheet to a 9 1/2-x13-inch rectangle. Line up the two longer sides and overlap by 1 inch to form a 13-x18-inch rectangle. Brush egg wash in between to form a seam. Use a rolling pin to seal the seam. Transfer the pastry to the parchment. Fold sides of pastry towards center to form a 1/2-inch border on all four sides. Lightly score the border by using a paring knife to make small shallow diagonal cuts. Prick the surface of the pastry inside the border with a fork. Refrigerate until ready to use. Slice the pears in half lengthwise, and then cut lengthwise into 1/4-inch thick slices. Trim the seeds and core and toss the slices in the sugar. Arrange on the pastry and brush all exposed pastry (including the borders) with the egg wash. Bake until the crust is puffed and golden brown, 45 to 50 minutes. Brush the fruit and pastry with the maple syrup. Let cool completely, and then slice into squares to serve.",
            "Preheat the oven to 375°F. Line a 13x18-inch baking sheet with parchment paper. In a small bowl, beat the egg with 1 tablespoon water.",
            "If using a 14-ounce puff pastry package, roll the sheet to a 13-x18-inch rectangle on a floured surface. If using a 17-ounce puff pastry package, roll each sheet to a 9 1/2-x13-inch rectangle. Line up the two longer sides and overlap by 1 inch to form a 13-x18-inch rectangle. Brush egg wash in between to form a seam. Use a rolling pin to seal the seam.",
            "Transfer the pastry to the parchment. Fold sides of pastry towards center to form a 1/2-inch border on all four sides. Lightly score the border by using a paring knife to make small shallow diagonal cuts. Prick the surface of the pastry inside the border with a fork. Refrigerate until ready to use.",
            "Slice the pears in half lengthwise, and then cut lengthwise into 1/4-inch thick slices. Trim the seeds and core and toss the slices in the sugar. Arrange on the pastry and brush all exposed pastry (including the borders) with the egg wash.",
            "Bake until the crust is puffed and golden brown, 45 to 50 minutes. Brush the fruit and pastry with the maple syrup. Let cool completely, and then slice into squares to serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54aecf036529d92b2c04a939/6:4/w_274%2Ch_169/51253810_pear-tart_hires-hpr-9x4.jpg"
    }
}