{
    "recipe": {
        "title": "Maple-Roasted Delicata Squash with Red Onion ",
        "ingredients": [
            "3 medium Delicata squash (about 3 pounds), halved lengthwise, seeded, and cut into 1/4-inch thick slices",
            "2 medium red onions, halved lengthwise and cut into 1/2-inch rings",
            "5 garlic cloves, peeled and smashed",
            "4 fresh thyme sprigs",
            "1/2 teaspoon red-pepper flakes",
            "3 tablespoons extra-virgin olive oil",
            "2 tablespoons maple syrup",
            "Kosher salt",
            "freshly ground black pepper"
        ],
        "instructions": [
            "Arrange the racks in the upper and lower rungs in the oven and preheat the oven to 425°F degrees. Place the squash, red onion, garlic, thyme, and red pepper flakes in a large bowl. Drizzle with olive oil and maple syrup, and sprinkle generously with salt and pepper; toss to coat. Spread vegetables evenly onto two large, rimmed baking sheets. Bake the squash on the upper and lower racks of the oven, tossing, rotating, and switching the pan positions half way through cooking, until tender and browned, 25 to 30 minutes. Taste and season again with more salt and pepper, if desired.",
            "Arrange the racks in the upper and lower rungs in the oven and preheat the oven to 425°F degrees. Place the squash, red onion, garlic, thyme, and red pepper flakes in a large bowl. Drizzle with olive oil and maple syrup, and sprinkle generously with salt and pepper; toss to coat.",
            "Spread vegetables evenly onto two large, rimmed baking sheets. Bake the squash on the upper and lower racks of the oven, tossing, rotating, and switching the pan positions half way through cooking, until tender and browned, 25 to 30 minutes. Taste and season again with more salt and pepper, if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b879827cbba01c0db7f0d8/6:4/w_274%2Ch_169/51258430_roasted-delicata-squash_1x1.jpg"
    }
}