{
    "recipe": {
        "title": "Maple Sugar Ragamuffins ",
        "ingredients": [
            "2 cups all-purpose flour",
            "1 tablespoon granulated maple sugar (see cooks' note, below)",
            "1 tablespoon baking powder",
            "1/2 teaspoon salt",
            "5 tablespoons cold unsalted butter, cut into small pieces",
            "3/4 cup whole milk",
            "3/4 stick (6 tablespoons) unsalted butter, well softened",
            "1 cup granulated maple sugar (6 ounces)",
            "parchment paper"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 400°F. Line a large (17- by 14-inch) baking sheet with parchment.",
            "Whisk together flour, maple sugar, baking powder, and salt in a large bowl. Blend in butter with a pastry blender or your fingertips until most of mixture resembles coarse meal with some small (roughly pea-size) butter lumps. Add milk and stir with a fork until a shaggy dough forms. Gently knead dough 8 to 10 times with floured hands on a lightly floured surface.",
            "Roll out and fill dough: Roll out dough on a lightly floured surface with a floured rolling pin into a 13- by 11-inch rectangle. Spread softened butter evenly over dough and sprinkle all over with maple sugar, pressing firmly to help adhere. Beginning with one long side, roll up dough snugly, jelly-roll style. Cut roll crosswise into 12 slices with a sharp knife. Arrange slices, cut sides down, 2 inches apart on baking sheet. Gather any maple sugar from work surface and sprinkle on top of rolls. Bake until rolls are puffed and golden, 18 to 20 minutes. Transfer to a rack to cool until warm, about 15 minutes.",
            "Roll out dough on a lightly floured surface with a floured rolling pin into a 13- by 11-inch rectangle. Spread softened butter evenly over dough and sprinkle all over with maple sugar, pressing firmly to help adhere. Beginning with one long side, roll up dough snugly, jelly-roll style. Cut roll crosswise into 12 slices with a sharp knife. Arrange slices, cut sides down, 2 inches apart on baking sheet. Gather any maple sugar from work surface and sprinkle on top of rolls. Bake until rolls are puffed and golden, 18 to 20 minutes. Transfer to a rack to cool until warm, about 15 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd713f3a00aeb2f1d26aa/6:4/w_274%2Ch_169/234003.jpg",
        "color": 2174319
    }
}