{
    "recipe": {
        "title": "Marbled Pumpkin-Maple Cheesecake Bars ",
        "ingredients": [
            "1/2 cup (1 stick) unsalted butter, melted, slightly cooled, plus more for pan",
            "10 oz. graham crackers (about 20)",
            "2 Tbsp. sugar",
            "1/2 tsp. kosher salt",
            "24 oz. cream cheese, room temperature, cut into small pieces",
            "4 large eggs, room temperature",
            "1 cup sugar",
            "2 tsp. vanilla extract",
            "1/2 tsp. kosher salt",
            "8 oz. sour cream, room temperature",
            "1/2 cup pure maple syrup",
            "1 (15-oz.) can pumpkin purée",
            "1 1 /2 tsp. pumpkin pie spice",
            "1/2 tsp. ground ginger"
        ],
        "instructions": [
            "Crust: Place a rack in center of oven; preheat to 350°F. Lightly butter a 13x9x2\" metal baking pan. Line with parchment paper, leaving some overhang on long sides, then butter parchment. Pulse graham crackers in a food processor until fine crumbs form (you should have a generous 2 cups). Add sugar and salt and pulse just to combine. Add 1/2 cup butter and pulse until mixture is the consistency of wet sand. Transfer crumbs to prepared pan and press firmly into bottom with a measuring cup. Bake crust until fragrant and edges are just starting to take on color, 8–10 minutes. Transfer to a wire rack and let cool.",
            "Place a rack in center of oven; preheat to 350°F. Lightly butter a 13x9x2\" metal baking pan. Line with parchment paper, leaving some overhang on long sides, then butter parchment. Pulse graham crackers in a food processor until fine crumbs form (you should have a generous 2 cups). Add sugar and salt and pulse just to combine. Add 1/2 cup butter and pulse until mixture is the consistency of wet sand.",
            "Transfer crumbs to prepared pan and press firmly into bottom with a measuring cup. Bake crust until fragrant and edges are just starting to take on color, 8–10 minutes. Transfer to a wire rack and let cool.",
            "Cheesecake and Assembly: Reduce oven temperature to 275°F. Beat cream cheese in the bowl of a stand mixer fitted with the paddle attachment on medium-high speed until smooth, about 2 minutes. Add eggs, sugar, vanilla, and salt and beat on low speed, occasionally scraping down sides of bowl, until incorporated. Add sour cream and maple syrup and beat until mixture is thick and creamy and no lumps remain. Scoop 3/4 cup filling into a small bowl and save for marbling later. Add pumpkin purée, pumpkin pie spice, and ginger to remaining batter and beat until no streaks remain. Remove bowl from mixer and tap on counter several times to force any air bubbles to the filling’s surface. Scrape filling into cooled crust; pop any air bubbles. Dollop reserved filling over pumpkin filling and swirl with a skewer or toothpick to marble. Bake cheesecake until edges are set but center still wobbles slightly when gently shaken (it will firm as it cools), 40–50 minutes. Transfer to a wire rack on stovetop and let cool (the warmth from the cooling oven will help it come to room temperature more slowly, keeping the top from cracking), about 3 hours. Chill cheesecake until cold and firm, 3–4 hours. Cut into bars or squares to serve. Do Ahead: Cheesecake can be made 2 days ahead. Cover and chill.",
            "Reduce oven temperature to 275°F. Beat cream cheese in the bowl of a stand mixer fitted with the paddle attachment on medium-high speed until smooth, about 2 minutes. Add eggs, sugar, vanilla, and salt and beat on low speed, occasionally scraping down sides of bowl, until incorporated. Add sour cream and maple syrup and beat until mixture is thick and creamy and no lumps remain. Scoop 3/4 cup filling into a small bowl and save for marbling later. Add pumpkin purée, pumpkin pie spice, and ginger to remaining batter and beat until no streaks remain. Remove bowl from mixer and tap on counter several times to force any air bubbles to the filling’s surface. Scrape filling into cooled crust; pop any air bubbles. Dollop reserved filling over pumpkin filling and swirl with a skewer or toothpick to marble.",
            "Bake cheesecake until edges are set but center still wobbles slightly when gently shaken (it will firm as it cools), 40–50 minutes. Transfer to a wire rack on stovetop and let cool (the warmth from the cooling oven will help it come to room temperature more slowly, keeping the top from cracking), about 3 hours.",
            "Chill cheesecake until cold and firm, 3–4 hours. Cut into bars or squares to serve.",
            "Do Ahead: Cheesecake can be made 2 days ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5bce2b7778c6d82a35d4c4cc/6:4/w_274%2Ch_169/Pumpkin-Cheesecake-Bars-18102018.jpg"
    }
}