{
    "recipe": {
        "title": "Marble Bundt Cake ",
        "ingredients": [
            "1 cup (8 ounces or 230 grams) unsalted butter, at room temperature",
            "2 cups (400 grams) granulated sugar",
            "2 large eggs",
            "1 teaspoon (5 ml) vanilla extract",
            "2/3 cup (160 grams) sour cream",
            "1 1/2 cups (355 ml) milk, preferably whole",
            "1 teaspoon baking soda",
            "3/4 teaspoon fine sea or table salt",
            "2 1/3 cups (305 grams) all-purpose flour",
            "2 ounces (55 grams) white chocolate, melted and cooled slightly",
            "1/3 cup (25 grams) cocoa powder (any variety), sifted if lumpy",
            "2 ounces (55 grams) dark or bittersweet chocolate, melted and cooled slightly",
            "6 tablespoons (90 ml) heavy cream",
            "1 cup (6 ounces or 190 grams) chopped dark or bittersweet chocolate or chocolate chips"
        ],
        "instructions": [
            "Heat the oven to 350°F. Coat the inside of a Bundt pan with nonstick spray, or butter and flour every nook and cranny well. Cream the butter and sugar together with an electric mixer until light and fluffy. Beat in the eggs, one at a time, scraping down the bowl between additions. Beat in the vanilla and sour cream until smooth, then add the milk. Sprinkle the baking soda and salt over batter, and mix until thoroughly combined. Add 2 cups of the flour to the batter, and mix until just combined. Scoop half of the batter—you can eyeball it—into a separate bowl, and stir the melted white chocolate into it until fully combined; then stir in 1/3 cup flour. Stir the cocoa powder and melted dark chocolate into the other half of batter. Drop or dot large spoonfuls of the white chocolate batter into the bottom of your prepared cake pan. Drop or dot large spoonfuls of the dark chocolate batter over that, checkerboarding it a little. Continue until all the batter is used. Use a skewer to marble the batters together in figure-8 motions. Bake the cake until a toothpick or skewer inserted into the center comes out batter-free, 40 to 50 minutes. Let cool completely in the pan on a cooling rack, then invert onto a cake plate.",
            "Heat the oven to 350°F. Coat the inside of a Bundt pan with nonstick spray, or butter and flour every nook and cranny well. Cream the butter and sugar together with an electric mixer until light and fluffy. Beat in the eggs, one at a time, scraping down the bowl between additions. Beat in the vanilla and sour cream until smooth, then add the milk. Sprinkle the baking soda and salt over batter, and mix until thoroughly combined. Add 2 cups of the flour to the batter, and mix until just combined.",
            "Scoop half of the batter—you can eyeball it—into a separate bowl, and stir the melted white chocolate into it until fully combined; then stir in 1/3 cup flour.",
            "Stir the cocoa powder and melted dark chocolate into the other half of batter.",
            "Drop or dot large spoonfuls of the white chocolate batter into the bottom of your prepared cake pan. Drop or dot large spoonfuls of the dark chocolate batter over that, checkerboarding it a little. Continue until all the batter is used. Use a skewer to marble the batters together in figure-8 motions.",
            "Bake the cake until a toothpick or skewer inserted into the center comes out batter-free, 40 to 50 minutes.",
            "Let cool completely in the pan on a cooling rack, then invert onto a cake plate.",
            "To finish: Heat the cream and chocolate together, and stir until just melted. Spoon over the fully cooled cake, and use the back of a spoon to nudge the drippings down in places. Refrigerate cake to set the chocolate coating; leftovers keep best in the fridge as well.",
            "Heat the cream and chocolate together, and stir until just melted. Spoon over the fully cooled cake, and use the back of a spoon to nudge the drippings down in places. Refrigerate cake to set the chocolate coating; leftovers keep best in the fridge as well."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59f33f3a8d945c52828a641c/6:4/w_274%2Ch_169/marble-bundt-cake-deb-perelman-smitten-kitchen-recipe-102717.jpg"
    }
}