{
    "recipe": {
        "title": "Marinated Summer Vegetables ",
        "ingredients": [
            "3 summer squash or zucchini (about 1 pound), sliced on a diagonal 1/2\" thick",
            "3 red, orange, or yellow bell peppers, cut into 1\" strips",
            "4 tablespoons extra-virgin olive oil, divided",
            "Kosher salt, freshly ground pepper",
            "2 garlic cloves",
            "2 tablespoons Sherry or red wine vinegar",
            "4 sprigs oregano"
        ],
        "instructions": [
            "Place racks in upper and lower thirds of oven; preheat to 475°. Place squash and peppers on separate baking sheets. Drizzle each sheet of vegetables with 1/2 tablespoons oil, season with salt and pepper, and toss to coat. Spread out in a single layer, turning peppers skin side up. Roast peppers on upper rack and squash on lower rack, turning squash once, until tender, 15-20 minutes. Let cool slightly; remove skins from peppers. Whisk garlic, vinegar, and remaining 3 tablespoons oil in a large bowl; season with salt and pepper. Add vegetables and oregano; toss to coat. Cover and let sit at least 1 hour. DO AHEAD: Vegetables can be made 3 days ahead. Cover and chill; bring to room temperature before serving.",
            "Place racks in upper and lower thirds of oven; preheat to 475°. Place squash and peppers on separate baking sheets. Drizzle each sheet of vegetables with 1/2 tablespoons oil, season with salt and pepper, and toss to coat. Spread out in a single layer, turning peppers skin side up.",
            "Roast peppers on upper rack and squash on lower rack, turning squash once, until tender, 15-20 minutes. Let cool slightly; remove skins from peppers.",
            "Whisk garlic, vinegar, and remaining 3 tablespoons oil in a large bowl; season with salt and pepper. Add vegetables and oregano; toss to coat. Cover and let sit at least 1 hour.",
            "DO AHEAD: Vegetables can be made 3 days ahead. Cover and chill; bring to room temperature before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54afdeabd3789d374d8fe50c/6:4/w_274%2Ch_169/51169630_marinated-summer-vegetables_1x1.jpg"
    }
}