{
    "recipe": {
        "title": "Marinated Manchego With Orange Preserve ",
        "ingredients": [
            "1 head of garlic",
            "1 1/2 cups olive oil, plus more for drizzling",
            "Kosher salt",
            "1 Seville or navel orange",
            "1/4 cup sugar",
            "1 pound young Manchego cheese, cut into 3/4-inch pieces",
            "1 tablespoon finely chopped rosemary",
            "1 tablespoon finely chopped thyme",
            "Toasted baguette or other crusty bread (for serving)"
        ],
        "instructions": [
            "Heat oven to 350°F. Cut 1/4\" off top of garlic bulb and place on a sheet of foil. Drizzle with oil; season with salt. Wrap tightly in foil and bake until skin is golden brown and cloves are tender, 35–40 minutes. Let cool. Squeeze cloves into a large bowl. Meanwhile, cut 1/4\" off top and bottom of orange and cut lengthwise into quarters. Remove flesh from each quarter, not including white pith, from peel in 1 piece (save peels). Squeeze juice from flesh into a small bowl; set aside. Cut peel into 1/4\" pieces and place in a small saucepan; pour in cold water to cover by 1\". Bring to a boil then drain; repeat process twice more to remove bitterness. Return orange peels to saucepan and add sugar, reserved orange juice, and 1/2 cup water. Bring to a boil; reduce heat and simmer, stirring occasionally, until peels are soft and liquid is syrupy, 20–30 minutes. Let orange preserve cool. Add orange preserve, Manchego, rosemary, thyme, and remaining 1 1/2 cups oil to bowl with garlic and gently toss to combine. Cover and chill at least 12 hours. Bring marinated Manchego to room temperature before serving with bread.",
            "Heat oven to 350°F. Cut 1/4\" off top of garlic bulb and place on a sheet of foil. Drizzle with oil; season with salt. Wrap tightly in foil and bake until skin is golden brown and cloves are tender, 35–40 minutes. Let cool. Squeeze cloves into a large bowl.",
            "Meanwhile, cut 1/4\" off top and bottom of orange and cut lengthwise into quarters. Remove flesh from each quarter, not including white pith, from peel in 1 piece (save peels). Squeeze juice from flesh into a small bowl; set aside. Cut peel into 1/4\" pieces and place in a small saucepan; pour in cold water to cover by 1\". Bring to a boil then drain; repeat process twice more to remove bitterness. Return orange peels to saucepan and add sugar, reserved orange juice, and 1/2 cup water. Bring to a boil; reduce heat and simmer, stirring occasionally, until peels are soft and liquid is syrupy, 20–30 minutes. Let orange preserve cool.",
            "Add orange preserve, Manchego, rosemary, thyme, and remaining 1 1/2 cups oil to bowl with garlic and gently toss to combine. Cover and chill at least 12 hours.",
            "Bring marinated Manchego to room temperature before serving with bread.",
            "Do Ahead Manchego can be marinated 5 days ahead. Cover and chill.",
            "Manchego can be marinated 5 days ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57d1f0a1219ffa4a2747ee8c/6:4/w_274%2Ch_169/marinated-manchego-with-orange-BA-090816.jpg"
    }
}