{
    "recipe": {
        "title": "Marinated Summer Squash with Hazelnuts and Ricotta ",
        "ingredients": [
            "3 medium summer squash or zucchini, cut in half lengthwise",
            "1 1/2 tsp. kosher salt, plus more",
            "1/4 cup blanched hazelnuts",
            "6 Tbsp. extra-virgin olive oil, divided, plus more for drizzling",
            "1 small bunch mint, divided",
            "1 small garlic clove, finely grated",
            "2 Tbsp. white wine vinegar",
            "3/4 tsp. sugar",
            "1/2 tsp. crushed red pepper flakes",
            "Freshly ground black pepper",
            "1/2 lemon",
            "1/2 cup fresh ricotta",
            "Flaky sea salt",
            "Toasted country-style bread (for serving)"
        ],
        "instructions": [
            "Preheat oven to 300°F. Toss squash and 1 1/2 tsp. kosher salt in a colander; set over a bowl. Let sit 10 minutes, then pat dry with paper towels.",
            "Toss hazelnuts and 1 Tbsp. oil on a rimmed baking sheet and roast, shaking occasionally, until golden brown, 15–20 minutes. Let cool; crush into large pieces with a measuring cup or glass.",
            "Smack 3 mint sprigs against your cutting board a few times to release their flavor; mix in a large bowl with garlic, vinegar, sugar, red pepper flakes, and 2 Tbsp. oil; set dressing aside.",
            "Heat 2 Tbsp. oil in a large skillet, preferably cast iron, over medium-high until shimmering. Arrange squash cut side down in skillet, breaking into smaller pieces if needed in order to fit in a single layer, and cook, moving around in pan to ensure even browning, until golden brown on cut side, about 5 minutes. Reduce heat to medium-low, cover (if you don’t have a lid use a baking sheet), and continue to cook until very tender, about 15 minutes. Transfer to a cutting board and let cool slightly.",
            "Cut squash into 2\" pieces and toss in reserved dressing to coat; season with kosher salt and black pepper. Let sit at room temperature, tossing occasionally, 15 minutes. Pluck out mint sprigs; discard.",
            "Meanwhile, zest lemon half into a small bowl, mix in ricotta and remaining 1 Tbsp. oil; season with kosher salt. Hang on to that lemon.",
            "Spread lemon ricotta over platter. Top with squash and their juices. Squeeze reserved lemon over. Pull leaves from remaining mint sprigs (you want about 1/4 cup). Scatter mint and hazelnuts over squash. Drizzle generously with oil and sprinkle with sea salt. Serve with toast."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b16fb163674e370f3a0ce15/6:4/w_274%2Ch_169/marinated-zucchini-with-hazelnuts-and-ricotta-recipe-BA-060518.jpg",
        "color": 11800382
    }
}