{
    "recipe": {
        "title": "Marinated Skirt Steak ",
        "ingredients": [
            "3/4 cup balsamic vinegar",
            "1/2 cup corn oil or other neutral oil such as grapeseed or canola",
            "1/4 cup Worcestershire sauce",
            "2 shallots, roughly chopped",
            "2 garlic cloves",
            "1 tablespoon cayenne pepper",
            "1 tablespoon chopped fresh cilantro leaves",
            "1 teaspoon freshly ground black pepper",
            "1 tablespoon kosher salt",
            "4 pounds skirt steak, cleaned of all exterior fat and connective tissue"
        ],
        "instructions": [
            "Put all ingredients except the steak in a blender and blend until smooth. Pour the marinade over the skirt steak in a nonreactive pan.",
            "Put all ingredients except the steak in a blender and blend until smooth.",
            "Pour the marinade over the skirt steak in a nonreactive pan.",
            "Break Point Marinate, refrigerated, for 3 to 4 hours before grilling, but no more than 10 hours. When ready to cook the steaks, prepare your grill for grilling. Remove the skirt steak from the marinade and clean away any excess marinade with the back of a knife. Grill the steak over medium-high heat for 4 to 5 minutes per side to serve it rare to medium-rare. When cooked, slice the steak thinly against the grain, starting at one corner and cutting on the bias. Serve either hot or at room temperature.",
            "Marinate, refrigerated, for 3 to 4 hours before grilling, but no more than 10 hours.",
            "When ready to cook the steaks, prepare your grill for grilling.",
            "Remove the skirt steak from the marinade and clean away any excess marinade with the back of a knife.",
            "Grill the steak over medium-high heat for 4 to 5 minutes per side to serve it rare to medium-rare.",
            "When cooked, slice the steak thinly against the grain, starting at one corner and cutting on the bias. Serve either hot or at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/576430c39644034b690ea943/6:4/w_274%2Ch_169/marinated-skirt-steak.jpg"
    }
}