{
    "recipe": {
        "title": "Masa Cornbread Stuffing with Chiles ",
        "ingredients": [
            "1 cup (2 sticks) unsalted butter",
            "3 cups chopped white onions",
            "5 garlic cloves, minced",
            "18 ounces fresh Anaheim chiles (about 6 large), seeded, chopped (scant 4 cups)",
            "18 ounces fresh poblano chiles, seeded, chopped (about 3 cups)",
            "4 large fresh jalapeño chiles, seeded (if desired), chopped (about 1 cup)",
            "1 1/2 tablespoons ground New Mexico chiles",
            "1 tablespoon coarse kosher salt",
            "3/4 teaspoon freshly ground black pepper",
            "3/4 teaspoon dried oregano",
            "3/4 teaspoon ground cumin",
            "1 cup chopped fresh cilantro",
            "1 13 x 9-inch loaf Masa Cornbread , cut into 1-inch cubes (12 to 13 cups)",
            "6 ounces Monterey Jack cheese, cut into 1/3-inch cubes (optional)",
            "4 large eggs",
            "1 cup low-salt chicken broth",
            "Ingredient info: Look for Anaheim chiles (California chiles), poblano chiles (a.k.a. pasillas), and ground New Mexico chiles at some supermarkets and at Latin markets."
        ],
        "instructions": [
            "Melt butter in large skillet over medium-high heat. Add onions and garlic; sauté until tender, about 5 minutes. Add all chiles; sauté until beginning to soften, 12 to 14 minutes. Stir in ground chiles and next 4 ingredients. Transfer vegetable mixture to bowl. DO AHEAD: Can be made 1 day ahead. Cool, then cover and chill.",
            "Preheat oven to 375°F. Butter 15 x 10 x 2- inch glass baking dish. Stir cilantro into vegetable mixture. Place cornbread cubes in very large bowl; add vegetable mixture and toss gently. Toss in cheese, if using. Whisk eggs and broth in medium bowl, then pour over stuffing and toss gently to moisten. Transfer stuffing to prepared dish. Cover dish with buttered foil, buttered side down.",
            "Bake stuffing until heated through, about 30 minutes. Remove foil; bake until top is golden, about 30 minutes longer."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3441521388ef838b0991a/6:4/w_274%2Ch_169/361732_masa-cornbread-stuffing_1x1.jpg"
    }
}