{
    "recipe": {
        "title": "Masa Pancakes Topped with Poached Eggs and Chipotle Ranchera Salsa ",
        "ingredients": [
            "3/4 cup Masa Harina (corn tortilla mix)*",
            "1 pound pork chorizo sausage, casings removed",
            "1/2 cup all purpose flour",
            "1/2 cup yellow cornmeal",
            "1 teaspoon sugar",
            "1 teaspoon salt",
            "1 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "1 1/2 cups buttermilk",
            "14 large eggs",
            "4 tablespoons (about) corn oil",
            "Chipotle Ranchera Salsa",
            "1/4 cup chopped fresh cilantro",
            "1/4 cup chopped green onions",
            "1/4 cup crumbled queso añejo or shredded Monterey Jack cheese",
            "*Available at Latin American markets and many supermarkets."
        ],
        "instructions": [
            "Preheat oven to 350°F. Spread Masa Harina on heavy baking sheet. Bake until fragrant and golden, stirring often, about 15 minutes. Cool Masa Harina. Reduce oven temperature to 250°F. Cook chorizo in heavy large skillet over medium heat until brown, breaking up with back of fork, about 10 minutes. Using slotted spoon, transfer chorizo to paper-towel-lined plate to drain. Transfer sausage to oven. Sift Masa Harina, flour and next 5 ingredients into large bowl. Whisk buttermilk, 2 eggs and 3 tablespoons oil in medium bowl to blend. Add buttermilk mixture to dry ingredients and whisk just until blended (batter will be thick). Lightly coat griddle with oil. Heat over medium heat. Working in batches, spoon scant 1/2 cup batter onto griddle. Using spoon, spread batter to make 4-inch-diameter pancake. Cook until bottom is golden, about 4 minutes. Turn and cook until second side is golden, about 3 minutes. Transfer to baking sheet; place in oven. Repeat to make 6 pancakes total, brushing griddle with oil as needed. Meanwhile, bring large skillet of salted water to simmer. Working in batches, crack 12 eggs into skillet. Simmer until eggs are softly poached, about 3 minutes. Remove eggs from water; drain. Divide pancakes among plates. Sprinkle chorizo around pancakes. Top each pancake with 2 eggs. Spoon salsa over eggs. Top with cilantro, onions and cheese.",
            "Preheat oven to 350°F. Spread Masa Harina on heavy baking sheet. Bake until fragrant and golden, stirring often, about 15 minutes. Cool Masa Harina. Reduce oven temperature to 250°F.",
            "Cook chorizo in heavy large skillet over medium heat until brown, breaking up with back of fork, about 10 minutes. Using slotted spoon, transfer chorizo to paper-towel-lined plate to drain. Transfer sausage to oven.",
            "Sift Masa Harina, flour and next 5 ingredients into large bowl. Whisk buttermilk, 2 eggs and 3 tablespoons oil in medium bowl to blend. Add buttermilk mixture to dry ingredients and whisk just until blended (batter will be thick).",
            "Lightly coat griddle with oil. Heat over medium heat. Working in batches, spoon scant 1/2 cup batter onto griddle. Using spoon, spread batter to make 4-inch-diameter pancake. Cook until bottom is golden, about 4 minutes. Turn and cook until second side is golden, about 3 minutes. Transfer to baking sheet; place in oven. Repeat to make 6 pancakes total, brushing griddle with oil as needed.",
            "Meanwhile, bring large skillet of salted water to simmer. Working in batches, crack 12 eggs into skillet. Simmer until eggs are softly poached, about 3 minutes. Remove eggs from water; drain.",
            "Divide pancakes among plates. Sprinkle chorizo around pancakes. Top each pancake with 2 eggs. Spoon salsa over eggs. Top with cilantro, onions and cheese."
        ],
        "picture_link": null
    }
}