{
    "recipe": {
        "title": "Mashed Sweet Potatoes with Brown Sugar and Pecans ",
        "ingredients": [
            "1 cup (packed) golden brown sugar",
            "1/2 cup chopped pecans (about 2 ounces)",
            "1/4 cup (1/2 stick) chilled butter, cut into 1/4-inch pieces",
            "5 pounds red-skinned sweet potatoes (yams), peeled, cut into 1 1/2-inch pieces",
            "4 large eggs",
            "3 tablespoons pure maple syrup",
            "2 tablespoons vanilla extract",
            "1 tablespoon fresh lemon juice",
            "2 teaspoons salt"
        ],
        "instructions": [
            "Preheat oven to 350°F. Mix sugar, pecans and butter in small bowl. Cover and chill until ready to use. (Can be made up to 2 days ahead. Keep refrigerated.) Butter 13 x 9 x 2-inch glass baking dish. Cook sweet potatoes in large pot of boiling salted water until very tender, about 12 minutes. Drain. Let stand in colander 15 minutes. Purée sweet potatoes in processor. Beat eggs, syrup, vanilla, lemon juice and salt in large bowl. Mix in puréed sweet potatoes. Transfer sweet potato mixture to prepared dish. Sprinkle pecan topping evenly over mixture. Bake until sweet potato mixture is set and topping bubbles, about 1 hour. Let stand 15 minutes and serve.",
            "Preheat oven to 350°F. Mix sugar, pecans and butter in small bowl. Cover and chill until ready to use. (Can be made up to 2 days ahead. Keep refrigerated.)",
            "Butter 13 x 9 x 2-inch glass baking dish. Cook sweet potatoes in large pot of boiling salted water until very tender, about 12 minutes. Drain. Let stand in colander 15 minutes. Purée sweet potatoes in processor.",
            "Beat eggs, syrup, vanilla, lemon juice and salt in large bowl. Mix in puréed sweet potatoes. Transfer sweet potato mixture to prepared dish. Sprinkle pecan topping evenly over mixture.",
            "Bake until sweet potato mixture is set and topping bubbles, about 1 hour. Let stand 15 minutes and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59bc1285e1f0c41594079cbe/6:4/w_274%2Ch_169/MASHED-SWEET-POTATOES-WITH-BROWN-SUGAR-AND-PECANS-RECIPE-07092017.jpg"
    }
}