{
    "recipe": {
        "title": "Meatball Sliders ",
        "ingredients": [
            "2 (28-ounce) cans whole tomatoes in juice",
            "1/4 cup olive oil",
            "1 medium onion, finely chopped",
            "5 garlic cloves, minced",
            "1 teaspoon sugar",
            "1 Turkish or 1/2 California bay leaf",
            "3 cups coarse fresh bread crumbs (6 slices firm white sandwich bread)",
            "2/3 cup whole milk",
            "1 pound ground pork",
            "1 pound ground beef chuck (not lean)",
            "4 garlic cloves, minced",
            "1 1/2 cups grated Pecorino Romano (1/4 pound)",
            "2 large eggs, lightly beaten",
            "1/2 cup finely chopped flat-leaf parsley",
            "1/2 teaspoon dried oregano",
            "2 cups vegetable oil",
            "20 small (2-inch) soft buns or rolls, split"
        ],
        "instructions": [
            "Purée tomatoes with their juice, 1 can at a time, in a blender and transfer to a bowl.",
            "Heat oil in a large heavy pot over medium-high heat until it shimmers, then sauté onion until golden, about 6 minutes. Add garlic and sauté, stirring, 1 minute. Add tomato purée, sugar, bay leaf, and 1 1/2 teaspoons salt and simmer, uncovered, stirring occasionally, until thickened, 40 to 50 minutes. Discard bay leaf.",
            "Make meatballs while sauce simmers: Stir together bread crumbs and milk in a large bowl and let stand 10 minutes. Add meat, garlic, cheese, eggs, parsley, oregano, 1/2 teaspoon salt, and 1/2 teaspoon pepper and blend with your hands until just combined well (do not overmix). Form level 1/4-cup portions into meatballs. Heat oil in a 10-inch heavy skillet over medium-high heat until it shimmers, then fry meatballs, about 6 at a time, turning occasionally, until well browned and cooked through, 4 to 6 minutes per batch. Transfer to paper towels with a slotted spoon.",
            "Stir together bread crumbs and milk in a large bowl and let stand 10 minutes. Add meat, garlic, cheese, eggs, parsley, oregano, 1/2 teaspoon salt, and 1/2 teaspoon pepper and blend with your hands until just combined well (do not overmix). Form level 1/4-cup portions into meatballs.",
            "Heat oil in a 10-inch heavy skillet over medium-high heat until it shimmers, then fry meatballs, about 6 at a time, turning occasionally, until well browned and cooked through, 4 to 6 minutes per batch. Transfer to paper towels with a slotted spoon.",
            "Simmer meatballs in sauce and assemble sliders: Add drained meatballs to tomato sauce and simmer, stirring occasionally, until meatballs are heated through. Assemble sliders with a meatball and 1 tablespoon sauce per bun, securing each with a wooden pick.",
            "Add drained meatballs to tomato sauce and simmer, stirring occasionally, until meatballs are heated through.",
            "Assemble sliders with a meatball and 1 tablespoon sauce per bun, securing each with a wooden pick."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56a0f17c60309143516714c1/6:4/w_274%2Ch_169/0807-GT-KP08.01.jpg"
    }
}