{
    "recipe": {
        "title": "Mediterranean Egg Salad Sandwich ",
        "ingredients": [
            "12 eggs",
            "1/4 cup (1 1/4 oz/40 g) chopped, drained oil-packed sun-dried tomatoes",
            "1/4 cup (11/4 oz/40 g) chopped, pitted Kalamata olives",
            "3/4-1 cup (6-8 fl oz/180-250 ml) mayonnaise",
            "Salt and ground pepper",
            "12 slices white, whole-wheat (wholemeal), or coarse country bread, toasted",
            "6 large leaves butter or romaine (cos) lettuce"
        ],
        "instructions": [
            "Bring a large saucepan three-fourths full of lightly salted water to a boil over high heat. Carefully slip the eggs into the water and cover the pan. Reduce the heat to medium and cook for 7-8 minutes. Do not overcook. Drain the eggs, then immerse in cold water. When cool enough to handle, peel the eggs and chop coarsely. In a bowl, combine the chopped eggs, sun-dried tomatoes, olives, and just enough mayonnaise to bind the ingredients. Season with salt and pepper. Spread the egg salad on 6 slices of toast, dividing it evenly. Top with a lettuce leaf, close the sandwich with a second slice of toast, and serve.",
            "Bring a large saucepan three-fourths full of lightly salted water to a boil over high heat. Carefully slip the eggs into the water and cover the pan. Reduce the heat to medium and cook for 7-8 minutes. Do not overcook. Drain the eggs, then immerse in cold water. When cool enough to handle, peel the eggs and chop coarsely. In a bowl, combine the chopped eggs, sun-dried tomatoes, olives, and just enough mayonnaise to bind the ingredients. Season with salt and pepper.",
            "Spread the egg salad on 6 slices of toast, dividing it evenly. Top with a lettuce leaf, close the sandwich with a second slice of toast, and serve.",
            "Sun-dried vs. fresh tomatoes In summer, when ripe tomatoes are abundant, omit the sun-dried tomatoes from the egg salad and add a fresh slice of tomato to each sandwich instead.",
            "In summer, when ripe tomatoes are abundant, omit the sun-dried tomatoes from the egg salad and add a fresh slice of tomato to each sandwich instead."
        ],
        "picture_link": null
    }
}