{
    "recipe": {
        "title": "Melktert ",
        "ingredients": [
            "400 g (14 ounces) puff pastry or flaky pastry (see tips, below)",
            "500 ml (2 cups) full-cream milk (whole milk)",
            "1 stick cinnamon",
            "3 eggs, separated",
            "80 ml (1/3 cup) cake flour",
            "15 ml (1 tablespoon) cornflour (cornstarch)",
            "80 ml (1/3 cup) castor sugar (superfine sugar — regular sugar may be substituted)",
            "2 ml (1/2 teaspoon) baking powder",
            "30 g (30 ml) (2 tablespoons) butter",
            "15 ml (1 tablespoon) vanilla essence (vanilla extract)",
            "ground cinnamon"
        ],
        "instructions": [
            "CRUST Set the oven at 200°C (400°F). Lightly grease a 24-cm (10-inch) shallow enamel plate or quiche tin. Roll out the pastry and line the baking plate or tin. Press in a piece of oiled foil and bake for 10 minutes. Remove foil and bake the crust for about 5 minutes more until crisp and golden. Allow to cool.",
            "Set the oven at 200°C (400°F). Lightly grease a 24-cm (10-inch) shallow enamel plate or quiche tin. Roll out the pastry and line the baking plate or tin. Press in a piece of oiled foil and bake for 10 minutes. Remove foil and bake the crust for about 5 minutes more until crisp and golden. Allow to cool.",
            "FILLING Measure three-quarters of the milk into a saucepan, add the cinnamon and heat to just below boiling point. Set aside to infuse for about 15 minutes. Mix together the remaining milk, egg yolks, flour, cornflour (cornstarch), castor sugar (superfine or regular sugar) and baking powder. Strain the cinnamon-flavoured milk, pour into a clean saucepan and cook, stirring, until the custard thickens. Remove from the heat, and whisk in the butter and vanilla essence. Cool to room temperature. Reduce oven temperature to 180°C (350°F). Whisk the egg white stiffly and fold into the custard. Pour into the pastry shell and bake for 10 minutes. Reduce oven temperature to 160°C (325°F) and bake for about 30 minutes more, until the filling is set. Slide the hot tart onto a plate, sprinkle with ground cinnamon and serve warm.",
            "Measure three-quarters of the milk into a saucepan, add the cinnamon and heat to just below boiling point. Set aside to infuse for about 15 minutes.",
            "Mix together the remaining milk, egg yolks, flour, cornflour (cornstarch), castor sugar (superfine or regular sugar) and baking powder. Strain the cinnamon-flavoured milk, pour into a clean saucepan and cook, stirring, until the custard thickens. Remove from the heat, and whisk in the butter and vanilla essence. Cool to room temperature. Reduce oven temperature to 180°C (350°F).",
            "Whisk the egg white stiffly and fold into the custard. Pour into the pastry shell and bake for 10 minutes. Reduce oven temperature to 160°C (325°F) and bake for about 30 minutes more, until the filling is set. Slide the hot tart onto a plate, sprinkle with ground cinnamon and serve warm."
        ],
        "picture_link": null
    }
}