{
    "recipe": {
        "title": "Mexican-Style Spicy Sweet Potato and Chicken Bowl ",
        "ingredients": [
            "2 sweet potatoes, peeled and chopped into chunks",
            "Coconut oil, for greasing and frying",
            "1 garlic clove, crushed",
            "1 red onion, finely diced",
            "200g skinless chicken breast, cut into chunks",
            "1 teaspoons paprika, plus extra for sprinkling",
            "200g canned chopped tomatoes",
            "1 ripe avocado, pit removed and flesh cut into chunks",
            "2 tablespoons sour cream",
            "1 small handful of fresh cilantro",
            "Sea salt and freshly ground black pepper"
        ],
        "instructions": [
            "Preheat the oven to 200°C/400°F/Gas Mark 6. Massage the sweet potato chunks with a little coconut oil, season well and then place onto a foil-lined tray. Bake in the oven for about 35 minutes. Meanwhile, heat a small amount of coconut oil in a frying pan, add the garlic and red onion and fry gently until slightly softened. Add the chicken breast chunks, lightly season with paprika and a pinch of salt and pepper and brown the chicken for a few minutes. Add the chopped tomatoes, then leave to simmer for 20 minutes until thickened. Once the sweet potato is cooked, add to the pan and stir through. Plate up, add the avocado, sour cream and sprinkle with fresh cilantro and paprika and serve.",
            "Preheat the oven to 200°C/400°F/Gas Mark 6.",
            "Massage the sweet potato chunks with a little coconut oil, season well and then place onto a foil-lined tray. Bake in the oven for about 35 minutes.",
            "Meanwhile, heat a small amount of coconut oil in a frying pan, add the garlic and red onion and fry gently until slightly softened. Add the chicken breast chunks, lightly season with paprika and a pinch of salt and pepper and brown the chicken for a few minutes.",
            "Add the chopped tomatoes, then leave to simmer for 20 minutes until thickened.",
            "Once the sweet potato is cooked, add to the pan and stir through.",
            "Plate up, add the avocado, sour cream and sprinkle with fresh cilantro and paprika and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/584abfa7024ba92504957ccd/6:4/w_274%2Ch_169/mexican-style-sweet-potato-chicken-bowl-hc-120816.jpg"
    }
}