{
    "recipe": {
        "title": "Mexican Meat Patties with Fresh Corn Salsa ",
        "ingredients": [
            "1/2 lb. ground beef",
            "1/2 lb. ground pork",
            "1/2 tsp. garlic powder",
            "1/2 cup coarsely chopped cilantro leaves and tender stems, divided",
            "2 1/4 tsp. kosher salt, divided",
            "3/4 tsp. chili powder, preferably chipotle, divided",
            "1 Tbsp. vegetable oil, plus more for greasing",
            "2 ears corn on the cob",
            "1 large tomato, chopped into 1/2\" pieces",
            "1/2 small red onion, finely chopped",
            "1 avocado, halved, cut into 1/2\" pieces",
            "1 serrano chile, seeded, finely chopped",
            "3 Tbsp. fresh lime juice"
        ],
        "instructions": [
            "Process beef, pork, garlic powder, 1/4 cup cilantro, 1 1/4 tsp. salt, and 1/2 tsp. chili powder in a food processor until evenly distributed and well combined, about 2 minutes. Roll mixture into 4 balls.",
            "Rub one 16x12\" piece of parchment with a little bit of oil. Place 1 ball of meat on one half of oiled paper, then fold other half over. Using a rolling pin or wine bottle, gently roll meat into a very thin oval between parchment (it should be about 9x6\"). Transfer, with parchment, to a rimmed baking sheet. Repeat with 3 more sheets of paper and remaining meat. Chill until ready to use.",
            "Slice kernels off ears of corn and transfer to a large bowl. Add tomato, onion, avocado, chile, lime juice, and remaining 1/4 cup cilantro, 1 tsp. salt, and 1/4 tsp. chili powder and stir to combine. Let sit while you cook the patties.",
            "Heat 1 Tbsp. oil in a large heavy (preferably cast-iron) skillet until smoking. Working one at a time, peel patty off greased parchment and sear until browned and crisped on the bottom, about 2 minutes. Turn and cook just until cooked through, about 1 minute more. Transfer to a plate and repeat with remaining patties.",
            "Top patties with corn salsa.",
            "Do Ahead: Patties can be formed 2 days ahead. Chill in parchment on a covered rimmed baking sheet."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b7709ac142de7670d9b0c38/6:4/w_274%2Ch_169/Mexican-Beef-Patties-3-16082018.jpg",
        "color": 16015379
    }
}