{
    "recipe": {
        "title": "Milk Chocolate Mousse with Port Ganache and Whipped Crème Fraîche ",
        "ingredients": [
            "1 1/4 cups plus 1/2 cup (or more) ruby Port",
            "1/2 cup heavy whipping cream",
            "2 tablespoons (1/4 stick) unsalted butter",
            "4 ounces high-quality milk chocolate (such as Lindt, Perugina, or Valrhona), chopped",
            "1 tablespoon sugar",
            "2 large eggs, separated",
            "2 tablespoons water",
            "10 tablespoons chilled heavy whipping cream, divided",
            "1 tablespoon sugar",
            "6 ounces high-quality milk chocolate (such as Lindt, Perugina, or Valrhona), chopped",
            "1/3 cup chilled heavy whipping cream",
            "1/3 cup chilled crème fraîche*"
        ],
        "instructions": [
            "Boil 1 1/4 cups Port in heavy medium saucepan until reduced to 1/4 cup, about 9 minutes.",
            "Meanwhile, simmer cream and butter in small saucepan. Remove from heat. Add chocolate; whisk until smooth. Stir 2 tablespoons Port reduction into chocolate mixture. Add 1/2 cup Port and 1 tablespoon sugar to Port reduction. Boil until syrup coats spoon thickly, 6 to 7 minutes.",
            "For mousse: Whisk yolks, 2 tablespoons water, 2 tablespoons cream, and sugar in heavy medium saucepan. Stir over medium-low heat until custard thickens enough to coat spoon, about 5 minutes (do not boil). Remove from heat. Add chocolate; stir until smooth. Transfer chocolate mixture to medium bowl. Using electric mixer, beat egg whites in another medium bowl until soft peaks form. Fold whites into chocolate mixture in 2 additions. Beat 8 tablespoons cream in another medium bowl until peaks form. Fold cream into chocolate mixture. Cover; chill at least 6 hours. DO AHEAD: Can be made 1 day ahead. Keep chilled.",
            "Whisk yolks, 2 tablespoons water, 2 tablespoons cream, and sugar in heavy medium saucepan. Stir over medium-low heat until custard thickens enough to coat spoon, about 5 minutes (do not boil). Remove from heat. Add chocolate; stir until smooth. Transfer chocolate mixture to medium bowl. Using electric mixer, beat egg whites in another medium bowl until soft peaks form. Fold whites into chocolate mixture in 2 additions. Beat 8 tablespoons cream in another medium bowl until peaks form. Fold cream into chocolate mixture. Cover; chill at least 6 hours. DO AHEAD: Can be made 1 day ahead. Keep chilled.",
            "For whipped crème fraîche: Using electric mixer, beat cream in medium bowl until soft peaks form. Fold in crème fraîche. Rewarm ganache in microwave in 10-second intervals until warm. Rewarm Port syrup, thinning with Port by 1/2 teaspoonfuls if too thick. Bring small saucepan of water almost to boil. Spoon 2 tablespoons warm ganache onto center of each of 8 plates. Dip large tablespoon into hot water; shake off excess. Starting at 1 edge of mousse, pull tablespoon in horizontal position across surface of mousse, forming oval-shaped scoop. Place mousse in center of ganache. Repeat procedure for each serving, dipping spoon into hot water and shaking off excess between scoops. Using slightly smaller spoon, repeat procedure to scoop whipped crème fraîche. Place 1 scoop of whipped crème fraîche alongside mousse on each plate. Drizzle warm Port syrup around ganache on each plate.",
            "Using electric mixer, beat cream in medium bowl until soft peaks form. Fold in crème fraîche.",
            "Rewarm ganache in microwave in 10-second intervals until warm. Rewarm Port syrup, thinning with Port by 1/2 teaspoonfuls if too thick.",
            "Bring small saucepan of water almost to boil. Spoon 2 tablespoons warm ganache onto center of each of 8 plates. Dip large tablespoon into hot water; shake off excess. Starting at 1 edge of mousse, pull tablespoon in horizontal position across surface of mousse, forming oval-shaped scoop. Place mousse in center of ganache. Repeat procedure for each serving, dipping spoon into hot water and shaking off excess between scoops. Using slightly smaller spoon, repeat procedure to scoop whipped crème fraîche. Place 1 scoop of whipped crème fraîche alongside mousse on each plate. Drizzle warm Port syrup around ganache on each plate.",
            "Available at most supermarkets and at specialty foods stores.",
            "Available at most supermarkets and at specialty foods stores.",
            "Available at most supermarkets and at specialty foods stores."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b338c221388ef838b06e14/6:4/w_274%2Ch_169/357277_milk-chocolate-mousse_1x1.jpg",
        "color": 14359329
    }
}