{
    "recipe": {
        "title": "Millet \"Burrito\" Bowl ",
        "ingredients": [
            "Kosher salt",
            "1 1/2 cups millet",
            "4 tablespoons extra-virgin olive oil",
            "2 teaspoons whole cumin seeds",
            "1/4 cup fresh lime juice (3 to 4 limes), plus 1 lime cut into wedges for serving",
            "3/4 teaspoon ground coriander",
            "Freshly cracked black pepper",
            "1 (15-ounce) can pinto or black beans, drained and rinsed",
            "4 radishes, halved and thinly sliced",
            "4 scallions, finely chopped",
            "4 cups baby arugula or torn arugula",
            "3/4 cup crumbled Cotija, feta, or goat cheese",
            "1/4 cup roasted and salted pumpkin seeds (pepitas)",
            "Salsa and sour cream for serving (optional)"
        ],
        "instructions": [
            "Bring a large pot of salted water to a boil over high heat. Add the millet and cook until the millet is tender, about 20 minutes. Drain and rinse under cool water, shaking out as much water as possible. Transfer the millet to a large bowl and toss with 1 tablespoon of the olive oil.",
            "Add the cumin seeds to a small dry skillet set over medium heat. Toast 3 to 5 minutes, shaking the pan regularly, until you smell a nutty aroma and hear some gratifying crackling and popping. Remove from skillet quickly to avoid burning. Transfer to a spice grinder or mortar and pestle to gently crush, or tip out onto a cutting board and use a heavy-bottomed pot to do the same.",
            "In a small bowl, combine the cumin, lime juice, coriander, 1 teaspoon salt, and pepper to taste. Whisk in the remaining 3 tablespoons olive oil.",
            "Add the pinto beans, radishes, scallions, and arugula to the bowl with the millet. Drizzle in the dressing and toss with a fork to combine. Sprinkle with the cheese and pumpkin seeds and serve with a lime wedge, plus salsa and sour cream on the side, if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57ed6cda157db2af0703b188/6:4/w_274%2Ch_169/Millet-Burrito-Bowl092916.jpg"
    }
}