{
    "recipe": {
        "title": "Minestrone of Late-Summer Vegetables ",
        "ingredients": [
            "3 tablespoons olive oil",
            "3 large carrots, peeled, sliced",
            "2 medium onions, sliced",
            "1 medium fresh fennel bulb, sliced",
            "1 medium celery root (celeriac), peeled, sliced",
            "1/2 head of garlic, crushed (with peel)",
            "6 large fresh Italian parsley sprigs",
            "3 bay leaves",
            "1 large fresh rosemary sprig",
            "2 large tomatoes, chopped",
            "2 tablespoons tomato paste",
            "16 cups water",
            "2 tablespoons olive oil",
            "3 large garlic cloves, minced",
            "3 cups 1/2-inch cubes baguette or rustic country-style bread",
            "1 cup dried cranberry beans or cannellini (white kidney beans)",
            "4 small carrots, peeled, sliced",
            "3 large shallots, thinly sliced",
            "3 garlic cloves, minced",
            "2 medium white-skinned potatoes, peeled, cut into 3/4-inch cubes",
            "1 cup fresh edamame beans or frozen, thawed",
            "1 cup sliced trimmed Italian pole beans or green beans (about 5 ounces)",
            "1 cup 1/2-inch cubes peeled celery root (celeriac)",
            "1/2 cup chopped red bell pepper",
            "4 lacinato (black) kale leaves, thinly sliced crosswise",
            "2 1/2-pints red and/or yellow cherry tomatoes, cut in half",
            "1/2 cup chopped fresh Italian parsley",
            "Freshly shaved Pleasant Ridge Reserve cheese,* Parmesan cheese, or Asiago cheese",
            "*Pleasant Ridge Reserve cheese is available online at uplandscheese.com; 888-935-5558."
        ],
        "instructions": [
            "Heat oil in very large pot over medium-high heat. Add carrots and next 7 ingredients. Sauté until vegetables are golden and begin to soften, about 15 minutes. Add tomatoes and tomato paste; stir to blend. Add 16 cups water and bring to boil. Reduce heat; cover and simmer 2 1/2 hours.",
            "Strain vegetable mixture, pressing on solids to extract as much liquid as possible. Discard solids in strainer. Measure 13 cups broth and pour into large bowl (reserve remaining broth for another use). Season broth with salt. DO AHEAD: Can be made 5 days ahead. Cool slightly. Cover and refrigerate.",
            "for garlic croutons: Heat oil in large nonstick skillet over medium heat. Add garlic; stir 30 seconds. Add bread cubes; stir until crisp and golden, about 7 minutes. Remove from heat; cool. DO AHEAD: Can be made 1 day ahead. Store airtight at room temperature.",
            "Heat oil in large nonstick skillet over medium heat. Add garlic; stir 30 seconds. Add bread cubes; stir until crisp and golden, about 7 minutes. Remove from heat; cool. DO AHEAD: Can be made 1 day ahead. Store airtight at room temperature.",
            "For vegetable soup: Place cranberry beans in medium bowl; add enough cold water to cover beans by 2 inches. Let stand at room temperature overnight. Drain. Place beans in large saucepan; add enough cold water to cover beans by 3 inches. Bring to boil. Reduce heat and simmer until beans are tender, about 1 hour 15 minutes. Drain beans; set aside. Bring 13 cups vegetable broth to simmer in large pot over medium-high heat. Add carrots and next 7 ingredients to broth; bring to boil. Reduce heat and simmer until vegetables are tender, stirring occasionally, about 45 minutes. DO AHEAD: Soup and beans can be made 1 day ahead. Cover and chill beans. Cool soup slightly, then chill until cold. Cover and keep chilled. Rewarm soup over medium heat before continuing. Add cranberry beans and kale and simmer 15 minutes. Stir in cherry tomatoes and parsley; simmer just until heated through, about 5 minutes. Season soup with salt and pepper. Ladle vegetable soup into bowls. Garnish with garlic croutons and shaved cheese and serve.",
            "Place cranberry beans in medium bowl; add enough cold water to cover beans by 2 inches. Let stand at room temperature overnight. Drain. Place beans in large saucepan; add enough cold water to cover beans by 3 inches. Bring to boil. Reduce heat and simmer until beans are tender, about 1 hour 15 minutes. Drain beans; set aside.",
            "Bring 13 cups vegetable broth to simmer in large pot over medium-high heat. Add carrots and next 7 ingredients to broth; bring to boil. Reduce heat and simmer until vegetables are tender, stirring occasionally, about 45 minutes. DO AHEAD: Soup and beans can be made 1 day ahead. Cover and chill beans. Cool soup slightly, then chill until cold. Cover and keep chilled. Rewarm soup over medium heat before continuing.",
            "Add cranberry beans and kale and simmer 15 minutes. Stir in cherry tomatoes and parsley; simmer just until heated through, about 5 minutes. Season soup with salt and pepper.",
            "Ladle vegetable soup into bowls. Garnish with garlic croutons and shaved cheese and serve."
        ],
        "picture_link": null,
        "color": 14924915
    }
}