{
    "recipe": {
        "title": "Mini Lime Pies with Glazed Berries ",
        "ingredients": [
            "3 large eggs",
            "3/4 cup granulated sugar",
            "1/2 cup fresh lime juice",
            "3/4 stick (6 tablespoons) unsalted butter, cut into 1/2-inch cubes",
            "1 teaspoon finely grated fresh lime zest",
            "Pastry dough for a single-crust pie",
            "3 tablespoons superfine granulated sugar",
            "1/4 cup confectioners sugar",
            "1/4 cup water",
            "1 tablespoon fresh lime juice",
            "3 cups mixed raspberries, blackberries, and blueberries",
            "2 large (17- by 12-inch) baking sheets; parchment paper; a 3-inch round cookie cutter; a small blowtorch"
        ],
        "instructions": [
            "Whisk together eggs, sugar, and lime juice in a 2-quart heavy saucepan until combined. Add butter and cook over moderately low heat, whisking constantly, until curd is thick enough to hold marks of the whisk and first bubbles appear on surface, 8 to 10 minutes. Immediately pour through a fine-mesh sieve into a bowl, discarding solids. Cool to room temperature, stirring occasionally. Stir in zest, then chill, covered, at least 1 hour.",
            "Make pastry rounds: Put oven rack in middle position and preheat oven to 350°F. Line 1 baking sheet with parchment paper. Roll out dough into a 15-inch round (pastry will be thin) on a lightly floured surface with a lightly floured rolling pin. Cut out 18 rounds with cookie cutter and arrange 1/2 inch apart on lined baking sheet. Prick each round several times with a fork, then cover rounds with another sheet of parchment and weight with second baking sheet. Bake until rounds are pale golden, 15 to 20 minutes. Remove top baking sheet and parchment and transfer rounds to racks to cool. Sprinkle each round evenly with 1/2 teaspoon superfine sugar and carefully caramelize with a blowtorch (sugar burns easily).",
            "Put oven rack in middle position and preheat oven to 350°F. Line 1 baking sheet with parchment paper.",
            "Roll out dough into a 15-inch round (pastry will be thin) on a lightly floured surface with a lightly floured rolling pin. Cut out 18 rounds with cookie cutter and arrange 1/2 inch apart on lined baking sheet. Prick each round several times with a fork, then cover rounds with another sheet of parchment and weight with second baking sheet.",
            "Bake until rounds are pale golden, 15 to 20 minutes. Remove top baking sheet and parchment and transfer rounds to racks to cool.",
            "Sprinkle each round evenly with 1/2 teaspoon superfine sugar and carefully caramelize with a blowtorch (sugar burns easily).",
            "Make glazed fruit and assemble desserts: Boil confectioners sugar, water, and lime juice in a 12-inch heavy skillet over moderate heat, stirring occasionally, until slightly thickened, about 2 minutes. Remove from heat and add berries, gently tossing to coat. (There will be just enough to glaze berries; they will give off a small amount of juice as they cool.) Cool berries 5 minutes. Put 1 tablespoon of curd on each of 6 plates. Stack 3 rounds on each plate, layering rounds with some of curd and glazed berries, then drizzle plates with some syrup.",
            "Boil confectioners sugar, water, and lime juice in a 12-inch heavy skillet over moderate heat, stirring occasionally, until slightly thickened, about 2 minutes.",
            "Remove from heat and add berries, gently tossing to coat. (There will be just enough to glaze berries; they will give off a small amount of juice as they cool.)",
            "Cool berries 5 minutes.",
            "Put 1 tablespoon of curd on each of 6 plates. Stack 3 rounds on each plate, layering rounds with some of curd and glazed berries, then drizzle plates with some syrup."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd780f3a00aeb2f1d27e2/6:4/w_274%2Ch_169/235490.jpg",
        "color": 13490432
    }
}