{
    "recipe": {
        "title": "Mini Crab Cakes ",
        "ingredients": [
            "8 ounces cream cheese, room temperature",
            "3/4 cup finely grated Parmesan cheese, divided",
            "1 large egg",
            "1/4 cup sour cream",
            "1 teaspoon finely grated orange peel",
            "1/2 teaspoon finely grated lemon peel",
            "4 teaspoons plus 2 tablespoons chopped fresh chives, divided",
            "1/4 teaspoon coarse kosher salt",
            "Large pinch of cayenne pepper",
            "6 ounces fresh lump crabmeat, picked over, patted dry, coarsely shredded",
            "1 cup panko (Japanese breadcrumbs)*",
            "1/4 cup (1/2 stick) unsalted butter, melted, plus more for pans",
            "1 plus more for pans",
            "Fresh chives, cut into pieces",
            "2 mini muffin pans"
        ],
        "instructions": [
            "Using electric mixer, beat cream cheese in medium bowl until smooth. Add 1/4 cup Parmesan and egg; beat to blend. Beat in sour cream, citrus peels, 4 teaspoons chopped chives, coarse salt, and cayenne pepper. Fold in crabmeat. DO AHEAD: Can be made 1 day ahead. Cover and chill. Preheat oven to 350°F. Generously butter 2 mini muffin pans. Toss panko, 1/2 cup Parmesan, and 2 tablespoons chopped chives in small bowl. Drizzle 1/4 cup melted butter over, tossing with fork until evenly moistened. Press 1 rounded tablespoon panko mixture into bottom of each muffin cup, forming crust. Spoon 1 generous tablespoon crab mixture into each cup. Sprinkle rounded teaspoon of panko mixture over each (some may be left over). Bake crab cakes until golden on top and set, about 30 minutes. Cool in pans 5 minutes. Run knife around each cake and gently lift out of pan. DO AHEAD: Can be made 2 hours ahead. Arrange on baking sheet; let stand at room temperature. Rewarm in 350°F oven 6 to 8 minutes. Arrange crab cakes on serving platter; sprinkle with chives.",
            "Using electric mixer, beat cream cheese in medium bowl until smooth. Add 1/4 cup Parmesan and egg; beat to blend. Beat in sour cream, citrus peels, 4 teaspoons chopped chives, coarse salt, and cayenne pepper. Fold in crabmeat. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
            "Preheat oven to 350°F. Generously butter 2 mini muffin pans. Toss panko, 1/2 cup Parmesan, and 2 tablespoons chopped chives in small bowl. Drizzle 1/4 cup melted butter over, tossing with fork until evenly moistened. Press 1 rounded tablespoon panko mixture into bottom of each muffin cup, forming crust. Spoon 1 generous tablespoon crab mixture into each cup. Sprinkle rounded teaspoon of panko mixture over each (some may be left over).",
            "Bake crab cakes until golden on top and set, about 30 minutes. Cool in pans 5 minutes. Run knife around each cake and gently lift out of pan. DO AHEAD: Can be made 2 hours ahead. Arrange on baking sheet; let stand at room temperature. Rewarm in 350°F oven 6 to 8 minutes.",
            "Arrange crab cakes on serving platter; sprinkle with chives.",
            "Available in the Asian foods section of some supermarkets and at Asian markets.",
            "Available in the Asian foods section of some supermarkets and at Asian markets.",
            "Available in the Asian foods section of some supermarkets and at Asian markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/553fdc1805ebb68a358bcd97/6:4/w_274%2Ch_169/0409-BA-FOD1-02-CP-6x4.jpg"
    }
}