{
    "recipe": {
        "title": "Miniature Jalapeño Souffles ",
        "ingredients": [
            "1 tablespoon unsalted butter plus additional for buttering muffin cups",
            "2 1/2 tablespoons all-purpose flour",
            "1 1/2 tablespoons pine nuts, very finely chopped",
            "1 small whole pickled jalapeño or 5 slices, seeded and finely chopped (1 tablespoon)",
            "6 tablespoons whole milk",
            "1 oz finely shredded Gruyère (1/4 cup)",
            "1/4 teaspoon kosher salt",
            "1/8 teaspoon black pepper",
            "1/2 teaspoon Dijon mustard",
            "1 large egg, separated",
            "a nonstick mini-muffin pan with 12 (1/8-cup) cups (each about 1 3/4 inches wide and 3/4 inch deep)"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat to 400°F. Butter muffin cups. Stir together 1 tablespoon flour and 1 tablespoon pine nuts in a small bowl. Dust cups with flour mixture, knocking out excess. Melt remaining tablespoon butter in a 1- to 1 1/2-quart heavy saucepan over moderately high heat. Add remaining 1 1/2 tablespoons flour and jalapeño and cook, stirring, 2 minutes. Whisk in milk (mixture will temporarily look curdled) and bring to a simmer, whisking, then cook, whisking constantly, until thick and smooth, about 3 minutes. Transfer to a bowl and add cheese, salt, pepper, mustard, and egg yolk, stirring until cheese is melted and mixture is well blended. Cool to room temperature, about 15 minutes. Beat egg white in a small deep bowl with an eggbeater or a handheld electric mixer at high speed until it just barely holds stiff peaks. Stir one fourth of whites into soufflé mixture to lighten, then fold in remaining whites gently but thoroughly. Spoon into muffin cups, filling about halfway, and sprinkle with remaining 1/2 tablespoon pine nuts. Bake soufflés until puffed and golden, 9 to 11 minutes. Cool in pan on a rack just until warm, then, if necessary, carefully run a small knife around edge of each soufflé to loosen. (Soufflés will fall as they cool.)",
            "Put oven rack in middle position and preheat to 400°F.",
            "Butter muffin cups. Stir together 1 tablespoon flour and 1 tablespoon pine nuts in a small bowl. Dust cups with flour mixture, knocking out excess.",
            "Melt remaining tablespoon butter in a 1- to 1 1/2-quart heavy saucepan over moderately high heat. Add remaining 1 1/2 tablespoons flour and jalapeño and cook, stirring, 2 minutes. Whisk in milk (mixture will temporarily look curdled) and bring to a simmer, whisking, then cook, whisking constantly, until thick and smooth, about 3 minutes.",
            "Transfer to a bowl and add cheese, salt, pepper, mustard, and egg yolk, stirring until cheese is melted and mixture is well blended. Cool to room temperature, about 15 minutes.",
            "Beat egg white in a small deep bowl with an eggbeater or a handheld electric mixer at high speed until it just barely holds stiff peaks. Stir one fourth of whites into soufflé mixture to lighten, then fold in remaining whites gently but thoroughly.",
            "Spoon into muffin cups, filling about halfway, and sprinkle with remaining 1/2 tablespoon pine nuts. Bake soufflés until puffed and golden, 9 to 11 minutes. Cool in pan on a rack just until warm, then, if necessary, carefully run a small knife around edge of each soufflé to loosen. (Soufflés will fall as they cool.)"
        ],
        "picture_link": null
    }
}