{
    "recipe": {
        "title": "Mint Hot Fudge Sundaes ",
        "ingredients": [
            "1 cup bittersweet chocolate chips",
            "1/4 cup light corn syrup",
            "1/4 cup water",
            "2 tablespoons (1/4 stick) butter",
            "2 tablespoons sugar, divided",
            "1 ounce unsweetened chocolate, chopped",
            "1/2 teaspoon peppermint extract",
            "2 tablespoons sliced fresh mint leaves plus fresh mint sprigs for garnish",
            "1 pint vanilla ice cream",
            "10 chocolate-mint sandwich cookies, coarsely broken",
            "1 pint green mint chocolate chip ice cream",
            "Sweetened whipped cream"
        ],
        "instructions": [
            "Stir first 4 ingredients and 1 tablespoon sugar in heavy small saucepan over medium-high heat until chocolate is melted and smooth. Bring just to boil. Remove from heat. Add unsweetened chocolate and extract; stir until smooth. Set mint-fudge sauce aside. Toss remaining 1 tablespoon sugar and sliced mint in small bowl. Set mint sugar aside. Place small scoop of vanilla ice cream in each dish. Top with some broken cookies, then scoop of mint ice cream and more cookies. Drizzle 1 to 2 tablespoons warm sauce over each. Top with whipped cream. Garnish with mint sugar and mint sprigs.",
            "Stir first 4 ingredients and 1 tablespoon sugar in heavy small saucepan over medium-high heat until chocolate is melted and smooth. Bring just to boil. Remove from heat. Add unsweetened chocolate and extract; stir until smooth. Set mint-fudge sauce aside.",
            "Toss remaining 1 tablespoon sugar and sliced mint in small bowl. Set mint sugar aside.",
            "Place small scoop of vanilla ice cream in each dish. Top with some broken cookies, then scoop of mint ice cream and more cookies. Drizzle 1 to 2 tablespoons warm sauce over each. Top with whipped cream. Garnish with mint sugar and mint sprigs."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55e9bd7aad4e361c200f72c2/6:4/w_274%2Ch_169/0808-BA-DES1-02-cp.jpg"
    }
}