{
    "recipe": {
        "title": "Minute Filets with Pickled Vegetables ",
        "ingredients": [
            "1 1/4 cups water",
            "1 cup distilled white vinegar",
            "1/4 cup sugar",
            "2 garlic cloves",
            "2 large dill sprigs",
            "1 Turkish or 1/2 California bay leaf",
            "1 tablespoon coriander seeds",
            "5 whole allspice, crushed",
            "2 medium carrots",
            "2 celery ribs",
            "1/3 seedless cucumber (about 1/4 pound)",
            "5 large radishes",
            "1 garlic clove, smashed",
            "3 tablespoons extra-virgin olive oil",
            "4 (2-inch-thick) center-cut filets mignons (beef tenderloin steaks; 1/2 pound each)"
        ],
        "instructions": [
            "Bring water, vinegar, sugar, garlic, dill, bay leaf, spices, and 2 1/2 teaspoons salt to a boil in a small saucepan, stirring, then simmer 2 minutes.",
            "Cut carrots, celery, and cucumber into 1 1/2-to 2-inch lengths, then julienne all vegetables, including radishes, with slicer. Transfer to a medium bowl, then pour warm pickling liquid over vegetables and let stand while you prepare and grill beef.",
            "Prepare beef: Prepare grill for direct-heat cooking over hot charcoal (high heat for gas); see Grilling Procedure . Combine garlic and oil in a small bowl. Remove the string from meat if tied. To cut each steak into a long rectangle that is about 1/2 inch thick, stand it on its side on a cutting board, with a flat side facing you. Hold knife blade parallel to and 1/2 inch above cutting board and, with other hand holding top of meat, slice crosswise into meat (keeping blade 1/2 inch above board) just until you are 1/2 inch from cutting through. Rotate meat to left (or right, if left-handed) and continue to cut and rotate meat until it's unfurled and 1/2 inch thick. Brush beef on both sides with garlic oil, then season both sides with 1/2 teaspoon each of salt and pepper per filet. Oil grill rack, then grill beef, covered only if using a gas grill, turning once, 4 minutes total for medium-rare. Drain pickled vegetables and discard dill, garlic, and bay leaf. Serve beef topped with vegetables.",
            "Prepare grill for direct-heat cooking over hot charcoal (high heat for gas); see Grilling Procedure .",
            "Combine garlic and oil in a small bowl.",
            "Remove the string from meat if tied. To cut each steak into a long rectangle that is about 1/2 inch thick, stand it on its side on a cutting board, with a flat side facing you. Hold knife blade parallel to and 1/2 inch above cutting board and, with other hand holding top of meat, slice crosswise into meat (keeping blade 1/2 inch above board) just until you are 1/2 inch from cutting through. Rotate meat to left (or right, if left-handed) and continue to cut and rotate meat until it's unfurled and 1/2 inch thick.",
            "Brush beef on both sides with garlic oil, then season both sides with 1/2 teaspoon each of salt and pepper per filet. Oil grill rack, then grill beef, covered only if using a gas grill, turning once, 4 minutes total for medium-rare.",
            "Drain pickled vegetables and discard dill, garlic, and bay leaf. Serve beef topped with vegetables."
        ],
        "picture_link": null
    }
}