{
    "recipe": {
        "title": "Miso-Marinated Sea Bass with Beurre Blanc ",
        "ingredients": [
            "1 cup mirin (sweet Japanese rice wine)*",
            "3/4 cup white miso (fermented soybean paste)*",
            "1/2 cup sake",
            "1/4 cup sugar",
            "6 5- to 6-ounce sea bass fillets (each about 1 inch thick)",
            "1 cup dry white wine",
            "1/4 cup chopped shallots",
            "6 garlic cloves, chopped",
            "1 bay leaf",
            "1/2 teaspoon whole black peppercorns",
            "1 cup whipping cream",
            "5 tablespoons unsalted butter, room temperature",
            "1 1/2 tablespoons fresh lemon juice"
        ],
        "instructions": [
            "Whisk mirin, white miso, sake, and sugar in 13x9x2-inch glass baking dish to combine. Add sea bass; turn to coat. Cover fish and refrigerate 2 hours.",
            "Boil white wine, chopped shallots, chopped garlic, bay leaf, and black peppercorns in heavy large saucepan until reduced to 3/4 cup, about 7 minutes. Add whipping cream and boil until reduced to 1 cup, about 6 minutes. Strain into medium saucepan, pressing on solids. Place over low heat. Add unsalted butter 1 tablespoon at a time, whisking until melted before adding more. Remove from heat. Whisk in fresh lemon juice. Season sauce to taste with salt and pepper. Cover to keep warm.",
            "Preheat oven to 450°F. Oil rimmed baking sheet. Remove fish from marinade; transfer to prepared sheet. Bake until almost opaque in center, about 10 minutes. Preheat broiler. Broil fish until well-browned on top and opaque in center, watching closely to avoid burning, about 3 minutes. Transfer fish to plates. Spoon sauce around and serve.",
            "Mirin and miso are available at Japanese markets and in the Asian foods section of some supermarkets.",
            "Mirin and miso are available at Japanese markets and in the Asian foods section of some supermarkets."
        ],
        "picture_link": null,
        "color": 4919899
    }
}