{
    "recipe": {
        "title": "Miss Ollie's Jerk Chicken ",
        "ingredients": [
            "1 bunch chives, cut into 1-inch pieces",
            "4–8 Scotch bonnet chiles or habanero chiles",
            "5 garlic cloves, crushed",
            "3/4 cup malt vinegar",
            "3/4 cup soy sauce",
            "2 tablespoons Jamaican rum",
            "2 tablespoons Diamond Crystal or 1 tablespoon Morton kosher salt",
            "2 1/2 teaspoons ground allspice",
            "1 1/2 teaspoons ground nutmeg",
            "3/4 teaspoon ground cloves",
            "8 pieces skin-on, bone-in chicken legs (about 6 pounds total), drumsticks and thighs separated, patted dry",
            "Vegetable oil (for grill)"
        ],
        "instructions": [
            "Blend chives, chiles, garlic, vinegar, soy sauce, rum, salt, allspice, nutmeg, and cloves in a blender until smooth. Place chicken in a large bowl and pour jerk marinade over. Turn thighs and drumsticks several times to coat. Cover and chill, turning chicken pieces once, at least 2 hours and up to 1 day. Remove chicken from marinade, wiping off any excess, and let come to room temperature, about 30 minutes. Discard marinade. Prepare grill for 2-zone heat (for a charcoal grill, bank two-thirds of coals on one half of grill and scatter remaining coals over other side; for a gas grill, set one burner to high heat and the remaining burners to medium-low heat). Lightly brush grate with oil. Arrange chicken drumsticks and thighs, skin side down, on grate over hottest part of grill and grill, turning halfway through, until lightly charred, 5–10 minutes. Move chicken to cooler part of grill and continue to grill, turning several times, until an instant-read thermometer inserted into the thickest part registers 165°F, 20–25 minutes longer. Transfer chicken to a platter and let rest 10 minutes before serving.",
            "Blend chives, chiles, garlic, vinegar, soy sauce, rum, salt, allspice, nutmeg, and cloves in a blender until smooth. Place chicken in a large bowl and pour jerk marinade over. Turn thighs and drumsticks several times to coat. Cover and chill, turning chicken pieces once, at least 2 hours and up to 1 day.",
            "Remove chicken from marinade, wiping off any excess, and let come to room temperature, about 30 minutes. Discard marinade.",
            "Prepare grill for 2-zone heat (for a charcoal grill, bank two-thirds of coals on one half of grill and scatter remaining coals over other side; for a gas grill, set one burner to high heat and the remaining burners to medium-low heat). Lightly brush grate with oil. Arrange chicken drumsticks and thighs, skin side down, on grate over hottest part of grill and grill, turning halfway through, until lightly charred, 5–10 minutes. Move chicken to cooler part of grill and continue to grill, turning several times, until an instant-read thermometer inserted into the thickest part registers 165°F, 20–25 minutes longer.",
            "Transfer chicken to a platter and let rest 10 minutes before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59233d7d00cf0627ec115d45/6:4/w_274%2Ch_169/miss-ollies-jerk-chicken-BA-052217.jpg"
    }
}