{
    "recipe": {
        "title": "Mixed-Mushroom and Tarragon Gravy ",
        "ingredients": [
            "2 ounces dried porcini mushrooms",
            "2 cups boiling water",
            "1/4 cup (1/2 stick) unsalted butter",
            "1 large shallot, chopped (about 1/2 cup)",
            "3 large garlic cloves, chopped",
            "1/2 pound fresh crimini (baby bella) mushrooms, stemmed, caps sliced",
            "1/2 pound fresh shiitake mushrooms, stemmed, caps sliced",
            "1 teaspoon chopped fresh thyme",
            "1 teaspoon chopped fresh sage",
            "1 cup dry vermouth or dry white wine",
            "4 1/4 cups Ultimate Turkey Stock or low-salt chicken broth, divided",
            "1/2 cup crème fraîche",
            "5 teaspoons cornstarch",
            "1 1/2 teaspoons chopped fresh tarragon",
            "ingredient info: Dried porcini and crème fraîche are available at many supermarkets and at specialty foods stores."
        ],
        "instructions": [
            "Place dried porcini in large bowl. Pour 2 cups boiling water over. Let stand until soft, stirring occasionally, about 1 hour. Using slotted spoon, transfer porcini to small bowl. Cool porcini, then chop. Pour porcini soaking liquid into medium bowl, leaving sediment behind.",
            "Melt butter in large skillet over medium-high heat. Add shallot and garlic. Stir 15 seconds. Add fresh mushrooms, thyme, and sage. Sauté until mushrooms are tender, 6 to 7 minutes. Transfer mushrooms to bowl. Add vermouth to skillet; boil 3 minutes, scraping up browned bits. Add 4 cups stock, fresh-mushroom mixture, porcini, and porcini liquid. Boil 10 minutes.",
            "Whisk in crème fraîche. Stir 1/4 cup stock and cornstarch in bowl to dissolve; mix into gravy. Cook until gravy coats spoon, about 5 minutes. Season with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cool, cover, and chill. Rewarm before continuing.",
            "Whisk tarragon into gravy and serve."
        ],
        "picture_link": null,
        "color": 8877793
    }
}