{
    "recipe": {
        "title": "Mixed Lettuces and Kohlrabi With Creamy Sumac Dressing ",
        "ingredients": [
            "1/2 cup blanched hazelnuts",
            "1 white or pink grapefruit",
            "1/2 cup sour cream",
            "1/4 cup fresh Meyer lemon juice or regular lemon juice",
            "1 tablespoon finely chopped shallot",
            "1 teaspoons sumac, plus more",
            "Kosher salt, freshly ground pepper",
            "12 cups torn mixed lettuces (such as red romaine, red-leaf, Little Gem, and/or butter lettuce)",
            "2 medium kohlrabi, peeled, thinly sliced on a mandoline",
            "1/2 cup mixed mint leaves and parsley leaves with tender stems",
            "Sumac can be found at Middle Eastern markets, specialty foods stores, and online."
        ],
        "instructions": [
            "Preheat oven to 350°F. Toast hazelnuts on a rimmed baking sheet, tossing once, until golden brown, 10–12 minutes. Let cool; crush with the flat side of a knife. Remove peel and white pith from grapefruit; discard. Cut along sides of membranes to release segments into a small bowl; discard membranes. Whisk sour cream, Meyer lemon juice, shallot, and 1 tsp. sumac in a large bowl; season dressing with salt and pepper. Add lettuce and toss to coat; season with salt and pepper. Tuck kohlrabi and grapefruit under and between lettuce. Top with herbs, hazelnuts, and more sumac.",
            "Preheat oven to 350°F. Toast hazelnuts on a rimmed baking sheet, tossing once, until golden brown, 10–12 minutes. Let cool; crush with the flat side of a knife.",
            "Remove peel and white pith from grapefruit; discard. Cut along sides of membranes to release segments into a small bowl; discard membranes.",
            "Whisk sour cream, Meyer lemon juice, shallot, and 1 tsp. sumac in a large bowl; season dressing with salt and pepper. Add lettuce and toss to coat; season with salt and pepper. Tuck kohlrabi and grapefruit under and between lettuce. Top with herbs, hazelnuts, and more sumac."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5665fe891874938e1762d1af/6:4/w_274%2Ch_169/mixed-lettuces-and-kohlrabi.jpg"
    }
}