{
    "recipe": {
        "title": "Mocha Tartlets ",
        "ingredients": [
            "2 large egg yolks",
            "2 1/2 tablespoons sugar",
            "1 1/2 tablespoons cornstarch",
            "3/4 cup whole milk",
            "2 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped",
            "1/2 tablespoon Tía Maria or other coffee liqueur",
            "1/2 tablespoon unsalted butter, softened",
            "1 teaspoon instant-espresso powder",
            "1 1/4 cups all-purpose flour",
            "1/3 cup sugar",
            "1/2 teaspoon salt",
            "1 stick (1/2 cup) unsalted butter, softened",
            "1 large egg, lightly beaten",
            "1/2 teaspoon vanilla",
            "Special equipment: 24 small (2 7/8- to 1 1/2-inch) sandbakkel or petit four molds; a pastry bag fitted with 1/2-inch star tip (optional)"
        ],
        "instructions": [
            "Beat together yolks, sugar, cornstarch, and a pinch of salt in a bowl with an electric mixer until thick and pale, about 1 minute. Heat milk in a 2-quart heavy saucepan over moderate heat until hot but not boiling. Add one third of hot milk to yolk mixture in a slow stream, whisking constantly. Pour remainder of milk into yolk mixture, whisking, then transfer to saucepan. Simmer, whisking constantly, until very thick, 1 1/2 to 2 minutes. Remove from heat and add chocolate, liqueur, butter, and espresso powder. Let stand until chocolate is melted, about 1 minute, then whisk until smooth. Force custard through a fine sieve into a bowl. Cover surface of custard with wax paper and chill until cold, at least 4 hours.",
            "Make tartlet shells while custard chills: Pulse together flour, sugar, salt, butter, egg, and vanilla in a food processor until dough is smooth and begins to form a ball (it will be soft, like cookie dough). Turn out dough onto a sheet of plastic wrap and gather into a ball. Flatten dough into a disk and chill, wrapped in plastic wrap, until firm, at least 30 minutes and up to 8 hours (overnight). Preheat oven to 350°F. Break off 1-teaspoon pieces of dough and press evenly into molds with floured fingers to form shells about 1/16 inch thick, pinching off excess from rim and making bottoms slightly thinner than sides. Arrange molds 1 inch apart in a shallow baking pan and chill until dough is firm again, about 30 minutes. Bake in middle of oven, rotating pan halfway through baking, until pale golden, 12 to 15 minutes total. Transfer molds to a rack to cool, then carefully remove shells from molds. Make more tartlet shells in same manner if desired.",
            "Pulse together flour, sugar, salt, butter, egg, and vanilla in a food processor until dough is smooth and begins to form a ball (it will be soft, like cookie dough). Turn out dough onto a sheet of plastic wrap and gather into a ball. Flatten dough into a disk and chill, wrapped in plastic wrap, until firm, at least 30 minutes and up to 8 hours (overnight).",
            "Preheat oven to 350°F.",
            "Break off 1-teaspoon pieces of dough and press evenly into molds with floured fingers to form shells about 1/16 inch thick, pinching off excess from rim and making bottoms slightly thinner than sides. Arrange molds 1 inch apart in a shallow baking pan and chill until dough is firm again, about 30 minutes.",
            "Bake in middle of oven, rotating pan halfway through baking, until pale golden, 12 to 15 minutes total. Transfer molds to a rack to cool, then carefully remove shells from molds. Make more tartlet shells in same manner if desired.",
            "Assemble tartlets: Fill pastry bag with custard and pipe decoratively into shells.",
            "Fill pastry bag with custard and pipe decoratively into shells."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea8a6f9a84192308a9ce1/6:4/w_274%2Ch_169/105928.jpg",
        "color": 9173936
    }
}