{
    "recipe": {
        "title": "Monkey Bread ",
        "ingredients": [
            "2/3 cups plus 1/2 cup heavy cream",
            "1 cup packed dark brown sugar",
            "2 tablespoons light corn syrup",
            "6 tablespoons (3/4 stick) unsalted butter",
            "1/2 teaspoon salt",
            "1 vanilla bean, split lengthwise",
            "2 teaspoons fresh lemon juice",
            "Brioche dough, refrigerated for at least 8 hours",
            "4 tablespoons (1/2 stick) unsalted butter, melted",
            "1 cup sugar",
            "1 tablespoon ground cinnamon"
        ],
        "instructions": [
            "In a small saucepan, combine 2/3 cup of the cream, the brown sugar, corn syrup, the 6 tablespoons butter, and the salt. With the tip of a paring knife, scrape the seeds from the vanilla bean into the pan, then add the bean itself. Bring the mixture to a boil over high heat, stirring until the sugar is dissolved, then reduce the heat and simmer for a few minutes to thicken.",
            "Remove from the heat and stir in the lemon juice and the remaining 1/2 cup cream. Remove the vanilla bean. Pour the toffee sauce into a 9 x 13 inch baking pan.",
            "Divide the brioche into 20 golf ball-sized pieces and roll. Put the melted butter in a small bowl, combine the sugar and cinnamon. Dip each ball in the mixture, and arrange in the baking pan so you end up with 4 rows of 5 balls each.",
            "To proof the dough, loosely cover the pan with plaster wrap and put it in a warm place until the dough is light and has doubled in size, about 1 /12 hours. (The dough is very forgiving, so don't worry if it rises longer. You can leave it out overnight.)",
            "Preheat the oven to 350°F, with a rack in the middle position.",
            "Bake the monkey break until cooked through and golden brown, about 30 minutes. Let cool for about 10 minutes. Serve the bread straight from the pan. It's so much more fun to pull it apart by hand instead of cutting it. The bread will keep, tightly covered, at room temperature for up to 2 days."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5668b9093801be1a253780bc/6:4/w_274%2Ch_169/monkeybread.jpg",
        "color": 5132970
    }
}