{
    "recipe": {
        "title": "Moors and Christians (Moros y Cristianos) ",
        "ingredients": [
            "8 ounces dried black beans",
            "1 medium yellow onion (about 8 ounces), peeled",
            "1 medium green bell pepper (about 7 ounces), cored, seeded, and halved",
            "6 Caribbean sweet peppers (ajíes dulces) or 1 cubanelle pepper",
            "1 ham hock (optional)",
            "2 cups (about 13 ounces) long-grain rice or Uncle Ben's converted rice",
            "2 tablespoons extra-virgin olive oil",
            "4 ounces slab bacon, diced",
            "1 medium yellow onion, finely chopped (about 1 1/4 cups)",
            "1 medium green bell pepper (about 7 ounces), cored, seeded, deveined, and finely chopped (about 1 cup)",
            "1 teaspoon ground cumin",
            "1 teaspoon dried oregano",
            "1 bay leaf",
            "1 tablespoon distilled white vinegar, or to taste",
            "1 tablespoon dry sherry, or to taste",
            "2 teaspoons salt, or to taste"
        ],
        "instructions": [
            "Rinse and pick over the beans. Place in a medium heavy-bottomed pot with 2 1/2 quarts water, the onion, bell pepper, ajíes or cubanelle pepper, and the ham hock, if using, and bring to a boil over high heat. Lower the heat to medium and simmer, uncovered, until the beans are tender but still retain their shape, about 2 hours. Drain, reserving 4 cups of the cooking liquid. Discard the vegetables and ham hock; you should have 2 cups cooked beans.",
            "Finishing the Dish Place the rice in a medium bowl, cover with cold tap water, and swirl the rice, then drain, holding the rice in place with one hand. Repeat the process as many times as necessary until the water runs clear. Drain well in a sieve or strainer. Heat the oil in the heavy-bottomed pot over medium heat. Add the diced bacon and sauté until golden, about 3 minutes. Add the onion, green pepper, cumin, oregano, and bay leaf and sauté until the onion is soft, about 5 minutes. Add the rice and stir to coat thoroughly. Add the beans and the reserved bean cooking liquid, then add the vinegar, sherry, and salt. Mix well and taste for seasoning; add a dash more of sherry, vinegar, and/or spices if needed. The cooking liquid should be flavorful. Cook, uncovered, until most of the liquid is absorbed and small craters have formed on the surface of the rice. Fluff the rice slightly with a kitchen fork, reduce the heat to the lowest possible setting, and cook, tightly covered, for 20 minutes. Remove from the heat and let stand, uncovered, for at least 10 minutes before serving.",
            "Place the rice in a medium bowl, cover with cold tap water, and swirl the rice, then drain, holding the rice in place with one hand. Repeat the process as many times as necessary until the water runs clear. Drain well in a sieve or strainer. Heat the oil in the heavy-bottomed pot over medium heat. Add the diced bacon and sauté until golden, about 3 minutes. Add the onion, green pepper, cumin, oregano, and bay leaf and sauté until the onion is soft, about 5 minutes.",
            "Add the rice and stir to coat thoroughly. Add the beans and the reserved bean cooking liquid, then add the vinegar, sherry, and salt. Mix well and taste for seasoning; add a dash more of sherry, vinegar, and/or spices if needed. The cooking liquid should be flavorful. Cook, uncovered, until most of the liquid is absorbed and small craters have formed on the surface of the rice. Fluff the rice slightly with a kitchen fork, reduce the heat to the lowest possible setting, and cook, tightly covered, for 20 minutes.",
            "Remove from the heat and let stand, uncovered, for at least 10 minutes before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad486419925f464b3b36e8/6:4/w_274%2Ch_169/51203610_moors-christians_1x1.jpg",
        "color": 2002824
    }
}