{
    "recipe": {
        "title": "Moroccan Skirt Steak Salad With Chermoula ",
        "ingredients": [
            "1 pound skirt steak, sliced crosswise into 5–6-inch-long pieces",
            "1/2 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "1/2 cup Blender Chermoula Sauce",
            "Vegetable oil (for grill)",
            "2 medium carrots, shaved into long thin ribbons",
            "2 small Persian cucumbers, thinly sliced into rounds",
            "6 cups baby arugula",
            "1/4 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "1 cup (packed) mixed herb leaves, such as parsley, cilantro, and mint, divided",
            "1/2 cup Blender Chermoula Sauce, divided",
            "1/4 cup crumbled feta",
            "1/4 cup pomegranate seeds"
        ],
        "instructions": [
            "Season steak with salt and pepper. Place steak in a large resealable bag or bowl. Pour chermoula over, toss to coat, then let rest at room temperature at least 1 hour.",
            "Prepare a grill for medium-high heat or heat grill pan over medium-high; lightly oil grate or pan. Remove steak from marinade; discard marinade. Grill steak until an instant-read thermometer inserted into the center registers 125°F, 2–3 minutes per side for medium-rare. Transfer to a cutting board and let rest 10 minutes before slicing against the grain.",
            "Assemble the salad: Toss carrots, cucumbers, arugula, salt, pepper, 1/2 cup herbs, and 1/4 cup chermoula sauce in a large bowl. Divide salad among 4 plates. Top with steak and remaining 1/2 cup herbs. Drizzle salads with remaining 1/4 cup chermoula sauce. Top with feta and pomegranate seeds.",
            "Toss carrots, cucumbers, arugula, salt, pepper, 1/2 cup herbs, and 1/4 cup chermoula sauce in a large bowl. Divide salad among 4 plates. Top with steak and remaining 1/2 cup herbs. Drizzle salads with remaining 1/4 cup chermoula sauce. Top with feta and pomegranate seeds.",
            "Do Ahead Steak can be marinated 10 hours ahead; chill in bag. Let steak come to room temperature at least 1 hour before cooking.",
            "Steak can be marinated 10 hours ahead; chill in bag. Let steak come to room temperature at least 1 hour before cooking."
        ],
        "picture_link": "https://assets.epicurious.com/photos/577d49fb4f2c1eb16e3d5845/6:4/w_274%2Ch_169/moroccan-skirt-Steak-Salad-with-chermoula-recipe-20052016.jpg",
        "color": 5175502
    }
}