{
    "recipe": {
        "title": "Moroccan-Spiced Scallops with Lentils ",
        "ingredients": [
            "1 teaspoon ground cumin",
            "1 teaspoon ground coriander",
            "1/2 teaspoon ground cinnamon",
            "2 tablespoons olive oil, divided",
            "1/2 cup chopped onion",
            "2 1/2 cups (or more) vegetable broth",
            "1 cup red lentils,* rinsed",
            "1/4 cup chopped fresh cilantro plus additional for sprinkling",
            "1 1/2 pounds sea scallops, patted dry"
        ],
        "instructions": [
            "Mix first 3 ingredients in small bowl. Heat 1 tablespoon oil in heavy medium saucepan over medium-high heat. Add onion and sauté until translucent, about 4 minutes. Add 2 teaspoons spice mixture and sauté 30 seconds. Stir in 21/2 cups vegetable broth and lentils. Bring to boil; reduce heat to medium and simmer until lentils are tender, adding more broth by tablespoonfuls if dry and stirring occasionally, about 10 minutes. Stir in 1/4 cup cilantro; season to taste with salt and pepper.",
            "Meanwhile, heat 1 tablespoon oil in heavy large skillet over high heat. Sprinkle scallops with salt, pepper, and remaining spice mixture; add to skillet and cook until browned on both sides and just opaque in centers, about 2 minutes per side. Top lentil mixture with scallops and sprinkle with additional cilantro.",
            "Also known as masoor dal; sold at some supermarkets and at natural foods stores and Indian markets. If unavailable, use green lentils and increase cooking time to about 30 minutes.",
            "Also known as masoor dal; sold at some supermarkets and at natural foods stores and Indian markets. If unavailable, use green lentils and increase cooking time to about 30 minutes.",
            "Also known as masoor dal; sold at some supermarkets and at natural foods stores and Indian markets. If unavailable, use green lentils and increase cooking time to about 30 minutes."
        ],
        "picture_link": null
    }
}