{
    "recipe": {
        "title": "Mozzarella ",
        "ingredients": [
            "1 gallon whole milk",
            "1 1/8 teaspoon citric acid*",
            "1/4 tablet rennet*, crushed",
            "1/4 cup warm water",
            "Equipment: cheesecloth; kitchen string",
            "*Available from Leeners, 800-543-3697 and leeners.com"
        ],
        "instructions": [
            "Heat milk and citric acid to 88°F in a 7- to 8-quart heavy pot over low heat, stirring occasionally, then maintain a temperature of 88 to 91°F on an instant-read thermometer, returning to and removing from heat as necessary, for 1 hour. (Mixture will begin to curdle.) Dissolve rennet in warm water, then stir into milk mixture. Let stand, uncovered, maintaining 88 to 91°F, until the consistency of soft pudding, 15 to 20 minutes. Using a long knife, make cuts across stiffened milk mixture at 1/2-inch intervals, reaching down to bottom of pot, then make similar cuts in stiffened milk mixture to form a crosshatch pattern (small squares) on top. Let stand, undisturbed, 5 minutes. Keeping temperature between 88 and 91°F (reheat when necessary over very low heat), gently stir curds every 10 minutes for 30 minutes, then let curds stand, uncovered and undisturbed, maintaining temperature, 30 minutes more. Line a large sieve with cheesecloth and set over a bowl. Using a ladle or slotted spoon, transfer curds to center of cheesecloth. Gather sides up over curds to form a sack and tie sides together with a long piece of string as close to curds as possible but without squeezing curds. Suspend sack from a knob or cupboard handle, using string, at least 4 inches from bottom of bowl (sack should not sit in any whey that accumulates; if necessary, discard whey as it accumulates). Let hang 3 hours at room temperature. Heat a large pot of heavily salted water (1/3 cup salt for 5 quarts water) to 170°F. Place one fourth of the curds in a shallow bowl, then ladle about 6 cups hot water over curds and let stand until curds start to meld together, about 2 minutes. Gather curds together with a slotted spoon and remove from water. Working over the bowl of hot water, gently fold the mass of curds over itself in your hands, stretching as you fold. Reheat in hot water as necessary (3 to 5 times) to maintain temperature, folding and stretching until curds become a smooth and elastic disk. Form into a ball by tucking outside into center, then pinch edges together. Place mozzarella in cool water to cool completely before eating. Make remaining cheese in same manner, reusing hot salted water for subsequent batches.",
            "Heat milk and citric acid to 88°F in a 7- to 8-quart heavy pot over low heat, stirring occasionally, then maintain a temperature of 88 to 91°F on an instant-read thermometer, returning to and removing from heat as necessary, for 1 hour. (Mixture will begin to curdle.)",
            "Dissolve rennet in warm water, then stir into milk mixture. Let stand, uncovered, maintaining 88 to 91°F, until the consistency of soft pudding, 15 to 20 minutes.",
            "Using a long knife, make cuts across stiffened milk mixture at 1/2-inch intervals, reaching down to bottom of pot, then make similar cuts in stiffened milk mixture to form a crosshatch pattern (small squares) on top. Let stand, undisturbed, 5 minutes. Keeping temperature between 88 and 91°F (reheat when necessary over very low heat), gently stir curds every 10 minutes for 30 minutes, then let curds stand, uncovered and undisturbed, maintaining temperature, 30 minutes more.",
            "Line a large sieve with cheesecloth and set over a bowl. Using a ladle or slotted spoon, transfer curds to center of cheesecloth. Gather sides up over curds to form a sack and tie sides together with a long piece of string as close to curds as possible but without squeezing curds. Suspend sack from a knob or cupboard handle, using string, at least 4 inches from bottom of bowl (sack should not sit in any whey that accumulates; if necessary, discard whey as it accumulates). Let hang 3 hours at room temperature.",
            "Heat a large pot of heavily salted water (1/3 cup salt for 5 quarts water) to 170°F. Place one fourth of the curds in a shallow bowl, then ladle about 6 cups hot water over curds and let stand until curds start to meld together, about 2 minutes. Gather curds together with a slotted spoon and remove from water. Working over the bowl of hot water, gently fold the mass of curds over itself in your hands, stretching as you fold. Reheat in hot water as necessary (3 to 5 times) to maintain temperature, folding and stretching until curds become a smooth and elastic disk.",
            "Form into a ball by tucking outside into center, then pinch edges together. Place mozzarella in cool water to cool completely before eating. Make remaining cheese in same manner, reusing hot salted water for subsequent batches."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d79bb7b55306961bf36f6/6:4/w_274%2Ch_169/351229.jpg"
    }
}