{
    "recipe": {
        "title": "Mrs. Marshall's Cheesecake ",
        "ingredients": [
            "1 1/2 cups crushed zwieback toasts",
            "1 cup sugar",
            "1 teaspoon cinnamon",
            "8 tablespoons unsalted butter, melted",
            "2 (8-oz) packages cream cheese, softened",
            "4 large eggs, separated",
            "1 cup sugar",
            "1 cup heavy cream",
            "1 tablespoon all-purpose flour",
            "1 teaspoon vanilla"
        ],
        "instructions": [
            "Preheat oven to 350°F and butter a 10-inch springform pan.",
            "Make crust: Stir together crust ingredients. Reserve 1/4 cup for topping and press remainder onto bottom and 1 1/2 inches up side of springform pan.",
            "Stir together crust ingredients. Reserve 1/4 cup for topping and press remainder onto bottom and 1 1/2 inches up side of springform pan.",
            "Make filling: Beat cream cheese with a wooden spoon in a large bowl until smooth and creamy and add yolks 1 at a time, beating well after each addition. Beat in sugar, cream, flour, and vanilla. Beat whites with an eggbeater in another large bowl until they just hold stiff peaks and fold into cream-cheese mixture gently but thoroughly. Spoon filling into crust, smoothing top, and sprinkle evenly with reserved crumb mixture. Put springform pan in a shallow baking pan and bake cake on lowest rack of oven 1 hour. Turn oven off and open oven door 5 to 6 inches. Cool in oven 1 hour. Chill, covered, at least 3 hours. Remove side of pan and let cheesecake stand at room temperature 30 minutes before serving.",
            "Beat cream cheese with a wooden spoon in a large bowl until smooth and creamy and add yolks 1 at a time, beating well after each addition. Beat in sugar, cream, flour, and vanilla. Beat whites with an eggbeater in another large bowl until they just hold stiff peaks and fold into cream-cheese mixture gently but thoroughly. Spoon filling into crust, smoothing top, and sprinkle evenly with reserved crumb mixture. Put springform pan in a shallow baking pan and bake cake on lowest rack of oven 1 hour. Turn oven off and open oven door 5 to 6 inches. Cool in oven 1 hour. Chill, covered, at least 3 hours. Remove side of pan and let cheesecake stand at room temperature 30 minutes before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5612e634f35fab51707e7efe/6:4/w_274%2Ch_169/102394.jpg",
        "color": 2801929
    }
}