{
    "recipe": {
        "title": "Muffin Cup Veggie Omelets ",
        "ingredients": [
            "Olive oil spray",
            "1/2 cup chopped red bell pepper",
            "1/4 cup chopped onion",
            "1/2 cup chopped white mushrooms",
            "1/4 cup chopped spinach",
            "5 fresh basil leaves, chopped",
            "4 large eggs",
            "3 large egg whites",
            "Pinch of kosher salt",
            "Pinch of freshly ground black pepper",
            "1/4 cup crumbled goat cheese"
        ],
        "instructions": [
            "Preheat the oven to 350°F. Spray a 12-cup muffin pan with oil spray.",
            "As you chop the veggies, divide them among the muffin cups.",
            "In a large bowl, whisk together the eggs, egg whites, salt, and pepper. Pour 2 tablespoons of the egg mixture into each muffin cup, then top each with 1 teaspoon of goat cheese.",
            "Bake the omelets for 20 minutes, then let them rest for 5 minutes in the pan (this will help them stay together).",
            "Variations: You can use any cheese you like! Cheddar and feta both work well. If you like spice, add a few dashes of your favorite hot sauce to the eggs. If you want to add meat, crumble 2 cooked sausage patties and add them to the veggies.",
            "You can use any cheese you like! Cheddar and feta both work well. If you like spice, add a few dashes of your favorite hot sauce to the eggs. If you want to add meat, crumble 2 cooked sausage patties and add them to the veggies.",
            "Do Ahead Save more time in the morning by prepping the omelets the night before. Fill the muffin cups with veggies and whisk the eggs in a bowl, cover both with plastic wrap, and place in the fridge. The next morning, give the eggs another quick whisk, then pour them into the muffin cups, top with cheese, and pop in the oven. This will take less than 5 minutes. You can reheat these for the very busiest mornings. Make and refrigerate them a few days ahead and pop them in a 200°F oven while you get ready. They need 20 minutes to heat, but can be left in the oven to stay warm for up to an hour.",
            "Save more time in the morning by prepping the omelets the night before. Fill the muffin cups with veggies and whisk the eggs in a bowl, cover both with plastic wrap, and place in the fridge. The next morning, give the eggs another quick whisk, then pour them into the muffin cups, top with cheese, and pop in the oven. This will take less than 5 minutes.",
            "You can reheat these for the very busiest mornings. Make and refrigerate them a few days ahead and pop them in a 200°F oven while you get ready. They need 20 minutes to heat, but can be left in the oven to stay warm for up to an hour."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a611991200b56342754d039/6:4/w_274%2Ch_169/muffin-cup-veggie-omelets-recipe-HC-011818.jpg"
    }
}