{
    "recipe": {
        "title": "Mummy Sandwich Cookies with White and Dark Chocolate ",
        "ingredients": [
            "1 recipe Classic Sugar Cookies , baked using the slice-and-bake method",
            "8 ounces dark or semi-sweet chocolate, chopped",
            "8 ounces white chocolate, chopped",
            "2 1/2 cups confectioner's sugar, sifted",
            "3/4 cup (1 1/2 sticks) unsalted butter, at room temperature",
            "8 ounces bar cream cheese, at room temperature",
            "1 teaspoon vanilla extract",
            "Green food coloring (preferably gel paste)",
            "pastry bag with small tip or resealable plastic bag",
            "wooden skewers or toothpicks"
        ],
        "instructions": [
            "Decorate the cookies: Fill a medium pot with 2 inches of water, place over medium heat, and bring to a simmer. Place dark chocolate in a heatproof metal or glass bowl and set over the pot (the simmering water should not touch the bottom of the bowl). Melt chocolate, stirring frequently, until almost completely melted. Remove bowl from heat, and stir until smooth. Using a small offset spatula or spoon, apply a thin layer of dark chocolate onto the rounded surface of the \"tops\" of half the cookies, reserving the remaining half of the cookies for the sandwich \"bottoms.\" Reserve remaining dark chocolate for the mummy eyes. Set cookies aside to allow chocolate to set, about 10 minutes. Repeat melting process with white chocolate. Fill a pastry bag fitted with a small tip with melted white chocolate. Drizzle thin horizontal stripes of white chocolate onto each chocolate-covered cookie, leaving a 1/4-inch gap in the center for the eyes. Add the whites of two eyes in the center of each cookie and allow to set, about 5 minutes. Using a toothpick, add two small dots of reserved melted dark chocolate to the eyes to make pupils. Repeat with remaining cookies.",
            "Fill a medium pot with 2 inches of water, place over medium heat, and bring to a simmer. Place dark chocolate in a heatproof metal or glass bowl and set over the pot (the simmering water should not touch the bottom of the bowl). Melt chocolate, stirring frequently, until almost completely melted. Remove bowl from heat, and stir until smooth.",
            "Using a small offset spatula or spoon, apply a thin layer of dark chocolate onto the rounded surface of the \"tops\" of half the cookies, reserving the remaining half of the cookies for the sandwich \"bottoms.\" Reserve remaining dark chocolate for the mummy eyes. Set cookies aside to allow chocolate to set, about 10 minutes.",
            "Repeat melting process with white chocolate. Fill a pastry bag fitted with a small tip with melted white chocolate. Drizzle thin horizontal stripes of white chocolate onto each chocolate-covered cookie, leaving a 1/4-inch gap in the center for the eyes. Add the whites of two eyes in the center of each cookie and allow to set, about 5 minutes. Using a toothpick, add two small dots of reserved melted dark chocolate to the eyes to make pupils. Repeat with remaining cookies.",
            "Make the filling: Using an electric mixer, beat butter on medium-high until smooth and fluffy. Add the cream cheese and beat until well blended. Add the confectioner's sugar, vanilla extract, and a few drops food coloring. Mix on medium-low until well combined, adding additional food coloring, if desired.",
            "Using an electric mixer, beat butter on medium-high until smooth and fluffy. Add the cream cheese and beat until well blended. Add the confectioner's sugar, vanilla extract, and a few drops food coloring. Mix on medium-low until well combined, adding additional food coloring, if desired.",
            "Assemble the cookie sandwiches: Spread 1 1/2 teaspoons of filling on the flat side of each reserved plain sugar cookie \"bottom,\" then top with a decorated cookie.",
            "Spread 1 1/2 teaspoons of filling on the flat side of each reserved plain sugar cookie \"bottom,\" then top with a decorated cookie."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b9c1b42a4b69f8647e6cc0/6:4/w_274%2Ch_169/51256010_mummy-cookies_1x1.jpg"
    }
}