{
    "recipe": {
        "title": "Mushroom and Gruyère Bread Pudding ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "2 tablespoons olive oil",
            "1 pound assorted fresh mushrooms (such as crimini, button, and stemmed shiitake), thinly sliced",
            "1 cup chopped onion",
            "1/2 cup dried porcini mushrooms,* broken into pieces",
            "2 tablespoons chopped fresh tarragon",
            "2 garlic cloves, minced",
            "1/4 cup Madeira",
            "2 cups whole milk",
            "4 large eggs",
            "1/2 teaspoon salt",
            "1/2 teaspoon ground black pepper",
            "12 slices white bread, crusts trimmed",
            "3/4 cup grated Gruyère cheese",
            "3/4 cup freshly grated Parmesan cheese"
        ],
        "instructions": [
            "Spray 13x9x2-inch glass baking dish with nonstick spray. Heat oil in large nonstick skillet over medium-high heat. Add fresh mushrooms and onion; sauté 3 minutes. Add dried porcini; sauté until mushrooms are brown, about 8 minutes. Mix in tarragon and garlic; season with salt and pepper. Transfer to medium bowl.",
            "Add Madeira to same skillet; boil until reduced by half, stirring, about 1 minute. Whisk milk and eggs in large bowl to blend. Whisk in Madeira, 1/2 teaspoon salt, and 1/2 teaspoon pepper.",
            "Arrange 6 bread slices over bottom of prepared dish. Top with mushroom mixture, half of Gruyère, and half of Parmesan cheese. Cover with remaining 6 bread slices. Drizzle egg mixture over; press gently to submerge bread. Cover; chill at least 1 hour and up to 3 hours.",
            "Preheat oven to 350°F. Sprinkle remaining Gruyère and Parmesan cheese over bread pudding. Bake uncovered until bread pudding puffs and top is golden brown, about 40 minutes.",
            "Dried porcini mushrooms are available at Italian markets, specialty foods stores, and many supermarkets.",
            "Dried porcini mushrooms are available at Italian markets, specialty foods stores, and many supermarkets.",
            "Dried porcini mushrooms are available at Italian markets, specialty foods stores, and many supermarkets."
        ],
        "picture_link": null,
        "color": 1543446
    }
}