{
    "recipe": {
        "title": "Mushrooms with Béarnaise Yogurt ",
        "ingredients": [
            "1 shallot, finely chopped",
            "2 sprigs tarragon, plus 2 teaspoons chopped",
            "1/2 teaspoon black peppercorns, crushed",
            "1 tablespoon white wine vinegar",
            "1 cup plain whole-fat Greek yogurt",
            "2 tablespoons fresh lemon juice",
            "1 tablespoon olive oil",
            "Kosher salt",
            "1 tablespoon coriander seeds",
            "1 teaspoon kosher salt",
            "1 teaspoon mustard powder",
            "1 teaspoon paprika",
            "12 ounces maitake or oyster mushrooms, torn into large pieces",
            "2 tablespoons olive oil",
            "Torn tarragon sprigs (for serving)",
            "A spice mill or a mortar and pestle"
        ],
        "instructions": [
            "Bring shallot, tarragon sprigs, peppercorns, vinegar, and 1/3 cup water to a boil in a small skillet over medium heat and cook until liquid is nearly evaporated, 8–10 minutes. Let cool. Discard tarragon sprigs and transfer mixture to a small bowl. Add yogurt, lemon juice, oil, and chopped tarragon and mix well; season with salt.",
            "To assemble: Prepare a grill for medium heat. Finely grind coriander seeds in spice grinder or with mortar and pestle. Transfer to a small bowl and mix in salt, mustard powder, and paprika. Drizzle mushrooms with oil in a medium bowl; gently toss to coat. Season with rub. Grill, turning occasionally, until browned and tender, 6–8 minutes. Serve over yogurt topped with tarragon.",
            "Prepare a grill for medium heat. Finely grind coriander seeds in spice grinder or with mortar and pestle. Transfer to a small bowl and mix in salt, mustard powder, and paprika.",
            "Drizzle mushrooms with oil in a medium bowl; gently toss to coat. Season with rub. Grill, turning occasionally, until browned and tender, 6–8 minutes. Serve over yogurt topped with tarragon.",
            "Do Ahead Yogurt can be made 3 days ahead. Cover and chill.",
            "Yogurt can be made 3 days ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/577d246c6cd1d6f116956b58/6:4/w_274%2Ch_169/oyster-mushrooms-bernaise-yogurt-BA-070616.jpg",
        "color": 11068072
    }
}