{
    "recipe": {
        "title": "Mushroom Consomme with Morels and Pastry \"Hats\" ",
        "ingredients": [
            "2 pounds white mushrooms, finely chopped (preferably in a food processor)",
            "2 medium onions, chopped",
            "2 quarts cold water",
            "2 tablespoons 1-inch pieces fresh chives",
            "1 1/2 cups boiling water",
            "3/4 ounce dried morels (about 3/4 cup)",
            "3/4 cup Sercial Madeira",
            "1 pound frozen all-butter puff pastry, thawed",
            "1 whole large egg, lightly beaten",
            "1 large egg yolk",
            "Equipment: 6 deep (16-to 18-ounces) ovenproof bowls (4 to 4 1/2 inches across the top) such as \"lion's head\" bowls; a round template 1 1/2 inches larger than diameter of tops of bowls"
        ],
        "instructions": [
            "Simmer white mushrooms, onions, water, and 1 tsp salt in a 6-qt stockpot, uncovered, 1 1/2 hours.",
            "Strain mushroom mixture through a large sieve lined with a damp paper towel into a large saucepan, pressing gently on solids to extract as much liquid as possible. Mushroom mixture should yield about 4 cups consommé. (If less, add water; if too much, boil consommé until it is reduced to 4 cups.) Discard solids. Season consommé with salt and pepper.",
            "Prepare morels wwhile consommé simmers: Pour boiling water over morels in a small bowl and soak until morels are softened, about 20 minutes. Transfer morels with a slotted spoon to a medium-mesh sieve set over a bowl. Press on morels with back of spoon to remove liquid, then add liquid from morels to soaking liquid and reserve. Rinse morels to remove any grit, then transfer to a small saucepan and add Madeira. Simmer, covered, 5 minutes.",
            "Pour boiling water over morels in a small bowl and soak until morels are softened, about 20 minutes.",
            "Transfer morels with a slotted spoon to a medium-mesh sieve set over a bowl. Press on morels with back of spoon to remove liquid, then add liquid from morels to soaking liquid and reserve.",
            "Rinse morels to remove any grit, then transfer to a small saucepan and add Madeira. Simmer, covered, 5 minutes.",
            "Finish consommé: Add morels and Madeira to consommé in saucepan. Let reserved soaking liquid settle, then slowly pour into consommé, being careful to leave last tablespoon (containing sediment) in bowl. Add chives to consommé and simmer, covered, 3 minutes, then chill, uncovered, until cold, about 1 hour.",
            "Add morels and Madeira to consommé in saucepan. Let reserved soaking liquid settle, then slowly pour into consommé, being careful to leave last tablespoon (containing sediment) in bowl.",
            "Add chives to consommé and simmer, covered, 3 minutes, then chill, uncovered, until cold, about 1 hour.",
            "Prepare pastry \"hats\": If pastry comes as 1 sheet, cut crosswise in half. Roll out each piece of pastry into a 13-inch square on a lightly floured surface with a lightly floured rolling pin. Chill on baking sheets until firm, about 1 hour. Cut out 3 rounds from each sheet of puff pastry using template. Brush any excess flour from both sides of pastry rounds. Brush tops with some of beaten egg. Chill pastry rounds on baking sheets until firm, about 1 hour. Preheat oven to 425°F with rack in middle. Divide cold soup among bowls. (Do not chill soup in bowls.) Lightly beat yolk, then brush around edge and down side of each bowl (a 1/2-inch-wide strip). Working quickly, place each pastry round over a bowl and pull slightly so pastry is taut. Press edge down against side of bowl to seal tightly. When all bowls are covered with pastry, arrange in a large 4-sided sheet pan and bake until pastry is puffed and golden brown, 15 to 20 minutes. Serve immediately.",
            "If pastry comes as 1 sheet, cut crosswise in half. Roll out each piece of pastry into a 13-inch square on a lightly floured surface with a lightly floured rolling pin. Chill on baking sheets until firm, about 1 hour.",
            "Cut out 3 rounds from each sheet of puff pastry using template. Brush any excess flour from both sides of pastry rounds. Brush tops with some of beaten egg. Chill pastry rounds on baking sheets until firm, about 1 hour.",
            "Preheat oven to 425°F with rack in middle.",
            "Divide cold soup among bowls. (Do not chill soup in bowls.) Lightly beat yolk, then brush around edge and down side of each bowl (a 1/2-inch-wide strip). Working quickly, place each pastry round over a bowl and pull slightly so pastry is taut. Press edge down against side of bowl to seal tightly.",
            "When all bowls are covered with pastry, arrange in a large 4-sided sheet pan and bake until pastry is puffed and golden brown, 15 to 20 minutes. Serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d7927f9a841923089d832/6:4/w_274%2Ch_169/350246_hires.jpg",
        "color": 16148027
    }
}