{
    "recipe": {
        "title": "Mussels with Chorizo and Tomatoes on Toast ",
        "ingredients": [
            "1/2 cup extra-virgin olive oil, divided",
            "1 1/2 oz. dried cured Spanish chorizo, thinly sliced into coins",
            "1 medium onion, chopped",
            "1 medium fennel bulb, chopped",
            "6 garlic cloves, smashed, divided",
            "1 pint cherry tomatoes, preferably Sun Gold",
            "1/4 tsp. crushed red pepper flakes",
            "1 tsp. kosher salt, divided",
            "1 cup dry white wine",
            "2 lb. mussels, soaked, scrubbed, beards removed",
            "1 (15.5-oz.) can cannellini beans, rinsed, drained",
            "1 1/2 cups chopped cilantro leaves with tender stems",
            "2 lemons, divided",
            "4 (1\"-thick) slices sourdough or country-style bread"
        ],
        "instructions": [
            "Heat 1 Tbsp. oil in a large heavy pot or Dutch oven over medium. Add chorizo and cook, stirring occasionally, until browned and crisp, 2–3 minutes. Add onion, fennel, 5 garlic cloves, and 3 Tbsp. oil and cook, stirring often, until vegetables are softened but not browned, 8–10 minutes. Add tomatoes, red pepper, and 3/4 tsp. salt and cook, stirring, until warmed through, about 2 minutes longer. Add wine and cook, stirring occasionally, just to burn off some of the alcohol, 1–2 minutes. Add mussels and beans and stir once or twice to incorporate. Cover pot and steam until all mussels are open, 3–5 minutes. Discard any that do not open. Stir in cilantro. Cut 1 lemon in half and squeeze in 1 Tbsp. lemon juice. Meanwhile, working in batches, heat remaining 2 Tbsp. oil in a large skillet over medium. Add bread and cook until golden brown and crisp on one side, about 2 minutes. Transfer toast to a medium bowl. Rub cooked sides of toast with remaining garlic clove; season with remaining 1/4 tsp. salt. Spoon mussel mixture and broth over toasts. Cut remaining lemon into wedges and serve alongside.",
            "Heat 1 Tbsp. oil in a large heavy pot or Dutch oven over medium. Add chorizo and cook, stirring occasionally, until browned and crisp, 2–3 minutes. Add onion, fennel, 5 garlic cloves, and 3 Tbsp. oil and cook, stirring often, until vegetables are softened but not browned, 8–10 minutes. Add tomatoes, red pepper, and 3/4 tsp. salt and cook, stirring, until warmed through, about 2 minutes longer.",
            "Add wine and cook, stirring occasionally, just to burn off some of the alcohol, 1–2 minutes. Add mussels and beans and stir once or twice to incorporate. Cover pot and steam until all mussels are open, 3–5 minutes. Discard any that do not open. Stir in cilantro. Cut 1 lemon in half and squeeze in 1 Tbsp. lemon juice.",
            "Meanwhile, working in batches, heat remaining 2 Tbsp. oil in a large skillet over medium. Add bread and cook until golden brown and crisp on one side, about 2 minutes. Transfer toast to a medium bowl. Rub cooked sides of toast with remaining garlic clove; season with remaining 1/4 tsp. salt.",
            "Spoon mussel mixture and broth over toasts. Cut remaining lemon into wedges and serve alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b73123e063d67325cea00e1/6:4/w_274%2Ch_169/Mussels-on-Toast-recipe-08082018.jpg"
    }
}