{
    "recipe": {
        "title": "Mussels in Lager ",
        "ingredients": [
            "1/2 stick (1/4 cup) unsalted butter",
            "1 medium onion, chopped (1 cup)",
            "2 celery ribs, cut into 1/4-inch dice (1 cup)",
            "1 cup drained canned diced tomatoes (from a 14- to 15-oz can)",
            "3 garlic cloves, finely chopped",
            "1 teaspoon chopped fresh thyme",
            "1 Turkish or 1/2 California bay leaf",
            "1/2 teaspoon salt",
            "1/4 teaspoon black pepper",
            "2 cups lager such as Harp (16 oz; pour beer slowly into measuring cup; do not measure foam)",
            "2 lb mussels (preferably cultivated), scrubbed well and beards removed",
            "1 tablespoon Dijon mustard",
            "2 tablespoons heavy cream",
            "1/4 cup chopped fresh flat-leaf parsley",
            "Accompaniment: crusty bread"
        ],
        "instructions": [
            "Heat butter in a wide 5- to 6-quart heavy pot over moderately high heat until foam subsides, then cook onion, celery, tomatoes, garlic, thyme, bay leaf, salt, and pepper, stirring occasionally, until vegetables are softened, about 4 minutes. Add beer and bring just to a boil. Add mussels and cook, covered, stirring occasionally, until mussels open wide, 4 to 6 minutes, transferring them to a bowl as they open. (Discard any mussels that remain unopened after 6 minutes.) Remove pot from heat. Stir together mustard and cream in a small bowl, then add mixture along with parsley to hot broth and whisk until combined. Discard bay leaf. Serve sauce over mussels.",
            "Heat butter in a wide 5- to 6-quart heavy pot over moderately high heat until foam subsides, then cook onion, celery, tomatoes, garlic, thyme, bay leaf, salt, and pepper, stirring occasionally, until vegetables are softened, about 4 minutes.",
            "Add beer and bring just to a boil. Add mussels and cook, covered, stirring occasionally, until mussels open wide, 4 to 6 minutes, transferring them to a bowl as they open. (Discard any mussels that remain unopened after 6 minutes.) Remove pot from heat. Stir together mustard and cream in a small bowl, then add mixture along with parsley to hot broth and whisk until combined. Discard bay leaf. Serve sauce over mussels."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55a409642165ea177986cd64/6:4/w_274%2Ch_169/CN00156867-6x4.jpg"
    }
}