{
    "recipe": {
        "title": "Mustard Fennel Pork Loin with Cumberland Pan Sauce ",
        "ingredients": [
            "2 California bay leaves",
            "1 1/2 tablespoons kosher salt",
            "1 tablespoon fennel seeds",
            "1 (4- to 4 1/2-lb) center-cut boneless pork loin roast* (3 to 4 inches in diameter; preferably organic or sustainably raised)",
            "1/4 cup coarse-grain mustard",
            "2 teaspoons olive oil plus additional for greasing",
            "1/2 cup plus 1 tablespoon water",
            "1/3 cup ruby Port",
            "2/3 cup fresh orange juice",
            "1 1/2 tablespoons fresh lemon juice",
            "3 tablespoons red-currant jelly",
            "1/4 teaspoon ground ginger",
            "1/4 teaspoon salt",
            "1 tablespoon cornstarch",
            "1 tablespoon unsalted butter",
            "Accompaniment: pork cracklings",
            "an electric coffee/spice grinder; kitchen string; a 17- by 12-inch flameproof roasting pan (not glass) with a rack; an instant-read thermometer"
        ],
        "instructions": [
            "Roast pork: Discard center stem from bay leaves, then crumble leaves into grinder and pulse with kosher salt and fennel seeds until bay leaves are finely chopped. Discard any strings from loin if tied. Arrange loin, fat side up, lengthwise on a work surface. Holding knife horizontally, make a lengthwise cut about 1 1/2 inches deep along side of loin (do not cut all the way through). Open loin like a book, then pat dry inside and out. Rub 1 tablespoon mustard all over cut sides, then sprinkle with 1 teaspoon seasoned salt. Close loin and tie crosswise at 1-inch intervals with string. Rub olive oil evenly over roast, then rub with remaining mustard and sprinkle with remaining seasoned salt, pressing lightly to help adhere. Oil roasting rack, then transfer pork, fat side up, to rack set in roasting pan and marinate, loosely covered and chilled, at least 12 hours. Let pork stand at room temperature 30 minutes before roasting. While pork comes to room temperature, put oven rack in middle position and preheat oven to 450°F. Roast pork 25 minutes, then reduce oven temperature to 325°F and continue to roast until thermometer inserted diagonally 2 inches into center of meat registers 145°F, 35 to 45 minutes. Transfer pork to a platter (reserve roasting pan) and let stand, uncovered, 25 minutes.",
            "Discard center stem from bay leaves, then crumble leaves into grinder and pulse with kosher salt and fennel seeds until bay leaves are finely chopped.",
            "Discard any strings from loin if tied. Arrange loin, fat side up, lengthwise on a work surface. Holding knife horizontally, make a lengthwise cut about 1 1/2 inches deep along side of loin (do not cut all the way through). Open loin like a book, then pat dry inside and out. Rub 1 tablespoon mustard all over cut sides, then sprinkle with 1 teaspoon seasoned salt. Close loin and tie crosswise at 1-inch intervals with string. Rub olive oil evenly over roast, then rub with remaining mustard and sprinkle with remaining seasoned salt, pressing lightly to help adhere. Oil roasting rack, then transfer pork, fat side up, to rack set in roasting pan and marinate, loosely covered and chilled, at least 12 hours.",
            "Let pork stand at room temperature 30 minutes before roasting.",
            "While pork comes to room temperature, put oven rack in middle position and preheat oven to 450°F.",
            "Roast pork 25 minutes, then reduce oven temperature to 325°F and continue to roast until thermometer inserted diagonally 2 inches into center of meat registers 145°F, 35 to 45 minutes. Transfer pork to a platter (reserve roasting pan) and let stand, uncovered, 25 minutes.",
            "Make sauce while pork stands: If there is fat in roasting pan, skim all but 1 tablespoon. Straddle roasting pan across 2 burners, then add 1/2 cup water and deglaze pan by boiling over high heat, stirring and scraping up brown bits, 1 minute. Add Port and boil 1 minute. Add orange and lemon juices, jelly, ginger, and salt, and cook, whisking, until jelly is dissolved. Whisk together remaining tablespoon water and cornstarch in a cup, then add to pan and boil, whisking, 1 minute. Remove from heat and whisk in butter, then pour sauce through a fine-mesh sieve into a bowl. Discard string from pork. Slice pork and serve with sauce and cracklings.",
            "If there is fat in roasting pan, skim all but 1 tablespoon. Straddle roasting pan across 2 burners, then add 1/2 cup water and deglaze pan by boiling over high heat, stirring and scraping up brown bits, 1 minute. Add Port and boil 1 minute. Add orange and lemon juices, jelly, ginger, and salt, and cook, whisking, until jelly is dissolved. Whisk together remaining tablespoon water and cornstarch in a cup, then add to pan and boil, whisking, 1 minute. Remove from heat and whisk in butter, then pour sauce through a fine-mesh sieve into a bowl.",
            "Discard string from pork. Slice pork and serve with sauce and cracklings.",
            "*Available at some supermarkets, some specialty foods shops, and Niman Ranch (866-808-0340; nimanranch.com).",
            "*Available at some supermarkets, some specialty foods shops, and Niman Ranch (866-808-0340; nimanranch.com)."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de532f3a00aeb2f1d5344/6:4/w_274%2Ch_169/231650.jpg"
    }
}