{
    "recipe": {
        "title": "My Favorite Brisket (Not Too Gedempte Fleysch) ",
        "ingredients": [
            "2 teaspoons salt",
            "Freshly ground black pepper",
            "1 (5-pound) brisket of beef, shoulder roast of beef, chuck roast, or end of steak",
            "1 clove garlic, peeled",
            "2 tablespoons vegetable oil",
            "3 onions, peeled and diced",
            "1 (10-ounce) can tomatoes",
            "2 cups red wine",
            "2 stalks celery with the leaves, chopped",
            "1 bay leaf",
            "1 sprig thyme",
            "1 sprig rosemary",
            "1/4 cup chopped parsley",
            "6 to 8 carrots, peeled and sliced on the diagonal"
        ],
        "instructions": [
            "Preheat the oven to 325°F. Sprinkle the salt and pepper to taste over the brisket and rub with the garlic. Sear the brisket in the oil and then place, fat side up, on top of the onions in a large casserole. Cover with the tomatoes, red wine, celery, bay leaf, thyme, and rosemary.",
            "Cover and bake in the oven for about 3 hours, basting often with the pan juices.",
            "Add the parsley and carrots and bake, uncovered, for 30 minutes more, or until the carrots are cooked. To test for doneness, stick a fork in the brisket. When there is a light pull on the fork as it is removed from the meat, it is \"fork-tender.\"",
            "This dish is best prepared in advance and refrigerated so that the fat can be easily skimmed from the surface of the gravy. When ready to serve, preheat the oven to 350°F. Reheat the gravy in a pan on the stove. Some people like to strain the gravy, but Joan prefers to keep the onions because they are so delicious.",
            "Trim off all the visible fat from the cold brisket. Then place the brisket, on what was the fat side down, on a cutting board. Look for the grain-that is, the muscle lines of the brisket-and with a sharp knife, cut across the grain.",
            "Put the sliced brisket in a roasting pan. Pour the hot gravy on the meat, cover, and reheat in the oven for about 30 minutes."
        ],
        "picture_link": null,
        "color": 8617197
    }
}