{
    "recipe": {
        "title": "My Favorite Brownie ",
        "ingredients": [
            "150g (2/3 cup, packed) light brown sugar",
            "225g (1 cup plus 2 tbsp) superfine sugar",
            "225g (1 cup/2 sticks) butter",
            "150g (5.25 ounces) dark chocolate, chopped",
            "3 eggs",
            "115g (1 cup) plain flour",
            "75g (3/4 cup) cocoa powder",
            "150g (5.25 ounces/about 1 cup) chocolate chips",
            "You will also need a 20x30cm (8x12-inch) brownie tin."
        ],
        "instructions": [
            "Preheat the oven to 400°F/200°C/180°C fan/gas 6 and line a 20x30cm (8x12-inch) tin with baking parchment. Put the sugars and butter into a large saucepan and heat on medium until the butter has melted. Simmer the mixture for five minutes to allow the sugar to begin to melt, stirring all the time. It should lose its grainy appearance and the butter will combine with the sugar. Remove from the heat. Add the chopped dark chocolate to the warm sugar and butter mixture and stir it in until it is completely melted. Leave to cool to room temperature. When the mixture is cool enough to touch comfortably, beat in the eggs. Add the flour and cocoa powder before stirring briefly to combine. You don't want to overbeat the mixture or your brownies will become too 'cakey'. Fold through the chocolate chips and scrape into the prepared tin. Bake for 20–25 minutes or until the top is shiny and slightly cracked. It will feel slightly underbaked, but for gooey, sticky brownies this is perfect. Leave to cool completely in the tin, then chill in the fridge for an hour to get the ultimate, fudgy center, then cut into squares.",
            "Preheat the oven to 400°F/200°C/180°C fan/gas 6 and line a 20x30cm (8x12-inch) tin with baking parchment.",
            "Put the sugars and butter into a large saucepan and heat on medium until the butter has melted. Simmer the mixture for five minutes to allow the sugar to begin to melt, stirring all the time. It should lose its grainy appearance and the butter will combine with the sugar. Remove from the heat.",
            "Add the chopped dark chocolate to the warm sugar and butter mixture and stir it in until it is completely melted. Leave to cool to room temperature.",
            "When the mixture is cool enough to touch comfortably, beat in the eggs. Add the flour and cocoa powder before stirring briefly to combine. You don't want to overbeat the mixture or your brownies will become too 'cakey'. Fold through the chocolate chips and scrape into the prepared tin.",
            "Bake for 20–25 minutes or until the top is shiny and slightly cracked. It will feel slightly underbaked, but for gooey, sticky brownies this is perfect. Leave to cool completely in the tin, then chill in the fridge for an hour to get the ultimate, fudgy center, then cut into squares."
        ],
        "picture_link": null
    }
}