{
    "recipe": {
        "title": "Nacho Macaroni and Cheese ",
        "ingredients": [
            "2 cups small elbow macaroni",
            "1/2 cup bottled thick and chunky salsa verde (medium heat)",
            "1 cup (packed) fresh cilantro leaves",
            "3 cups (packed) coarsely grated sharp cheddar cheese (12 ounces), divided",
            "4 teaspoons all purpose flour",
            "1 cup whole milk",
            "3/4 cup heavy whipping cream",
            "1/4 teaspoon (scant) ground cloves",
            "1 cup large corn chips"
        ],
        "instructions": [
            "Preheat oven to 425°F. Cook macaroni in large saucepan of boiling salted water until tender but still firm to bite, stirring occasionally, about 6 minutes. Drain. Meanwhile, blend salsa and cilantro in processor. Toss 2 cups cheese and flour in medium bowl to coat. Bring milk, cream, and cloves to simmer in large saucepan over medium-high heat. Add cheese mixture. Whisk until sauce is smooth, about 1 minute. Mix in macaroni; season with pepper. Spread half of macaroni mixture in 11 x 7-inch baking dish. Drop half of salsa mixture over in dollops. Sprinkle with 1/2 cup cheese. Top with remaining macaroni mixture and salsa mixture. Sprinkle chips over. Top with 1/2 cup cheese. Bake until heated through, about 10 minutes.",
            "Preheat oven to 425°F. Cook macaroni in large saucepan of boiling salted water until tender but still firm to bite, stirring occasionally, about 6 minutes. Drain.",
            "Meanwhile, blend salsa and cilantro in processor. Toss 2 cups cheese and flour in medium bowl to coat.",
            "Bring milk, cream, and cloves to simmer in large saucepan over medium-high heat. Add cheese mixture. Whisk until sauce is smooth, about 1 minute. Mix in macaroni; season with pepper.",
            "Spread half of macaroni mixture in 11 x 7-inch baking dish. Drop half of salsa mixture over in dollops. Sprinkle with 1/2 cup cheese. Top with remaining macaroni mixture and salsa mixture. Sprinkle chips over. Top with 1/2 cup cheese. Bake until heated through, about 10 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9955f9a84192308a1970/6:4/w_274%2Ch_169/237298.jpg"
    }
}