{
    "recipe": {
        "title": "Nam Prik Num ",
        "ingredients": [
            "4 to 5 fresh yellow chilies or Anaheim chilies, about 5 to 6 inches long (about 1/4 pound)",
            "1/4 pound shallots, halved, or if large, quartered",
            "6 to 8 garlic cloves, halved if large",
            "1/2 pound vine-ripened cherry tomatoes",
            "2 to 3 tablespoons packed fresh coriander leaves, washed well and spun dry, and coarsely torn",
            "2 tablespoons Asian fish sauce (preferably naam pla)",
            "2 tablespoons fresh lemon juice",
            "Accompaniments: Thai Sticky Rice , sliced cucumber, and lettuce leaves"
        ],
        "instructions": [
            "Heat a dry cast-iron skillet over high heat until hot. Add chilies and reduce heat to moderately high. Dry-fry chilies, pressing down gently on chilies and turning with tongs, until blackened on all sides, 8 to 10 minutes, and transfer to a cutting board. Add shallots and garlic and reduce heat to moderately high. Dry-fry shallots and garlic, turning once, until softened and blackened, 8 to 10 minutes. Transfer shallots and garlic to a bowl to cool slightly. Dry-fry tomatoes in same manner.",
            "Wearing rubber gloves, cut off stem ends of chilies. Slice chilies lengthwise, discarding seeds (unless you want a very hot salsa). Finely chop chilies, shallots, and garlic and transfer to a ceramic or glass bowl. Discard tomato stems and skins. Finely chop tomatoes and add with any juices to chili mixture.",
            "Add coriander to taste, fish sauce, and lime juice and stir until combined (salsa will be chunky and a little soupy). Alternatively, all ingredients may be chopped together in a food processor, but the salsa has a more traditional coarse texture when chopped by hand. Let salsa stand, covered, 30 minutes to blend and mellow flavors. Salsa keeps, covered and chilled, 5 days.",
            "Serve salsa at room temperature with rice, cucumbers, and lettuce leaves for scooping.",
            "Serve salsa at room temperature with rice, cucumbers, and lettuce leaves for scooping."
        ],
        "picture_link": null,
        "color": 15672973
    }
}