{
    "recipe": {
        "title": "Nana's Brownies ",
        "ingredients": [
            "1/2 cup (1 stick) salted butter, plus more for pan",
            "1 cup all-purpose flour, plus more for pan",
            "1 1/2 cups chopped walnuts (optional)",
            "2 tablespoons unsweetened cocoa powder",
            "1 teaspoon kosher salt",
            "3/4 teaspoon baking powder",
            "3 ounces bittersweet chocolate (preferably 72% cacao)",
            "1 1/2 cups sugar",
            "3 large eggs",
            "1 teaspoon vanilla extract",
            "3 ounces bittersweet chocolate (preferably 72% cacao)",
            "4 tablespoons (1/2 stick) salted butter",
            "1 tablespoon dark rum",
            "1 tablespoon unsweetened cocoa powder",
            "1 teaspoon vanilla extract",
            "1/4 teaspoon kosher salt",
            "1/2 cup walnuts (optional)"
        ],
        "instructions": [
            "Brownies: Preheat oven to 350°F. Butter and flour an 8x8\" baking dish, shaking out excess flour. Toast walnuts, if using, on a rimmed baking sheet, tossing occasionally, until golden brown, 8–10 minutes; let cool. Increase oven temperature to 375°F. Whisk cocoa, salt, baking powder, and 1 cup flour in a medium bowl to combine and work out any lumps. Heat chocolate, sugar, and 1/2 cup butter in a large heatproof bowl set over a saucepan of simmering water (bowl should not touch water), stirring constantly, until smooth. Remove from heat and add eggs one at a time, beating vigorously with a wooden spoon to blend after each addition. Mix in vanilla, then add dry ingredients and mix until just combined. Fold in reserved walnuts (do not overmix). Scrape batter into prepared pan; smooth top. Bake until a tester inserted into the center comes out clean, 30–40 minutes. Let cool.",
            "Preheat oven to 350°F. Butter and flour an 8x8\" baking dish, shaking out excess flour. Toast walnuts, if using, on a rimmed baking sheet, tossing occasionally, until golden brown, 8–10 minutes; let cool. Increase oven temperature to 375°F.",
            "Whisk cocoa, salt, baking powder, and 1 cup flour in a medium bowl to combine and work out any lumps. Heat chocolate, sugar, and 1/2 cup butter in a large heatproof bowl set over a saucepan of simmering water (bowl should not touch water), stirring constantly, until smooth. Remove from heat and add eggs one at a time, beating vigorously with a wooden spoon to blend after each addition. Mix in vanilla, then add dry ingredients and mix until just combined. Fold in reserved walnuts (do not overmix).",
            "Scrape batter into prepared pan; smooth top. Bake until a tester inserted into the center comes out clean, 30–40 minutes. Let cool.",
            "Glaze: Heat chocolate, butter, rum, cocoa powder, vanilla, and salt in a heatproof bowl set over a saucepan of simmering water (bowl should not touch water), stirring constantly, until smooth. Pour glaze over brownies and top with walnuts, if using. Chill until glaze is set, at least 1 hour. Slice into 12 brownies.",
            "Heat chocolate, butter, rum, cocoa powder, vanilla, and salt in a heatproof bowl set over a saucepan of simmering water (bowl should not touch water), stirring constantly, until smooth.",
            "Pour glaze over brownies and top with walnuts, if using. Chill until glaze is set, at least 1 hour. Slice into 12 brownies.",
            "Do Ahead Brownies can be made 1 day ahead. Keep chilled.",
            "Brownies can be made 1 day ahead. Keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5580669874cbe9ed7c20c5a9/6:4/w_274%2Ch_169/56389656_nanas-brownies_1x1.jpg"
    }
}