{
    "recipe": {
        "title": "Napkin Rings and a Decorated Vase from Corrugated Cardboard ",
        "ingredients": [
            "Scissors",
            "1 small roll corrugated cardboard or 3 sheets approximately 10 by 15 inches (available at craft stores)",
            "1 empty cardboard roll from paper towels (optional)",
            "Double-sided tape",
            "18 to 26 strands Raffia",
            "12 to 24 small dried or fresh flowers",
            "1 glass cylinder vase (3 inches in diameter)"
        ],
        "instructions": [
            "To make a napkin ring for each guest Cut a strip of corrugated cardboard measuring 2 inches across the ridges and 10 inches down. This will create a natural roll. If available, use an empty paper towel roll as a form for making the rings. Roll the length of corrugated cardboard to form a ring, securing it inconspicuously in a couple of places with tape. Wrap 2 or 3 strands of raffia around the middle of the napkin ring several times, and then double knot it. Cut the ends so they are 1 inch long. If using dried flowers, cut the stems so they are 1½ inches long and slide them through the raffia to secure them. If using fresh flowers, wait until 1 hour before guests arrive to trim the stems and attach them to the napkin rings.",
            "Cut a strip of corrugated cardboard measuring 2 inches across the ridges and 10 inches down. This will create a natural roll. If available, use an empty paper towel roll as a form for making the rings. Roll the length of corrugated cardboard to form a ring, securing it inconspicuously in a couple of places with tape. Wrap 2 or 3 strands of raffia around the middle of the napkin ring several times, and then double knot it. Cut the ends so they are 1 inch long. If using dried flowers, cut the stems so they are 1½ inches long and slide them through the raffia to secure them. If using fresh flowers, wait until 1 hour before guests arrive to trim the stems and attach them to the napkin rings.",
            "To decorate the vase Cut 1 piece of corrugated cardboard measuring 3 inches across the ridges and 15 inches down the ridges. This will create a natural roll. Roll the length of corrugated cardboard around the center of the vase. Secure it inconspicuously with tape. Wrap 2 or 3 strands of raffia several times around the middle and then double knot it. Cut the ends so they are 1 inch long or tie a bow and trim the ends. Slip 2 dried flowers, with the stems cut 1 1/2-inch-long, through the raffia to secure them. Arrange flowers in the vase.",
            "Cut 1 piece of corrugated cardboard measuring 3 inches across the ridges and 15 inches down the ridges. This will create a natural roll. Roll the length of corrugated cardboard around the center of the vase. Secure it inconspicuously with tape. Wrap 2 or 3 strands of raffia several times around the middle and then double knot it. Cut the ends so they are 1 inch long or tie a bow and trim the ends. Slip 2 dried flowers, with the stems cut 1 1/2-inch-long, through the raffia to secure them. Arrange flowers in the vase."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a62362fa7a9917c25a38/6:4/w_274%2Ch_169/355413_hires.jpg"
    }
}