{
    "recipe": {
        "title": "Naturally Dyed Pickled Easter Eggs ",
        "ingredients": [
            "6 hard-boiled eggs, peeled",
            "1 cup distilled white vinegar",
            "2 teaspoons kosher salt",
            "2 teaspoons sugar",
            "1/2 small beet, peeled, quartered",
            "1 shallot, sliced",
            "1 bay leaf",
            "1 (1/2-inch) piece ginger, thinly sliced",
            "2 teaspoons black peppercorns",
            "1/4 teaspoon turmeric powder",
            "1 cup chopped purple cabbage",
            "1 teaspoon caraway seeds",
            "2 teaspoons baking soda, divided",
            "1 medium carrot, peeled, sliced",
            "2 garlic cloves",
            "1 sliver peeled beet",
            "Small pinch of saffron"
        ],
        "instructions": [
            "Place eggs in a medium glass heatproof jar. Cook vinegar, salt, sugar, and 1 cup water in a small pot over high heat, stirring, until salt and sugar dissolve.",
            "To make pink pickled eggs: Add beet, shallot, and bay leaf and bring to a boil. Remove from heat and let cool slightly. Pour over eggs, stir, and chill at least 3 hours or up to overnight for a darker shade of pink.",
            "Add beet, shallot, and bay leaf and bring to a boil. Remove from heat and let cool slightly. Pour over eggs, stir, and chill at least 3 hours or up to overnight for a darker shade of pink.",
            "To make yellow pickled eggs: Add ginger, peppercorns, and turmeric and bring to a boil. Remove from heat and let cool slightly. Pour over eggs, stir, and chill at least 3 hours or up to overnight for a darker shade of yellow.",
            "Add ginger, peppercorns, and turmeric and bring to a boil. Remove from heat and let cool slightly. Pour over eggs, stir, and chill at least 3 hours or up to overnight for a darker shade of yellow.",
            "To make purple pickled eggs: Add cabbage and caraway seeds and bring to a boil. Remove from heat and let cool slightly. Pour over eggs. Add 1 tsp. baking soda and stir until foaming subsides, then stir in remaining 1 tsp. baking soda. Chill at least 3 hours or up to overnight for a darker shade of purple.",
            "Add cabbage and caraway seeds and bring to a boil. Remove from heat and let cool slightly. Pour over eggs. Add 1 tsp. baking soda and stir until foaming subsides, then stir in remaining 1 tsp. baking soda. Chill at least 3 hours or up to overnight for a darker shade of purple.",
            "To make orange pickled eggs: Add carrot, garlic, beet, and saffron and bring to a boil. Remove from heat and let cool slightly. Pour over eggs, stir, and chill at least 3 hours or up to overnight for a darker shade of orange.",
            "Add carrot, garlic, beet, and saffron and bring to a boil. Remove from heat and let cool slightly. Pour over eggs, stir, and chill at least 3 hours or up to overnight for a darker shade of orange.",
            "Do Ahead Pickled eggs can be made 5 days ahead. Remove from pickling brine once desired color has been reached, transfer to an airtight container, and chill.",
            "Pickled eggs can be made 5 days ahead. Remove from pickling brine once desired color has been reached, transfer to an airtight container, and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56d0acbfca1c2b7e6b6e5f36/6:4/w_274%2Ch_169/EP_02242016_Natural-Dyed_easter_egg_recipe.jpg"
    }
}