{
    "recipe": {
        "title": "Nectarines and Peaches with Lavender Syrup ",
        "ingredients": [
            "1/2 cup pecans",
            "3 tablespoons honey",
            "2 tablespoons plus 1/4 cup sugar",
            "1 sprig rosemary",
            "1 tablespoon dried lavender buds",
            "Kosher salt",
            "3 ripe white or yellow nectarines, cut into wedges",
            "3 ripe white or yellow peaches, cut into wedges",
            "2 teaspoons finely grated lemon zest",
            "1/2 cup crumbled Gorgonzola, divided"
        ],
        "instructions": [
            "Preheat oven to 350°F. Toast pecans on a rimmed baking sheet, stirring once, until slightly darkened in color and fragrant, 10–12 minutes. Let cool.",
            "Meanwhile, bring honey, 2 Tbsp. sugar, and 3 Tbsp. water to a simmer in a small saucepan over medium-high heat, swirling occasionally until sugar is dissolved. Add rosemary and lavender and remove from heat. Let sit 5 minutes. Remove rosemary and let syrup cool.",
            "Bring a pinch of salt, remaining 1/4 cup sugar, and 1 Tbsp. water to a boil in another small saucepan, stirring to dissolve sugar. Cook (without stirring) until sugar turns a light amber color, about 2 minutes. Add pecans and cook, stirring constantly, until nuts are coated and caramel is a dark amber color, about 2 minutes. Immediately scrape out onto a parchment-lined baking sheet and spread out into a single layer; let cool. Break into smaller pieces.",
            "Toss nectarines, peaches, lemon zest, and 1/4 cup syrup in a large bowl to coat. Let sit 5 minutes. Gently toss in half of Gorgonzola and half of candied pecans; taste and season with salt if needed. Transfer to a platter. Top with remaining Gorgonzola and candied pecans.",
            "Do Ahead Syrup can be made 1 month ahead; cover and chill. Pecans can be candied 1 day ahead; store airtight at room temperature.",
            "Syrup can be made 1 month ahead; cover and chill. Pecans can be candied 1 day ahead; store airtight at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5949ac16d918bd139d8cccf8/6:4/w_274%2Ch_169/nectarines-and-peaches-with-lavender-syrup-recipe-BA-062017.jpg",
        "color": 1301008
    }
}