{
    "recipe": {
        "title": "Neo-Neapolitan Bombe ",
        "ingredients": [
            "2 pints coconut ice cream (not dairy-free)",
            "2 pints pistachio ice cream",
            "2 pints strawberry ice cream",
            "3/4 cup freeze-dried strawberries, finely chopped",
            "3/4 cup raw pistachios, finely chopped"
        ],
        "instructions": [
            "Line a large bowl with a curved bottom (at least 12-cup capacity; the stainless-steel bowl of a stand mixer is perfect) with plastic wrap, leaving generous overhang, and place in freezer. Peel away sides of containers from coconut ice cream. Cut ice cream into 2\" pieces and place in a medium bowl. Repeat with pistachio and strawberry ice creams, placing each in a separate medium bowl. Let sit until slightly softened, about 5 minutes, then stir each with a clean wooden spoon or large rubber spatula until the consistency of thick cake batter.",
            "Remove chilled bowl from freezer. Scoop about 1/2 cup of each ice cream into another medium bowl and fold a couple of times with a rubber spatula to swirl together (do not overmix; you want fat, marbled ribbons). Scrape into chilled bowl and press down to mold into bowl. Repeat process until you’ve used all of the ice cream (if it starts to melt, freeze until firm, about 5 minutes, before proceeding). Smooth top, then bring plastic up and over bombe, pressing against ice cream to compact. Freeze until hard, at least 12 hours.",
            "Combine freeze-dried strawberries and pistachios in a fine-mesh sieve and shake over a bowl to remove any dust or tiny particles; set aside larger pieces for topping. Remove bombe from freezer and remove plastic from over top of bowl of ice cream. Set a small plate or cake round over bowl opening and invert bowl onto plate. Lift off bowl and peel off plastic from bombe. Sprinkle reserved strawberry-pistachio mixture over bombe, covering all exposed ice cream and pressing to adhere.",
            "Cut bombe into wedges with a hot dry knife to serve (run knife under hot water and wipe dry between slices).",
            "Do Ahead Bombe (without strawberry-pistachio coating) can be made 1 week ahead. Keep frozen.",
            "Bombe (without strawberry-pistachio coating) can be made 1 week ahead. Keep frozen."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57ab9c1e5dc5a16b3e65cb59/6:4/w_274%2Ch_169/strawberry-pistachio-ice-cream-bombe-ba-081016.jpg",
        "color": 4393973
    }
}