{
    "recipe": {
        "title": "New England Clam and Corn Chowder with Herbs ",
        "ingredients": [
            "6 thick bacon slices, cut crosswise into 1/2-inch pieces",
            "1 large onion, chopped",
            "2 large carrots, peeled, chopped",
            "1 1/4 teaspoons dried thyme",
            "3/4 teaspoon crushed dried rosemary",
            "3 tablespoons all purpose flour",
            "4 cups whole milk",
            "1 8-ounce unpeeled white-skinned potato, cut into 1/2-inch cubes",
            "3 6 1/2-ounce cans chopped clams in juice",
            "1 8 3/4-ounce can corn kernels, drained",
            "Chopped fresh parsley"
        ],
        "instructions": [
            "Cook bacon in large saucepan over medium heat until crisp. Transfer bacon to paper towels to drain. Pour out all but 3 tablespoons drippings from pan. Add next 4 ingredients to pan; sprinkle with salt and pepper. Sauté until vegetables are crisp-tender, about 5 minutes. Sprinkle flour over; stir 1 to 2 minutes. Gradually add milk to pan, stirring constantly. Bring to boil; reduce heat to medium and cook until slightly thickened, stirring often, about 5 minutes. Add potatoes, clams with juice, and drained corn. Bring to boil; reduce heat to medium-low and simmer until potatoes are tender, stirring often, about 10 minutes. Season to taste with salt and pepper. Divide soup among bowls, sprinkle with bacon and parsley, and serve.",
            "Cook bacon in large saucepan over medium heat until crisp. Transfer bacon to paper towels to drain. Pour out all but 3 tablespoons drippings from pan. Add next 4 ingredients to pan; sprinkle with salt and pepper. Sauté until vegetables are crisp-tender, about 5 minutes. Sprinkle flour over; stir 1 to 2 minutes. Gradually add milk to pan, stirring constantly. Bring to boil; reduce heat to medium and cook until slightly thickened, stirring often, about 5 minutes. Add potatoes, clams with juice, and drained corn. Bring to boil; reduce heat to medium-low and simmer until potatoes are tender, stirring often, about 10 minutes. Season to taste with salt and pepper.",
            "Divide soup among bowls, sprinkle with bacon and parsley, and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d7995f3a00aeb2f1cb82f/6:4/w_274%2Ch_169/350962_hires.jpg"
    }
}