{
    "recipe": {
        "title": "New-Wave Rocky Road ",
        "ingredients": [
            "26 ounces bittersweet (not unsweetened) or semisweet chocolate, coarsely chopped",
            "2 teaspoons grated orange peel",
            "3/4 cup walnut halves",
            "3/4 cup chopped dried tart cherries or dried cranberries",
            "3 tablespoons finely chopped crystallized ginger",
            "22 large marshmallows",
            "40 paper or foil candy cups"
        ],
        "instructions": [
            "Line 11x7-inch baking pan with foil, extending over sides. Place chocolate in medium bowl. Set over saucepan of simmering water (do not allow bottom of bowl to touch water). Stir until melted and candy thermometer registers 115°F. Remove bowl from over water. Mix in orange peel, then next 3 ingredients. Fold in marshmallows. Pour into prepared pan, spreading evenly. Chill until chocolate is just firm enough to cut, about 1 hour. Using foil as aid, lift candy from pan. Fold down foil sides. Cut candy crosswise into 8 strips. Cut lengthwise into 5 strips, forming total of 40 squares. Transfer rocky road squares to paper or foil candy cups. (Can be made 2 weeks ahead. Cover and refrigerate. Let stand at room temperature at least 30 minutes and up to 1 hour before serving.)",
            "Line 11x7-inch baking pan with foil, extending over sides. Place chocolate in medium bowl. Set over saucepan of simmering water (do not allow bottom of bowl to touch water). Stir until melted and candy thermometer registers 115°F. Remove bowl from over water. Mix in orange peel, then next 3 ingredients. Fold in marshmallows. Pour into prepared pan, spreading evenly. Chill until chocolate is just firm enough to cut, about 1 hour.",
            "Using foil as aid, lift candy from pan. Fold down foil sides. Cut candy crosswise into 8 strips. Cut lengthwise into 5 strips, forming total of 40 squares. Transfer rocky road squares to paper or foil candy cups. (Can be made 2 weeks ahead. Cover and refrigerate. Let stand at room temperature at least 30 minutes and up to 1 hour before serving.)"
        ],
        "picture_link": null
    }
}