{
    "recipe": {
        "title": "Niçoise Toast ",
        "ingredients": [
            "4 large eggs",
            "Juice from 1 lemon",
            "1 lb. tomatoes, cut into bite-size pieces",
            "1 medium shallot, thinly sliced",
            "A pinch of sugar",
            "Kosher salt",
            "1/2 cup mayonnaise",
            "1 small garlic clove, finely grated",
            "1 1/2 tsp. sherry vinegar or red wine vinegar",
            "1/2 tsp. hot smoked Spanish paprika",
            "4 Tbsp. extra-virgin olive oil, plus more for drizzling",
            "4 slices sourdough bread",
            "2 (6–7-oz.) jars oil-packed tuna, drained",
            "Flaky sea salt",
            "Freshly ground black pepper",
            "1/2 cup torn mixed tender herbs (such as dill, parsley, basil, and/or tarragon)",
            "1/4 cup oil-cured black olives, pitted, flesh torn"
        ],
        "instructions": [
            "Bring a medium saucepan of water to a boil. Gently lower eggs into pot with a slotted spoon and cook 8 minutes. Transfer to a bowl of ice water and let cool. Peel eggs; set aside. Toss lemon juice, tomatoes, shallot, sugar, and a pinch of kosher salt in a medium bowl. Whisk mayonnaise, garlic, vinegar, and paprika in a small bowl; season with kosher salt. Heat 2 Tbsp. oil in a large skillet over medium until shimmering. Add 2 slices of bread and cook, adjusting heat as needed, until bottoms are deeply browned, about 3 minutes. Transfer to a platter and sprinkle fried side with kosher salt. Repeat with another 2 Tbsp. oil and remaining slices of bread. Spread mayonnaise over toasted side of bread. Top with tuna and tomato mixture; spoon some of the juices over. Tear each egg into 3 or 4 pieces and arrange on top; season with sea salt and pepper. Scatter herbs and olives over; drizzle with oil.",
            "Bring a medium saucepan of water to a boil. Gently lower eggs into pot with a slotted spoon and cook 8 minutes. Transfer to a bowl of ice water and let cool. Peel eggs; set aside.",
            "Toss lemon juice, tomatoes, shallot, sugar, and a pinch of kosher salt in a medium bowl.",
            "Whisk mayonnaise, garlic, vinegar, and paprika in a small bowl; season with kosher salt.",
            "Heat 2 Tbsp. oil in a large skillet over medium until shimmering. Add 2 slices of bread and cook, adjusting heat as needed, until bottoms are deeply browned, about 3 minutes. Transfer to a platter and sprinkle fried side with kosher salt. Repeat with another 2 Tbsp. oil and remaining slices of bread.",
            "Spread mayonnaise over toasted side of bread. Top with tuna and tomato mixture; spoon some of the juices over. Tear each egg into 3 or 4 pieces and arrange on top; season with sea salt and pepper. Scatter herbs and olives over; drizzle with oil.",
            "Do Ahead Paprika mayonnaise can be made 2 days ahead. Cover and chill.",
            "Paprika mayonnaise can be made 2 days ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b16fafd9f98d2589e7a2069/6:4/w_274%2Ch_169/tuna-nicoise-toast-recipe-BA-060518.jpg"
    }
}