{
    "recipe": {
        "title": "North African Chicken and Spinach Stew ",
        "ingredients": [
            "1 whole chicken (about 2 1/2 pounds)",
            "3 celery stalks, roughly chopped",
            "2 carrots, roughly chopped",
            "1 medium onion, roughly chopped",
            "3 bay leaves",
            "Sea salt",
            "10 garlic cloves",
            "6 tablespoons (3/4 stick) salted butter",
            "1/2 teaspoon freshly cracked black pepper",
            "1 cinnamon stick",
            "10 ounces baby spinach, chopped (about 8 cups)",
            "1 tablespoon granulated onion",
            "1 tablespoon granulated garlic",
            "1 tablespoon paprika",
            "1/4 teaspoon cayenne pepper",
            "1 tablespoon dried oregano",
            "Cooked basmati rice, for serving",
            "Lemon wedges, for serving (optional)"
        ],
        "instructions": [
            "PLACE the chicken in a large pot and cover it with water. Add the celery, carrot, onion, and bay leaves and season with 1 tablespoon salt. Cover and bring to a boil, then reduce the heat and simmer for 45 minutes.",
            "REMOVE the chicken to a deep dish or bowl and let it drain. Strain the stock into a large bowl or pan and set aside. Transfer the vegetables from the strainer to a blender (remove the bay leaves), add the garlic, and puree until completely smooth. Set aside.",
            "TO make the spinach stew, in a large saucepan over medium heat, melt 4 tablespoons of the butter. When it’s bubbling slightly, add the vegetable puree. Warm it through, about 2 minutes. Season with 1 teaspoon salt, the pepper, and the cinnamon stick, then add the spinach and cook until wilted, about 2 minutes. Add 1 1/2 cups of the reserved stock and bring to a simmer. Cook to let the flavors develop, about 15 minutes. Reduce the heat and keep warm (remove the cinnamon stick before serving).",
            "MEANWHILE, when the chicken is cool enough to handle, pat it completely dry and break it down into 8 pieces: 2 thighs, 2 wings, and 2 breasts, then split the breasts in half. Place the chicken pieces in a large dish. Combine the granulated onion, granulated garlic, paprika, cayenne, oregano, and 1 teaspoon salt in a small bowl. Completely coat the chicken in this dry rub.",
            "MELT the remaining 2 tablespoons butter in a large cast-iron skillet over high heat. Add the chicken pieces and sear until charred in spots, about 4 minutes. Flip and cook on the other side, 4 minutes. Remove from the heat.",
            "SERVE the chicken with rice and a generous ladle of spinach stew. Squeeze lemon over the plate if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ae38af346a4784fa17cec19/6:4/w_274%2Ch_169/north-african-chicken-stew-recipe-HC-042718.jpg"
    }
}