{
    "recipe": {
        "title": "Nutter Butter® Cookies ",
        "ingredients": [
            "2 cups (9 ounces) all-purpose flour, such as Gold Medal, plus more for dusting",
            "6 tablespoons (3 ounces) unsalted butter, creamy and soft—about 68°F",
            "1/3 cup (3 ounces) creamy peanut butter, such as Skippy",
            "1 cup (7 ounces) sugar",
            "1/4 teaspoon baking soda",
            "1/4 teaspoon Diamond Crystal kosher salt (half as much if iodized)",
            "2 large egg whites (1/4 cup (2 1/4 ounces))",
            "6 tablespoons | 3 ounces unsalted butter, creamy and soft—about 68°F",
            "1/3 cup | 3 ounces creamy peanut butter, such as Skippy",
            "1 tablespoon | 3/4 ounce honey",
            "1 teaspoon vanilla extract",
            "1/4 teaspoon Diamond Crystal kosher salt (half as much if iodized)",
            "1 cup | 4 ounces organic powdered sugar, sifted"
        ],
        "instructions": [
            "Sift flour (if using a cup measure, spoon into the cup and level with a knife before sifting).",
            "Combine butter, peanut butter, sugar, baking soda, and salt in the bowl of a stand mixer fitted with a paddle attachment. Mix on low speed to moisten, then increase to medium and cream until fluffy and light, about 5 minutes. Beat the whites with a fork until foamy and thin, then add to the butter and sugar in four additions, letting each incorporate before adding the next. Scrape the bowl and beater with a flexible spatula, then resume mixing on low. Sprinkle in the flour, and mix to form a soft dough.",
            "Knead against the sides of the bowl to form a smooth ball, divide in half, and flatten into discs. Use immediately, or wrap in plastic and refrigerate for up to 1 week; soften for 30 minutes at room temperature, then knead on a bare work surface until pliable and smooth.",
            "Make the wafers: Adjust oven rack to middle position and preheat to 350°F. On a flour-dusted surface, roll the dough until 1/2 inch thick. Sprinkle with flour, flip, sprinkle again, and roll just shy of 1/8 inch. Slide an offset spatula under the dough to loosen. Cut into \"peanuts\" with a 3-inch bikini cookie cutter (see Cooks' Note) or into simple 2 1/4-inch rounds and arrange on a parchment-lined aluminum baking sheet, leaving 1/4 inch between them. If you like, gently score the cutouts with a bench scraper to make a diamond pattern. Gather scraps, re-roll, and cut as before. The remaining scraps can also be baked, to grind for crumbs. Bake until wafers are firm and dry, about 15 minutes. Cool completely on the baking sheet. Use immediately, or transfer to an airtight container and store for up to a week at room temperature or a month in the fridge.",
            "Adjust oven rack to middle position and preheat to 350°F. On a flour-dusted surface, roll the dough until 1/2 inch thick. Sprinkle with flour, flip, sprinkle again, and roll just shy of 1/8 inch. Slide an offset spatula under the dough to loosen. Cut into \"peanuts\" with a 3-inch bikini cookie cutter (see Cooks' Note) or into simple 2 1/4-inch rounds and arrange on a parchment-lined aluminum baking sheet, leaving 1/4 inch between them. If you like, gently score the cutouts with a bench scraper to make a diamond pattern. Gather scraps, re-roll, and cut as before. The remaining scraps can also be baked, to grind for crumbs.",
            "Bake until wafers are firm and dry, about 15 minutes. Cool completely on the baking sheet. Use immediately, or transfer to an airtight container and store for up to a week at room temperature or a month in the fridge.",
            "Make the creme: Combine butter, peanut butter, honey, vanilla, and salt in the bowl of a stand mixer fitted with a paddle attachment. Mix on low speed to moisten, then sprinkle in the powdered sugar a little at a time. Once fully incorporated, increase to medium and beat until the creme is soft and light, about 5 minutes, pausing to scrape the bowl and beater halfway through. Transfer to a pastry bag fitted with a 1/2-inch plain tip.",
            "Combine butter, peanut butter, honey, vanilla, and salt in the bowl of a stand mixer fitted with a paddle attachment. Mix on low speed to moisten, then sprinkle in the powdered sugar a little at a time. Once fully incorporated, increase to medium and beat until the creme is soft and light, about 5 minutes, pausing to scrape the bowl and beater halfway through. Transfer to a pastry bag fitted with a 1/2-inch plain tip.",
            "Sandwich the cookies: Pipe 1/4 ounce (2 teaspoons) creme into the center of half of the rounds or 1/8 ounce (1 teaspoon) into each \"lobe\" of a peanut. Sandwich with the remaining wafers; there are extras to account for breakage. Transfer to an airtight container and refrigerate until the filling has set, about 15 minutes. Store up to 1 week at room temperature or up to a month in the fridge; serve at room temperature.",
            "Pipe 1/4 ounce (2 teaspoons) creme into the center of half of the rounds or 1/8 ounce (1 teaspoon) into each \"lobe\" of a peanut. Sandwich with the remaining wafers; there are extras to account for breakage. Transfer to an airtight container and refrigerate until the filling has set, about 15 minutes. Store up to 1 week at room temperature or up to a month in the fridge; serve at room temperature.",
            "Mix it up! Cookie Crumbs: Grind broken wafers and scraps in a food processor until fine; freeze in a quart zip-top bag for up to 6 months. Use to replace the graham cracker crumbs in Souffléed Cheesecake or bake into a crumb crust. Vegan: Replace the butter in the dough and filling with an equal amount of refined coconut oil and omit the egg whites in the dough. Refrigerate for 15 minutes before rolling the dough. Gluten-Free: Replace the all-purpose flour with 4 ounces (1 1/4 cups) oat flour, 3 ounces (2/3 cup) white rice flour, and 2 ounces (1/2 cup) coconut flour.",
            "Cookie Crumbs: Grind broken wafers and scraps in a food processor until fine; freeze in a quart zip-top bag for up to 6 months. Use to replace the graham cracker crumbs in Souffléed Cheesecake or bake into a crumb crust.",
            "Vegan: Replace the butter in the dough and filling with an equal amount of refined coconut oil and omit the egg whites in the dough. Refrigerate for 15 minutes before rolling the dough.",
            "Gluten-Free: Replace the all-purpose flour with 4 ounces (1 1/4 cups) oat flour, 3 ounces (2/3 cup) white rice flour, and 2 ounces (1/2 cup) coconut flour."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a21975fafe8825b3fcadcb0/6:4/w_274%2Ch_169/homemade-nutter-butter-cookies-stella-parks-bravetart-recipe-120117.jpg"
    }
}