{
    "recipe": {
        "title": "Oatmeal Ice Cream Cookie Sandwiches ",
        "ingredients": [
            "3/4 cup (1 1/2 sticks) unsalted butter",
            "1 1/2 ounces store-bought waffle cones, lightly crushed",
            "1 1/2 cups old-fashioned oats",
            "2 tablespoons all-purpose flour",
            "1 1/2 teaspoons kosher salt",
            "3/4 cup (packed) light brown sugar",
            "1 large egg yolk",
            "2 teaspoons vanilla extract",
            "4 pints ice cream (any flavors)"
        ],
        "instructions": [
            "Make the Cookies Preheat oven to 350°F. Cook butter in a medium saucepan over medium heat, swirling often, until it foams, then browns, 5–8 minutes. Scrape brown butter and toasty solids into a heatproof measuring glass and let cool. Process waffle cones, oats, flour, and salt in a food processor in long pulses until oats are broken up and cones are finely ground. Add brown sugar and pulse to combine. Whisk egg yolk, vanilla, and 2 Tbsp. water in a small bowl. With the motor running, slowly drizzle into food processor, then stream in brown butter; process until dough forms a ball around the blade. Portion out slightly rounded tablespoonfuls of dough to make 26 balls (each should weigh about 3/4 oz.). Roll balls between your palms to smooth and divide between 2 parchment-lined rimmed baking sheets, spacing 3\" apart (the cookies will spread as they bake). Cover with another sheet of parchment paper and use the bottom of a glass to flatten each into a 2 1/2\" round. Bake cookies, rotating sheets front to back and top to bottom halfway through, until golden all over and browned around the edges, 12–15 minutes. Let cool on baking sheets; use a thin metal spatula to loosen cookies from parchment. Turn half of cookies over (you’ll have 2 extra).",
            "Preheat oven to 350°F. Cook butter in a medium saucepan over medium heat, swirling often, until it foams, then browns, 5–8 minutes. Scrape brown butter and toasty solids into a heatproof measuring glass and let cool.",
            "Process waffle cones, oats, flour, and salt in a food processor in long pulses until oats are broken up and cones are finely ground. Add brown sugar and pulse to combine. Whisk egg yolk, vanilla, and 2 Tbsp. water in a small bowl. With the motor running, slowly drizzle into food processor, then stream in brown butter; process until dough forms a ball around the blade.",
            "Portion out slightly rounded tablespoonfuls of dough to make 26 balls (each should weigh about 3/4 oz.). Roll balls between your palms to smooth and divide between 2 parchment-lined rimmed baking sheets, spacing 3\" apart (the cookies will spread as they bake). Cover with another sheet of parchment paper and use the bottom of a glass to flatten each into a 2 1/2\" round.",
            "Bake cookies, rotating sheets front to back and top to bottom halfway through, until golden all over and browned around the edges, 12–15 minutes. Let cool on baking sheets; use a thin metal spatula to loosen cookies from parchment. Turn half of cookies over (you’ll have 2 extra).",
            "Prepare Ice Cream Remove 2 pints of ice cream (same flavor) from containers (just peel away container if it’s paper, or use a rubber spatula to help slide ice cream out intact if container is plastic). Cut ice cream into 2” pieces and place in a large bowl. Let sit until slightly softened, about 5 minutes, then stir with a wooden spoon or a large rubber spatula until the consistency of thick cake batter.",
            "Remove 2 pints of ice cream (same flavor) from containers (just peel away container if it’s paper, or use a rubber spatula to help slide ice cream out intact if container is plastic). Cut ice cream into 2” pieces and place in a large bowl. Let sit until slightly softened, about 5 minutes, then stir with a wooden spoon or a large rubber spatula until the consistency of thick cake batter.",
            "Assembly Using a 4-oz. ice cream scoop or 1/2-cup measuring cup, and working one at a time or in small batches, scoop out large domes of ice cream onto upside-down cookies. Top each with a right-side-up cookie, then press down gently until ice cream extends to the edges. Transfer sandwiches to a rimmed baking sheet set in the freezer as you work. Repeat softening process with remaining 2 pints of ice cream and assemble remaining sandwiches. Freeze sandwiches until ice cream is hard, about 2 hours. Cover tray with plastic wrap and freeze at least another 8 hours to let cookies soften.",
            "Using a 4-oz. ice cream scoop or 1/2-cup measuring cup, and working one at a time or in small batches, scoop out large domes of ice cream onto upside-down cookies. Top each with a right-side-up cookie, then press down gently until ice cream extends to the edges. Transfer sandwiches to a rimmed baking sheet set in the freezer as you work. Repeat softening process with remaining 2 pints of ice cream and assemble remaining sandwiches.",
            "Freeze sandwiches until ice cream is hard, about 2 hours. Cover tray with plastic wrap and freeze at least another 8 hours to let cookies soften.",
            "Do Ahead Cookies can be baked 1 week ahead; transfer to a resealable plastic freezer bag and freeze. Sandwiches can be assembled 5 days ahead; keep frozen.",
            "Cookies can be baked 1 week ahead; transfer to a resealable plastic freezer bag and freeze. Sandwiches can be assembled 5 days ahead; keep frozen."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5977608c58694170ada965bc/6:4/w_274%2Ch_169/cookie-sandwiches.jpg"
    }
}