{
    "recipe": {
        "title": "Oatmeal Chocolate Chunk Lactation Cookies ",
        "ingredients": [
            "3 cups old-fashioned oats",
            "1 cup whole wheat flour",
            "3/4 cup all-purpose flour",
            "5 Tbsp. brewer’s yeast powder",
            "1/4 cup ground flaxseed",
            "3 Tbsp. white chia seeds",
            "1 tsp. ground cinnamon",
            "1/2 tsp. aluminum-free baking powder",
            "1/2 tsp. baking soda",
            "1/4 tsp. fine sea salt",
            "1 1/4 cups sugar",
            "6 Tbsp. virgin coconut oil, melted, cooled slightly",
            "6 Tbsp. unsalted butter, room temperature",
            "2 large eggs",
            "2 1/2 tsp. vanilla extract",
            "6 Tbsp. unsweetened applesauce",
            "1 1/2 cups semisweet chocolate chips",
            "3/4 cup dried cranberries (optional)",
            "3/4 cup unsweetened coconut flakes (optional)",
            "Nonstick vegetable oil spray",
            "Flaky sea salt"
        ],
        "instructions": [
            "Mix oats, whole wheat flour, all-purpose flour, yeast powder, flaxseed, chia seeds, cinnamon, baking powder, baking soda, and 1/4 tsp. fine sea salt in a large bowl.",
            "Using an electric mixer on medium speed, beat sugar, coconut oil, and butter in another large bowl, scraping down sides as needed, until fluffy, about 5 minutes. Add eggs and vanilla and beat until incorporated, about 4 minutes. Add applesauce and beat for just a few seconds (it will break the mixture slightly and look lumpy; that’s okay).",
            "Reduce mixer speed to low. Gradually add dry ingredients and beat just to combine. Using a wooden spoon, stir in chocolate chips, cranberries, and coconut flakes (if using). Chill dough at least 1 hour and up to overnight.",
            "Preheat oven to 350°F. Line a rimmed baking sheet with parchment paper. Coat parchment with nonstick spray.",
            "Using a 1/4-cup (2.5-oz.) scoop, portion dough on prepared baking sheet, spacing 1\"–2\" apart (you’ll get 6 per sheet). Flatten top of each cookie with your hand, then season lightly with flaky sea salt. Bake cookies until golden brown, 12–14 minutes.",
            "Let cookies cool on baking sheets about 5 minutes, then transfer to a wire rack and let cool completely (if moved immediately, they will crack and start to break apart). Repeat with remaining dough.",
            "Do Ahead: Cookies can be made 5 days ahead. Store in an airtight container at room temperature, or place in a freezer-safe bag and freeze up to 1 month. Reheat by microwaving on low about 1 minute."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aa9ae132133066cf9403eb7/6:4/w_274%2Ch_169/A-Breastfeeding-Mama%E2%80%99s-Snacking-Survival-Guide-13032018.jpg",
        "color": 3645724
    }
}