{
    "recipe": {
        "title": "Oil-Poached Tuna Salad ",
        "ingredients": [
            "1 cup dried flageolet or navy beans, soaked overnight, drained, or one 15-ounce can navy beans, rinsed",
            "Kosher salt",
            "1 pound green and/or wax beans",
            "3 cups olive oil",
            "2 sprigs rosemary",
            "2 garlic cloves",
            "4 4-ounce bigeye or albacore tuna steaks (about 1\" thick)",
            "Freshly ground black pepper",
            "4 anchovies packed in oil, drained, finely chopped",
            "1 small shallot, finely chopped",
            "1/4 cup chopped fresh flat-leaf parsley",
            "1/4 cup (or more) fresh lemon juice",
            "1 teaspoon Dijon mustard",
            "2 tablespoons chopped fresh dill plus small sprigs for serving",
            "1 cup small Sun Gold or cherry tomatoes, halved",
            "3/4 cup Kalamata olives, pitted, halved",
            "A deep-fry thermometer"
        ],
        "instructions": [
            "Bring flageolet beans and 4 cups water to a boil in a large saucepan, reduce heat, and simmer until beans are tender, 50-60 minutes; season with salt. Let beans cool; drain. Transfer to a medium bowl. (Do not cook canned beans.)",
            "Cook green beans in another large saucepan of boiling salted water until crisp-tender, about 5 minutes. Drain and transfer to a colander set in a bowl of ice water. Let cool; drain and set aside. Wipe saucepan dry.",
            "Heat oil, rosemary, and garlic in same saucepan over medium-low heat until deep-fry thermometer registers 160°F. Season tuna with salt and pepper and cook in oil until opaque except for a bit of pink in the center, about 4 minutes per side. Using a slotted spatula, transfer tuna to a plate. Let poaching oil cool, then remove rosemary and garlic. Set aside 1/4 cup oil.",
            "Whisk anchovies, shallot, parsley, lemon juice, mustard, chopped dill, and reserved poaching oil in a small bowl; season with salt, pepper, and more lemon juice, if desired. Add some vinaigrette to bowl with flageolet beans and toss to coat.",
            "Break tuna into large pieces and arrange on a platter with flageolet and green beans, tomatoes, and olives. Top with a few dill sprigs and serve with remaining vinaigrette alongside.",
            "DO AHEAD: Tuna can be made 1 day ahead. Return fish to cooled oil, cover, and chill. Serve at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54af4c2ec4a891cc44ccd7cd/6:4/w_274%2Ch_169/51178990_tuna-salad_1x1.jpg",
        "color": 8465267
    }
}