{
    "recipe": {
        "title": "Okra and Lamb Khoresht ",
        "ingredients": [
            "350 g/12 oz okra",
            "300 g/11 oz potatoes",
            "1 medium onion",
            "4 large cloves of garlic",
            "1-2 dried or fresh chillies",
            "400 g/14 oz leg of lamb",
            "3 tablespoons vegetable oil",
            "1 heaped teaspoon turmeric",
            "Salt and black pepper",
            "400 g/14 oz canned chopped tomatoes",
            "750 ml/1 1/4 pints boiling water",
            "100 g/3 1/2 oz tamarind paste dissolved in 200 ml/7 fl oz boiling water, then strained",
            "1 tablespoon tomato purée/tomato paste",
            "3 tablespoons lemon juice (optional)"
        ],
        "instructions": [
            "Cut off the top stems of the okra, taking care not to bruise them, and wash thoroughly. Wash and peel the potatoes and cut them into 4-5 cm/1 1/2-2 inch cubes. Peel and finely chop the onion.",
            "Peel and chop the garlic cloves. Deseed and chop the chillies. Using a pestle and mortar, crush the garlic and chilli together until mixed to a paste.",
            "Wash the lamb and dry it on kitchen paper. Trim off any skin and fat, and cut the meat into 4-5 cm/1 1/2-2 inch cubes.",
            "Cooking Heat the oil in a medium-sized, heavy-based saucepan and fry the onion until golden. Add the garlic and chilli paste and stir for a couple of minutes. Add the lamb, turmeric, salt and pepper to the pan. Mix well and fry lightly to seal the meat on all sides. Add the chopped tomatoes, boiling water and half of the tamarind liquid. Mix thoroughly. Reduce the heat, cover and simmer gently for 1 hour or until the meat is cooked: it should be tender enough to cut with a fork. Stir in the tomato purée/tomato paste and the potatoes. Cook for a further 15 minutes or until the potatoes are tender but not falling apart. Add more water if necessary. The liquid should now be reduced to about 500 ml/just under 1 pint. Add the okra to the pan and pour in the rest of the tamarind liquid. Cover and simmer for 20-30 minutes on a low heat until the okra is soft. Taste and adjust the seasoning, and add lemon juice if you prefer a tarter flavour. Serve in a shallow bowl with the meat at the bottom and the okra and potatoes arranged on top. Serve with plain rice (chelo).",
            "Heat the oil in a medium-sized, heavy-based saucepan and fry the onion until golden. Add the garlic and chilli paste and stir for a couple of minutes.",
            "Add the lamb, turmeric, salt and pepper to the pan. Mix well and fry lightly to seal the meat on all sides.",
            "Add the chopped tomatoes, boiling water and half of the tamarind liquid. Mix thoroughly. Reduce the heat, cover and simmer gently for 1 hour or until the meat is cooked: it should be tender enough to cut with a fork.",
            "Stir in the tomato purée/tomato paste and the potatoes.",
            "Cook for a further 15 minutes or until the potatoes are tender but not falling apart. Add more water if necessary. The liquid should now be reduced to about 500 ml/just under 1 pint.",
            "Add the okra to the pan and pour in the rest of the tamarind liquid. Cover and simmer for 20-30 minutes on a low heat until the okra is soft. Taste and adjust the seasoning, and add lemon juice if you prefer a tarter flavour.",
            "Serve in a shallow bowl with the meat at the bottom and the okra and potatoes arranged on top. Serve with plain rice (chelo)."
        ],
        "picture_link": null,
        "color": 7475592
    }
}