{
    "recipe": {
        "title": "Old-Fashioned Coconut Cake ",
        "ingredients": [
            "1 18.5-ounce package butter recipe golden cake mix",
            "3 large eggs",
            "1/2 cup (1 stick) unsalted butter, room temperature",
            "1/3 cup sweetened cream of coconut (such as Coco Lòpez)*",
            "1/3 cup water",
            "1 tablespoon dark rum",
            "2 8-ounce packages cream cheese, room temperature",
            "1/2 cup (1 stick) unsalted butter, room temperature",
            "1/2 cup sweetened cream of coconut",
            "3/4 cup powdered sugar",
            "1 teaspoon vanilla extract",
            "1 10-ounce package sweetened flaked coconut (about 3 cups)"
        ],
        "instructions": [
            "Preheat oven to 375°F. Butter and flour two 9-inch-diameter cake pans. Combine all 6 ingredients in large bowl. Using electric mixer, beat mixture on low speed until smooth. Increase speed to medium and beat 4 minutes. Divide batter between prepared pans. Bake cakes until tester inserted into center comes out clean, about 25 minutes. Cool in pans 10 minutes. Cut around cakes to loosen; turn out onto racks. Cool completely.",
            "For frosting: Using electric mixer, beat cream cheese, butter and cream of coconut in large bowl until smooth. Beat in powdered sugar and vanilla.",
            "Using electric mixer, beat cream cheese, butter and cream of coconut in large bowl until smooth. Beat in powdered sugar and vanilla.",
            "Place 1 cake layer, flat side up, on platter. Spread layer with 3/4 cup frosting. Sprinkle with 3/4 cup flaked coconut. Top with second cake layer, flat side down. Cover top and sides of cake with remaining frosting. Press remaining flaked coconut over top and sides of cake. Chill cake until frosting is firm, at least 1 hour. (Can be made 1 day ahead. Cover loosely and keep chilled until 1 hour before serving.)",
            "Place 1 cake layer, flat side up, on platter. Spread layer with 3/4 cup frosting. Sprinkle with 3/4 cup flaked coconut. Top with second cake layer, flat side down. Cover top and sides of cake with remaining frosting. Press remaining flaked coconut over top and sides of cake. Chill cake until frosting is firm, at least 1 hour. (Can be made 1 day ahead. Cover loosely and keep chilled until 1 hour before serving.)",
            "*Cream of coconut is available in the liquor section of most supermarkets.",
            "*Cream of coconut is available in the liquor section of most supermarkets."
        ],
        "picture_link": null
    }
}