{
    "recipe": {
        "title": "Old-fashioned Fruitcake Cookies ",
        "ingredients": [
            "1 cup halved dried cherries",
            "1 cup dried currants (about 5 ounces)",
            "1 cup chopped pitted dates",
            "1 cup golden raisins (about 5 ounces)",
            "1 cup brown raisins (about 5 ounces)",
            "1 cup chopped Simple Candied Orange Peel",
            "6 tablespoons bourbon, divided",
            "6 tablespoons dry Sherry (preferably imported), divided",
            "9 to 10 dozen paper or foil bonbon-size (1-inch-diameter) baking cups",
            "1 cup coarsely chopped walnuts",
            "2 cups all purpose flour, divided",
            "1 teaspoon baking powder",
            "1/2 teaspoon salt",
            "1/2 teaspoon ground cinnamon",
            "1/2 teaspoon freshly grated nutmeg",
            "1 cup sugar",
            "1/2 cup (1 stick) unsalted butter, room temperature",
            "2 large eggs",
            "1 cup (packed) powdered sugar",
            "4 teaspoons (or more) bourbon",
            "4 teaspoons (or more) dry Sherry (preferably imported)",
            "Diced or slivered Simple Candied Orange Peel"
        ],
        "instructions": [
            "Toss first 6 ingredients in large bowl. Mix in 4 tablespoons each bourbon and Sherry. Cover; soak 2 to 24 hours.",
            "Position rack in center of oven; preheat to 325°F. Arrange about 36 baking cups on each of 3 rimmed baking sheets. Stir walnuts, then 1 cup flour into fruit mixture, coating evenly. Whisk 1 cup flour, baking powder, salt, and spices in medium bowl.",
            "Beat sugar and butter in another large bowl until smooth. Beat in eggs, 1 at a time. Beat in dry ingredients, then remaining 2 tablespoons each bourbon and Sherry. Fold in fruit mixture. Drop batter by heaping teaspoonfuls into baking cups.",
            "Bake cookies, 1 sheet at a time, until light brown, about 23 minutes. Cool.",
            "For glaze and garnish: Mix sugar and 4 teaspoons each bourbon and Sherry in bowl. Add more liquor by 1/2 teaspoonfuls in equal amounts to thin if necessary. Spoon glaze over cookies; garnish with peel. Let stand until glaze sets, at least 2 hours. DO AHEAD: Can be made 1 week ahead. Store between sheets of waxed paper in airtight container at room temperature.",
            "Mix sugar and 4 teaspoons each bourbon and Sherry in bowl. Add more liquor by 1/2 teaspoonfuls in equal amounts to thin if necessary.",
            "Spoon glaze over cookies; garnish with peel. Let stand until glaze sets, at least 2 hours. DO AHEAD: Can be made 1 week ahead. Store between sheets of waxed paper in airtight container at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d7976f3a00aeb2f1cb7f0/6:4/w_274%2Ch_169/350832_hires.jpg"
    }
}