{
    "recipe": {
        "title": "Olive-Crusted Rack of Lamb ",
        "ingredients": [
            "2 pounds meaty lamb neck and shoulder stew bones",
            "1/4 cup olive oil",
            "1 large leek (white and pale green parts only), chopped (about 1 1/4 cups)",
            "1 large carrot, peeled, chopped",
            "1 onion, chopped",
            "1 large tomato, chopped",
            "1/2 cup dry red wine",
            "6 garlic cloves, peeled",
            "2 bay leaves",
            "1 1/4 teaspoons chopped fresh rosemary",
            "4 cups water",
            "4 tablespoons olive oil",
            "3 large shallots, minced (about 3/4 cup)",
            "2 teaspoons chopped fresh rosemary",
            "1 1/2 cups (or more) fresh breadcrumbs made from French bread",
            "8 ounces Kalamata olives or other brine-cured black olives, pitted, finely chopped (about 1 cup)",
            "3 well-trimmed racks of lamb (each about 1 1/4 pounds)",
            "4 1/2 teaspoons Dijon mustard"
        ],
        "instructions": [
            "For sauce: Sprinkle lamb bones with salt and pepper. Heat oil in heavy large pot over medium-high heat. Add lamb bones and sauté until dark brown, about 20 minutes. Transfer lamb bones to bowl. Add leek, carrot, and onion to same pot. Sauté until golden, about 12 minutes. Add tomato, red wine, garlic, bay leaves, and rosemary; bring to boil, scraping up browned bits. Add 4 cups water and lamb bones with any accumulated juices. Bring to boil. Cover partially, reduce heat to medium-low and simmer until thickened and reduced, about 2 hours. Using tongs, discard lamb bones. Press vegetables and liquid through sieve into large bowl. Season sauce to taste with salt and pepper. (Can be made 1 day ahead. Refrigerate until cold, then cover and keep refrigerated.)",
            "Sprinkle lamb bones with salt and pepper. Heat oil in heavy large pot over medium-high heat. Add lamb bones and sauté until dark brown, about 20 minutes. Transfer lamb bones to bowl. Add leek, carrot, and onion to same pot. Sauté until golden, about 12 minutes. Add tomato, red wine, garlic, bay leaves, and rosemary; bring to boil, scraping up browned bits. Add 4 cups water and lamb bones with any accumulated juices. Bring to boil. Cover partially, reduce heat to medium-low and simmer until thickened and reduced, about 2 hours. Using tongs, discard lamb bones. Press vegetables and liquid through sieve into large bowl. Season sauce to taste with salt and pepper. (Can be made 1 day ahead. Refrigerate until cold, then cover and keep refrigerated.)",
            "For lamb: Heat 3 tablespoons oil in heavy large skillet over medium-high heat. Add shallots and rosemary; sauté until soft, about 3 minutes. Add breadcrumbs and sauté until golden brown, about 5 minutes. Add olives and stir until moist clumps form, adding more breadcrumbs if mixture is loose. Season crumb topping with salt and pepper. Cool. Preheat oven to 400°F. Heat remaining 1 tablespoon oil in heavy large skillet over high heat. Working in batches, add lamb racks to skillet, rounded side down. Sear until brown, about 6 minutes. Transfer to large rimmed baking sheet, seared side up. Spread 1 1/2 teaspoons mustard over each. Press crumb topping into mustard. Roast lamb to desired doneness, about 25 minutes for medium. Rewarm sauce over low heat, stirring occasionally. Cut lamb between bones and serve with sauce.",
            "Heat 3 tablespoons oil in heavy large skillet over medium-high heat. Add shallots and rosemary; sauté until soft, about 3 minutes. Add breadcrumbs and sauté until golden brown, about 5 minutes. Add olives and stir until moist clumps form, adding more breadcrumbs if mixture is loose. Season crumb topping with salt and pepper. Cool.",
            "Preheat oven to 400°F. Heat remaining 1 tablespoon oil in heavy large skillet over high heat. Working in batches, add lamb racks to skillet, rounded side down. Sear until brown, about 6 minutes. Transfer to large rimmed baking sheet, seared side up. Spread 1 1/2 teaspoons mustard over each. Press crumb topping into mustard. Roast lamb to desired doneness, about 25 minutes for medium.",
            "Rewarm sauce over low heat, stirring occasionally. Cut lamb between bones and serve with sauce."
        ],
        "picture_link": null
    }
}