{
    "recipe": {
        "title": "Olive-Oil Toasts With Greens, Pine Nuts, and Raisins ",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil, divided",
            "1 baguette, cut into 24 slices (1/4-inch thick)",
            "1/4 teaspoon kosher salt",
            "1 bunch chard, kale, or spinach leaves, stems reserved for another use",
            "3 tablespoons extra-virgin olive oil, divided",
            "1 small yellow onion, finely chopped",
            "3/4 teaspoon kosher salt, divided",
            "2 garlic cloves, finely chopped",
            "1/4 teaspoon red-pepper flakes, plus more to taste",
            "3 tablespoons toasted pine nuts",
            "3 tablespoons raisins (preferably golden), soaked in hot water for 30 minutes, drained and chopped",
            "Scant 1/4 cup grated parmesan or Pecorino Toscano"
        ],
        "instructions": [
            "Preheat oven to 350°F. Brush 1 tablespoon oil evenly on a large rimmed baking sheet. Arrange bread slices on top; brush them with remaining tablespoon oil and season with salt. Place baking sheet in oven and toast for 6 minutes. Rotate the pan front to back and bake the toasts until golden brown all over with no pale patches, a few minutes more. (The toasts will probably not all be done at the same time, so remove the ones that are, and keep toasting). Remove toasts from the baking sheet to a separate container and let cool to room temperature.",
            "For the topping: To wash the chard leaves, throw them into a big bowl of water and swish around with conviction to get rid of any dirt. Lift out the greens (don't pour them out or the dirt will just go right back on), and transfer to a colander to drain. Don't spin the greens dry—it's good to have some water clinging to the leaves to help them steamily cook. Heat a large skillet over medium-low heat and add 2 tablespoons oil. Add the onion and 1/4 teaspoon salt and cook, stirring occasionally, until very tender and just slightly colored, about 15 minutes. Add the garlic and red-pepper flakes and stir until the garlic is fragrant, but not browned, about 2 minutes. Add the chard leaves with 1/2 teaspoon salt and let them begin to wilt. Toss and flip with tongs, adding salt, oil, or water as needed so the garlic does not burn, until chard is tender but not mushy, 8 to 10 minutes. Stir in the pine nuts and raisins and then spoon the mixture onto a cutting board to cool for a couple of minutes. Chop the chard, then scoop into a medium bowl and mix in the cheese and the remaining tablespoon of oil. Top toasts with chard mixture and serve warm or at room temperature.",
            "To wash the chard leaves, throw them into a big bowl of water and swish around with conviction to get rid of any dirt. Lift out the greens (don't pour them out or the dirt will just go right back on), and transfer to a colander to drain. Don't spin the greens dry—it's good to have some water clinging to the leaves to help them steamily cook.",
            "Heat a large skillet over medium-low heat and add 2 tablespoons oil. Add the onion and 1/4 teaspoon salt and cook, stirring occasionally, until very tender and just slightly colored, about 15 minutes. Add the garlic and red-pepper flakes and stir until the garlic is fragrant, but not browned, about 2 minutes.",
            "Add the chard leaves with 1/2 teaspoon salt and let them begin to wilt. Toss and flip with tongs, adding salt, oil, or water as needed so the garlic does not burn, until chard is tender but not mushy, 8 to 10 minutes.",
            "Stir in the pine nuts and raisins and then spoon the mixture onto a cutting board to cool for a couple of minutes. Chop the chard, then scoop into a medium bowl and mix in the cheese and the remaining tablespoon of oil. Top toasts with chard mixture and serve warm or at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54c9499a1f13bb9b2edf4a2f/6:4/w_274%2Ch_169/51262500_olive-oil-toast_1x1.jpg"
    }
}