{
    "recipe": {
        "title": "Ombre Christmas Tree Cookies ",
        "ingredients": [
            "All-purpose flour (for dusting)",
            "1 batch All-in-One Sugar Cookie Dough, chilled",
            "2 cups white royal icing",
            "Sanding sugar in 3 shades of green and gold dragees (for decorating)",
            "3\"–5\" tree cookie cutters; a small offset spatula"
        ],
        "instructions": [
            "Position racks in upper and lower thirds of oven; preheat to 350°F. Line 2 rimmed baking sheets with parchment paper. Generously flour a rolling pin and work surface. Working with 1 disc at a time, roll dough to 1/4\" thick. Cut out as many cookies as possible with cookie cutters (if dough becomes too soft, chill until firm). Place cookies 1/2\" apart on prepared baking sheets. Chill 15 minutes. Bake cookies until edges are light golden brown, 10–12 minutes. Transfer to wire racks and let cool. Using small offset spatula, frost trees with icing. While still wet, decorate each cookie in 3 sections to create an ombre effect—start by covering bottom third with darkest green sanding sugar. Sprinkle the medium green shade in the center, then the light green shade over the top third. Tap cookie lightly to remove excess sprinkles. Top tips of trees with gold dragees to look like a tree topper. Let icing dry before storing cookies, about 3 hours.",
            "Position racks in upper and lower thirds of oven; preheat to 350°F. Line 2 rimmed baking sheets with parchment paper.",
            "Generously flour a rolling pin and work surface. Working with 1 disc at a time, roll dough to 1/4\" thick. Cut out as many cookies as possible with cookie cutters (if dough becomes too soft, chill until firm). Place cookies 1/2\" apart on prepared baking sheets. Chill 15 minutes.",
            "Bake cookies until edges are light golden brown, 10–12 minutes. Transfer to wire racks and let cool.",
            "Using small offset spatula, frost trees with icing. While still wet, decorate each cookie in 3 sections to create an ombre effect—start by covering bottom third with darkest green sanding sugar. Sprinkle the medium green shade in the center, then the light green shade over the top third. Tap cookie lightly to remove excess sprinkles. Top tips of trees with gold dragees to look like a tree topper. Let icing dry before storing cookies, about 3 hours.",
            "Do Ahead Cookies can be made 10 days ahead; store in an airtight container at room temperature.",
            "Cookies can be made 10 days ahead; store in an airtight container at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58458fb3e0175cfb77ebdeaa/6:4/w_274%2Ch_169/Ombre-Christmas-Tree-Cookies-029112016.jpg"
    }
}