{
    "recipe": {
        "title": "Ombre Rainbow Cookies ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "1 1/2 cups (3 sticks) unsalted butter, room temperature",
            "1 1/2 cups sugar",
            "10 ounces almond paste (about 1 cup), crumbled",
            "2 tablespoons vegetable oil",
            "3/4 teaspoon kosher salt",
            "6 large eggs, room temperature",
            "3 cups all-purpose flour",
            "5 3/4 teaspoons plus 4 drops green or red food coloring, divided",
            "5 teaspoons matcha (green tea powder) or 1 ounce (about 1 cup) freeze-dried raspberries, divided",
            "3/4 cup apricot jam, divided"
        ],
        "instructions": [
            "Place racks in upper and lower thirds of oven and preheat to 350°F. Lightly coat three 13x9\" baking dishes with nonstick spray and line with parchment paper, leaving overhang on both long sides. Using an electric mixer on high speed, beat butter, sugar, almond paste, oil, and salt in a large bowl until mixture is well combined and fluffy, 5–8 minutes.",
            "Add eggs, one at a time, beating after each addition to incorporate before adding the next. Continue to beat mixture until pale and fluffy, about 5 minutes. Reduce speed to low and, with motor running, gradually add flour. Continue mixing just until combined. Divide batter evenly among 3 bowls. (Scoop out about 2 1/4 cups per bowl, or weigh out 500 g/1 lb. 2 oz. batter for each.)",
            "If making matcha cookies, mix 4 drops green food coloring and 1/2 tsp. matcha into batter in first bowl. Mix 3/4 tsp. green food coloring and 1 1/2 tsp. matcha to batter in second bowl. Mix 5 tsp. green food coloring and 3 tsp. matcha into batter in last bowl. (This will create three shades of green batter.)",
            "If making raspberry cookies, pulse raspberries in a food processor to create a fine powder. Mix 4 drops red food coloring and 1 1/2 tsp. raspberry powder to batter in first bowl. Mix 3/4 tsp. red food coloring and 1 Tbsp. plus 1 1/2 tsp. raspberry powder into batter in second bowl. Mix 5 tsp. red food coloring and 2 Tbsp. raspberry powder into last bowl of batter. (This will create three shades of red/pink batter.)",
            "Scrape a bowl of batter into each prepared pan and smooth tops. Bake cakes, rotating pans halfway through, until center springs back when gently pressed, 12–15 minutes. Let cakes cool completely in pans.",
            "Remove lightest-colored cake from pan, turning out onto a surface, and carefully peel away parchment paper. Spread half of jam evenly over top. Remove medium-colored cake from pan, peel away parchment paper, and place on top of light cake. Spread evenly with remaining jam. Remove darkest-colored cake from its pan, peel away parchment paper, and place on top. Press down gently to adhere layers and wrap tightly in plastic; chill at least 1 hour.",
            "To make cookies, trim edges to square off; about 1/2\" on each side should do it. Then, using a serrated knife, cut cake crosswise into 1 1/2\"-wide strips (you should have 8 total). Cut strips crosswise into 3/4\"-thick pieces.",
            "Do Ahead Cakes can be assembled 5 days ahead; wrap tightly and keep chilled. Cut into pieces just before serving.",
            "Cakes can be assembled 5 days ahead; wrap tightly and keep chilled. Cut into pieces just before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5665facb9a4b892c0f6b8ed5/6:4/w_274%2Ch_169/ombre-rainbow-cookies.jpg",
        "color": 9519250
    }
}