{
    "recipe": {
        "title": "One-Hour Apricot and Almond Galette ",
        "ingredients": [
            "1/2 cup almonds, preferably blanched",
            "1/3 cup sugar, plus more for sprinkling",
            "1 large egg",
            "4 tablespoons unsalted butter, room temperature",
            "1/2 teaspoon almond extract (optional)",
            "1/2 teaspoon vanilla extract",
            "Pinch of kosher salt",
            "1 tablespoon all-purpose flour, plus more for surface",
            "1 package frozen puff pastry, preferably all-butter, thawed",
            "12 apricots (about 1 1/4 pounds), halved, pitted, or other stone fruit, quartered if large"
        ],
        "instructions": [
            "Place a rack in middle of oven; preheat to 425°F. Pulse almonds and 1/3 cup sugar in a food processor until very finely ground. Add egg and pulse to combine. Add butter, almond extract (if using), vanilla extract, salt, and 1 Tbsp. flour; pulse until almond cream is smooth.",
            "Roll out pastry on a lightly floured surface just to smooth out any creases.",
            "If you’re using a package of pastry that has 2 sheets, stack and roll out to a 1/4\"–1/8\"-thick rectangle.",
            "If your package contains a single 16x10\" sheet of puff pastry, halve it crosswise and roll out one half on a lightly floured surface until rectangle is 1/4\"–1/8\" thick; save remaining half for another use. Transfer to a parchment-lined baking sheet. Fold over edges of pastry to make a 1/2\" border around all sides. Prick surface all over with a fork (this keeps the pastry from rising too much when baked and helps it cook through). Spread almond cream over pastry, staying inside borders. (Chill dough in the freezer for a few minutes if it becomes too soft to work with.) Set apricots, cut sides up, on top of almond cream. Sprinkle lightly with sugar.",
            "Bake galette until pastry is golden brown and puffed, 15–20 minutes. Reduce oven temperature to 325°F and continue to bake until pastry is deep golden brown and cooked through and apricots are softened and browned in spots, 15–20 minutes longer.",
            "Do Ahead: Almond cream can be made 3 days ahead. Cover and chill.",
            "Almond cream can be made 3 days ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/594174366c15d005a3037974/6:4/w_274%2Ch_169/apricot-and-almond-galette.jpg"
    }
}