{
    "recipe": {
        "title": "One-Skillet Roasted Butternut Squash with Spiced Chickpeas ",
        "ingredients": [
            "1 small butternut squash (about 1 1/2 pounds)",
            "1/2 cup plain whole-milk Greek yogurt",
            "5 garlic cloves (1 finely grated, 4 chopped)",
            "2 tablespoons fresh lemon juice, divided",
            "Kosher salt, freshly ground pepper",
            "4 tablespoons olive oil, divided, plus more for drizzling",
            "1 (15-ounce) can chickpeas, rinsed, patted dry",
            "1 medium onion, chopped",
            "2 tablespoons vadouvan or curry powder",
            "2 radishes, trimmed, very thinly sliced",
            "1 cup parsley, mint, and/or cilantro leaves",
            "2 tablespoons pomegranate seeds (optional)"
        ],
        "instructions": [
            "Preheat oven to 425°F. Roast squash directly on oven rack until a paring knife poked through skin easily slides through flesh, 50–65 minutes. Let squash cool until you can handle. Trim ends, halve lengthwise, and scoop out seeds. Tear or cut squash into large pieces; discard skin (it will come off easily as you tear).",
            "Meanwhile, mix yogurt, grated garlic, and 1 Tbsp. lemon juice in a medium bowl; season with salt and pepper.",
            "Heat 2 Tbsp. oil in a large skillet, preferably cast iron, over medium-high. Cook chickpeas, shaking skillet often, until starting to brown and crisp, about 5 minutes. Add onion and chopped garlic and cook, stirring often, until onion is translucent, about 5 minutes. Sprinkle in vadouvan and cook, stirring, until chickpeas and onion are coated and mixture is fragrant, about 1 minute. Season with salt and pepper and transfer to a medium bowl. Wipe out skillet.",
            "Heat 2 Tbsp. oil in same skillet over medium-high. Cook squash pieces, cut side down, undisturbed, until browned and caramelized, about 5 minutes. Turn pieces over, remove from heat, and season with salt and pepper. Spoon chickpea mixture over squash, then dollop reserved lemon-garlic yogurt around.",
            "Toss radishes, herbs, and pomegranate seeds, if using, with remaining 1 Tbsp. lemon juice in a small bowl; drizzle with a splash of oil and season with salt and pepper. Scatter over squash and chickpeas. Finish with a grind or two of pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58ed4217d738985ef9d9993a/6:4/w_274%2Ch_169/skillet-roasted-butternut-squash-with-spiced-chickpeas-BA-030617.jpg",
        "color": 3673253
    }
}