{
    "recipe": {
        "title": "Orange, Jícama, and Watercress Salad ",
        "ingredients": [
            "1/4 cup freshly squeezed lime juice (from approximately 2 limes)",
            "1 teaspoon finely grated lime zest",
            "1 1/2 teaspoons kosher salt",
            "3/4 teaspoon freshly ground black pepper",
            "1/2 cup extra-virgin olive oil",
            "1/2 small jícama, peeled and cut into 1/4- by 1-inch matchsticks (approximately 5 ounces)",
            "3 large oranges",
            "3 bunches watercress, thick stems removed (about 8 cups, packed)",
            "3/4 cup raw green (hulled) pumpkin seeds (pepitas), toasted (optional)"
        ],
        "instructions": [
            "In small bowl, whisk together lime juice, zest, salt, and pepper. Gradually whisk in oil, whisking until mixture emulsifies. In medium bowl, toss together jícama and 1/4 cup vinaigrette, reserving remaining vinaigrette. Let marinate while preparing rest of ingredients. Using paring knife and working over large bowl to catch juice, remove peel and white pith from oranges, then cut between membranes to remove segments (discard membranes). To bowl with orange juice, add orange segments, jícama (including vinaigrette), and watercress. Toss well to combine. If desired, add additional vinaigrette, or reserve remainder for another use. Sprinkle with pumpkin seeds if using. Serve immediately.",
            "In small bowl, whisk together lime juice, zest, salt, and pepper. Gradually whisk in oil, whisking until mixture emulsifies.",
            "In medium bowl, toss together jícama and 1/4 cup vinaigrette, reserving remaining vinaigrette. Let marinate while preparing rest of ingredients.",
            "Using paring knife and working over large bowl to catch juice, remove peel and white pith from oranges, then cut between membranes to remove segments (discard membranes).",
            "To bowl with orange juice, add orange segments, jícama (including vinaigrette), and watercress. Toss well to combine. If desired, add additional vinaigrette, or reserve remainder for another use. Sprinkle with pumpkin seeds if using. Serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a70f3a00aeb2f1cf82a/6:4/w_274%2Ch_169/240454_hires.jpg"
    }
}