{
    "recipe": {
        "title": "Orange Flan ",
        "ingredients": [
            "2 tablespoons water",
            "1 1/4 cups sugar, divided",
            "8 large egg yolks",
            "4 whole large eggs",
            "2 teaspoons grated orange zest",
            "1 cup fresh orange juice",
            "1 cup unsweetened plain almond milk",
            "1 1/2 teaspoons orange-flower water",
            "1/4 teaspoon salt",
            "Equipment: an 8-to 9-inch round ceramic or glass baking dish or metal cake pan (2 inches deep)"
        ],
        "instructions": [
            "Preheat oven to 325°F with rack in middle.",
            "Bring water and 1/2 cup sugar to a boil in a small heavy saucepan over medium heat, stirring until sugar has dissolved, then wash down any sugar crystals from side of pan with a pastry brush dipped in cold water. Boil, without stirring, swirling pan occasionally so caramel colors evenly, until dark amber. Immediately pour caramel into baking dish and tilt to coat bottom (dish will be hot). Cool until hardened, 10 to 15 minutes.",
            "Whisk together remaining ingredients, including remaining 3/4 cup sugar (or blend in a blender). Pour custard over caramel.",
            "Bake in a water bath until custard is set 3 inches from edge but still wobbly in center, 1 to 1 1/2 hours. Transfer flan in dish to a rack to cool completely, about 40 minutes (flan will continue to set as it cools). Chill until cold, at least 8 hours.",
            "To unmold flan, run a thin knife around edge of dish, then dip dish briefly (about 20 seconds) in a pan of very warm water. Invert a large platter with a rim over baking dish, then quickly invert to turn out flan onto platter (caramel will pour out over and around flan). Let stand at room temperature 30 minutes before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a53de0acd286555db7aa/6:4/w_274%2Ch_169/352326_hires.jpg",
        "color": 16704987
    }
}