{
    "recipe": {
        "title": "Orange Upside-Down Cake ",
        "ingredients": [
            "2 medium oranges",
            "3/4 cup granulated sugar",
            "4 1/2 tablespoons unsalted butter, cut into pieces, plus more for cake pan",
            "1/4 teaspoon kosher salt",
            "2 cups all-purpose flour",
            "1 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "3/4 teaspoon kosher salt",
            "1/2 cup (1 stick) unsalted butter, at room temperature",
            "1 cup granulated sugar",
            "3 large eggs, at room temperature",
            "1 teaspoon pure vanilla extract",
            "1 teaspoon grated orange zest",
            "1 cup buttermilk, well shaken",
            "10-inch round cake pan"
        ],
        "instructions": [
            "Make the caramel: Preheat the oven to 350°F. Lightly butter the cake pan. Slice the oranges as thinly as you can (about 1/8 to 1/4-inch thick), preferably using a mandoline and picking out seeds as you go; set aside. Make sure you have all the ingredients for the caramel ready to go before you begin cooking it. In a medium pot, combine the sugar and 6 tablespoons water and place over medium-high heat. Bring to a boil and cook, swirling the pan occasionally, until the mixture turns a medium-dark amber color, about 10 minutes. Remove pot from heat and carefully stir in the butter and salt until incorporated. Pour the caramel into the buttered cake pan. Starting in the center of the pan, layer the orange slices on top of the caramel, overlapping a bit and working your way toward the outer edge (you may not need to use all the orange slices). Set pan aside.",
            "Preheat the oven to 350°F.",
            "Lightly butter the cake pan. Slice the oranges as thinly as you can (about 1/8 to 1/4-inch thick), preferably using a mandoline and picking out seeds as you go; set aside.",
            "Make sure you have all the ingredients for the caramel ready to go before you begin cooking it. In a medium pot, combine the sugar and 6 tablespoons water and place over medium-high heat. Bring to a boil and cook, swirling the pan occasionally, until the mixture turns a medium-dark amber color, about 10 minutes. Remove pot from heat and carefully stir in the butter and salt until incorporated. Pour the caramel into the buttered cake pan.",
            "Starting in the center of the pan, layer the orange slices on top of the caramel, overlapping a bit and working your way toward the outer edge (you may not need to use all the orange slices). Set pan aside.",
            "Make the cake: In a medium bowl, whisk together the flour, baking powder, baking soda, and salt; set aside. In a separate large bowl, use an electric mixer to cream the butter and sugar until fluffy, about 3 minutes. Add the eggs one at a time, beating well after each addition, and then blend in the vanilla and orange zest. Add the flour mixture in three parts, alternating with the buttermilk, beating just to combine. Spoon the batter in dollops over the oranges in the cake pan, being careful not to move them around too much. Smooth the top of the batter with a wet offset spatula or the back of a spoon. Bake until a toothpick inserted in the middle of the cake comes out clean, 35 to 40 minutes, rotating the pan halfway through. With an offset spatula or a butter knife, loosen any parts of the cake that seem to be sticking to the side of the pan. Invert the cake onto a plate or platter while it's still hot. Let cool until warm or room temperature, then cut into wedges with a serrated knife to serve.",
            "In a medium bowl, whisk together the flour, baking powder, baking soda, and salt; set aside.",
            "In a separate large bowl, use an electric mixer to cream the butter and sugar until fluffy, about 3 minutes. Add the eggs one at a time, beating well after each addition, and then blend in the vanilla and orange zest.",
            "Add the flour mixture in three parts, alternating with the buttermilk, beating just to combine. Spoon the batter in dollops over the oranges in the cake pan, being careful not to move them around too much. Smooth the top of the batter with a wet offset spatula or the back of a spoon. Bake until a toothpick inserted in the middle of the cake comes out clean, 35 to 40 minutes, rotating the pan halfway through.",
            "With an offset spatula or a butter knife, loosen any parts of the cake that seem to be sticking to the side of the pan. Invert the cake onto a plate or platter while it's still hot. Let cool until warm or room temperature, then cut into wedges with a serrated knife to serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54f084fb4f77a310045da13f/6:4/w_274%2Ch_169/EP-201502-orangeupsidedowncake-6x4.jpg"
    }
}