{
    "recipe": {
        "title": "Orange Olive Oil Pound Cake ",
        "ingredients": [
            "1 tablespoon unsalted butter, for the pan",
            "2 cups all-purpose flour",
            "1 tablespoon baking powder",
            "Pinch of salt",
            "3 large eggs",
            "1 1/4 cups sugar",
            "1 cup olive oil",
            "1/2 cup whole milk",
            "2 tablespoons brandy",
            "2 tablespoons orange liqueur, such as Cointreau",
            "1 tablespoon grated lemon zest",
            "1 tablespoon grated orange zest",
            "1/2 cup fresh orange juice"
        ],
        "instructions": [
            "Preheat the oven to 325°F. Butter a 9 × 5-inch loaf pan. In a medium bowl, whisk together the flour, baking powder, and salt. In a large bowl, whisk together the eggs and 1 cup of the sugar. Whisk in the olive oil, milk, brandy, liqueur, lemon zest, orange zest, and 1/4 cup of the orange juice. Add the dry ingredients and whisk to combine. The batter is wet. It's okay. Pour the batter into the loaf pan and bake for 1 hour 5 minutes to 1 hour 10 minutes, until a cake tester inserted in the cake comes out clean. You will smell the cake when it is done. Remove the cake from the oven and let cool enough to handle, then flip over onto a rack to cool thoroughly. Meanwhile, in a small bowl, combine the remaining 1/4 cup sugar and 1/4 cup orange juice. Turn the cake right side up. Using a pastry brush, brush the glaze all over the cake. Allow the glaze to harden some before serving.",
            "Preheat the oven to 325°F. Butter a 9 × 5-inch loaf pan.",
            "In a medium bowl, whisk together the flour, baking powder, and salt. In a large bowl, whisk together the eggs and 1 cup of the sugar. Whisk in the olive oil, milk, brandy, liqueur, lemon zest, orange zest, and 1/4 cup of the orange juice. Add the dry ingredients and whisk to combine. The batter is wet. It's okay.",
            "Pour the batter into the loaf pan and bake for 1 hour 5 minutes to 1 hour 10 minutes, until a cake tester inserted in the cake comes out clean. You will smell the cake when it is done. Remove the cake from the oven and let cool enough to handle, then flip over onto a rack to cool thoroughly.",
            "Meanwhile, in a small bowl, combine the remaining 1/4 cup sugar and 1/4 cup orange juice. Turn the cake right side up. Using a pastry brush, brush the glaze all over the cake. Allow the glaze to harden some before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/555b6a2b100d9bda6d82094f/6:4/w_274%2Ch_169/51253040_orange-olive-oil-pound-cake_6x4.jpg"
    }
}