{
    "recipe": {
        "title": "Orange- and Lime-Marinated Lamb Kebabs ",
        "ingredients": [
            "1 3 1/2-pound boneless leg of lamb, all fat and sinew trimmed, meat cut into 1 1/4- to 1 1/2-inch cubes",
            "3/4 cup orange juice",
            "1/2 cup olive oil",
            "1/4 cup fresh lime juice",
            "1/4 cup soy sauce",
            "1 tablespoon chopped fresh oregano",
            "1 tablespoon chopped canned chipotle chilies*",
            "3 garlic cloves, minced",
            "2 teaspoons grated lime peel",
            "2 teaspoons ground cumin",
            "2 teaspoons ground black pepper",
            "1 teaspoon salt",
            "1 red onion, cut into 1-inch pieces",
            "3 fresh poblano chilies,** seeded, cut into 1-inch pieces",
            "6 12-inch metal skewers"
        ],
        "instructions": [
            "Place lamb cubes in large resealable plastic bag. Whisk orange juice and next 10 ingredients in medium bowl to blend. Pour over lamb in plastic bag. Seal bag and refrigerate overnight, turning occasionally. Drain lamb. Prepare barbecue (medium-high heat). Alternate 4 lamb cubes, 4 onion pieces, and 4 chili pieces on each skewer. Grill lamb to desired doneness, turning frequently, about 9 minutes for medium-rare. Place skewers on platter and serve.",
            "Place lamb cubes in large resealable plastic bag. Whisk orange juice and next 10 ingredients in medium bowl to blend. Pour over lamb in plastic bag. Seal bag and refrigerate overnight, turning occasionally. Drain lamb.",
            "Prepare barbecue (medium-high heat). Alternate 4 lamb cubes, 4 onion pieces, and 4 chili pieces on each skewer. Grill lamb to desired doneness, turning frequently, about 9 minutes for medium-rare. Place skewers on platter and serve.",
            "*Chipotle chilies canned in a spicy tomato sauce, sometimes called adobo, are available at Latin American markets, specialty foods stores and some supermarkets. **Fresh green chilies, often called pasillas; available at Latin American markets and some supermarkets.",
            "*Chipotle chilies canned in a spicy tomato sauce, sometimes called adobo, are available at Latin American markets, specialty foods stores and some supermarkets.",
            "**Fresh green chilies, often called pasillas; available at Latin American markets and some supermarkets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea847f9a84192308a9bb3/6:4/w_274%2Ch_169/105304.jpg"
    }
}