{
    "recipe": {
        "title": "Orange and Poppy Seed Stollen ",
        "ingredients": [
            "100g butter",
            "500g plain all-purpose flour",
            "40g fresh yeast (or 7g active-dry)",
            "225ml warm milk",
            "30g sugar",
            "1 tsp salt",
            "1 egg",
            "125g golden raisins",
            "125g candied citrus peel",
            "1 medium-sized orange",
            "4 Tbsp rum or brandy",
            "1 tsp vanilla extract",
            "8 green cardamom pods",
            "2 tsp poppy seeds",
            "1 tsp ground cinnamon",
            "50 g blanched, sliced almonds",
            "200g marzipan",
            "A little beaten egg",
            "50g butter",
            "Powdered sugar",
            "You will also need a large baking sheet, lined with baking parchment."
        ],
        "instructions": [
            "Put the sultanas into a mixing bowl. Chop the candied citrus peel into small dice and add to the sultanas. Finely grate the zest from the orange and add to the bowl. Squeeze in the juice of the orange, pour in the rum or brandy and vanilla, then toss together and leave for an hour.",
            "Make dough: Melt the butter in a small pan, then leave to cool down. Put the flour into a large mixing bowl. No need to sieve it. If using fresh yeast, warm the milk to body temperature (it should feel comfortable rather than cold or scalding when you insert your finger), then crumble in the yeast and stir to dissolve. Add the sugar and salt to the flour and mix well. Beat the egg. Stir in the egg and the warm milk and butter. (If you are using dried yeast, add the yeast straight to the flour, then stir in the other ingredients followed by the warm milk, egg and butter.) Mix thoroughly—the dough should be soft, shiny and rather sticky. In all honesty it may be very sticky. Turn out on to a generously floured board and knead for a good eight minutes. As you knead, the dough will become less and less sticky and more like a bread dough—though it will be heavier because of the butter and egg. When the dough is soft, elastic and no longer sticking to the board, scoop it up and put it into a floured bowl. Set aside, covered with a clean tea towel, somewhere warm and draught-free for a good hour or until it is well risen. (It won't be quite twice the size of the original dough but well on the way.) Alternatively, mix and knead using a food mixer fitted with a dough hook until the dough comes cleanly away from the sides of the bowl.",
            "Melt the butter in a small pan, then leave to cool down. Put the flour into a large mixing bowl. No need to sieve it. If using fresh yeast, warm the milk to body temperature (it should feel comfortable rather than cold or scalding when you insert your finger), then crumble in the yeast and stir to dissolve. Add the sugar and salt to the flour and mix well. Beat the egg. Stir in the egg and the warm milk and butter. (If you are using dried yeast, add the yeast straight to the flour, then stir in the other ingredients followed by the warm milk, egg and butter.)",
            "Mix thoroughly—the dough should be soft, shiny and rather sticky. In all honesty it may be very sticky. Turn out on to a generously floured board and knead for a good eight minutes. As you knead, the dough will become less and less sticky and more like a bread dough—though it will be heavier because of the butter and egg. When the dough is soft, elastic and no longer sticking to the board, scoop it up and put it into a floured bowl. Set aside, covered with a clean tea towel, somewhere warm and draught-free for a good hour or until it is well risen. (It won't be quite twice the size of the original dough but well on the way.) Alternatively, mix and knead using a food mixer fitted with a dough hook until the dough comes cleanly away from the sides of the bowl.",
            "Assemble: Break the cardamom pods open and remove their seeds. Crush the seeds to a coarse powder using a pestle and mortar or a spice mill, then mix in a small bowl with the poppy seeds, cinnamon and almonds. Dust the work surface in the flour and tip your risen dough onto it. Knead the spice and seed mixture and the soaked fruits, leaving behind most of the liquid, into the dough. Roll into a long loaf about 22cmx16cm and flatten it slightly: Roll the marzipan into a cylinder nearly the length of the dough, then place it in the centre. Brush the edges with a little beaten egg and press together. Turn the dough over and place it on a lined baking sheet, cover with a towel and return it to a warm place to prove for a further hour and a half. Heat the oven to 350°F/180°C/Gas 4. Place the loaf in the hot oven and bake for about thirty-five to forty minutes, until pale gold. Melt the butter for the glaze and brush over the loaf. Cool on a wire rack, then dust generously with icing sugar.",
            "Break the cardamom pods open and remove their seeds. Crush the seeds to a coarse powder using a pestle and mortar or a spice mill, then mix in a small bowl with the poppy seeds, cinnamon and almonds. Dust the work surface in the flour and tip your risen dough onto it. Knead the spice and seed mixture and the soaked fruits, leaving behind most of the liquid, into the dough.",
            "Roll into a long loaf about 22cmx16cm and flatten it slightly: Roll the marzipan into a cylinder nearly the length of the dough, then place it in the centre. Brush the edges with a little beaten egg and press together. Turn the dough over and place it on a lined baking sheet, cover with a towel and return it to a warm place to prove for a further hour and a half.",
            "Heat the oven to 350°F/180°C/Gas 4. Place the loaf in the hot oven and bake for about thirty-five to forty minutes, until pale gold. Melt the butter for the glaze and brush over the loaf. Cool on a wire rack, then dust generously with icing sugar.",
            "To Keep When the loaf is thoroughly cool, wrap loosely in waxed paper or clingfilm and keep in a cookie tin.",
            "When the loaf is thoroughly cool, wrap loosely in waxed paper or clingfilm and keep in a cookie tin."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c06a7550899e22c8f5b4986/6:4/w_274%2Ch_169/apricot-poppyseed-stolen-nigel-slater-recipe-120418.jpg",
        "color": 14495727
    }
}