{
    "recipe": {
        "title": "Orange Cranberry Cupcakes ",
        "ingredients": [
            "1 1/2 cups plus 1 tablespoon all-purpose flour",
            "1 teaspoon baking powder",
            "1/4 teaspoon baking soda",
            "1/4 teaspoon fine sea salt",
            "2/3 cup whole milk",
            "2 tablespoons lightly packed finely grated orange zest (from 2 large oranges)",
            "1/2 teaspoon pure vanilla extract",
            "1/2 cup (1 stick) unsalted butter, slightly softened",
            "1 cup sugar",
            "1 large egg",
            "2 large egg whites",
            "1 cup fresh or unthawed frozen cranberries",
            "1 cup (2 sticks) unsalted butter, slightly softened",
            "1/8 teaspoon fine sea salt",
            "3 cups confectioners’ sugar, sifted",
            "1 teaspoon whole milk",
            "1 tablespoon lightly packed finely grated orange zest (from 1 large orange)",
            "1 tablespoon fresh orange juice",
            "1/8 teaspoon pure vanilla extract"
        ],
        "instructions": [
            "Preheat the oven to 325°F. Line a 12-cup cupcake pan with paper liners.",
            "In a medium bowl, whisk together 1 1/2 cups of the flour, the baking powder, baking soda, and salt. In a small saucepan, heat the milk and orange zest over low heat until hot (but not boiling); cool to lukewarm, 4 to 5 minutes. Stir in the vanilla.",
            "In the bowl of a stand mixer fitted with the paddle attachment, beat the butter and sugar on medium-high speed until light and fluffy, 2 to 3 minutes. Reduce the speed to medium-low, add the egg and egg whites one at a time, and beat until creamy, 1 to 2 minutes. Slowly add half the flour mixture, then the milk mixture, then the remaining flour mixture, beating until just blended after each addition. In a small bowl, toss the cranberries with the remaining 1 tablespoon flour. Using a silicone spatula, gently fold the cranberries into the batter.",
            "Divide the batter evenly among the liners and bake until the tops are just dry to the touch (some may be slightly golden on the sides before this happens) and a toothpick inserted into the center comes out clean, 17 to 19 minutes. Transfer the pan to a wire rack and cool completely before frosting with orange frosting.",
            "To bake as a cake: Butter two 9-inch round cake pans, line the bottoms with parchment paper cut to fit, and butter the parchment. Flour the pans, coating the bottom and sides of each pan, then tap out the excess flour. Divide the batter between the two pans and bake until the tops are dry to the touch, the sides of the cake start to pull away from the pan, and a toothpick inserted into the center comes out clean (for generally the same amount of time as in the cupcake recipe). Let cool on a wire rack, then remove each cake from its pan, discard the parchment paper, and set one cake layer on a cake round, frosting turntable, or the final serving platter. Frost the top of that cake layer with the frosting, stack the second layer on top, and frost the top and sides with the remaining frosting.",
            "Butter two 9-inch round cake pans, line the bottoms with parchment paper cut to fit, and butter the parchment. Flour the pans, coating the bottom and sides of each pan, then tap out the excess flour. Divide the batter between the two pans and bake until the tops are dry to the touch, the sides of the cake start to pull away from the pan, and a toothpick inserted into the center comes out clean (for generally the same amount of time as in the cupcake recipe). Let cool on a wire rack, then remove each cake from its pan, discard the parchment paper, and set one cake layer on a cake round, frosting turntable, or the final serving platter. Frost the top of that cake layer with the frosting, stack the second layer on top, and frost the top and sides with the remaining frosting.",
            "To make the orange frosting: In the bowl of a stand mixer fitted with the paddle attachment, beat the butter and salt on medium speed until light and fluffy, 2 to 3 minutes. Reduce the speed to low, gradually add the confectioners’ sugar, and beat until incorporated. Increase the speed to medium, add the milk, orange zest and juice, and vanilla and beat until fully blended, 1 to 2 minutes, making sure not to incorporate too much air into the frosting.",
            "In the bowl of a stand mixer fitted with the paddle attachment, beat the butter and salt on medium speed until light and fluffy, 2 to 3 minutes. Reduce the speed to low, gradually add the confectioners’ sugar, and beat until incorporated. Increase the speed to medium, add the milk, orange zest and juice, and vanilla and beat until fully blended, 1 to 2 minutes, making sure not to incorporate too much air into the frosting."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59b2cd3e1a5e0017eed06a4c/6:4/w_274%2Ch_169/orange-cranberry-Cupcake-recipe-090517.jpg"
    }
}