{
    "recipe": {
        "title": "Orange Glow Chiffon Cake ",
        "ingredients": [
            "All ingredients should be at room temperature.",
            "2 1/4 cups sifted cake flour (8 ounces = 225 grams)",
            "1 1/2 cups sugar (10.5 ounces = 300 grams)",
            "2 teaspoons baking powder (10 grams)",
            "1/2 teaspoon salt (3.5 grams)",
            "1/2 liquid cup safflower oil (3.75 ounces = 108 grams)",
            "7 large eggs, separated + 3 additional whites (yolks: 1/2 liquid cup = 4.5 ounces = 130 grams; whites: 1 1/4 liquid cups = 10.5 ounces = 300 grams)",
            "3/4 liquid cup orange juice, freshly squeezed (6.25 ounces = 182 grams)",
            "2 tablespoons grated orange zest (12 grams)",
            "1 teaspoon vanilla (4 grams)",
            "1 1/4 teaspoon cream of tartar (4 grams)",
            "One ungreased 10-inch two-piece tube pan"
        ],
        "instructions": [
            "Preheat the oven to 325°F. In a large mixing bowl combine the flour, all but 2 tablespoons of the sugar, baking powder, and salt and beat 1 minute to mix. Make a well in the center. Add the oil, egg yolks, orange juice, orange zest, and vanilla and beat 1 minute or until smooth. In another large mixing bowl beat the egg whites until frothy, add the cream of tartar, and beat until soft peaks form when the beater is raised. Beat in the remaining 2 tablespoons sugar and beat until stiff peaks form when the beater is raised slowly. Gently fold the egg whites into the batter with a large balloon wire whisk, slotted skimmer, or angel food cake folder until just blended. Pour into the tube pan (the batter will come to 1 inch from the top), run a small metal spatula or knife through the batter to prevent air pockets, and bake for 55 minutes or until a cake tester inserted in the center comes out clean and the cake springs back when lightly pressed in the center. Invert the pan, placing the tube opening over the neck of a soda or wine bottle to suspend it well above the counter, and cool the cake completely in the pan (this takes about 1 1/2 hours). Loosen the sides with a long metal spatula and remove the center core of the pan. Dislodge the bottom and center core with a metal spatula or thin, sharp knife. (A wire cake tester works well around the core. To keep the sides attractive, press the spatula against the sides of the pan and avoid any up-and-down motion.) Invert onto a greased wire rack and reinvert onto a serving plate. Wrap airtight.",
            "Preheat the oven to 325°F.",
            "In a large mixing bowl combine the flour, all but 2 tablespoons of the sugar, baking powder, and salt and beat 1 minute to mix. Make a well in the center. Add the oil, egg yolks, orange juice, orange zest, and vanilla and beat 1 minute or until smooth.",
            "In another large mixing bowl beat the egg whites until frothy, add the cream of tartar, and beat until soft peaks form when the beater is raised. Beat in the remaining 2 tablespoons sugar and beat until stiff peaks form when the beater is raised slowly. Gently fold the egg whites into the batter with a large balloon wire whisk, slotted skimmer, or angel food cake folder until just blended.",
            "Pour into the tube pan (the batter will come to 1 inch from the top), run a small metal spatula or knife through the batter to prevent air pockets, and bake for 55 minutes or until a cake tester inserted in the center comes out clean and the cake springs back when lightly pressed in the center. Invert the pan, placing the tube opening over the neck of a soda or wine bottle to suspend it well above the counter, and cool the cake completely in the pan (this takes about 1 1/2 hours).",
            "Loosen the sides with a long metal spatula and remove the center core of the pan. Dislodge the bottom and center core with a metal spatula or thin, sharp knife. (A wire cake tester works well around the core. To keep the sides attractive, press the spatula against the sides of the pan and avoid any up-and-down motion.) Invert onto a greased wire rack and reinvert onto a serving plate. Wrap airtight.",
            "Finished Height: 4 1/2 inches high in the middle.",
            "4 1/2 inches high in the middle.",
            "Store: 3 days room temperature, 10 days refrigerated, 2 months frozen.",
            "3 days room temperature, 10 days refrigerated, 2 months frozen.",
            "Complimentary Adornments: A light sprinkling of powdered sugar and/or decorate the base and center with orange blossoms or fresh daisies. Candied orange zest scattered on top also makes an attractive and flavorful addition.",
            "A light sprinkling of powdered sugar and/or decorate the base and center with orange blossoms or fresh daisies. Candied orange zest scattered on top also makes an attractive and flavorful addition.",
            "Serve: Room temperature or lightly chilled. Cut with a serrated knife.",
            "Room temperature or lightly chilled. Cut with a serrated knife.",
            "Pointers for Success: • Use cake flour that does not contain leavening. Do not use self-rising cake flour. • Use superfine sugar for the finest texture and maximum volume. • Measure or weigh ingredients carefully. • Do not use oil that contains silicates — it will be listed on the label. • Egg whites must be free of even a trace of yolk and the bowl must be spotless. • When beating egg whites, use cream of tartar or be careful to beat just until stiff peaks form when the beater is raised slowly. • Fold flour gently but thoroughly into the batter. • Prevent air pockets by running a small metal spatula or knife through the batter before baking. • Use the correct pan size. • Bake immediately after mixing. • Check for accurate oven temperature. • Use correct baking time; do not underbake. • Cool cakes upside down, well elevated from the countertop, in a draft-free area. • Wrap cakes well when cool. • An angel food cake folder, large balloon whisk, or slotted skimmer is ideal for folding in the flour with the least amount of air loss. If using the whisk, periodically shake out the batter which collects inside.",
            "• Use cake flour that does not contain leavening. Do not use self-rising cake flour.",
            "• Use superfine sugar for the finest texture and maximum volume.",
            "• Measure or weigh ingredients carefully.",
            "• Do not use oil that contains silicates — it will be listed on the label.",
            "• Egg whites must be free of even a trace of yolk and the bowl must be spotless.",
            "• When beating egg whites, use cream of tartar or be careful to beat just until stiff peaks form when the beater is raised slowly.",
            "• Fold flour gently but thoroughly into the batter.",
            "• Prevent air pockets by running a small metal spatula or knife through the batter before baking.",
            "• Use the correct pan size.",
            "• Bake immediately after mixing.",
            "• Check for accurate oven temperature.",
            "• Use correct baking time; do not underbake.",
            "• Cool cakes upside down, well elevated from the countertop, in a draft-free area.",
            "• Wrap cakes well when cool.",
            "• An angel food cake folder, large balloon whisk, or slotted skimmer is ideal for folding in the flour with the least amount of air loss. If using the whisk, periodically shake out the batter which collects inside."
        ],
        "picture_link": null
    }
}