{
    "recipe": {
        "title": "Orecchiette Carbonara with Charred Brussels Sprouts ",
        "ingredients": [
            "2 tablespoons olive oil, divided",
            "1/2 pound Brussels sprouts, trimmed, leaves separated",
            "12 ounces fresh orecchiette or other fresh or dried small pasta",
            "Kosher salt",
            "2 ounces guanciale (salt-cured pork jowl) or pancetta (Italian bacon), finely chopped (about 1/4 cup)",
            "1/2 teaspoon coarsely ground black pepper",
            "1/4 cup (1/2 stick) unsalted butter, cut into pieces",
            "1/3 cup grated Pecorino plus more",
            "2 large egg yolks, beaten to blend"
        ],
        "instructions": [
            "Heat 1 tablespoon oil in a large skillet over high heat. Working in batches, add Brussels sprout leaves and cook, tossing occasionally, until charred in spots and crisp-tender, about 5 minutes; transfer to a plate and set aside. Wipe out skillet.",
            "Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente (about 5 minutes for fresh pasta). Drain, reserving 1 cup pasta cooking liquid.",
            "Meanwhile, heat remaining 1 tablespoon oil in same skillet over medium heat. Add guanciale and cook, stirring often, until slightly crisp, about 4 minutes. Add pepper and cook, stirring, until fragrant, about 30 seconds. Immediately add 1/2 cup pasta cooking liquid to keep pasta from burning; reduce heat to low and gradually add butter, swirling skillet and adding more pasta cooking liquid as needed, until a thick, glossy sauce forms. (Taste as you go and switch to hot water once sauce is adequately seasoned.)",
            "Add pasta to skillet and toss to coat. Add Pecorino; toss to combine. Remove from heat; mix in egg yolks. Add reserved Brussels sprout leaves; toss, adding pasta cooking liquid (or hot water) as needed to thin sauce.",
            "Serve pasta topped with more Pecorino."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad70736529d92b2c046fdf/6:4/w_274%2Ch_169/51187460_orecchiette-carbonara_1x1.jpg"
    }
}