{
    "recipe": {
        "title": "Orecchiette with Buttermilk, Peas, and Pistachios ",
        "ingredients": [
            "1/4 cup pistachios",
            "12 oz. orecchiette",
            "Kosher salt",
            "12 oz. peas (such as shelled fresh or frozen English and/or halved sugar snap)",
            "3 Tbsp. unsalted butter",
            "2 Tbsp. extra-virgin olive oil, plus more for drizzling",
            "2 medium leeks, white and pale green parts only, cut in half lengthwise, thinly sliced",
            "3 garlic cloves, thinly sliced",
            "1/2 tsp. crushed red pepper flakes",
            "1 small bunch mint, divided",
            "3/4 cup buttermilk",
            "3 oz. Parmesan, finely grated, plus more for serving",
            "Freshly ground black pepper",
            "2 Tbsp. fresh lemon juice."
        ],
        "instructions": [
            "Preheat oven to 350°F. Toast pistachios on a rimmed baking sheet, tossing once, until golden brown, 5–8 minutes. Let cool, then coarsely crush with a measuring cup or glass.",
            "Cook pasta in a large pot of boiling salted water 6 minutes, then add peas and cook until pasta is al dente, about 2 minutes more.",
            "Meanwhile, heat butter and 2 Tbsp. oil in a medium heavy pot over medium. Cook leeks, garlic, red pepper flakes, and 3 mint sprigs, stirring occasionally, until leeks are soft but not browned, 6–8 minutes; season with salt. Add buttermilk; bring to a simmer. Pluck out mint; discard.",
            "Using a slotted spoon, transfer pasta and peas to leek mixture. Add 3 oz. Parmesan; cook, stirring vigorously and adding a little pasta water if needed, until sauce is creamy and coats pasta, about 1 minute. Season with salt and pepper. Remove from heat; add lemon juice. Pull leaves from remaining mint sprigs, tear into pasta, and toss. Divide pasta among bowls. Top with pistachios and Parmesan; drizzle with oil."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b16fb13bf24904d9ece7fc0/6:4/w_274%2Ch_169/orecchiette-pasta-with-buttermilk-peas-and-pistachios-recipe-BA-060518.jpg",
        "color": 14878458
    }
}