{
    "recipe": {
        "title": "Our Favorite Thanksgiving Stuffing with Sausage and Cornbread ",
        "ingredients": [
            "1/2 cup (1 stick) unsalted butter, plus more for pan",
            "1/2 pound good-quality day-old crusty country-style or peasant bread, torn into 3/4\" pieces (about 5 cups)",
            "1/2 pound day-old cornbread, broken into 3/4\" pieces (about 5 cups)",
            "1 pound breakfast sausage links, casings removed, or ground breakfast sausage mix, broken up into 1/2\" pieces",
            "2 1/2 cups chopped onions (about 1 medium plus 1 large onion)",
            "3 medium celery stalks, sliced",
            "2 large eggs",
            "2 1/2 cups low-sodium chicken broth",
            "1/2 cup chopped parsley",
            "2 tablespoons chopped sage",
            "1 tablespoon chopped thyme",
            "2 teaspoons chopped rosemary",
            "2 teaspoons kosher salt",
            "1 teaspoon freshly ground black pepper",
            "A 13x9x2\" or other 3-quart baking dish"
        ],
        "instructions": [
            "Preheat oven to 300°F. Butter baking dish; set aside. Arrange bread and cornbread in a single layer on a rimmed baking sheet. Bake, tossing occasionally, until completely dried out, 35–50 minutes. Let cool on baking sheet, then transfer to a very large bowl.",
            "Meanwhile, heat a large skillet over medium-high. Break sausage into 1/2\" pieces and cook, stirring and breaking up into smaller (about 1/4\") pieces with a wooden spoon or spatula, until browned, 8–10 minutes. Transfer to bowl with bread but do not stir.",
            "Heat remaining 1 stick butter in same skillet over medium-high. Cook onions and celery, stirring often and scraping browned bits off bottom of pan, until just beginning to brown, about 10 minutes. Add to bowl with bread mixture and let cool.",
            "Whisk eggs, broth, parsley, sage, thyme, rosemary, salt, and pepper in a medium bowl. Add to bread mixture and fold gently until thoroughly combined.",
            "Increase oven temperature to 350°F. Transfer mixture to prepared dish, cover with foil, and bake stuffing until an instant-read thermometer inserted into the center registers 160°F, 40–45 minutes. Uncover and continue to bake until set and top is browned and crisped, 45–50 minutes more.",
            "Do Ahead Stuffing can be assembled, but not baked, 1 day ahead. Cover and chill. When ready to bake, bring to room temperature and bake according to recipe. Stuffing can be baked 1 day ahead. Let cool completely, then cover with foil and chill. Keep covered and bake in a 350°F oven until warmed through, 25–30 minutes. Uncover and bake until top is crisped, 7–10 minutes more.",
            "Stuffing can be assembled, but not baked, 1 day ahead. Cover and chill. When ready to bake, bring to room temperature and bake according to recipe. Stuffing can be baked 1 day ahead. Let cool completely, then cover with foil and chill. Keep covered and bake in a 350°F oven until warmed through, 25–30 minutes. Uncover and bake until top is crisped, 7–10 minutes more."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59dba33272bac22d1335f691/6:4/w_274%2Ch_169/Our-Favorite-Thanksgiving-Stuffing-with-Sausage-and-Cornbread-07092017.jpg",
        "color": 6571638
    }
}