{
    "recipe": {
        "title": "Oven-Baked Beef Meatballs ",
        "ingredients": [
            "1 large egg",
            "4 garlic cloves, 2 finely grated, 2 thinly sliced",
            "3 tablespoons white miso",
            "3 tablespoons whole milk",
            "1 1/2 teaspoons berbere or garam masala",
            "1 teaspoon kosher salt, plus more",
            "3/4 ounces Pecorino, finely grated (about 3/4 cup)",
            "3 tablespoons panko (Japanese breadcrumbs)",
            "1 pound ground beef",
            "2 tablespoons dried currants",
            "2 bunches Tuscan kale, ribs and stems removed, leaves torn",
            "3 tablespoons olive oil, divided",
            "8 small radishes, trimmed, halved lengthwise",
            "1 tablespoon fresh lemon juice"
        ],
        "instructions": [
            "Preheat oven to 400°F. Whisk egg, grated garlic, miso, milk, berbere, and 1 tsp. salt in a large bowl. Mix in Pecorino and panko. Add beef and currants and gently mix with your hands just until all ingredients are evenly incorporated (be careful not to overmix). Working one at a time, scoop out 2 heaping Tbsp. (about 1 1/2 oz.) mixture and roll into balls between your palms. Place on a foil-lined rimmed baking sheet, spacing 2\" apart (you should end up with about 15). Bake meatballs until lightly browned on top and cooked through, 20–25 minutes. Meanwhile, place kale in a large colander in the sink and pour 8 cups boiling water over top to wilt leaves. Run under cold water to rinse, then squeeze leaves thoroughly with your hands to remove excess liquid. Heat 2 Tbsp. oil in a large skillet over medium-high. Add radishes and cook, tossing occasionally, until golden and crisp-tender, 5–7 minutes. Add kale and stir, breaking up leaves, until warmed through. Push kale and radishes to one side of skillet. Pour remaining 1 Tbsp. oil on the empty side and add sliced garlic. As soon as garlic starts to sizzle, stir it into vegetables. Remove pan from heat and add lemon juice to mixture; season with salt. Toss well. Tear meatballs in half and add to skillet along with any pan juices. Toss everything together; divide among plates.",
            "Preheat oven to 400°F. Whisk egg, grated garlic, miso, milk, berbere, and 1 tsp. salt in a large bowl. Mix in Pecorino and panko. Add beef and currants and gently mix with your hands just until all ingredients are evenly incorporated (be careful not to overmix).",
            "Working one at a time, scoop out 2 heaping Tbsp. (about 1 1/2 oz.) mixture and roll into balls between your palms. Place on a foil-lined rimmed baking sheet, spacing 2\" apart (you should end up with about 15). Bake meatballs until lightly browned on top and cooked through, 20–25 minutes.",
            "Meanwhile, place kale in a large colander in the sink and pour 8 cups boiling water over top to wilt leaves. Run under cold water to rinse, then squeeze leaves thoroughly with your hands to remove excess liquid.",
            "Heat 2 Tbsp. oil in a large skillet over medium-high. Add radishes and cook, tossing occasionally, until golden and crisp-tender, 5–7 minutes. Add kale and stir, breaking up leaves, until warmed through. Push kale and radishes to one side of skillet. Pour remaining 1 Tbsp. oil on the empty side and add sliced garlic. As soon as garlic starts to sizzle, stir it into vegetables. Remove pan from heat and add lemon juice to mixture; season with salt. Toss well.",
            "Tear meatballs in half and add to skillet along with any pan juices. Toss everything together; divide among plates."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ad89f1a20e37426cda1911a/6:4/w_274%2Ch_169/baked-beef-meatballs-with-sweet-spices-recipe-BA-041918.jpg"
    }
}