{
    "recipe": {
        "title": "Oxtail and Red Wine Stew ",
        "ingredients": [
            "3 Tbsp. extra-virgin olive oil",
            "1/2 cup panko (Japanese breadcrumbs)",
            "Kosher salt, freshly ground pepper",
            "2 Tbsp. finely chopped chives",
            "2 tsp. thyme leaves",
            "1 medium beet, preferably golden, trimmed, peeled",
            "1 small knob horseradish, peeled",
            "1 Tbsp. red wine vinegar",
            "1/2 tsp. honey",
            "Kosher salt, freshly ground pepper",
            "5 lb. oxtails or beef short ribs, cut into 2\" segments, patted dry",
            "Kosher salt, freshly ground pepper",
            "3 Tbsp. extra-virgin olive oil",
            "2 large leeks, white and pale green parts only, halved lengthwise, then sliced crosswise into 1/2\" pieces",
            "4 celery stalks, sliced 1/2\" thick",
            "2 heads of garlic, halved crosswise",
            "1/4 cup tomato paste",
            "1 (750-ml) bottle red wine",
            "1 bunch thyme, stems tied together with kitchen twine",
            "Parsley leaves, grated Parmesan, and/or sliced jarred pepperoncini (for serving; optional)"
        ],
        "instructions": [
            "Heat oil in a medium skillet over medium. As soon as oil is shimmering, add panko and cook, stirring often, until golden brown, about 3 minutes. Season with salt and pepper. Remove from heat and mix in chives and thyme. Let cool.",
            "Horseradish-Beet Relish: Grate beet on the large holes of a box grater into a medium bowl. Grate about 1” of horseradish on the small holes of grater into the same bowl. Add vinegar and honey and season with salt and pepper; mix well. Let sit at room temperature at least 15 minutes before serving.",
            "Grate beet on the large holes of a box grater into a medium bowl. Grate about 1” of horseradish on the small holes of grater into the same bowl. Add vinegar and honey and season with salt and pepper; mix well. Let sit at room temperature at least 15 minutes before serving.",
            "Stew and assembly: Season oxtails very generously all over with salt and pepper. Heat oil in a large Dutch oven or other heavy pot over medium-high. Working in 2 batches, cook oxtail in a single layer, turning once, until browned on both sides, 8–10 minutes per batch. As oxtail pieces finish cooking, transfer to a large plate. Reduce heat to medium and cook leeks, celery, and garlic, cut side down, in the same pot, stirring leeks and celery occasionally, until leeks are softened and browned in spots and garlic is golden brown, about 5 minutes. Add tomato paste and cook, stirring constantly and scraping bottom of pot, until vegetables are coated and paste is slightly darkened in color, about 3 minutes. Gradually add wine, stirring to release any bits stuck on bottom of pot, then add 6 cups water and thyme. Season generously with salt and pepper and bring to a simmer. Return oxtails to pot and bring stew back up to a simmer. Cover with a lid, leaving slightly askew so steam can escape and cook, adjusting heat to maintain a very gentle simmer and skimming foam from surface as needed, until meat is fork-tender, 3–31/2 hours. Uncover and remove pot from heat. Transfer oxtails to a cutting board and let cool 15–20 minutes. Pull meat from bones and tear into bite-size pieces; discard fat and cartilage. Add meat and bones back to pot as you go. Let stew cool uncovered (bones and all) until no longer steaming. Cover pot and chill stew at least 12 hours (you can skip this step, but it will dramatically improve the flavor). Uncover stew and spoon off half to three-quarters of fat on the surface; discard. Gently reheat stew until barely simmering. Pluck out and discard bones, thyme, and garlic heads (don't worry about any cloves that may have escaped into stew). Taste and season with more salt and pepper if needed. Ladle into bowls and serve with Herby Panko, Horseradish-Beet Relish, parsley, Parmesan, and/or pepperoncini as desired.",
            "Season oxtails very generously all over with salt and pepper. Heat oil in a large Dutch oven or other heavy pot over medium-high. Working in 2 batches, cook oxtail in a single layer, turning once, until browned on both sides, 8–10 minutes per batch. As oxtail pieces finish cooking, transfer to a large plate.",
            "Reduce heat to medium and cook leeks, celery, and garlic, cut side down, in the same pot, stirring leeks and celery occasionally, until leeks are softened and browned in spots and garlic is golden brown, about 5 minutes. Add tomato paste and cook, stirring constantly and scraping bottom of pot, until vegetables are coated and paste is slightly darkened in color, about 3 minutes. Gradually add wine, stirring to release any bits stuck on bottom of pot, then add 6 cups water and thyme. Season generously with salt and pepper and bring to a simmer. Return oxtails to pot and bring stew back up to a simmer. Cover with a lid, leaving slightly askew so steam can escape and cook, adjusting heat to maintain a very gentle simmer and skimming foam from surface as needed, until meat is fork-tender, 3–31/2 hours.",
            "Uncover and remove pot from heat. Transfer oxtails to a cutting board and let cool 15–20 minutes. Pull meat from bones and tear into bite-size pieces; discard fat and cartilage. Add meat and bones back to pot as you go. Let stew cool uncovered (bones and all) until no longer steaming. Cover pot and chill stew at least 12 hours (you can skip this step, but it will dramatically improve the flavor).",
            "Uncover stew and spoon off half to three-quarters of fat on the surface; discard. Gently reheat stew until barely simmering. Pluck out and discard bones, thyme, and garlic heads (don't worry about any cloves that may have escaped into stew). Taste and season with more salt and pepper if needed. Ladle into bowls and serve with Herby Panko, Horseradish-Beet Relish, parsley, Parmesan, and/or pepperoncini as desired.",
            "Do Ahead Relish can be made 2 days ahead. Cover and chill. Stew can be made 3 days ahead. Keep chilled.",
            "Relish can be made 2 days ahead. Cover and chill. Stew can be made 3 days ahead. Keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5bc4da294956fe2e1197c67b/6:4/w_274%2Ch_169/oxtail-and-red-wine-stew-bowl-recipe-BA-101518.jpg"
    }
}