{
    "recipe": {
        "title": "Oysters with Champagne-Vinegar Mignonette ",
        "ingredients": [
            "2 teaspoons Champagne vinegar",
            "1 1/2 teaspoons finely chopped shallot",
            "Pinch of coarsely ground black pepper",
            "Pinch of sugar",
            "1 teaspoon finely chopped fresh flat-leaf parsley",
            "1 1/2 cups kosher or other coarse salt",
            "1/2 dozen small oysters, such as Kumamoto or Prince Edward Island, shells scrubbed well and oysters left on the half shell, their liquor reserved and oysters picked over for shell fragments",
            "1/2 tablespoon unsalted butter, cut into 6 pieces",
            "1 small cluster Champagne table grapes or 2 finely diced seedless red grapes"
        ],
        "instructions": [
            "Make mignonnette: Stir together vinegar, shallot, pepper, and sugar and let stand 30 minutes.",
            "Stir together vinegar, shallot, pepper, and sugar and let stand 30 minutes.",
            "Prepare oysters: Preheat broiler. Spread 3/4 cup salt in an 8- to 10-inch flameproof shallow baking dish or pan. Arrange oysters on their shells in salt, then top each with a piece of butter. Broil 4 to 6 inches from heat until butter is melted and sizzling and edges of oysters are beginning to curl, 1 to 2 minutes. Stir parsley into mignonnette. Divide remaining 3/4 cup salt between 2 plates and arrange 3 oysters on each. Spoon 1/4 teaspoon mignonnette over each oyster and sprinkle oysters with grapes. Serve warm.",
            "Preheat broiler.",
            "Spread 3/4 cup salt in an 8- to 10-inch flameproof shallow baking dish or pan. Arrange oysters on their shells in salt, then top each with a piece of butter.",
            "Broil 4 to 6 inches from heat until butter is melted and sizzling and edges of oysters are beginning to curl, 1 to 2 minutes.",
            "Stir parsley into mignonnette. Divide remaining 3/4 cup salt between 2 plates and arrange 3 oysters on each. Spoon 1/4 teaspoon mignonnette over each oyster and sprinkle oysters with grapes. Serve warm."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de5b1f3a00aeb2f1d54e4/6:4/w_274%2Ch_169/232602.jpg"
    }
}