{
    "recipe": {
        "title": "Paella with Tomatoes and Eggs ",
        "ingredients": [
            "3 1/2 cups vegetable stock or water, plus more if needed",
            "Large pinch saffron threads (optional)",
            "1 pound fresh tomatoes, cored, cut into thick wedges, and seeded",
            "Salt and pepper",
            "4 tablespoons olive oil",
            "1 onion, chopped",
            "1 tablespoon minced garlic",
            "1 tablespoon tomato paste",
            "2 teaspoons smoked or other paprika",
            "2 cups Spanish or other short-grain white rice or parcooked short-grain brown rice",
            "4–6 eggs",
            "Chopped fresh parsley for garnish"
        ],
        "instructions": [
            "Heat the oven to 450°F. Warm the stock in a medium saucepan with the saffron if you’re using it. Put the tomatoes in a bowl, sprinkle with salt and pepper, and drizzle them with 1 tablespoon of the olive oil. Toss gently to coat.",
            "Put the remaining oil in a large ovenproof skillet over medium-high heat. Add the onion and garlic, sprinkle with salt and pepper, and cook, stirring occasionally, until the onion is soft, 3 to 5 minutes. Stir in the tomato paste and paprika and cook for a minute more. Add the rice and cook, stirring occasionally, until it’s shiny, another minute or 2. Carefully add the stock and stir until just combined.",
            "Put the tomato wedges on top of the rice and drizzle with the juices that accumulated in the bottom of the bowl. Use a large spoon to make 4 to 6 indentations in the rice and carefully crack an egg into each. Put the pan in the oven and roast, undisturbed, for 15 minutes. Check to see if the rice is dry and just tender. If not, return the pan to the oven for another 5 minutes. If the rice looks too dry at this point and still isn’t quite done, add a small amount of stock, wine, or water. When the rice is ready, turn off the oven and let it sit for at least 5 and up to 15 minutes.",
            "Remove the pan from the oven and sprinkle with parsley. If you like, put the pan over high heat for a few minutes to develop a bit of a bottom crust before serving.",
            "PAELLA WITH EGGPLANT Instead of tomatoes and eggs, use 1 pound eggplant, peeled if you like, and cubed. In Step 1, increase the oil to 2 tablespoons.",
            "Instead of tomatoes and eggs, use 1 pound eggplant, peeled if you like, and cubed. In Step 1, increase the oil to 2 tablespoons.",
            "PAELLA WITH MUSHROOM CAPS Instead of tomatoes and eggs, use 1 pound fresh mushrooms like cremini (sometimes called “baby bellas”) or shiitake. Trim the stems and save them for another use, but leave the caps whole. Proceed with the recipe, putting the caps on top of the rice, smooth side up.",
            "Instead of tomatoes and eggs, use 1 pound fresh mushrooms like cremini (sometimes called “baby bellas”) or shiitake. Trim the stems and save them for another use, but leave the caps whole. Proceed with the recipe, putting the caps on top of the rice, smooth side up.",
            "PAELLA WITH SPINACH AND LEMON ZEST You’ll have to pile the spinach up on top of the rice, but it will cook down and form a lovely green topping: Instead of tomatoes and eggs, use 1 pound fresh spinach, rinsed, trimmed of thick stems, and chopped. When you put it in the bowl with the olive oil, add 1 tablespoon minced lemon zest.",
            "You’ll have to pile the spinach up on top of the rice, but it will cook down and form a lovely green topping: Instead of tomatoes and eggs, use 1 pound fresh spinach, rinsed, trimmed of thick stems, and chopped. When you put it in the bowl with the olive oil, add 1 tablespoon minced lemon zest.",
            "PAELLA WITH FAVA BEANS You could also make this with limas or edamame: Instead of the tomatoes and eggs, use 1 cup shelled and peeled fava beans (frozen are fine).",
            "You could also make this with limas or edamame: Instead of the tomatoes and eggs, use 1 cup shelled and peeled fava beans (frozen are fine)."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a4bf2f06a1b7c6cea6b14bf/6:4/w_274%2Ch_169/Vegetarian%20Paella%20How%20to%20Cook%20Everything%20Vegetarian.jpg",
        "color": 2532167
    }
}