{
    "recipe": {
        "title": "Pancake Cake with Maple Cream Frosting ",
        "ingredients": [
            "1 cup all-purpose flour (spooned into cup and leveled off)",
            "1/3 cup rye or whole wheat flour",
            "2 tablespoons cornmeal",
            "1/4 cup granulated sugar",
            "2 tablespoons light brown sugar",
            "2 teaspoons baking powder",
            "1/2 teaspoon salt",
            "1 1/4 cups milk",
            "2 large eggs",
            "2 large egg yolks",
            "2 tablespoons unsalted butter, melted, plus more for the pan",
            "3/4 teaspoon pure vanilla extract",
            "11 ounces cream cheese, at room temperature",
            "1/4 cup whole-milk Greek yogurt",
            "5 tablespoons maple syrup, preferably Grade B",
            "3 tablespoons confectioners' sugar, sifted"
        ],
        "instructions": [
            "In a large bowl, whisk together the all-purpose flour, rye flour, cornmeal, granulated and brown sugars, baking powder, and salt. In a separate bowl, whisk together the milk, whole eggs, egg yolks, butter, and vanilla. Make a well in the center of the dry ingredients and fold in the wet just until moistened.",
            "Coat 8-inch skillet with some melted butter and heat over medium-low heat. Pour 1/2 cup of the batter into the pan and cook for 1 1/2 minutes, or until large bubbles appear on the surface of the pancake. Carefully flip the pancake over and cook for 1 minute longer, or until the underside is just cooked through. Transfer to a plate and repeat with the remaining batter to make 6 pancakes and let cool to room temperature.",
            "To make the filling: In a bowl, with and electric mixer, beat the cream cheese and yogurt until smooth. Beat in 4 tablespoons of the maple syrup and the confectioners' sugar until well combined.",
            "In a bowl, with and electric mixer, beat the cream cheese and yogurt until smooth. Beat in 4 tablespoons of the maple syrup and the confectioners' sugar until well combined.",
            "To assemble the cake: Spread each pancake with one-sixth of the filling (about 5 tablespoons). Place one of the pancakes on a platter and stack the remaining pancakes on top. Drizzle the remaining 1 tablespoon maple syrup over the top of the cake.",
            "Spread each pancake with one-sixth of the filling (about 5 tablespoons). Place one of the pancakes on a platter and stack the remaining pancakes on top. Drizzle the remaining 1 tablespoon maple syrup over the top of the cake."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad650a19925f464b3b5f1f/6:4/w_274%2Ch_169/51196630_pancake-cake_1x1.jpg",
        "color": 9206057
    }
}