{
    "recipe": {
        "title": "Pan-Grilled New York Strip Steaks with Green Olive Tapenade ",
        "ingredients": [
            "1/2 cup slivered almonds, toasted",
            "1 pound mild green brine-cured olives (such as Picholine), pitted",
            "5 tablespoons olive oil",
            "2 tablespoons drained capers",
            "4 anchovy fillets",
            "2 garlic cloves",
            "2 2-inch-thick New York strip steaks (each about 1 1/4 pounds)",
            "2 tablespoons chopped fresh rosemary"
        ],
        "instructions": [
            "Place almonds in processor and grind finely; transfer to small bowl. Place olives, oil, capers, anchovies, and garlic in processor. Blend until fine paste forms. Add almonds; blend 5 seconds. Season tapenade with salt and pepper. (Can be made 2 days ahead. Cover and chill.) Sprinkle steaks generously with salt and pepper. Coat steaks with rosemary, pressing to adhere. Heat 2 heavy medium skillets (preferably cast-iron) over high heat 5 minutes. Place 1 steak in each pan. Sear steaks 3 minutes; turn over and sear second side 3 minutes. Reduce heat to medium-high. Continue to cook, turning every 3 minutes, until steaks are cooked to desired doneness, about 15 minutes longer for medium-rare (thermometer inserted into center will register 130°F). Transfer steaks to platter; let stand 10 minutes. Slice steaks thinly. Serve with tapenade.",
            "Place almonds in processor and grind finely; transfer to small bowl. Place olives, oil, capers, anchovies, and garlic in processor. Blend until fine paste forms. Add almonds; blend 5 seconds. Season tapenade with salt and pepper. (Can be made 2 days ahead. Cover and chill.)",
            "Sprinkle steaks generously with salt and pepper. Coat steaks with rosemary, pressing to adhere. Heat 2 heavy medium skillets (preferably cast-iron) over high heat 5 minutes. Place 1 steak in each pan. Sear steaks 3 minutes; turn over and sear second side 3 minutes. Reduce heat to medium-high. Continue to cook, turning every 3 minutes, until steaks are cooked to desired doneness, about 15 minutes longer for medium-rare (thermometer inserted into center will register 130°F). Transfer steaks to platter; let stand 10 minutes. Slice steaks thinly. Serve with tapenade."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea1897b55306961bff128/6:4/w_274%2Ch_169/107647.jpg"
    }
}