{
    "recipe": {
        "title": "Panna Cotta with Strawberry-Vin Santo Sauce ",
        "ingredients": [
            "1/4 cup cold water",
            "4 teaspoons unflavored gelatin",
            "4 cups whipping cream",
            "1 cup sugar",
            "1 tablespoon orange blossom honey",
            "1/4 teaspoon vanilla extract",
            "1 tablespoon Vin Santo,* Muscat wine or cream Sherry",
            "2 cups pine nuts (about 9 ounces)",
            "Strawberry-Vin Santo Sauce",
            "Additional pine nuts"
        ],
        "instructions": [
            "Pour 1/4 cup water into metal bowl; sprinkle gelatin over. Let stand until gelatin softens, about 10 minutes. Set bowl in saucepan of simmering water. Stir just until gelatin dissolves, about 1 minute. Combine cream, sugar, honey and vanilla in heavy large saucepan. Bring to boil, stirring until sugar dissolves. Remove from heat. Add gelatin mixture and Vin Santo; whisk until well blended. Divide 2 cups pine nuts among ten 3/4-cup custard cups. Divide cream mixture among cups. Chill overnight. Set cups in small bowl of warm water to loosen panna cotta, about 20 seconds each. Run small knife between panna cotta and custard cups. Invert panna cotta onto plates. Spoon sauce over. Sprinkle with additional pine nuts; serve.",
            "Pour 1/4 cup water into metal bowl; sprinkle gelatin over. Let stand until gelatin softens, about 10 minutes. Set bowl in saucepan of simmering water. Stir just until gelatin dissolves, about 1 minute.",
            "Combine cream, sugar, honey and vanilla in heavy large saucepan. Bring to boil, stirring until sugar dissolves. Remove from heat. Add gelatin mixture and Vin Santo; whisk until well blended.",
            "Divide 2 cups pine nuts among ten 3/4-cup custard cups. Divide cream mixture among cups. Chill overnight. Set cups in small bowl of warm water to loosen panna cotta, about 20 seconds each. Run small knife between panna cotta and custard cups. Invert panna cotta onto plates. Spoon sauce over. Sprinkle with additional pine nuts; serve.",
            "*An Italian dessert wine available at some liquor stores and specialty foods stores.",
            "*An Italian dessert wine available at some liquor stores and specialty foods stores."
        ],
        "picture_link": "https://assets.epicurious.com/photos/561025fbf3a00aeb2f1d7aaa/6:4/w_274%2Ch_169/103466.jpg"
    }
}