{
    "recipe": {
        "title": "Panna Cotta with Strawberries and Balsamic Vinegar ",
        "ingredients": [
            "2 tablespoons water",
            "1 1/4 teaspoons unflavored gelatin",
            "2 cups whipping cream",
            "1 1/4 cups plain goat's-milk or whole-milk yogurt",
            "1 teaspoon vanilla extract",
            "1/2 cup sugar",
            "2 1-pint baskets strawberries, hulled, thinly sliced",
            "3 tablespoons balsamic vinegar",
            "1 tablespoon sugar",
            "1/2 teaspoon freshly ground black pepper"
        ],
        "instructions": [
            "For panna cotta: Pour 2 tablespoons water into small bowl. Sprinkle gelatin over water. Let stand until softened, about 15 minutes. Whisk 1 cup cream, yogurt, and vanilla in large bowl to blend. Heat remaining 1 cup cream and 1/2 cup sugar in small saucepan over medium heat, stirring until sugar dissolves and cream comes to simmer. Remove from heat. Add gelatin mixture, stirring to dissolve gelatin. Mix hot cream-gelatin mixture into yogurt mixture in bowl. Divide mixture among six 3/4-cup ramekins, using about 1/2 cup for each. Refrigerate desserts uncovered until cold, then cover and refrigerate overnight.",
            "Pour 2 tablespoons water into small bowl. Sprinkle gelatin over water. Let stand until softened, about 15 minutes. Whisk 1 cup cream, yogurt, and vanilla in large bowl to blend. Heat remaining 1 cup cream and 1/2 cup sugar in small saucepan over medium heat, stirring until sugar dissolves and cream comes to simmer. Remove from heat. Add gelatin mixture, stirring to dissolve gelatin. Mix hot cream-gelatin mixture into yogurt mixture in bowl. Divide mixture among six 3/4-cup ramekins, using about 1/2 cup for each. Refrigerate desserts uncovered until cold, then cover and refrigerate overnight.",
            "For strawberries: Toss strawberries, vinegar, sugar, and pepper in large bowl to combine. Let stand 30 minutes, tossing occasionally. Spoon strawberries over panna cotta and serve.",
            "Toss strawberries, vinegar, sugar, and pepper in large bowl to combine. Let stand 30 minutes, tossing occasionally. Spoon strawberries over panna cotta and serve."
        ],
        "picture_link": null
    }
}