{
    "recipe": {
        "title": "Panna Cotta with Lemon-Thyme Peaches ",
        "ingredients": [
            "1 1/4 teaspoon unflavored gelatin (from a 1/4-ounce envelope)",
            "2 tablespoon water",
            "1 1/4 cups heavy cream",
            "1 cup plain low-fat yogurt",
            "1/4 cup mild honey",
            "1/8 teaspoon pure almond extract",
            "1 1/2 tablespoon fresh lemon-thyme leaves",
            "1 tablespoon sugar",
            "3 peaches, peeled if desired, pitted, and thinly sliced"
        ],
        "instructions": [
            "Make panna cotta: Sprinkle gelatin over water in a small heavy saucepan and let stand 1 minute to soften. Stir in cream and 1/8 tsp salt, then heat gently over medium-low heat, stirring, until gelatin has dissolved. Whisk together yogurt, honey, and almond extract, then whisk in cream mixture. Pour mixture into 4 small bowls and chill, covered, until set, at least 8 hours.",
            "Sprinkle gelatin over water in a small heavy saucepan and let stand 1 minute to soften. Stir in cream and 1/8 tsp salt, then heat gently over medium-low heat, stirring, until gelatin has dissolved.",
            "Whisk together yogurt, honey, and almond extract, then whisk in cream mixture.",
            "Pour mixture into 4 small bowls and chill, covered, until set, at least 8 hours.",
            "Prepare peaches: Mince lemon thyme with sugar, then toss with peaches. Let macerate, stirring occasionally, at room temperature 20 minutes. While peaches macerate, let panna cotta stand at room temperature.",
            "Mince lemon thyme with sugar, then toss with peaches. Let macerate, stirring occasionally, at room temperature 20 minutes. While peaches macerate, let panna cotta stand at room temperature.",
            "To serve: Top bowls of panna cotta with peaches and their juice. Drizzle with additional honey if desired.",
            "Top bowls of panna cotta with peaches and their juice. Drizzle with additional honey if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56321dcc1744353b554e0e5c/6:4/w_274%2Ch_169/0615-FS-BRUN03.jpg"
    }
}