{
    "recipe": {
        "title": "Pan-Roasted Sirloin with Corn Relish ",
        "ingredients": [
            "1 cup white wine vinegar",
            "1/4 cup sugar",
            "1 clove garlic, peeled and minced",
            "1 tbsp grated fresh ginger",
            "2 sprigs fresh thyme",
            "2 tsp olive oil",
            "1 small yellow onion, diced",
            "1 small red pepper, diced",
            "1/2 to 1 small jalapeño pepper, seeded and minced",
            "1 tsp salt",
            "2 cups fresh or frozen corn kernels",
            "5 scallions, white parts only, chopped",
            "3 tbsp chopped fresh chives",
            "1 sirloin steak (14 oz) at least 1 1/2 inches thick, cut in half",
            "1 tsp vegetable oil",
            "2 sprigs fresh thyme or rosemary"
        ],
        "instructions": [
            "In a small saucepan, bring vinegar and sugar to a boil, stirring to dissolve sugar. Reduce heat and add garlic, ginger, and thyme. Simmer 10 minutes, until mixture is reduced to 3/4 cup. Remove pot from heat. Heat oil in large saucepan over medium heat. Add onion, red pepper, jalapeño, and salt. Cook, stirring, until pepper softens. Stir in corn and scallions. Cook 2 minutes longer. Add vinegar mixture to corn mixture; simmer 5 minutes. Cool to room temperature in fridge. Stir in chives.",
            "For pan-roasted sirloin: Season steaks with salt and pepper. Sprinkle oil on a nonstick skillet, then wipe it clean. Heat skillet, then add steaks and cook on medium-high heat for 3 minutes until brown on one side; turn steaks and cook 3 minutes more. Add fresh herbs to pan. Continue cooking steaks, turning from side to side, until done (13 to 15 minutes total for medium rare). Remove steaks from skillet and set aside to rest for 10 minutes. Slice and serve with room-temperature corn relish on top.",
            "Season steaks with salt and pepper. Sprinkle oil on a nonstick skillet, then wipe it clean. Heat skillet, then add steaks and cook on medium-high heat for 3 minutes until brown on one side; turn steaks and cook 3 minutes more. Add fresh herbs to pan. Continue cooking steaks, turning from side to side, until done (13 to 15 minutes total for medium rare). Remove steaks from skillet and set aside to rest for 10 minutes. Slice and serve with room-temperature corn relish on top."
        ],
        "picture_link": null,
        "color": 8932522
    }
}