{
    "recipe": {
        "title": "Pan-Roasted Steak with Crispy Broccoli ",
        "ingredients": [
            "2 large heads of broccoli (about 2 1/2 lb. total)",
            "6 Tbsp. plus 3/4 cup extra-virgin olive oil",
            "1/2 tsp. kosher salt, divided, plus more",
            "Freshly ground black pepper",
            "1/2 cup finely chopped shallot or red onion",
            "1/4 cup fresh lime juice",
            "3 (12-oz.) sirloin, boneless rib-eye, or New York strip steaks (about 1 1/4\" thick)",
            "2 tsp. vegetable oil",
            "1 cup finely chopped cilantro",
            "2 Tbsp. rinsed capers, coarsely chopped",
            "1/2 jalapeño, finely chopped"
        ],
        "instructions": [
            "Place racks in upper and lower thirds of oven; preheat to 425°F. Cut broccoli into large florets with some stalk attached. Divide between 2 rimmed baking sheets lined with parchment or foil. Drizzle each with 3 Tbsp. olive oil; season generously with salt and some pepper. Toss to combine. Roast, tossing and rotating baking sheets halfway through, until crisp around the edges and charred in spots, 35–40 minutes. Season with more salt and pepper if desired. Meanwhile, mix shallot, lime juice, and 1/2 tsp. salt in a small bowl. Set aside. Season steaks generously all over with salt and pepper, pressing to adhere. Heat a dry large skillet, preferably cast iron, over medium-high. Swirl vegetable oil in pan to coat. Pat steaks dry; cook 2 steaks, undisturbed, until undersides are browned, about 5 minutes. Turn; cook until other sides are browned and an instant-read thermometer inserted into the thickest part registers 130°F for medium-rare, about 5 minutes. Turn steaks onto fat cap and cook until browned, about 3 minutes. Transfer to a cutting board and let rest 10 minutes. Wipe out skillet, leaving just enough fat to coat pan. Repeat with remaining steak. Mix cilantro, capers, jalapeño, and remaining 3/4 cup olive oil into reserved shallot mixture. Reserve 1 steak and 1/4 cup cilantro salsa verde for making the Steak Sandwiches another night. Thinly slice remaining steaks against the grain. Top with salsa verde and serve with broccoli.",
            "Place racks in upper and lower thirds of oven; preheat to 425°F. Cut broccoli into large florets with some stalk attached. Divide between 2 rimmed baking sheets lined with parchment or foil. Drizzle each with 3 Tbsp. olive oil; season generously with salt and some pepper. Toss to combine. Roast, tossing and rotating baking sheets halfway through, until crisp around the edges and charred in spots, 35–40 minutes. Season with more salt and pepper if desired.",
            "Meanwhile, mix shallot, lime juice, and 1/2 tsp. salt in a small bowl. Set aside.",
            "Season steaks generously all over with salt and pepper, pressing to adhere. Heat a dry large skillet, preferably cast iron, over medium-high. Swirl vegetable oil in pan to coat. Pat steaks dry; cook 2 steaks, undisturbed, until undersides are browned, about 5 minutes. Turn; cook until other sides are browned and an instant-read thermometer inserted into the thickest part registers 130°F for medium-rare, about 5 minutes. Turn steaks onto fat cap and cook until browned, about 3 minutes. Transfer to a cutting board and let rest 10 minutes. Wipe out skillet, leaving just enough fat to coat pan. Repeat with remaining steak.",
            "Mix cilantro, capers, jalapeño, and remaining 3/4 cup olive oil into reserved shallot mixture. Reserve 1 steak and 1/4 cup cilantro salsa verde for making the Steak Sandwiches another night. Thinly slice remaining steaks against the grain. Top with salsa verde and serve with broccoli."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c6442ee11a45745bba9440d/6:4/w_274%2Ch_169/pan-roasted-Steak-with-crispy-broccoli-recipe-BA-010819.jpg"
    }
}