{
    "recipe": {
        "title": "Pan-Roasted Chicken with Shallots and Dates ",
        "ingredients": [
            "4 bone-in, skin-on chicken breast halves",
            "Salt and freshly cracked pepper",
            "2 tablespoons grapeseed oil",
            "4 tablespoons (2 ounces/55 g) unsalted butter, divided",
            "10 shallots, peeled, larger ones halved lengthwise",
            "4 cloves garlic, smashed and roughly chopped",
            "8 to 10 sprigs fresh thyme, divided",
            "1/2 cup (120 ml) dry white wine",
            "1 1/2 cups (360 ml) low-sodium chicken stock",
            "8 Medjool dates, pitted and halved lengthwise",
            "2/3 cup (105 g) green olives, smashed and pitted",
            "1 1/2 tablespoons apple cider vinegar",
            "1 lemon, zested and juiced"
        ],
        "instructions": [
            "Set the chicken out at room temperature for 30 minutes before cooking.",
            "Preheat the oven to 450°F (230°C). Position a rack in the top third of your oven.",
            "Place your largest cast-iron skillet in the oven for 15 minutes. Pat the chicken breasts dry and generously season them on all sides with salt and pepper. Carefully remove the hot skillet from the oven and place it on the stovetop. Add the grapeseed oil to the skillet and heat it over medium-high heat until the oil has a subtle ripple effect. You want the oil to be very hot. Working in two batches, cook the chicken, skin-side down, until the skin is crispy and golden brown, 4 to 5 minutes. Drain off all but 1 tablespoon of oil from the pan.",
            "Remove the chicken from the skillet and set it onto a plate as you build your sauce. Over medium heat, melt 2 tablespoons of the butter in the skillet and add the shallots. Cook the shallots undisturbed for 5 to 6 minutes, until they are caramelized and golden. Add the garlic, a few thyme sprigs, 1 tablespoon of the butter, and season with salt and pepper. Toss the shallots and continue to cook until they begin to soften, 5 to 7 minutes. Deglaze the pan with the wine and reduce it by half. Add a few more thyme sprigs and the stock. Simmer the sauce over medium to low heat for 15 minutes, until reduced slightly. Check for seasoning and add the dates and olives to the sauce.",
            "Return the chicken breasts to the skillet, skin-side up, and place it in the oven. Roast the chicken until it’s just cooked through, about 20 minutes. An instant-read thermometer inserted in the thickest part of the breast should register 160°F (70°C).",
            "Transfer the chicken breasts to a plate; set them aside and keep warm. Return the skillet to the stovetop over medium to low heat and add the vinegar to the sauce. Simmer until the sauce is thick enough to coat the back of a wooden spoon, 3 to 5 minutes. Remove it from the heat and stir in the remaining 1 tablespoon butter and the lemon juice. Check and adjust the seasoning. Return the chicken to the skillet and serve it immediately, garnished with the remaining thyme and the lemon zest."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a305f4004847a34b821cb52/6:4/w_274%2Ch_169/roasted-chicken-with-shallots-and-dates-recipe-121217.jpg"
    }
}