{
    "recipe": {
        "title": "Pan-Seared Squid with Lemony Aioli and Greens ",
        "ingredients": [
            "1 large egg yolk",
            "1 garlic clove, finely grated",
            "1 tablespoon fresh lemon juice",
            "1/2 cup olive oil",
            "1/4 cup plus 2 tablespoons grapeseed or vegetable oil",
            "Kosher salt, freshly ground pepper",
            "1 pound cleaned squid, bodies halved lengthwise, tentacles left whole",
            "1 tablespoon Sherry vinegar or red wine vinegar",
            "1/4 teaspoon crushed red pepper flakes",
            "8 cups purslane or watercress with tender stems",
            "1 teaspoon finely grated lemon zest"
        ],
        "instructions": [
            "Whisk egg yolk, garlic, and lemon juice in a small bowl. Whisking constantly, slowly drizzle in olive oil and 1/4 cup grapeseed oil, drop by drop at first, and whisk until aioli is thickened and smooth. Season with salt and pepper. Cover aioli and chill. Heat 1 tablespoon grapeseed oil in a large skillet, preferably cast iron, over high heat. Add half of squid and season with salt and pepper. Cook, tossing occasionally, until lightly charred and cooked through, about 2 minutes; transfer to a plate. Repeat with remaining squid and 1 tablespoon grapeseed oil. Return reserved squid to skillet, add vinegar and red pepper flakes, and cook, scraping up browned bits, to deglaze pan, about 1 minute. Transfer squid to a large bowl and toss with purslane and lemon zest; season with salt, pepper, and more vinegar, if desired. Serve salad with aioli. DO AHEAD: Aioli can be made 1 day ahead. Keep chilled.",
            "Whisk egg yolk, garlic, and lemon juice in a small bowl. Whisking constantly, slowly drizzle in olive oil and 1/4 cup grapeseed oil, drop by drop at first, and whisk until aioli is thickened and smooth. Season with salt and pepper. Cover aioli and chill.",
            "Heat 1 tablespoon grapeseed oil in a large skillet, preferably cast iron, over high heat. Add half of squid and season with salt and pepper. Cook, tossing occasionally, until lightly charred and cooked through, about 2 minutes; transfer to a plate. Repeat with remaining squid and 1 tablespoon grapeseed oil. Return reserved squid to skillet, add vinegar and red pepper flakes, and cook, scraping up browned bits, to deglaze pan, about 1 minute.",
            "Transfer squid to a large bowl and toss with purslane and lemon zest; season with salt, pepper, and more vinegar, if desired.",
            "Serve salad with aioli.",
            "DO AHEAD: Aioli can be made 1 day ahead. Keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac884c19925f464b3ab794/6:4/w_274%2Ch_169/51234480_pan-seared-squid_1x1.jpg"
    }
}