{
    "recipe": {
        "title": "Pan-Seared Ribeye with Miso Butter ",
        "ingredients": [
            "1/4 cup (56 g) unsalted butter, softened",
            "2 tbsp (39 g) yellow miso paste",
            "1 tbsp (3 g) thinly sliced green onions",
            "1/4 tsp black pepper",
            "2 large ribeye steaks, at least 1 1/2 inches (3.8 cm) thick",
            "Kosher salt, as desired for seasoning",
            "Black pepper, as desired for seasoning",
            "1 tbsp (15 ml) vegetable oil",
            "1 tbsp (14 g) unsalted butter",
            "3 cloves garlic, roughly chopped",
            "1/4 cup (10 g) thinly sliced white and light green parts of green onion",
            "1/4 cup (10 g) thinly sliced on the bias green onions, for garnish",
            "1/4 cup (4 g) cilantro leaves, for garnish"
        ],
        "instructions": [
            "For the miso butter, combine the softened butter and miso together in a small bowl. Add the green onions and pepper and combine. Keep at room temperature or roll into a 1 1/2-inch (3.8-cm) wide log in plastic wrap and refrigerate. Cut into slices before serving. There is one key difference to this method for thick steaks. The first step is to slightly warm the steaks in the oven before cooking on the stove. Adjust the oven rack to the center position and preheat the oven to 275°F (135°C). Add your cast-iron skillet to the oven to warm up. I like to use a preheated cast-iron pan because it retains heat very well for searing. Place a wire rack on a rimmed baking sheet, and set aside. Pat dry the steaks with paper towels, pressing out as much surface moisture as possible. Season both sides of the steak with salt and pepper. Transfer the steaks to the wire rack and place in the oven. The heat helps to dry the free moisture on the surface of the steaks for quicker browning and cook time in the pan. Cook the steak until the internal temperature reaches 90 to 95°F (32 to 35°C) for medium-rare, or 100 to 105°F (38°C to 41°C) for medium, about 15 to 20 minutes. The time will vary depending on the thickness of the steaks. Remove the steaks from the oven. In the warmed 12-inch (30-cm) cast-iron skillet, heat the vegetable oil over high heat until just beginning to smoke. Carefully add the steaks and sear until browned with a nice crust, about 2 minutes. Flip the steaks with tongs and sear until browned, 1½ to 2 minutes, or until an instant-read thermometer inserted into the thickest part of steak registers 120 to 125°F (49 to 52°C) for medium-rare or 130°F (54°C) for medium. Reduce the heat to medium and add the butter, garlic and white and light green parts of green onion. Turn the steaks onto their sides to cook and render any remaining fat, about 1 to 2 minutes. Briefly baste the steaks with the butter, garlic and green onion mixture. Basting the steaks as they cook with oil helps distribute any aromatics like herbs in the pan and evenly browns the surface. The butter is added toward the end to add flavor, mouthfeel and encourage more browning due to the milk protein solids in the butter. Immediately transfer the steaks to a clean wire rack set on a sheet pan to rest for 10 minutes. Serve the steaks topped with the miso butter, green onions and cilantro.",
            "For the miso butter, combine the softened butter and miso together in a small bowl. Add the green onions and pepper and combine. Keep at room temperature or roll into a 1 1/2-inch (3.8-cm) wide log in plastic wrap and refrigerate. Cut into slices before serving.",
            "There is one key difference to this method for thick steaks. The first step is to slightly warm the steaks in the oven before cooking on the stove. Adjust the oven rack to the center position and preheat the oven to 275°F (135°C). Add your cast-iron skillet to the oven to warm up. I like to use a preheated cast-iron pan because it retains heat very well for searing. Place a wire rack on a rimmed baking sheet, and set aside.",
            "Pat dry the steaks with paper towels, pressing out as much surface moisture as possible. Season both sides of the steak with salt and pepper. Transfer the steaks to the wire rack and place in the oven. The heat helps to dry the free moisture on the surface of the steaks for quicker browning and cook time in the pan.",
            "Cook the steak until the internal temperature reaches 90 to 95°F (32 to 35°C) for medium-rare, or 100 to 105°F (38°C to 41°C) for medium, about 15 to 20 minutes. The time will vary depending on the thickness of the steaks. Remove the steaks from the oven.",
            "In the warmed 12-inch (30-cm) cast-iron skillet, heat the vegetable oil over high heat until just beginning to smoke. Carefully add the steaks and sear until browned with a nice crust, about 2 minutes. Flip the steaks with tongs and sear until browned, 1½ to 2 minutes, or until an instant-read thermometer inserted into the thickest part of steak registers 120 to 125°F (49 to 52°C) for medium-rare or 130°F (54°C) for medium.",
            "Reduce the heat to medium and add the butter, garlic and white and light green parts of green onion. Turn the steaks onto their sides to cook and render any remaining fat, about 1 to 2 minutes. Briefly baste the steaks with the butter, garlic and green onion mixture. Basting the steaks as they cook with oil helps distribute any aromatics like herbs in the pan and evenly browns the surface. The butter is added toward the end to add flavor, mouthfeel and encourage more browning due to the milk protein solids in the butter.",
            "Immediately transfer the steaks to a clean wire rack set on a sheet pan to rest for 10 minutes. Serve the steaks topped with the miso butter, green onions and cilantro.",
            "Recipe Science Preheating the steak at low temperature activates enzymes called cathepsins in the meat that help to tenderize the beef, which occurs below 122°F (50°C). The goal with searing is to achieve a quick sear to create a thick brown crust on the steak without overcooking the interior.",
            "Preheating the steak at low temperature activates enzymes called cathepsins in the meat that help to tenderize the beef, which occurs below 122°F (50°C). The goal with searing is to achieve a quick sear to create a thick brown crust on the steak without overcooking the interior."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aff26dd31403c2d2eb85373/6:4/w_274%2Ch_169/pan-seared-rib-eye-with-miso-butter-recipe-051818.jpg"
    }
}