{
    "recipe": {
        "title": "Pantry Pasta Puttanesca ",
        "ingredients": [
            "1 lb. linguine or other long pasta",
            "Kosher salt",
            "1 (14-oz.) can diced tomatoes",
            "1/2 cup extra-virgin olive oil, divided",
            "1/4 cup capers, drained",
            "6 oil-packed anchovy fillets",
            "1 Tbsp. tomato paste",
            "1/3 cup pitted Kalamata olives, halved",
            "2 tsp. dried oregano",
            "1/2 tsp. crushed red pepper flakes",
            "6 oz. oil-packed tuna"
        ],
        "instructions": [
            "Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain pasta, reserving 1 cup pasta cooking liquid; return pasta to pot.",
            "While pasta cooks, pour tomatoes into a fine-mesh sieve set over a medium bowl. Shake to release as much juice as possible, then let tomatoes drain in sieve, collecting juices in bowl, until ready to use.",
            "Heat 1/4 cup oil in a large deep-sided skillet over medium-high. Add capers and cook, swirling pan occasionally, until they burst and are crisp, about 3 minutes. Using a slotted spoon, transfer capers to a paper towel–lined plate, reserving oil in skillet.",
            "Combine anchovies, tomato paste, and drained tomatoes in skillet. Cook over medium-high heat, stirring occasionally, until tomatoes begin to caramelize and anchovies start to break down, about 5 minutes. Add collected tomato juices, olives, oregano, and red pepper flakes and bring to a simmer. Cook, stirring occasionally, until sauce is slightly thickened, about 5 minutes. Add pasta, remaining 1/4 cup oil, and 3/4 cup pasta cooking liquid to pan. Cook over medium heat, stirring and adding remaining 1/4 cup pasta cooking liquid to loosen if needed, until sauce is thickened and emulsified, about 2 minutes. Flake tuna into pasta and toss to combine.",
            "Divide pasta among plates. Top with fried capers."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ac2492da0f0d86fa2879ce5/6:4/w_274%2Ch_169/Google-Express-Pasta-Puttanesca-recipe-23012018.jpg"
    }
}