{
    "recipe": {
        "title": "Papaya Spring Rolls with Peanut Sauce ",
        "ingredients": [
            "1/2 cup chunky peanut butter",
            "1/3 cup water",
            "2 tablespoons unseasoned rice vinegar",
            "2 tablespoons fish sauce (such as nam pla or nuoc nam)*",
            "2 teaspoons hot chili paste (such as sambal oelek)*",
            "24 6-inch-diameter rice paper rounds**",
            "24 large fresh basil leaves",
            "48 large fresh mint leaves",
            "1 1/2 large firm but ripe papayas, halved lengthwise then crosswise, seeded, peeled, cut crosswise into 1/2-inch-thick strips",
            "1 unpeeled English hothouse cucumber, cut into 1/4-inch-thick 2 1/2-inch-long strips",
            "48 small fresh cilantro sprigs"
        ],
        "instructions": [
            "Whisk first 5 ingredients in bowl. (Peanut sauce can be made 3 days ahead. Cover and chill. Rewhisk before serving.)",
            "Fill large bowl with warm water. Working in batches, soak 3 rice paper rounds in water until softened, about 2 minutes. Remove rounds from water and arrange in single layer on work surface. Place 1 basil leaf in center of each round. Place 2 mint leaves atop each basil leaf. Place 2 papaya strips, then 2 cucumber strips atop mint. Arrange 2 cilantro sprigs atop cucumber. Fold 1 edge of each round over filling. Fold in ends. Roll up rice paper rounds tightly, enclosing filling. Transfer to platter. Repeat with remaining rice paper rounds. Cover with moist paper towel, then plastic wrap; chill. (Can be made 8 hours ahead. Keep chilled.) Serve rolls with peanut sauce.",
            "*Available at Asian markets and in the Asian foods section of many supermarkets. **Thin Thai or Vietnamese wrappers made from rice flour and known as banh trang. Available at Asian markets and in the Asian foods section of some supermarkets.",
            "*Available at Asian markets and in the Asian foods section of many supermarkets.",
            "**Thin Thai or Vietnamese wrappers made from rice flour and known as banh trang. Available at Asian markets and in the Asian foods section of some supermarkets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df240f3a00aeb2f1d5cb4/6:4/w_274%2Ch_169/109562.jpg"
    }
}