{
    "recipe": {
        "title": "Pappardelle With Pork Sugo And Hazelnuts ",
        "ingredients": [
            "5 large plum tomatoes, quartered",
            "7 garlic cloves, 1 finely grated, 6 left whole",
            "3 tablespoons vegetable oil, divided",
            "Kosher salt, freshly ground pepper",
            "1/2 cup blanched hazelnuts",
            "2 pound boneless pork shoulder (Boston butt), fat trimmed, cut into 8 pieces",
            "4 large shallots, quartered",
            "2 cups red wine",
            "2 cups whole milk",
            "1 cup low-sodium chicken broth",
            "5 sprigs oregano, plus 1 tablespoon finely chopped",
            "5 sprigs thyme, plus 1 tablespoon finely chopped",
            "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
            "4 ounces Grana Padano cheese, finely grated, plus shaved for serving",
            "1 pound fresh or dried pappardelle"
        ],
        "instructions": [
            "Preheat oven to 425°F. Toss tomatoes, grated garlic, and 1 tablespoon oil on a rimmed baking sheet. Arrange tomatoes, skin side down, in a single layer; season with salt and pepper. Roast until browned around the edges, about 25 minutes. Set aside.",
            "Reduce oven temperature to 350°F. Toast hazelnuts on another baking sheet, tossing once, until golden brown, 10–12 minutes. Let cool; coarsely chop.",
            "Reduce oven temperature to 275°F. Season pork with salt and pepper. Heat remaining 2 tablespoons oil in a large ovenproof pot over medium-high. Cook pork in batches, turning occasionally, until brown, 8–10 minutes; transfer to a platter.",
            "Add shallots and whole garlic cloves to same pot and cook, stirring occasionally, until browned, about 5 minutes. Add wine, scraping up any browned bits; bring to a boil and cook until wine is reduced slightly, about 5 minutes. Return pork to pot and add milk, broth, and reserved tomatoes. Bring to a boil. Tie oregano and thyme sprigs together with kitchen twine; add to pot. Cover and transfer to oven. Braise meat until very tender, 2–2 1/2 hours.",
            "Remove from oven; discard herbs and use a potato masher or pair of forks to shred pork and mash vegetables into medium-size pieces. Gradually add butter and grated cheese, stirring as you go to fully incorporate into sugo.",
            "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain pasta, transfer to a platter, and toss with half of sugo. Serve topped with hazelnuts, chopped oregano and thyme, and more Grana Padano.",
            "Do Ahead Sugo can be made 1 week ahead. Let cool; cover and chill, or divide in half and freeze up to 3 months.",
            "Sugo can be made 1 week ahead. Let cool; cover and chill, or divide in half and freeze up to 3 months."
        ],
        "picture_link": null,
        "color": 16323925
    }
}