{
    "recipe": {
        "title": "Parmesan Broth ",
        "ingredients": [
            "1 halved head of garlic",
            "1 quartered onion",
            "olive oil, enough to sauté garlic and onion",
            "1 handful of thyme",
            "Sprigs of parsley",
            "1 bay leaf",
            "1 shake of black peppercorns",
            "1 cup of dry white wine",
            "1 pound Parmesan rinds",
            "8 cups of water"
        ],
        "instructions": [
            "I start by sautéing a halved head of garlic and a quartered onion in some olive oil, along with a handful of thyme, a few sprigs of parsley, a bay leaf, and a shake of black peppercorns. Once the garlic is browned, I add a cup of dry white wine and simmer, scraping the pot to get the brown bits loosened up, until reduced by half. In goes 1 pound Parmesan rinds and 8 cups of water. The whole thing simmers until it tastes robust and has reduced by half, about 2 hours. (I stir every now and then—the rinds will stick to the bottom of the pot if you let them.) I strain, and then use the broth in vegetable soups, instant-supper pastas, and beans in need of a boost. Then I start hoarding all over again.",
            "I start by sautéing a halved head of garlic and a quartered onion in some olive oil, along with a handful of thyme, a few sprigs of parsley, a bay leaf, and a shake of black peppercorns. Once the garlic is browned, I add a cup of dry white wine and simmer, scraping the pot to get the brown bits loosened up, until reduced by half. In goes 1 pound Parmesan rinds and 8 cups of water.",
            "The whole thing simmers until it tastes robust and has reduced by half, about 2 hours. (I stir every now and then—the rinds will stick to the bottom of the pot if you let them.) I strain, and then use the broth in vegetable soups, instant-supper pastas, and beans in need of a boost. Then I start hoarding all over again."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54aad6756529d92b2c02dc7e/6:4/w_274%2Ch_169/51259410_parmesan-broth_1x1.jpg"
    }
}