{
    "recipe": {
        "title": "Parsnip Confit with Pickled Currants ",
        "ingredients": [
            "2 1/2 lb. parsnips, peeled, halved lengthwise, quartered if large, woody core removed if large",
            "2 heads of garlic, halved crosswise",
            "1 (4\") piece ginger, scrubbed, sliced lengthwise into 1/8\"-thick planks",
            "3 large sprigs rosemary, divided, plus 1 Tbsp. rosemary leaves for serving",
            "1 Tbsp. plus 1 tsp. kosher salt",
            "3 cups extra-virgin olive oil",
            "1/2 cup dried currants",
            "1/4 cup sugar",
            "1/2 cup plus 1 Tbsp. apple cider vinegar",
            "2 tsp. Aleppo-style pepper"
        ],
        "instructions": [
            "Preheat oven to 300°F. Combine parsnips, garlic, ginger, 2 rosemary sprigs, and 1 Tbsp. salt in a rectangular 3-qt. baking dish; turn garlic cut side down. Pour oil over and roast 35 minutes. Remove from oven; turn parsnips over. Return to oven and roast until a knife easily slides through flesh, 30–40 minutes. Let cool slightly.",
            "Meanwhile, bring currants, sugar, 1/2 cup vinegar, remaining 1 tsp. salt, remaining rosemary sprig, and 1/4 cup water to a boil in a small saucepan over medium-high heat. Reduce heat and simmer, swirling pan occasionally, until reduced by three-quarters. Transfer to a small bowl and stir in Aleppo-style pepper, 1 Tbsp. parsnip confit oil, and remaining 1 Tbsp. vinegar.",
            "Remove parsnips from oil, letting excess drip back into baking dish, and place on a rimmed baking sheet. Pluck out garlic and set aside for serving. Strain oil through a fine-mesh sieve into an airtight container; discard aromatics. Cover and reserve oil for another use.",
            "Heat a large skillet, preferably cast iron, over medium-high. Working in batches, arrange parsnips in skillet in a single layer and cook, turning occasionally, until golden brown and charred in spots, about 4 minutes per batch. (Alternatively, you can broil them, turning halfway through, 10–12 minutes.) Transfer to a platter and spoon currant sauce over. Top with reserved garlic and rosemary leaves.",
            "Do Ahead Parnsips can be cooked in oil 1 week ahead. Let cool completely; cover and chill. Reheat in oil in a 300°F oven before browning. Currants can be pickled 1 week ahead; cover and chill.",
            "Parnsips can be cooked in oil 1 week ahead. Let cool completely; cover and chill. Reheat in oil in a 300°F oven before browning. Currants can be pickled 1 week ahead; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5be07fc13c7aa32d4fe962ac/6:4/w_274%2Ch_169/parsnip-confit-with-pickled-currants-recipe-BA-110518.jpg",
        "color": 9553750
    }
}