{
    "recipe": {
        "title": "Parsnip-Leek Soup with Lump Crab ",
        "ingredients": [
            "1 pound parsnips, peeled and cut into medium-size pieces",
            "2 tablespoons olive oil (not extra-virgin)",
            "1 1/2 cups (about 1 large) chopped leeks, white and light-green parts only",
            "4 sprigs fresh thyme or lemon thyme, divided",
            "1/4 cup dry white wine",
            "3 cups low-sodium chicken or vegetable stock, divided",
            "1/4 cup heavy cream (optional)",
            "1 teaspoon kosher or sea salt",
            "Juice of 1/2 lemon",
            "2 tablespoons unsalted butter",
            "1/4 pound lump crabmeat"
        ],
        "instructions": [
            "Heat oven to 350°F. In a medium roasting pan, toss parsnips with oil. Roast, covered with foil, 20 minutes. Add leeks and leaves of 2 thyme sprigs; toss to coat with oil; splash with wine. Roast, covered with same foil, stirring occasionally, until vegetables are soft, 30 minutes. Discard any burned bits. In a large pot, bring veggies and 2 cups stock to a boil; reduce heat; simmer 10 minutes; let cool slightly. In a food processor, blend soup on low until smooth. Return blended soup to pot; add cream, if desired. Bring soup to a very low simmer; season with salt and black pepper; add remaining 1 cup stock to reach desired thickness (crabmeat should be able to sit on top). In a bowl right before serving, microwave juice, butter and leaves of remaining 2 thyme sprigs until butter melts, about 20 seconds; stir. Toss crabmeat in lemon-butter mixture. Pour soup into 8 demitasse cups; top each with 1 1/2 teaspoons crab. DO AHEAD: You can roast the parsnips and leeks one or two days before your bash; just cover (so the veggies don't dry out) and refrigerate until you're ready to finish the soup."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56043ab5968c2fa94dc98b29/6:4/w_274%2Ch_169/368312.jpg",
        "color": 4833647
    }
}