{
    "recipe": {
        "title": "Party Posole Rojo ",
        "ingredients": [
            "1 1/2 lb. dried large white hominy, soaked overnight",
            "2 large onions, peeled",
            "2 bay leaves",
            "6 black peppercorns",
            "3 Tbsp. kosher salt, divided",
            "4 lb. bone-in country-style pork ribs",
            "1 Tbsp. ground cumin",
            "6 garlic cloves, finely chopped",
            "2 1/2 oz. dried New Mexico chiles",
            "2 1/2 oz. ancho chiles",
            "1 large onion, coarsely chopped",
            "6 garlic cloves, crushed",
            "1/4 cup apple cider vinegar",
            "2 tsp. light brown sugar",
            "1 tsp. kosher salt, plus more",
            "Avocado wedges, cilantro sprigs, thinly sliced cabbage, sliced jalapeños, sliced radishes, lime wedges, sour cream, tortilla chips, and hot sauce (for serving)"
        ],
        "instructions": [
            "Drain hominy and place in a large heavy pot; add onions, bay leaves, peppercorns, 2 Tbsp. salt, and 12 cups water. Cover and bring to a boil. Reduce heat to medium-low; simmer, still covered, stirring occasionally, until hominy starts to soften (some skins will split), about 1 hour.",
            "Sprinkle pork all over with cumin and remaining 1 Tbsp. salt. Add to pot along with garlic; pour in water to cover by 1\". Partially cover pot and cook, stirring occasionally and adding more water as needed to keep ingredients covered, until hominy is tender (some may unfurl like popped popcorn, and that’s okay) and pork is fall-apart tender, about 2 1/2 hours.",
            "Chile purée and assembly: While the posole is cooking, make the chile purée. Wearing gloves if you have them, remove stems from chiles and shake out and discard most of the seeds (for more heat, keep more seeds). Transfer to a large bowl and add onion and garlic; pour in boiling water to cover. Let sit until chiles are softened, about 30 minutes. Drain chile mixture, reserving soaking liquid, and transfer chiles, onion, and garlic to a blender. Add vinegar, brown sugar, 1 tsp. salt, and 1 cup soaking liquid and blend until smooth. When posole is done, remove pork, onions, and bay leaves from pot (keep posole simmering). Transfer pork to a plate; discard onions and bay leaves. Let pork cool slightly, then pick meat from bones, discarding any cartilage and larger pieces of fat. Shred meat into bite-size pieces and return to pot; discard bones. Stir chile purée into posole and let simmer 30 minutes to allow flavors to meld. Taste and season with more salt. Divide posole among bowls. Serve with avocado, cilantro, cabbage, jalapeños, radishes, lime wedges, sour cream, tortilla chips, and hot sauce alongside for topping.",
            "While the posole is cooking, make the chile purée. Wearing gloves if you have them, remove stems from chiles and shake out and discard most of the seeds (for more heat, keep more seeds). Transfer to a large bowl and add onion and garlic; pour in boiling water to cover. Let sit until chiles are softened, about 30 minutes.",
            "Drain chile mixture, reserving soaking liquid, and transfer chiles, onion, and garlic to a blender. Add vinegar, brown sugar, 1 tsp. salt, and 1 cup soaking liquid and blend until smooth.",
            "When posole is done, remove pork, onions, and bay leaves from pot (keep posole simmering). Transfer pork to a plate; discard onions and bay leaves. Let pork cool slightly, then pick meat from bones, discarding any cartilage and larger pieces of fat. Shred meat into bite-size pieces and return to pot; discard bones.",
            "Stir chile purée into posole and let simmer 30 minutes to allow flavors to meld. Taste and season with more salt.",
            "Divide posole among bowls. Serve with avocado, cilantro, cabbage, jalapeños, radishes, lime wedges, sour cream, tortilla chips, and hot sauce alongside for topping.",
            "Do Ahead Posole can be made 4 days ahead. Let cool, then cover and chill.",
            "Posole can be made 4 days ahead. Let cool, then cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ac2717db170856d2134694a/6:4/w_274%2Ch_169/party-posole-rojo-recipe-BA-032918.jpg"
    }
}