{
    "recipe": {
        "title": "Pastry-Wrapped Raspberry Crisps ",
        "ingredients": [
            "1 3/4 cups all purpose flour",
            "1 teaspoon plus 1 tablespoon sugar",
            "3/4 teaspoon salt",
            "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
            "1/4 cup frozen vegetable shortening, cut into pieces",
            "2 tablespoons water",
            "1 tablespoon fresh lemon juice",
            "6 tablespoons raspberry preserves (with seeds)",
            "1 6-ounce basket raspberries",
            "Sweetened whipped cream"
        ],
        "instructions": [
            "Combine flour, 1 teaspoon sugar and salt in processor. Add butter and shortening; process until mixture resembles coarse meal. Transfer 1/2 cup of mixture to bowl and add 1 tablespoon sugar; reserve for topping. Cover; chill.",
            "Add water and lemon juice to mixture in processor; blend, using on/off turns, until moist clumps form. Gather dough into ball; flatten into disk. Wrap in plastic; chill until firm enough to roll, about 30 minutes. (Can be made 1 day ahead. Keep refrigerated. Let dough soften slightly before rolling out.)",
            "For Filling: Place rack in lowest position in oven and preheat to 400°F. Place preserves in medium bowl; stir to loosen texture. Fold in raspberries. Roll out dough on lightly floured surface to 1/8-inch thickness. Using 6-inch-diameter saucer as template, cut out four 6-inch-diameter rounds. Spoon 1/4 of raspberry filling (about 1/3 cup) in center of each round, leaving 1-inch border at edges. Working with 1 pastry at a time, fold dough over edge of filling, pinching dough at 1-inch intervals. Using spatula, transfer to heavy large baking sheet, spacing apart. Sprinkle reserved topping mixture over exposed filling of each pastry. Bake crisps until crusts are golden, about 35 minutes. Let stand on baking sheet 15 minutes. Transfer to plates; serve warm with whipped cream.",
            "Place rack in lowest position in oven and preheat to 400°F. Place preserves in medium bowl; stir to loosen texture. Fold in raspberries.",
            "Roll out dough on lightly floured surface to 1/8-inch thickness. Using 6-inch-diameter saucer as template, cut out four 6-inch-diameter rounds. Spoon 1/4 of raspberry filling (about 1/3 cup) in center of each round, leaving 1-inch border at edges. Working with 1 pastry at a time, fold dough over edge of filling, pinching dough at 1-inch intervals. Using spatula, transfer to heavy large baking sheet, spacing apart. Sprinkle reserved topping mixture over exposed filling of each pastry.",
            "Bake crisps until crusts are golden, about 35 minutes. Let stand on baking sheet 15 minutes. Transfer to plates; serve warm with whipped cream."
        ],
        "picture_link": null
    }
}