{
    "recipe": {
        "title": "Pasta Carbonara with English Peas ",
        "ingredients": [
            "Kosher salt and freshly ground black pepper",
            "3 ounces pancetta, cut into small dice",
            "Extra-virgin olive oil",
            "8 ounces dried fettuccine, linguine, or spaghetti",
            "1 pound English peas in their pods, shelled (1 cup peas)",
            "3 scallions, trimmed (including 1/2 inch off the green tops), thinly sliced on an angle",
            "1 small handful pea tendrils (optional)",
            "1 egg, whipped well with a fork in a little bowl",
            "1/2 cup freshly grated Parmigiano-Reggiano cheese",
            "1/2 cup freshly grated Pecorino Romano cheese"
        ],
        "instructions": [
            "Bring a large pot of water to a boil and add salt until it tastes like the sea.",
            "Put the pancetta and a small glug of olive oil in a skillet or Dutch oven that’s large enough to hold all the pasta. Cook until the pancetta is lightly browned but still slightly chewy, 9 to 12 minutes (or less if you’re using thinly sliced pancetta). Season the pancetta very generously with pepper. Take the skillet off the heat, but don’t drain anything—you’ll use that fat!",
            "When the water is at a boil, add the pasta and cook according to the package directions until almost al dente. When the pasta is almost ready, add the shelled peas to the pasta pot.",
            "Put the skillet back over medium heat and reheat the pancetta gently.",
            "With a ladle or a measuring cup, scoop out about 1 cup of the pasta cooking water. Drain the pasta and peas. Whisk a couple of tablespoons of the pasta water into the fat and pancetta in the skillet, to make the bacon fat lighter and creamier by emulsifying it with the water. Pull the pan off the heat.",
            "Whisk some of that warm fat into the beaten egg to temper it (meaning to gently warm up the egg so that it doesn’t scramble when you add it to the hot skillet), then whisk the egg into the skillet.",
            "Dump the pasta, peas, scallions, and pea tendrils (if using) into the skillet. Add both the cheeses and toss everything quickly and thoroughly to blend. Add a few more small splashes of the pasta water and keep tossing until the noodles are cloaked in a creamy sauce. Taste and adjust the seasoning with more salt or black pepper as needed. Serve right away. This dish does not wait."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59134f0565c2152d58cd34b8/6:4/w_274%2Ch_169/pasta-carbonara-with-English-peas-six-seasons-051017.jpg"
    }
}