{
    "recipe": {
        "title": "Pasta with Shrimp in Tomato Cream ",
        "ingredients": [
            "Kosher salt",
            "3/4 pound fusilli",
            "2 tablespoons olive oil",
            "1 pound shrimp, peeled and deveined",
            "Freshly ground black pepper",
            "3 scallions, thinly sliced (dark green portion kept separate)",
            "3 cloves garlic, thinly sliced",
            "1 cup heavy cream",
            "1/2 cup chicken stock",
            "1/2 cup dry vermouth",
            "1/2 cup dry-packed sun-dried tomatoes, thinly sliced",
            "1 tablespoon tomato paste",
            "1 cup crumbled feta cheese",
            "1/4 cup chopped flat-leaf Italian parsley",
            "1/4 cup fresh basil chiffonade (see Cooks' Note)"
        ],
        "instructions": [
            "Bring a large pot of water to a boil. Add 2 tablespoons of the salt and return to a rolling boil. Add the pasta and cook until al dente according to package directions.",
            "While the pasta cooks, prepare the sauce: Heat the oil in a 12-inch skillet over medium-high heat. Season the shrimp with salt and pepper, add to the pan, and sauté until just cooked through, about 2 minutes. Remove and set aside in a large bowl.",
            "Add the white and light green slices of scallions (reserve the dark green slices for garnish) and garlic to the pan and cook until softened, about 2 minutes. Remove and set aside in the bowl with the shrimp and cover.",
            "Reduce the heat to medium. Stir in the cream, chicken stock, vermouth, sun-dried tomatoes, and tomato paste. Bring the sauce to a boil and simmer until the liquid has thickened and reduced by half, about 5 minutes. Return the shrimp mixture to the skillet and cook until heated through, about 2 minutes more.",
            "Increase the heat to medium-high and add the pasta directly to the skillet, along with the feta, parsley, and half the basil. Toss everything together until the cheese begins to melt and the pasta is glossy with sauce. Season with salt and pepper.",
            "Plate in bowls and garnish with the remaining basil and the scallion greens."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58b6de951c5fbd604af10197/6:4/w_274%2Ch_169/shrimp-pasta-with-cream-sauce-030117.jpg"
    }
}