{
    "recipe": {
        "title": "Pasta with Bolognese Sauce ",
        "ingredients": [
            "2 tablespoons olive oil",
            "2 tablespoons unsalted butter",
            "1 small onion, chopped fine",
            "1 carrot, chopped fine",
            "1 celery rib, chopped fine",
            "1/2 pound ground chuck",
            "1/2 pound ground pork",
            "1 cup milk",
            "freshly grated nutmeg to taste",
            "1 cup dry white wine",
            "a 28-to-32 ounce can whole tomatoes including juice",
            "1 1/4 pounds dried pasta such as penne, rigatoni, fusilli, or orecchiette, or 1 1/4 pounds Fresh Semolina Orecchiette"
        ],
        "instructions": [
            "In large heavy saucepan heat oil and butter over moderately high heat until foam subsides and sauté onion, carrot, and celery, stirring 2 minutes. Add beef and pork and cook, stirring, 2 minutes, or until meat is no longer pink. Season mixture with salt and pepper. Add milk and nutmeg and cook, stirring, until most milk is evaporated, about 10 minutes. Add wine and cook, stirring occasionally, until liquid is evaporated, about 10 minutes.",
            "In a blender or food processor coarsely purée tomatoes with juice and stir into sauce. Cook sauce at a bare simmer, uncovered, stirring occasionally, 1 hour and 15 minutes (sauce will be thickened) and season with salt and pepper. Sauce may be made ahead and cooled, uncovered, before being chilled, covered, 2 days or frozen 1 month.",
            "In an 8-quart kettle bring 7 quarts salted water to a boil. Cook pasta until al dente (about 6 minutes for fresh, longer for dried) and drain in a colander. In a heated large bowl immediately toss pasta with sauce.",
            "In an 8-quart kettle bring 7 quarts salted water to a boil. Cook pasta until al dente (about 6 minutes for fresh, longer for dried) and drain in a colander. In a heated large bowl immediately toss pasta with sauce."
        ],
        "picture_link": null,
        "color": 13903982
    }
}