{
    "recipe": {
        "title": "Pasta Carbonara with Cabbage and Mushrooms ",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil",
            "8 ounces shiitake mushrooms, stems removed, sliced into 1/2-inch strips",
            "6 ounces bacon, sliced crosswise into 1/2-inch strips",
            "8 ounces tagliatelle or linguine",
            "3/4 tsp. kosher salt, plus more",
            "1 medium head of savoy cabbage (about 1 pound) cored, sliced into 1/4-inch ribbons",
            "2 large egg yolks",
            "2 ounces Parmesan, finely grated, divided, plus more for serving",
            "1 1/2 teaspoons freshly ground black pepper"
        ],
        "instructions": [
            "Heat oil in a large heavy skillet, preferably cast iron, over high. Cook mushrooms and bacon, stirring often, until browned and crisp, about 8 minutes. Using a slotted spoon, transfer to a paper towel-lined plate; set aside. Reserve fat in skillet. Meanwhile, cook pasta in large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 1/2 cups pasta cooking liquid. Heat skillet with reserved fat over high. Add cabbage, press into an even layer, and cook, undisturbed, 2 minutes; season with remaining 3/4 tsp. salt. Turn cabbage with tongs, then continue to cook, undisturbed, until lightly charred in places and still crisp in others, about 2 minutes more. Whisk egg yolks, 1 oz. Parmesan, and 3/4 cup pasta cooking liquid in a large bowl until a smooth, glossy sauce forms. Add pasta and stir to coat. Add reserved mushrooms and bacon, cabbage, pepper, and 1 oz. Parmesan and toss again, adding more pasta cooking liquid if needed to loosen sauce. Divide pasta among bowls. Top with more Parmesan.",
            "Heat oil in a large heavy skillet, preferably cast iron, over high. Cook mushrooms and bacon, stirring often, until browned and crisp, about 8 minutes. Using a slotted spoon, transfer to a paper towel-lined plate; set aside. Reserve fat in skillet.",
            "Meanwhile, cook pasta in large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 1/2 cups pasta cooking liquid.",
            "Heat skillet with reserved fat over high. Add cabbage, press into an even layer, and cook, undisturbed, 2 minutes; season with remaining 3/4 tsp. salt. Turn cabbage with tongs, then continue to cook, undisturbed, until lightly charred in places and still crisp in others, about 2 minutes more.",
            "Whisk egg yolks, 1 oz. Parmesan, and 3/4 cup pasta cooking liquid in a large bowl until a smooth, glossy sauce forms. Add pasta and stir to coat. Add reserved mushrooms and bacon, cabbage, pepper, and 1 oz. Parmesan and toss again, adding more pasta cooking liquid if needed to loosen sauce.",
            "Divide pasta among bowls. Top with more Parmesan."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a329bf827dfe52f3100bd35/6:4/w_274%2Ch_169/cabbage-bacon-pasta-11032017.jpg"
    }
}