{
    "recipe": {
        "title": "Pasta with Baby Artichokes, Mascarpone, and Hazelnuts ",
        "ingredients": [
            "12 ounces fresh lasagna sheets (about 8x6 inches)",
            "All-purpose flour (for surface)",
            "1 lemon, halved",
            "1 pound baby artichokes (about 8)",
            "3 garlic cloves, crushed",
            "2 bay leaves",
            "1/4 cup plus 3 tablespoons olive oil",
            "Kosher salt",
            "3/4 cup blanched hazelnuts",
            "2 tablespoons finely chopped marjoram or oregano",
            "1 1/2 teaspoons Aleppo-style pepper",
            "1 cup mascarpone",
            "1 teaspoon finely grated lemon zest",
            "1 teaspoon fresh lemon juice"
        ],
        "instructions": [
            "Preheat oven to 350°F. Place a pasta sheet on a lightly floured work surface. Using a paring knife or a pastry wheel, cut the sheet into quarters (each piece should be about 4x3\"), then cut each piece on a diagonal from corner to corner to create 4 triangles. Transfer triangles to a flour-dusted baking sheet and cover with a kitchen towel. Repeat process with remaining lasagna sheets.",
            "Squeeze juice from lemon halves into a large bowl of cold water. Working with 1 artichoke at a time, pull off all the tough dark outer leaves until mostly yellow leaves remain. Using a serrated knife, cut 1\" off top of artichoke. Trim stem, leaving at least 1/2\" intact. Using a paring knife or a vegetable peeler, remove dark green outer layer from stem. Cut artichoke in half lengthwise and then into 1/3\"-thick wedges. Drop artichoke pieces in lemon water. The acid in the water will keep them from turning brown while you trim the remaining artichokes.",
            "Once all the artichokes have been trimmed, drain and place in a wide medium saucepan. Add garlic, bay leaves, and 1/4 cup oil. Pour in cold water to submerge artichokes; season generously with salt. Bring to a simmer over medium heat and cook until a paring knife slides through artichokes with little to no resistance, 8–10 minutes. Let cool, then drain and set artichokes aside.",
            "While the artichokes are simmering away, toast hazelnuts on a rimmed baking sheet, tossing once, until golden brown, 10–12 minutes. Let cool, then coarsely chop. Toss in a medium bowl with marjoram, Aleppo-style pepper, and 3 Tbsp. oil; season with a generous pinch of salt. Set aside.",
            "Mix mascarpone, lemon zest, and lemon juice in a separate medium bowl; season with salt. Set aside.",
            "Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente. Drain, reserving 1/2 cup pasta cooking liquid.",
            "Return pasta and 1/4 cup pasta cooking liquid to pot and set over low heat. Add reserved mascarpone mixture and gently toss, adding more pasta cooking liquid as needed if sauce is too thick, until pasta is al dente and sauce coats pasta. Add reserved artichokes and half of reserved hazelnut mixture and gently stir to distribute (you want to avoid breaking up artichokes very much).",
            "Divide pasta among bowls. Top with remaining hazelnut mixture.",
            "Do Ahead Hazelnuts can be toasted 3 days ahead; store airtight at room temperature. Artichokes can be trimmed and cooked 1 day ahead; let cool in cooking liquid. Cover and chill. Drain just before adding to pasta.",
            "Hazelnuts can be toasted 3 days ahead; store airtight at room temperature. Artichokes can be trimmed and cooked 1 day ahead; let cool in cooking liquid. Cover and chill. Drain just before adding to pasta."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58ed42199835a44e6a985c02/6:4/w_274%2Ch_169/spring-pasta-with-baby-artichokes-mascarpone-and-hazelnuts-BA-040617.jpg",
        "color": 15263853
    }
}