{
    "recipe": {
        "title": "Pasta with Spicy Anchovy Sauce and Dill Bread Crumbs ",
        "ingredients": [
            "3/4 cup extra-virgin olive oil, divided",
            "2 cups fresh bread crumbs (preferably from a baguette)",
            "1/4 cup chopped dill",
            "1 pound red onions, thinly sliced (3 cups)",
            "1 (2-ounce) can flat anchovy fillets, drained and chopped",
            "1 pound bucatini or perciatelli pasta (long tubular strands)",
            "1/2 teaspoon dried hot red-pepper flakes"
        ],
        "instructions": [
            "Heat 1/4 cup oil in a 12-inch heavy skillet over medium heat until it shimmers, then cook bread crumbs, stirring constantly, until deep golden and crisp, 6 to 8 minutes. Transfer bread crumbs to a bowl and toss with dill and 1/4 teaspoon each of salt and black pepper. Wipe out skillet, then cook onions with 1/4 teaspoon salt in remaining 1/2 cup oil over medium heat, stirring frequently, until very soft, 12 to 15 minutes. Add anchovies and cook, mashing anchovies into onions, until dissolved. Meanwhile, cook bucatini in a pasta pot of boiling salted water (2 tablespoons salt for 5 quarts water) until al dente. Reserve 1/2 cup cooking water, then drain pasta. Stir red-pepper flakes and reserved water into anchovy sauce, then add pasta and toss to combine. Add about half of bread crumbs and toss to coat. Serve sprinkled with remaining bread crumbs.",
            "Heat 1/4 cup oil in a 12-inch heavy skillet over medium heat until it shimmers, then cook bread crumbs, stirring constantly, until deep golden and crisp, 6 to 8 minutes.",
            "Transfer bread crumbs to a bowl and toss with dill and 1/4 teaspoon each of salt and black pepper.",
            "Wipe out skillet, then cook onions with 1/4 teaspoon salt in remaining 1/2 cup oil over medium heat, stirring frequently, until very soft, 12 to 15 minutes. Add anchovies and cook, mashing anchovies into onions, until dissolved.",
            "Meanwhile, cook bucatini in a pasta pot of boiling salted water (2 tablespoons salt for 5 quarts water) until al dente. Reserve 1/2 cup cooking water, then drain pasta.",
            "Stir red-pepper flakes and reserved water into anchovy sauce, then add pasta and toss to combine. Add about half of bread crumbs and toss to coat. Serve sprinkled with remaining bread crumbs."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d7838f9a841923089d609/6:4/w_274%2Ch_169/241984_hires.jpg"
    }
}