{
    "recipe": {
        "title": "Peach-Tarragon Shortcake ",
        "ingredients": [
            "4 large ripe peaches",
            "2 sprigs tarragon",
            "1/4–1/2 cup sugar",
            "4 tablespoons (1/2 stick) unsalted butter",
            "1 sprig tarragon",
            "1 cup cake flour",
            "1 tablespoon baking powder",
            "1 teaspoon kosher salt",
            "1 cup all-purpose flour, plus more for surface",
            "2 teaspoons sugar, plus more for sprinkling",
            "1 1/2 cups chilled heavy cream",
            "Whipped cream (for serving)"
        ],
        "instructions": [
            "Peaches Using the tip of a paring knife, score an X in the bottom of each peach. Cook in a large pot of boiling water just until skins begin to peel back where cut, about 1 minute. Using a slotted spoon, transfer to a bowl of ice water; let cool. Peel; cut over a medium bowl into 1/4\"-thick wedges, collecting juices. Add tarragon and sugar to peaches and toss to combine. Let stand, tossing occasionally, until peaches release their juices and sugar is dissolved, about 1 hour.",
            "Peaches Using the tip of a paring knife, score an X in the bottom of each peach. Cook in a large pot of boiling water just until skins begin to peel back where cut, about 1 minute. Using a slotted spoon, transfer to a bowl of ice water; let cool. Peel; cut over a medium bowl into 1/4\"-thick wedges, collecting juices.",
            "Add tarragon and sugar to peaches and toss to combine. Let stand, tossing occasionally, until peaches release their juices and sugar is dissolved, about 1 hour.",
            "Shortcake and assembly: Preheat oven to 425°. Heat butter and tarragon in a small saucepan over medium heat until butter is melted; set aside. Whisk cake flour, baking powder, salt, 1 cup all-purpose flour, and 2 teaspoons sugar in a large bowl. Drizzle chilled cream over and mix gently until dough holds together. Turn out dough onto a lightly floured surface and knead into a shaggy ball, being careful not to overwork. Place on a parchment-lined rimmed baking sheet and form into an 8\"-diameter disk, about 1/2\" thick. Brush with some reserved melted butter and sprinkle with sugar. Bake until shortcake edges are golden brown, 12–15 minutes. Reduce oven temperature to 325°. Bake until golden brown all over, 8–10 minutes longer. Brush shortcake with remaining melted butter. Transfer to a wire rack and let cool. Cut shortcake into 8 wedges, spoon peaches and their juices over, and top with whipped cream.",
            "Preheat oven to 425°. Heat butter and tarragon in a small saucepan over medium heat until butter is melted; set aside.",
            "Whisk cake flour, baking powder, salt, 1 cup all-purpose flour, and 2 teaspoons sugar in a large bowl. Drizzle chilled cream over and mix gently until dough holds together.",
            "Turn out dough onto a lightly floured surface and knead into a shaggy ball, being careful not to overwork. Place on a parchment-lined rimmed baking sheet and form into an 8\"-diameter disk, about 1/2\" thick. Brush with some reserved melted butter and sprinkle with sugar.",
            "Bake until shortcake edges are golden brown, 12–15 minutes. Reduce oven temperature to 325°. Bake until golden brown all over, 8–10 minutes longer.",
            "Brush shortcake with remaining melted butter. Transfer to a wire rack and let cool. Cut shortcake into 8 wedges, spoon peaches and their juices over, and top with whipped cream."
        ],
        "picture_link": "https://assets.epicurious.com/photos/596e1e5016a4dd314230aec7/6:4/w_274%2Ch_169/peach-tarragon-shortcake-recipe-BA-071817.jpg"
    }
}