{
    "recipe": {
        "title": "Peach and Mascarpone Cheesecake with Balsamic Syrup ",
        "ingredients": [
            "7 whole graham crackers, broken into pieces",
            "1/3 cup sugar",
            "5 tablespoons unsalted butter, diced",
            "3 (8-ounce) packages mascarpone cheese",
            "1 cup sugar",
            "3 tablespoons all purpose flour",
            "3 large eggs",
            "1/2 teaspoon vanilla extract",
            "2 large peaches (about 1 pound), peeled, pitted, diced",
            "1/2 cup balsamic vinegar",
            "1/2 cup sliced peaches"
        ],
        "instructions": [
            "For crust: Preheat oven to 350°F. Blend graham cracker pieces, sugar, and butter in processor until moist clumps form. Press onto bottom (not sides) of 9-inch-diameter springform pan. Bake until golden brown, about 12 minutes. Transfer crust to rack to cool. Maintain oven temperature.",
            "Preheat oven to 350°F. Blend graham cracker pieces, sugar, and butter in processor until moist clumps form. Press onto bottom (not sides) of 9-inch-diameter springform pan. Bake until golden brown, about 12 minutes. Transfer crust to rack to cool. Maintain oven temperature.",
            "For filling: Using electric mixer, beat mascarpone, sugar, and flour in large bowl until blended. Beat in eggs 1 at a time; add vanilla extract. Puree diced peaches in mini processor or blender until smooth. Beat peach puree into batter. Pour filling into crust. Bake until edges are raised and dry and center is softly set, about 1 hour 5 minutes. Place hot cheesecake directly in refrigerator. Chill uncovered overnight. Boil balsamic vinegar in small saucepan until reduced to 1/4 cup, about 4 minutes; cool syrup. Cut around cheesecake; remove pan sides. Top with peach slices, drizzle with balsamic vinegar syrup, and serve.",
            "Using electric mixer, beat mascarpone, sugar, and flour in large bowl until blended. Beat in eggs 1 at a time; add vanilla extract. Puree diced peaches in mini processor or blender until smooth. Beat peach puree into batter. Pour filling into crust. Bake until edges are raised and dry and center is softly set, about 1 hour 5 minutes. Place hot cheesecake directly in refrigerator. Chill uncovered overnight.",
            "Boil balsamic vinegar in small saucepan until reduced to 1/4 cup, about 4 minutes; cool syrup. Cut around cheesecake; remove pan sides. Top with peach slices, drizzle with balsamic vinegar syrup, and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd78ef3a00aeb2f1d2816/6:4/w_274%2Ch_169/235611.jpg"
    }
}