{
    "recipe": {
        "title": "Peach-Bourbon Jam ",
        "ingredients": [
            "1/2 vanilla bean",
            "1 pound ripe but firm yellow peaches, halved, pitted, and cut into 1/2-inch pieces (3 cups)",
            "1 cup sugar",
            "1/2 cup peeled and grated Granny Smith apple (1/2 apple)",
            "1 cup bourbon",
            "1 tablespoon bottled lemon juice"
        ],
        "instructions": [
            "Place 2 small plates in freezer to chill. Cut vanilla bean in half lengthwise. Using tip of paring knife, scrape out seeds. Stir vanilla bean and seeds, peaches, sugar, apple, bourbon, and lemon juice together in large saucepan, cover, and let sit for 20 minutes.",
            "Bring mixture to boil, stirring often, over medium-high heat. Once sugar is completely dissolved, reduce heat to medium-low, cover, and simmer, stirring occasionally, until peaches are softened, about 10 minutes.",
            "Off heat, crush fruit with potato masher until mostly smooth. Return mixture to boil over medium-high heat and cook, stirring and adjusting heat as needed, until mixture resisters 217°F–220°F, about 6 minutes. (Temperature will be lower at higher elevations.) Remove pot from heat and discard vanilla bean.",
            "To test consistency, place 1 teaspoon jam on chilled plate and freeze for 2 minutes. Drag your finger through jam on plate; jam has correct consistency when your finger leaves distinct trail. If runny, return pot to heat and simmer for 1 to 3 minutes longer before retesting. Skim any foam from surface of jam using spoon.",
            "Meanwhile, place two 1-cup jars in bowl and place under hot running water until heated through, 1 to 2 minutes; shake dry.",
            "Using funnel and ladle, portion hot jam into hot jars. Let cool to room temperature, cover, and refrigerate until jam is set, 12 to 24 hours. (Jam can be refrigerated for up to 2 months)"
        ],
        "picture_link": "https://assets.epicurious.com/photos/594d64bb705436304c0c5866/6:4/w_274%2Ch_169/weekend-warrior-jam-recipe-20062017.jpg"
    }
}