{
    "recipe": {
        "title": "Peanut Maple Fudge Bars ",
        "ingredients": [
            "3/4 cup flour",
            "1/4 cup powdered sugar",
            "2 tablespoons unsweetened cocoa powder",
            "Pinch of fine sea salt",
            "4 tablespoons (1/2 stick) melted salted butter",
            "10 ounces semisweet chocolate, chopped",
            "1/2 cup smooth peanut butter",
            "8 tablespoons (1 stick) salted butter",
            "2/3 cup sweetened condensed milk",
            "3/4 cup maple syrup",
            "1 cup (lightly packed) light brown sugar",
            "1/8 teaspoon salt",
            "3 tablespoons cream cheese",
            "3/4 cup lightly salted roasted peanuts"
        ],
        "instructions": [
            "Preheat oven to 350°. Line an 8\" x 8\" baking pan with 2 pieces of parchment paper, leaving at least 3\" of overhang.",
            "For the base, mix together flour, powdered sugar, cocoa powder, and salt in a medium bowl.",
            "Add melted butter and mix thoroughly until you have a soft dough. Break dough into small pebbles and spread evenly in bottom of lined baking pan, then gently press dough into pan in an even layer. Bake until it turns a shade darker, 15 minutes. Let base cool a bit.",
            "Meanwhile, make chocolate layer: Put chocolate in the top of a double boiler, or in a metal bowl set over a pan of simmering water. Add peanut butter and heat gently until melted, stirring occasionally.",
            "Pour 1/2 cup of warm melted chocolate mixture over the baked base, and spread it out evenly. Refrigerate until set. Reserve remaining chocolate mixture on top of the stove while you prepare maple fudge.",
            "Melt butter in a 2-quart saucepan over medium heat. Add sweetened condensed milk, maple syrup, brown sugar, and salt and bring to a simmer. Boil softly, stirring often, for 10 minutes. (Gauge doneness using the cold-water test: Fill a bowl with cold water and drop about 1/2 teaspoon of the mixture into it. If it forms a soft ball, it's ready.)",
            "Fill a sink with at least 6\" cold water, and set saucepan in it (making sure not to slosh water into fudge). Stir constantly with a sharp-edged wooden spoon, scraping down sides of pot, until mixture starts to turn granular, about 5 minutes. When it starts to look like sand and becomes hard to stir, remove pan from water; add cream cheese. Stir, scraping sides, until mixture is smooth and light.",
            "Immediately spread maple fudge in an even layer over cooled chocolate layer.",
            "Scatter peanuts on top and press them lightly into maple filling. Gently heat remaining chocolate mixture to return it to a liquid state. Drop chocolate from the side of a rubber spatula onto maple layer. Swipe across peanuts to cover them completely.",
            "Return baking pan to refrigerator and chill until completely set, about 4 hours. Cut into small bars."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac128b19925f464b3a798c/6:4/w_274%2Ch_169/51238010_peanut-maple-fudge-bars_1x1.jpg"
    }
}