{
    "recipe": {
        "title": "Pear and Dried-Cherry Custard Crisp ",
        "ingredients": [
            "3/4 cup all purpose flour",
            "6 tablespoons (packed) golden brown sugar",
            "1/4 cup pecans, ground in processor",
            "1 teaspoon ground cinnamon",
            "1 teaspoon finely grated lemon peel",
            "1/2 teaspoon salt",
            "1/2 cup (1 stick) unsalted butter, melted",
            "1 teaspoon vanilla extract",
            "2 large eggs",
            "1 cup crème fraîche",
            "1 teaspoon vanilla extract",
            "1 tablespoon all purpose flour",
            "3 1/2 pounds firm but ripe Bosc pears, peeled, cored, cut into 1 1/2-inch chunks (about 8 cups)",
            "1 cup dried tart cherries (about 6 ounces)",
            "2 tablespoons fresh lemon juice",
            "1/3 cup all purpose flour",
            "1/2 cup baker's sugar (superfine sugar) or regular sugar",
            "2 1/2 teaspoons finely grated lemon peel",
            "French vanilla ice cream"
        ],
        "instructions": [
            "Mix first 6 ingredients in medium bowl. Add melted butter and vanilla extract; stir with fork until soft crumbly dough forms. (Can be made up to 6 hours ahead. Cover; let stand at room temperature.)",
            "For custard: Whisk eggs in medium bowl to blend. Whisk in crème fraîche and vanilla. Sift in flour; whisk until smooth. (Can be made up to 6 hours ahead. Cover and chill; rewhisk before using.)",
            "Whisk eggs in medium bowl to blend. Whisk in crème fraîche and vanilla. Sift in flour; whisk until smooth. (Can be made up to 6 hours ahead. Cover and chill; rewhisk before using.)",
            "For filling: Preheat oven to 375°F. Generously butter 13x9x2-inch oval ceramic or glass baking dish. Combine pears, cherries, and lemon juice in large bowl; toss to blend. Mix flour, sugar, and lemon peel in small bowl. Add to pear mixture and toss to blend. Transfer pear mixture to prepared dish, pressing slightly with rubber spatula to form even layer. (Can be made up to 1 hour ahead; let stand at room temperature.) Pour custard evenly over pear mixture. Using fingertips, crumble topping evenly over. Bake until pears are tender and topping is deep golden, about 55 minutes. Remove from oven and let stand 10 minutes. Serve warm or at room temperature, with ice cream.",
            "Preheat oven to 375°F. Generously butter 13x9x2-inch oval ceramic or glass baking dish. Combine pears, cherries, and lemon juice in large bowl; toss to blend. Mix flour, sugar, and lemon peel in small bowl. Add to pear mixture and toss to blend. Transfer pear mixture to prepared dish, pressing slightly with rubber spatula to form even layer. (Can be made up to 1 hour ahead; let stand at room temperature.)",
            "Pour custard evenly over pear mixture. Using fingertips, crumble topping evenly over. Bake until pears are tender and topping is deep golden, about 55 minutes. Remove from oven and let stand 10 minutes. Serve warm or at room temperature, with ice cream."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd722f9a84192308a4ce3/6:4/w_274%2Ch_169/234160.jpg"
    }
}