{
    "recipe": {
        "title": "Pear and Currant Streusel Rounds ",
        "ingredients": [
            "2 tablespoons unsalted butter",
            "6 pounds under-ripe Anjou pears (about 13), peeled, cored, cut into 1/2-inch pieces",
            "1 1/3 cups dried currants",
            "1 1/3 cups sugar",
            "1 tablespoon fresh lemon juice",
            "1 1/2 teaspoons ground cinnamon",
            "1 vanilla bean, halved lengthwise",
            "3/4 cup slivered almonds (about 3 ounces)",
            "3/4 cup all purpose flour",
            "6 tablespoons sugar",
            "6 tablespoons chilled unsalted butter, cut into 1/2-inch pieces",
            "8 3-inch-diameter ring molds with 1 1/2-inch-high sides*",
            "Sweetened whipping cream (unwhipped)"
        ],
        "instructions": [
            ": Heat 2 heavy large skillets over medium heat. Melt 1 tablespoon butter in each skillet. Divide pears, currants, sugar, lemon juice and cinnamon between skillets. Scrape in seeds from vanilla bean; add bean halves to skillets. Cook until juices evaporate and pears caramelize, stirring often, about 35 minutes. Let fruit cool in skillets. Remove vanilla bean halves.",
            "For streusel : Preheat oven to 400°F. Blend almonds, flour and sugar in processor until almonds are finely chopped. Add butter. Using on/off turns, process until large moist clumps form. Sprinkle mixture onto heavy baking sheet. Bake until streusel is pale golden, stirring often and leaving mixture in clumps, about 10 minutes. Cool completely. (Can be prepared 1 day ahead. Store streusel airtight at room temperature. Cover and refrigerate fruit mixture.)",
            ": Preheat oven to 400°F. Blend almonds, flour and sugar in processor until almonds are finely chopped. Add butter. Using on/off turns, process until large moist clumps form. Sprinkle mixture onto heavy baking sheet. Bake until streusel is pale golden, stirring often and leaving mixture in clumps, about 10 minutes. Cool completely. (Can be prepared 1 day ahead. Store streusel airtight at room temperature. Cover and refrigerate fruit mixture.)",
            "Reduce oven temperature to 350°F. Arrange ring molds on large baking sheet. Divide fruit mixture evenly among molds, pressing to compact. Sprinkle streusel evenly over fruit. Bake until fruit is heated through, about 5 minutes for room-temperature fruit and 10 minutes for refrigerated fruit. Let cool 5 minutes. Slide metal spatula under ring molds and transfer to plates. Remove molds. Drizzle sweetened cream around fruit and serve.",
            "Reduce oven temperature to 350°F. Arrange ring molds on large baking sheet. Divide fruit mixture evenly among molds, pressing to compact. Sprinkle streusel evenly over fruit.",
            "Bake until fruit is heated through, about 5 minutes for room-temperature fruit and 10 minutes for refrigerated fruit. Let cool 5 minutes. Slide metal spatula under ring molds and transfer to plates. Remove molds. Drizzle sweetened cream around fruit and serve.",
            "*Sold at most specialty cookware stores. If unavailable, substitute clean 8-ounce cans with bottoms and tops removed.",
            "*Sold at most specialty cookware stores. If unavailable, substitute clean 8-ounce cans with bottoms and tops removed."
        ],
        "picture_link": null
    }
}