{
    "recipe": {
        "title": "Pear and Duck Confit Salad ",
        "ingredients": [
            "1 teaspoon Dijon mustard",
            "1 tablespoon Sherry vinegar",
            "5 tablespoons extra-virgin olive oil",
            "2 tablespoons finely chopped shallot",
            "1/2 cup pecans, coarsely chopped",
            "2 confit duck legs",
            "3 firm-ripe Anjou or Bartlett pears (preferably red)",
            "8 cups mixed greens, such as frisée (French curly endive), tender watercress sprigs, and baby spinach leaves",
            "2 ounces crumbled Roquefort or other blue cheese (1/2 cup), optional"
        ],
        "instructions": [
            "Preheat oven to 250°F. Whisk together mustard, vinegar, and salt and pepper to taste in a large bowl. Add 4 tablespoons oil in a slow stream, whisking until emulsified, then whisk in shallot. Heat remaining tablespoon oil in a 10-inch heavy skillet over moderate heat until hot but not smoking, then cook pecans, stirring, until golden brown. Transfer nuts with a slotted spoon to paper towels to drain, then season with salt. Heat skillet with any oil remaining in it over moderately high heat until hot but not smoking, then brown duck on all sides until crisp, about 5 minutes. Transfer to a cutting board and tear meat into bite-size pieces and discard bones. Keep duck warm, covered, on a baking sheet in oven. Halve and core pears and cut lengthwise into 1/4-inch-thick slices. Add pears, greens, duck, cheese, and nuts to dressing with salt and pepper to taste, then toss gently to combine.",
            "Preheat oven to 250°F.",
            "Whisk together mustard, vinegar, and salt and pepper to taste in a large bowl. Add 4 tablespoons oil in a slow stream, whisking until emulsified, then whisk in shallot.",
            "Heat remaining tablespoon oil in a 10-inch heavy skillet over moderate heat until hot but not smoking, then cook pecans, stirring, until golden brown. Transfer nuts with a slotted spoon to paper towels to drain, then season with salt.",
            "Heat skillet with any oil remaining in it over moderately high heat until hot but not smoking, then brown duck on all sides until crisp, about 5 minutes. Transfer to a cutting board and tear meat into bite-size pieces and discard bones. Keep duck warm, covered, on a baking sheet in oven.",
            "Halve and core pears and cut lengthwise into 1/4-inch-thick slices. Add pears, greens, duck, cheese, and nuts to dressing with salt and pepper to taste, then toss gently to combine."
        ],
        "picture_link": null
    }
}