{
    "recipe": {
        "title": "Pear and Dried-Cherry Tart ",
        "ingredients": [
            "8 firm-ripe Bosc or Bartlett pears",
            "1 1/2 cups dried tart cherries",
            "1/2 cup packed light brown sugar",
            "1 teaspoon finely chopped fresh rosemary",
            "2 tablespoons fresh lemon juice",
            "1 tablespoon cornstarch",
            "Frozen-butter pastry dough",
            "1 large egg, lightly beaten",
            "a 2-inch leaf-shaped cookie cutter"
        ],
        "instructions": [
            "Make filling: Peel pears and cut into 1/2-inch pieces. Cook pears, cherries, brown sugar, and rosemary in a 4- to 5-quart heavy pot over moderate heat, stirring, until pears are tender, about 20 minutes. Stir together lemon juice and cornstarch in a small cup and stir into pear mixture. Cook, stirring, 1 minute, or until thickened. Transfer filling to a bowl and cool completely.",
            "Peel pears and cut into 1/2-inch pieces. Cook pears, cherries, brown sugar, and rosemary in a 4- to 5-quart heavy pot over moderate heat, stirring, until pears are tender, about 20 minutes.",
            "Stir together lemon juice and cornstarch in a small cup and stir into pear mixture. Cook, stirring, 1 minute, or until thickened. Transfer filling to a bowl and cool completely.",
            "Prepare shell while filling cooks and cools: Roll out larger disk of pastry dough into a 13-inch round on a lightly floured surface, keeping remaining disk chilled, and fit into a 10-inch round tart pan (1 inch deep) with a removable fluted rim. Roll rolling pin over top of pan to trim dough flush with rim, then lightly prick bottom all over with a fork. Chill shell 30 minutes. Preheat oven to 425°F and place a large baking sheet in middle of oven. Roll out remaining dough into a 12-inch round on a lightly floured surface and with leaf-shaped cutter cut out as many leaves as possible.",
            "Roll out larger disk of pastry dough into a 13-inch round on a lightly floured surface, keeping remaining disk chilled, and fit into a 10-inch round tart pan (1 inch deep) with a removable fluted rim. Roll rolling pin over top of pan to trim dough flush with rim, then lightly prick bottom all over with a fork. Chill shell 30 minutes.",
            "Preheat oven to 425°F and place a large baking sheet in middle of oven.",
            "Roll out remaining dough into a 12-inch round on a lightly floured surface and with leaf-shaped cutter cut out as many leaves as possible.",
            "Fill and bake tart: Spoon filling into tart shell, smoothing top, and decorate with pastry leaves. Brush leaves and pastry rim with some beaten egg. Bake tart on preheated baking sheet in middle of oven until pastry leaves are golden, about 50 minutes. (If pastry rim gets too brown, tent rim with foil or a pie shield.) Cool tart in pan on a rack at least 1 hour.",
            "Spoon filling into tart shell, smoothing top, and decorate with pastry leaves. Brush leaves and pastry rim with some beaten egg.",
            "Bake tart on preheated baking sheet in middle of oven until pastry leaves are golden, about 50 minutes. (If pastry rim gets too brown, tent rim with foil or a pie shield.)",
            "Cool tart in pan on a rack at least 1 hour."
        ],
        "picture_link": null
    }
}