{
    "recipe": {
        "title": "Pear and Walnut Upside-Down Cake with Whipped Crème Fraîche ",
        "ingredients": [
            "1 cup unsalted butter (2 sticks), room temperature",
            "3/4 cup lightly packed brown sugar",
            "1 1/2 pounds ripe pears, cored and sliced into thin wedges (such as Bartlett or D'Anjou) (about 3 pears)",
            "1 cup walnuts, toasted and chopped",
            "1 3/4 cups all-purpose flour",
            "2 teaspoons baking powder",
            "1/4 teaspoon salt",
            "1 cup granulated sugar",
            "3 large eggs, at room temperature",
            "1 teaspoon pure vanilla extract",
            "3/4 cup milk, room temperature",
            "4 tablespoons crème fraîche",
            "1 cup heavy cream",
            "1 teaspoon granulated sugar",
            "One 9-inch round metal cake pan (at least 2 inches tall)"
        ],
        "instructions": [
            "For the cake: Preheat the oven to 350°F. Cut a half-stick of butter into slices and place it and the brown sugar in the cake pan. Set the pan over a medium-high burner. Stir as the butter and sugar melt together and continue until the mixture gets pale and bubbly, swirly when stirred, and toasty brown, about 2 minutes. Set aside to cool. (Note: If you'd rather not make the caramel in the cake pan, you can use a large skillet instead and simply pour the caramel into the cake pan when done.) Arrange the pear wedges in the cake pan in an even patter. Sprinkle the walnuts evenly over the pears. In a medium bowl, sift together the flour, baking powder, and salt and set aside. Place the remaining 1 1/2 sticks of butter in the bowl of a stand mixer or large bowl. Beat the heck out of the butter using the paddle attachment of a stand mixer or a hand mixer until it gets lighter in both color and consistency. Add the sugar and beat until well blended and fluffy. Separate the egg yolks from the whites and set the whites aside in a medium bowl. Stir the yolks into the butter mixture until completely blended (no need to beat, and then stir the vanilla. Add half the dry ingredients and stir until mixed in. Stir in the milk until completely smooth, then the rest of the dry ingredients just until fully incorporated; set aside. Using a stand mixer or hand mixer, beat the egg whites until very fluffy. The whites should look shiny with soft peaks—stop whisking before they get dry looking. Gently but thoroughly fold the whipped whites into the batter—all the air that you just whipped in will go out of the whites if you over-mix at this point. Pour the batter over the fruit and gently smooth the top. Put the cake in the oven and start checking for doneness in 35 minutes: peek in, give the pan a tiny nudge, and look for jigglyness in the center. If it wobbles and looks soft and crinkled on top, gently close the door and set the timer for 5 more minutes. If it's looking set, slide the rack out and touch the top of the cake with your fingers, testing for bounce-back. If your touch leaves a dent that stays, return the cake to the oven. If it does spring back, the final test is sticking a toothpick into center of the cake. When it comes out moist, but crumb-free, it's done! Let the cake cool in the pan for 30 minutes. Run a knife around the edge, invert a plate on top of the pan, and carefully but quickly flip it over. Tap the bottom of the pan if the cake doesn't fall onto the plate on its own. Lift the pan away and replace any pear slices that may have stuck there. When ready to serve, combine all the ingredients for the whipped crème fraîche in a large bowl; whip until thick and fluffy, but still soft. Slice the cake and serve each wedge with a dollop of whipped crème fraîche.",
            "Preheat the oven to 350°F.",
            "Cut a half-stick of butter into slices and place it and the brown sugar in the cake pan. Set the pan over a medium-high burner. Stir as the butter and sugar melt together and continue until the mixture gets pale and bubbly, swirly when stirred, and toasty brown, about 2 minutes. Set aside to cool. (Note: If you'd rather not make the caramel in the cake pan, you can use a large skillet instead and simply pour the caramel into the cake pan when done.)",
            "Arrange the pear wedges in the cake pan in an even patter. Sprinkle the walnuts evenly over the pears.",
            "In a medium bowl, sift together the flour, baking powder, and salt and set aside.",
            "Place the remaining 1 1/2 sticks of butter in the bowl of a stand mixer or large bowl. Beat the heck out of the butter using the paddle attachment of a stand mixer or a hand mixer until it gets lighter in both color and consistency. Add the sugar and beat until well blended and fluffy.",
            "Separate the egg yolks from the whites and set the whites aside in a medium bowl. Stir the yolks into the butter mixture until completely blended (no need to beat, and then stir the vanilla. Add half the dry ingredients and stir until mixed in. Stir in the milk until completely smooth, then the rest of the dry ingredients just until fully incorporated; set aside.",
            "Using a stand mixer or hand mixer, beat the egg whites until very fluffy. The whites should look shiny with soft peaks—stop whisking before they get dry looking. Gently but thoroughly fold the whipped whites into the batter—all the air that you just whipped in will go out of the whites if you over-mix at this point. Pour the batter over the fruit and gently smooth the top.",
            "Put the cake in the oven and start checking for doneness in 35 minutes: peek in, give the pan a tiny nudge, and look for jigglyness in the center. If it wobbles and looks soft and crinkled on top, gently close the door and set the timer for 5 more minutes. If it's looking set, slide the rack out and touch the top of the cake with your fingers, testing for bounce-back. If your touch leaves a dent that stays, return the cake to the oven. If it does spring back, the final test is sticking a toothpick into center of the cake. When it comes out moist, but crumb-free, it's done!",
            "Let the cake cool in the pan for 30 minutes. Run a knife around the edge, invert a plate on top of the pan, and carefully but quickly flip it over. Tap the bottom of the pan if the cake doesn't fall onto the plate on its own. Lift the pan away and replace any pear slices that may have stuck there.",
            "When ready to serve, combine all the ingredients for the whipped crème fraîche in a large bowl; whip until thick and fluffy, but still soft.",
            "Slice the cake and serve each wedge with a dollop of whipped crème fraîche."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54c949601f13bb9b2edf4869/6:4/w_274%2Ch_169/51262920_upside-down-cake_1x1.jpg"
    }
}