{
    "recipe": {
        "title": "Pecan Praline Thumbprints ",
        "ingredients": [
            "1 3/4 cups (6 ounces) toasted, salted pecan pieces",
            "3/4 cup granulated sugar",
            "1 cup (8 ounces) unsalted butter, at room temperature",
            "1 teaspoon pure vanilla extract",
            "2 cups unbleached all-purpose flour",
            "3/4 teaspoon kosher salt",
            "3/4 teaspoon sea salt flakes",
            "3/4 cup (6 ounces) unsalted butter, at room temperature",
            "1/2 cup maple syrup",
            "1/2 cup firmly packed light brown sugar",
            "1/4 cup firmly packed dark brown sugar",
            "1 teaspoon pure vanilla extract",
            "1/2 teaspoon kosher salt",
            "1/2 teaspoon sea salt flakes",
            "1/2 cup heavy cream",
            "1 1/4 cups (4 1/2 ounces) toasted, salted pecan pieces"
        ],
        "instructions": [
            "In a food processor, pulse the pecans and 1/4 cup of the granulated sugar until a fine meal forms but before the nuts start to release their oils.",
            "In the bowl of a stand mixer fitted with the paddle attachment, mix the butter briefly on medium speed for 5 to 10 seconds. Add the remaining 1/2 cup granulated sugar and beat together until the butter mixture is aerated and pale in color, approximately 4 minutes. Briefly beat in the vanilla. Scrape the sides and bottom of the bowl with a rubber spatula to bring the batter together.",
            "In a bowl, whisk together the flour and salts. Add the dry ingredients all at once and mix on low speed until the dough comes together but still looks shaggy, approximately 30 seconds. Scrape the sides and bottom of the bowl to bring the batter together. Mix for another 10 seconds on medium speed. Remove the bowl from the stand mixer. With a plastic bench scraper, bring the dough completely together by hand.",
            "Stretch out a long sheet of plastic wrap on a work surface and put the dough on top. Pat into an 8-inch square, using the bench scraper to square off the sides. Wrap tightly and refrigerate until chilled throughout, at least 30 minutes or up to 3 days.",
            "Heat the oven to 350°F. Line a couple of half sheet (13 by 18-inch) pans with parchment.",
            "Cut the dough into 6 even strips. Roll the strips back and forth into logs to round out the edges. Using the top half of your thumb as a guide, cut each log into 8 pieces but keep the log together. Roll the logs again to round out the edges, then pull the pieces apart and place cut-side up on the prepared pans, evenly spacing up to 20 cookies per pan. With the tip of your index finger, make an indentation into the center of each cookie.",
            "Bake one pan at a time for 8 minutes. Remove the pan from the oven and tap down the centers with the rounded end of a wooden spoon or a cocktail muddler. Rotate the pan and bake until the cookies have slight cracks on the top and are set, another 4 to 6 minutes. When ready, the cookies will have set around the edges and you will be able to gently move them, but they still will be soft. Let the cookies cool completely on the pan. Repeat with the remaining pan.",
            "To make the praline: While the cookies are baking, start the praline. In a pot, melt the butter over medium heat. Mix in the maple syrup, sugars, vanilla, and salts and stir until homogeneous. Bring the mixture to a boil and boil for 3 minutes to thicken. Pour in the heavy cream, stirring to combine. Let the mixture reduce for 3 to 4 minutes, or until it lightly coats the back of a spoon. Stir in the nuts. You will have approximately 2 1/2 cups of praline. While the thumbprints are still warm, use a small spoon to scoop the goopy praline into the centers. (It is okay if some spills over on the sides.) Refrigerate until set, approximately 30 minutes.",
            "While the cookies are baking, start the praline. In a pot, melt the butter over medium heat. Mix in the maple syrup, sugars, vanilla, and salts and stir until homogeneous. Bring the mixture to a boil and boil for 3 minutes to thicken. Pour in the heavy cream, stirring to combine. Let the mixture reduce for 3 to 4 minutes, or until it lightly coats the back of a spoon. Stir in the nuts. You will have approximately 2 1/2 cups of praline.",
            "While the thumbprints are still warm, use a small spoon to scoop the goopy praline into the centers. (It is okay if some spills over on the sides.) Refrigerate until set, approximately 30 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/552d509920ca5d650ed244e4/6:4/w_274%2Ch_169/56389460_pecan-praline-thumbprints_6x4.jpg"
    }
}