{
    "recipe": {
        "title": "Pecan-Cranberry Galette ",
        "ingredients": [
            "3/4 cup all-purpose flour",
            "2 Tbsp. pecan halves",
            "1 Tbsp. granulated sugar",
            "1/4 tsp. ground cinnamon",
            "1/4 tsp. kosher salt",
            "5 Tbsp. cold unsalted butter, cut into pieces",
            "1/2 cup dried cranberries",
            "1/3 cup whiskey or brandy",
            "1 large egg",
            "1/2 cup (packed) light or dark brown sugar",
            "2 Tbsp. butter, melted",
            "1/8 tsp. kosher salt",
            "1 cup pecan halves",
            "All-purpose flour (for dusting)",
            "Coarse or granulated sugar (for sprinkling)",
            "Whipped cream, ice cream, or crème fraîche (for serving)"
        ],
        "instructions": [
            "Make the dough: Pulse flour, pecans, granulated sugar, cinnamon, and salt in a food processor until pecans are finely ground. Add butter and pulse until sandy. With the motor running, slowly pour in 1 Tbsp. cold water, then pulse until dough starts to clump together. Form into a ball with your hands. Tightly wrap in plastic and chill at least 1 hour or up to 2 days.",
            "Pulse flour, pecans, granulated sugar, cinnamon, and salt in a food processor until pecans are finely ground. Add butter and pulse until sandy. With the motor running, slowly pour in 1 Tbsp. cold water, then pulse until dough starts to clump together. Form into a ball with your hands. Tightly wrap in plastic and chill at least 1 hour or up to 2 days.",
            "Make the filling and assemble: Preheat oven to 350°F. Bring cranberries and whiskey to a boil in a small saucepan over medium heat (or microwave in a small heatproof bowl). Remove from heat and let sit 10 minutes. Strain cranberries through a fine-mesh sieve, discarding (or drinking) the booze. Whisk egg in a large bowl. Set aside about 1 tsp. beaten egg in a small bowl to use for brushing crust. Whisk brown sugar, butter, and salt into remaining egg in large bowl until smooth, then stir in cranberries and pecans. Let dough sit at room temperature 10 minutes. Roll out dough on a lightly floured work surface to an approximately 11\" round. Don’t worry if your circle isn’t perfect or the edges are cracked—that’s okay. Transfer to a parchment-lined rimmed baking sheet. Spoon filling onto center of dough, leaving a 2\" border. Fold dough up and over filling, overlapping slightly and using parchment to help lift the dough. Brush dough with reserved egg wash, then sprinkle generously with coarse sugar. Chill for 10 minutes. Bake galette until filling is puffed and set and crust is golden brown, 25–30 minutes. If some of the filling leaks out, don’t worry—just trim that off before serving. Let galette cool slightly. Serve with whipped cream.",
            "Preheat oven to 350°F. Bring cranberries and whiskey to a boil in a small saucepan over medium heat (or microwave in a small heatproof bowl). Remove from heat and let sit 10 minutes. Strain cranberries through a fine-mesh sieve, discarding (or drinking) the booze.",
            "Whisk egg in a large bowl. Set aside about 1 tsp. beaten egg in a small bowl to use for brushing crust. Whisk brown sugar, butter, and salt into remaining egg in large bowl until smooth, then stir in cranberries and pecans.",
            "Let dough sit at room temperature 10 minutes. Roll out dough on a lightly floured work surface to an approximately 11\" round. Don’t worry if your circle isn’t perfect or the edges are cracked—that’s okay. Transfer to a parchment-lined rimmed baking sheet.",
            "Spoon filling onto center of dough, leaving a 2\" border. Fold dough up and over filling, overlapping slightly and using parchment to help lift the dough. Brush dough with reserved egg wash, then sprinkle generously with coarse sugar. Chill for 10 minutes.",
            "Bake galette until filling is puffed and set and crust is golden brown, 25–30 minutes. If some of the filling leaks out, don’t worry—just trim that off before serving. Let galette cool slightly. Serve with whipped cream."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5bce4f35beb1821bea8db9cb/6:4/w_274%2Ch_169/Thanksgiving-2-4-Pecan-Cranberry-Galette-recipe-09102018.jpg"
    }
}