{
    "recipe": {
        "title": "Pecan Waffles with Sauteed Pineapple ",
        "ingredients": [
            "1 (1/4-oz) package active dry yeast (2 1/4 teaspoons)",
            "1/4 cup warm water (105–115°F)",
            "2 tablespoons plus 1 teaspoon sugar",
            "6 large eggs",
            "1 qt well-shaken buttermilk",
            "1/3 cup vegetable oil plus additional for brushing waffle iron",
            "3 1/4 cups all-purpose flour",
            "1 teaspoon baking powder",
            "1 teaspoon baking soda",
            "1/2 teaspoon salt",
            "1 1/2 cups pecans (6 oz), toasted , then 1 cup finely chopped and 1/2 cup coarsely chopped",
            "3 tablespoons unsalted butter",
            "1/2 vanilla bean",
            "1 pineapple (preferably labeled \"extra sweet\"), peeled (reserving rind for syrup , cut into 8 wedges, cored, and cut crosswise into 1/2-inch slices",
            "Accompaniment: vanilla brown sugar syrup",
            "a waffle iron (preferably Belgian-style)"
        ],
        "instructions": [
            "Make waffle batter: Stir together yeast, warm water, and 1 teaspoon sugar in a small bowl and let stand until foamy, about 5 minutes. (If mixture doesn't foam, discard and start over with new yeast.) Whisk together eggs, buttermilk, and oil. Sift together flour, baking powder, baking soda, salt, and remaining 2 tablespoons sugar into a large bowl. Add egg mixture and whisk until combined but still lumpy. Add yeast mixture and whisk until combined but still lumpy. Chill batter, covered, at least 8 hours. Bring batter to room temperature, then stir in 1 cup finely chopped pecans.",
            "Stir together yeast, warm water, and 1 teaspoon sugar in a small bowl and let stand until foamy, about 5 minutes. (If mixture doesn't foam, discard and start over with new yeast.)",
            "Whisk together eggs, buttermilk, and oil. Sift together flour, baking powder, baking soda, salt, and remaining 2 tablespoons sugar into a large bowl. Add egg mixture and whisk until combined but still lumpy. Add yeast mixture and whisk until combined but still lumpy. Chill batter, covered, at least 8 hours. Bring batter to room temperature, then stir in 1 cup finely chopped pecans.",
            "Prepare pineapple topping while batter comes to room temperature: Melt butter in a 12-inch heavy skillet over low heat and scrape seeds from vanilla bean into butter (save pod for another use). Increase heat to moderately high, then cook pineapple, stirring occasionally, until heated through, 8 to 10 minutes. Keep warm, covered.",
            "Melt butter in a 12-inch heavy skillet over low heat and scrape seeds from vanilla bean into butter (save pod for another use). Increase heat to moderately high, then cook pineapple, stirring occasionally, until heated through, 8 to 10 minutes. Keep warm, covered.",
            "Cook waffles: Preheat oven to 250°F and preheat waffle iron. Brush waffle iron lightly with vegetable oil and spoon batter into iron, using about 1 1/2 cups for 4 (4-inch) square Belgian waffles and spreading evenly. Cook according to manufacturer's instructions, then transfer directly onto oven rack to keep warm. (Don't stack waffles; they will stay crisp if kept in 1 layer.) Serve waffles topped with pineapple and sprinkled with remaining 1/2 cup (coarsely chopped) pecans.",
            "Preheat oven to 250°F and preheat waffle iron.",
            "Brush waffle iron lightly with vegetable oil and spoon batter into iron, using about 1 1/2 cups for 4 (4-inch) square Belgian waffles and spreading evenly. Cook according to manufacturer's instructions, then transfer directly onto oven rack to keep warm. (Don't stack waffles; they will stay crisp if kept in 1 layer.)",
            "Serve waffles topped with pineapple and sprinkled with remaining 1/2 cup (coarsely chopped) pecans."
        ],
        "picture_link": null
    }
}