{
    "recipe": {
        "title": "Peking-Style Chicken Wraps ",
        "ingredients": [
            "8 (6- to 7-inch) flour tortillas",
            "1/4 cup hoisin sauce",
            "2 tablespoons soy sauce",
            "2 tablespoons mild honey",
            "1 tablespoon minced peeled fresh ginger",
            "1 teaspoon rice vinegar",
            "2 garlic cloves, minced",
            "1/8 teaspoon cayenne",
            "1 1/2 lb skinless boneless chicken thighs (about 6)",
            "1 large plum, quartered, pitted, and cut into 1/4-inch pieces (1 cup)",
            "3 scallions, trimmed and cut lengthwise into 2-inch-long slivers"
        ],
        "instructions": [
            "Preheat broiler and lightly oil rack of a broiler pan. Stack tortillas and wrap in foil. Stir together hoisin, soy, honey, ginger, vinegar, garlic, and cayenne in a 1- to 1 1/2-quart saucepan. Toss chicken with 3 tablespoons sauce in a large bowl to coat, then broil 2 to 3 inches from heat, without turning, rotating pan halfway through broiling, until cooked through and deep golden, about 10 minutes. Transfer to a cutting board and let stand, uncovered, 5 minutes. While chicken is broiling, put tortillas on bottom rack of oven to warm. Boil sauce until slightly thickened, about 2 minutes, then add plum and simmer, stirring, 2 minutes. Cut chicken crosswise into 1/4-inch-thick slices. To eat, wrap up chicken, plum sauce, and scallions in tortillas.",
            "Preheat broiler and lightly oil rack of a broiler pan.",
            "Stack tortillas and wrap in foil. Stir together hoisin, soy, honey, ginger, vinegar, garlic, and cayenne in a 1- to 1 1/2-quart saucepan.",
            "Toss chicken with 3 tablespoons sauce in a large bowl to coat, then broil 2 to 3 inches from heat, without turning, rotating pan halfway through broiling, until cooked through and deep golden, about 10 minutes. Transfer to a cutting board and let stand, uncovered, 5 minutes.",
            "While chicken is broiling, put tortillas on bottom rack of oven to warm.",
            "Boil sauce until slightly thickened, about 2 minutes, then add plum and simmer, stirring, 2 minutes.",
            "Cut chicken crosswise into 1/4-inch-thick slices.",
            "To eat, wrap up chicken, plum sauce, and scallions in tortillas."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df24d7b55306961bfe139/6:4/w_274%2Ch_169/109643.jpg"
    }
}