{
    "recipe": {
        "title": "Penne with Roasted Tomatoes, Chicken, and Mushrooms ",
        "ingredients": [
            "1 pound plum tomatoes, quartered lengthwise, seeded, wedges halved",
            "5 tablespoons olive oil",
            "1 tablespoon dried oregano",
            "12 ounces penne pasta",
            "6 small portobello mushrooms (portobellini), dark gills removed, caps sliced",
            "4 green onions, thinly sliced",
            "3 garlic cloves, minced",
            "3/4 pound chicken tenders, halved lengthwise, then halved crosswise",
            "1 cup crumbled feta cheese",
            "1 cup grated Parmesan cheese",
            "1/2 cup low-salt chicken broth",
            "1/4 cup dry white wine"
        ],
        "instructions": [
            "Preheat oven to 425°F. Combine tomatoes, 2 tablespoons oil, and oregano in small bowl; toss to blend. Place tomatoes on baking sheet. Roast until beginning to dry and wrinkle, about 20 minutes. Meanwhile, cook pasta in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain pasta; let stand in colander. Heat 2 tablespoons oil in same pot over medium-high heat. Add mushrooms, onions, and garlic and sauté until mushrooms are tender and brown, about 10 minutes. Transfer mushroom mixture to medium bowl. Heat remaining 1 tablespoon oil in same pot over medium-high heat. Sprinkle chicken with salt and pepper. Add chicken to pot and sauté until brown and cooked through, about 5 minutes. Add mushroom mixture and roasted tomatoes to pot. Add penne, feta, Parmesan, chicken broth, and wine; toss until heated through and sauce coats pasta, about 4 minutes. Season to taste with salt and pepper.",
            "Preheat oven to 425°F. Combine tomatoes, 2 tablespoons oil, and oregano in small bowl; toss to blend. Place tomatoes on baking sheet. Roast until beginning to dry and wrinkle, about 20 minutes.",
            "Meanwhile, cook pasta in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain pasta; let stand in colander.",
            "Heat 2 tablespoons oil in same pot over medium-high heat. Add mushrooms, onions, and garlic and sauté until mushrooms are tender and brown, about 10 minutes. Transfer mushroom mixture to medium bowl. Heat remaining 1 tablespoon oil in same pot over medium-high heat. Sprinkle chicken with salt and pepper. Add chicken to pot and sauté until brown and cooked through, about 5 minutes. Add mushroom mixture and roasted tomatoes to pot. Add penne, feta, Parmesan, chicken broth, and wine; toss until heated through and sauce coats pasta, about 4 minutes. Season to taste with salt and pepper."
        ],
        "picture_link": null
    }
}