{
    "recipe": {
        "title": "Peppercorn Roasted Pork with Vermouth Pan Sauce ",
        "ingredients": [
            "6 tablespoons pink peppercorns divided",
            "2 tablespoons black peppercorns",
            "1 1/2 tablespoons fennel seeds",
            "7 garlic cloves, minced",
            "3 tablespoons vegetable oil",
            "1 (5-pounds) boneless pork shoulder roast (butt end)",
            "1/2 cup dry vermouth",
            "2 cups reduced-sodium chicken broth",
            "1 tablespoon unsalted butter, softened",
            "1 tablespoon all-purpose flour",
            "Equipment: an electric coffee/spice grinder"
        ],
        "instructions": [
            "Grind 1/4 cup pink peppercorns with black peppercorns and fennel seeds in grinder, then stir together with garlic, oil, and 1 tablespoon salt. Pat pork dry and use a paring knife to make about 16 (1-inch-deep) slits all over roast. Stuff slits with all but 1 tablespoon garlic-peppercorn paste, then rub remaining tablespoon all over roast. Put in a small (13-by 9-inch) flameproof roasting pan and marinate, chilled, 8 to 24 hours. Let pork stand at room temperature 1 hour. Preheat oven to 350°F with rack in middle. Roast pork, fat side up, until an instant-read thermometer inserted into center of meat registers 150°F, 1 1/2 to 2 hours. Transfer pork to a cutting board and let rest 30 minutes. Meanwhile, pour off all but about 1 tablespoon fat from roasting pan. Add vermouth to pan and boil, scraping up brown bits, 2 minutes. Stir in broth, any meat juices from cutting board, and remaining 2 tablespoons pink peppercorns and boil until reduced to about 1 1/2 cups, about 5 minutes. Knead together butter and flour, then whisk into sauce and boil, whisking constantly, until just slightly thickened, about 2 minutes. Serve pork with sauce.",
            "Grind 1/4 cup pink peppercorns with black peppercorns and fennel seeds in grinder, then stir together with garlic, oil, and 1 tablespoon salt.",
            "Pat pork dry and use a paring knife to make about 16 (1-inch-deep) slits all over roast. Stuff slits with all but 1 tablespoon garlic-peppercorn paste, then rub remaining tablespoon all over roast. Put in a small (13-by 9-inch) flameproof roasting pan and marinate, chilled, 8 to 24 hours.",
            "Let pork stand at room temperature 1 hour. Preheat oven to 350°F with rack in middle.",
            "Roast pork, fat side up, until an instant-read thermometer inserted into center of meat registers 150°F, 1 1/2 to 2 hours. Transfer pork to a cutting board and let rest 30 minutes.",
            "Meanwhile, pour off all but about 1 tablespoon fat from roasting pan. Add vermouth to pan and boil, scraping up brown bits, 2 minutes. Stir in broth, any meat juices from cutting board, and remaining 2 tablespoons pink peppercorns and boil until reduced to about 1 1/2 cups, about 5 minutes.",
            "Knead together butter and flour, then whisk into sauce and boil, whisking constantly, until just slightly thickened, about 2 minutes.",
            "Serve pork with sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3dff221388ef838b0c3da/6:4/w_274%2Ch_169/354981_roasted-pork_1x1.jpg"
    }
}