{
    "recipe": {
        "title": "Perfect Poached Eggs ",
        "ingredients": [
            "4 large eggs",
            "Kosher salt, freshly ground pepper"
        ],
        "instructions": [
            "Bring a large saucepan of water to a gentle simmer. Crack an egg into a fine-mesh sieve set over a medium bowl. Let watery whites run through into bowl below; carefully transfer egg to a small bowl (this helps eliminate the long, tentacle-like strands of egg white that may otherwise form, and encourages a smooth, round poached egg). Stir simmering water with a slotted spoon to make a gentle vortex. Tip egg out of bowl into center of vortex and swirl water gently to help bring whites up around yolk. Repeat with 3 more eggs so there are 4 eggs total in saucepan. Cook until whites are just set but yolk is still very soft (lift out of water with a slotted spoon and gently press on yolk to assess), about 2 1/2 minutes from the time each egg hits the water. Transfer to a warm plate with slotted spoon. Season eggs with salt and pepper just before serving.",
            "Bring a large saucepan of water to a gentle simmer. Crack an egg into a fine-mesh sieve set over a medium bowl. Let watery whites run through into bowl below; carefully transfer egg to a small bowl (this helps eliminate the long, tentacle-like strands of egg white that may otherwise form, and encourages a smooth, round poached egg).",
            "Stir simmering water with a slotted spoon to make a gentle vortex. Tip egg out of bowl into center of vortex and swirl water gently to help bring whites up around yolk. Repeat with 3 more eggs so there are 4 eggs total in saucepan. Cook until whites are just set but yolk is still very soft (lift out of water with a slotted spoon and gently press on yolk to assess), about 2 1/2 minutes from the time each egg hits the water. Transfer to a warm plate with slotted spoon. Season eggs with salt and pepper just before serving.",
            "Do Ahead Eggs can be poached 1 day ahead. Transfer to a bowl of ice water instead of warm plate. Cover and chill. Reheat in barely simmering water 1 minute before serving.",
            "Eggs can be poached 1 day ahead. Transfer to a bowl of ice water instead of warm plate. Cover and chill. Reheat in barely simmering water 1 minute before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58f66919cd963f15a263e495/6:4/w_274%2Ch_169/perfect-poached-eggs-BA-071817.jpg"
    }
}