{
    "recipe": {
        "title": "Pickled Shrimp ",
        "ingredients": [
            "3 cups unseasoned rice vinegar",
            "3 cups olive oil",
            "1 cup fresh lemon juice",
            "1 cup paper-thin lemon slices",
            "1 cup paper-thin red onion slices",
            "1 cup sliced peeled garlic cloves (about 1 large head)",
            "12 fresh bay leaves, coarsely torn",
            "3 tablespoons celery seeds",
            "3 tablespoons mustard seeds",
            "2 teaspoons coarse kosher salt",
            "1 teaspoon freshly ground black pepper",
            "8 cups water",
            "1 cup coarse kosher salt",
            "10 Turkish bay leaves",
            "6 fresh thyme sprigs",
            "1 unpeeled whole head of garlic, cut crosswise in half",
            "1/4 cup paprika",
            "2 tablespoons mustard seeds",
            "1 tablespoon whole allspice",
            "1 tablespoon celery seeds",
            "1 tablespoon cardamom pods",
            "1 cinnamon stick",
            "2 pounds uncooked large shrimp in shells",
            "Ice cubes",
            "Crusty bread"
        ],
        "instructions": [
            "Stir rice vinegar, olive oil, lemon juice, lemon slices, onion slices, garlic cloves, bay leaves, celery seeds, mustard seeds, coarse kosher salt, and black pepper in large bowl until salt dissolves. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
            "For boiling mixture: Place 8 cups water in large pot. Add coarse salt, bay leaves, thyme sprigs, garlic, paprika, mustard seeds, allspice, celery seeds, cardamom pods, and cinnamon stick. Bring to boil over high heat. Boil 5 minutes. Add shrimp; stir to separate. Boil just until shells turn pink, about 2 minutes. Using large skimmer, transfer shrimp to colander to drain. Line rimmed baking sheet with layer of ice cubes. Scatter shrimp on ice to cool quickly, about 5 minutes. Peel and devein shrimp, leaving tails intact. Add peeled shrimp to pickling mixture; stir to blend. Cover and refrigerate at least 3 hours and up to 6 hours. Using slotted spoon, lift shrimp from pickling mixture. Arrange on platter. Serve with crusty bread.",
            "Place 8 cups water in large pot. Add coarse salt, bay leaves, thyme sprigs, garlic, paprika, mustard seeds, allspice, celery seeds, cardamom pods, and cinnamon stick. Bring to boil over high heat. Boil 5 minutes. Add shrimp; stir to separate. Boil just until shells turn pink, about 2 minutes. Using large skimmer, transfer shrimp to colander to drain.",
            "Line rimmed baking sheet with layer of ice cubes. Scatter shrimp on ice to cool quickly, about 5 minutes. Peel and devein shrimp, leaving tails intact. Add peeled shrimp to pickling mixture; stir to blend. Cover and refrigerate at least 3 hours and up to 6 hours.",
            "Using slotted spoon, lift shrimp from pickling mixture. Arrange on platter. Serve with crusty bread.",
            "What to drink: A special meal like this deserves a bubbly beginning. With the shrimp, pour a crisp Champagne. We like the Franck Bonville NV Brut Sélection (France, $30), which is fruity with citrus and mineral notes.",
            "A special meal like this deserves a bubbly beginning. With the shrimp, pour a crisp Champagne. We like the Franck Bonville NV Brut Sélection (France, $30), which is fruity with citrus and mineral notes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a79c6a59cdb91b5ff76b/6:4/w_274%2Ch_169/356356_hires.jpg",
        "color": 1251724
    }
}