{
    "recipe": {
        "title": "Pickled Vegetable Salad with Nori Vinaigrette ",
        "ingredients": [
            "6 radishes, trimmed, thinly sliced",
            "2 large carrots, peeled, julienned",
            "1/2 medium red onion, thinly sliced",
            "1/2 English hothouse cucumber, thinly sliced",
            "2 tablespoons sugar",
            "1 tablespoon kosher salt",
            "1 1/4 cups unseasoned rice vinegar, divided",
            "2 toasted nori sheets",
            "1/4 cup vegetable oil",
            "2 tablespoons reduced-sodium soy sauce",
            "1 tablespoon mirin (sweet Japanese rice wine)",
            "5 ounces tender lettuces (such as Bibb, butter, and mâche; about 6 cups)"
        ],
        "instructions": [
            "Place radishes, carrots, onion, and cucumber in 4 separate bowls or jars. Bring sugar, salt, 1 cup vinegar, and 2 cups water to a boil in a medium saucepan, stirring to dissolve sugar. Pour pickling liquid over vegetables to cover; let cool. Cover and chill. Grind nori in a blender, scraping down sides as needed, until finely ground. Add oil, soy sauce, mirin, and remaining 1/4 cup vinegar and blend until smooth. Toss lettuces and dressing in a large bowl to coat. Drain pickled vegetables and arrange on top of salad. DO AHEAD: Nori vinaigrette can be made 3 days ahead; cover and chill. Vegetables can be pickled 1 day ahead; keep chilled.",
            "Place radishes, carrots, onion, and cucumber in 4 separate bowls or jars. Bring sugar, salt, 1 cup vinegar, and 2 cups water to a boil in a medium saucepan, stirring to dissolve sugar. Pour pickling liquid over vegetables to cover; let cool. Cover and chill.",
            "Grind nori in a blender, scraping down sides as needed, until finely ground. Add oil, soy sauce, mirin, and remaining 1/4 cup vinegar and blend until smooth. Toss lettuces and dressing in a large bowl to coat. Drain pickled vegetables and arrange on top of salad.",
            "DO AHEAD: Nori vinaigrette can be made 3 days ahead; cover and chill. Vegetables can be pickled 1 day ahead; keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3f86a460b4423363f93c5/6:4/w_274%2Ch_169/51214460_pickled-vegetable-salad_1x1.jpg"
    }
}