{
    "recipe": {
        "title": "Pignoli Cookies ",
        "ingredients": [
            "2 (8-oz) cans almond paste (not marzipan), coarsely crumbled",
            "1 1/2 cups confectioners sugar",
            "1/2 teaspoon salt",
            "2 large egg whites",
            "2 tablespoons mild honey",
            "1 cup pine nuts (pignoli ; 4 1/2 oz)",
            "N/A",
            "N/A parchment paper",
            "a standing electric mixer; a large pastry bag fitted with 1/2-inch plain tip (optional); parchment paper"
        ],
        "instructions": [
            "Preheat oven to 350°F. Pulse almond paste in a food processor until broken up into small bits, then add confectioners sugar and salt and continue to pulse until finely ground, about 1 minute. Beat together almond mixture, egg whites, and honey in electric mixer at medium-high speed until smooth, about 5 minutes (batter will be very thick). Spoon half of batter into pastry bag if using (keep remaining batter covered with a dampened paper towel) and pipe or spoon 1 1/2-inch rounds about 1 inch apart onto 2 parchment-lined baking sheets. Gently press half of pine nuts into tops of cookies. Bake cookies in upper and lower thirds of oven, switching position of sheets halfway through baking, until golden, 12 to 15 minutes total. Slide cookies on parchment onto racks to cool completely, then peel cookies from parchment. Make more cookies with remaining batter and pine nuts on cooled baking sheets.",
            "Preheat oven to 350°F.",
            "Pulse almond paste in a food processor until broken up into small bits, then add confectioners sugar and salt and continue to pulse until finely ground, about 1 minute.",
            "Beat together almond mixture, egg whites, and honey in electric mixer at medium-high speed until smooth, about 5 minutes (batter will be very thick).",
            "Spoon half of batter into pastry bag if using (keep remaining batter covered with a dampened paper towel) and pipe or spoon 1 1/2-inch rounds about 1 inch apart onto 2 parchment-lined baking sheets. Gently press half of pine nuts into tops of cookies.",
            "Bake cookies in upper and lower thirds of oven, switching position of sheets halfway through baking, until golden, 12 to 15 minutes total. Slide cookies on parchment onto racks to cool completely, then peel cookies from parchment. Make more cookies with remaining batter and pine nuts on cooled baking sheets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57ab6c6960d0ba8b513d42ce/6:4/w_274%2Ch_169/pignoli-cookies.jpg"
    }
}