{
    "recipe": {
        "title": "Pigs-in-a-Blanket with Sauerkraut and Mustard ",
        "ingredients": [
            "1 large egg",
            "One 14- to 17-ounce box of puff pastry (preferably all-butter), thawed according to package directions",
            "2 pounds fully cooked German-style sausage such as bockwurst or bratwurst, halved lengthwise if thick, and cut into 32 pieces (about 2 1/2 inches each)",
            "1/3 cup whole-grain mustard",
            "1/3 cup drained sauerkraut",
            "Caraway seeds, for sprinkling"
        ],
        "instructions": [
            "Preheat the oven to 400°F. Set racks in the upper and lower thirds of the oven. Line two 13x18-inch baking sheets with parchment paper. In a small bowl, beat the egg with 1 tablespoon water. Prep the ingredients for the filling and set aside. If using a 17-ounce puff pastry package, roll each sheet to a 9x12-inch rectangle. Cut each piece lengthwise into eight 1 1/2-inch wide strips. Cut each strip crosswise into two pieces, about 4 1/2 inches long. You should have 32 pieces of pastry. Spread the center of each piece of pastry with 1/2 teaspoon mustard and top with 1/2 teaspoon sauerkraut. Brush one narrow end of the pastry with egg wash, add one piece of sausage, and roll to enclose. Return to parchment-lined baking sheets. Brush the top of each pastry with egg wash and sprinkle with caraway seeds, seam-side down. Chill in refrigerator for 15 minutes. Bake until golden brown and puffed, 23 to 27 minutes.",
            "Preheat the oven to 400°F. Set racks in the upper and lower thirds of the oven. Line two 13x18-inch baking sheets with parchment paper. In a small bowl, beat the egg with 1 tablespoon water. Prep the ingredients for the filling and set aside.",
            "If using a 17-ounce puff pastry package, roll each sheet to a 9x12-inch rectangle. Cut each piece lengthwise into eight 1 1/2-inch wide strips. Cut each strip crosswise into two pieces, about 4 1/2 inches long. You should have 32 pieces of pastry.",
            "Spread the center of each piece of pastry with 1/2 teaspoon mustard and top with 1/2 teaspoon sauerkraut. Brush one narrow end of the pastry with egg wash, add one piece of sausage, and roll to enclose. Return to parchment-lined baking sheets. Brush the top of each pastry with egg wash and sprinkle with caraway seeds, seam-side down. Chill in refrigerator for 15 minutes. Bake until golden brown and puffed, 23 to 27 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c17d4b06c844511339f43e7/6:4/w_274%2Ch_169/Small-Plates-New-Years-Pigs-in-a-blanket-12122018.jpg"
    }
}