{
    "recipe": {
        "title": "Pimiento Cheese Crackers ",
        "ingredients": [
            "12 oz. sharp cheddar, coarsely grated (about 4 cups)",
            "1 cup plus 2 Tbsp. all-purpose flour",
            "1 1/2 tsp. kosher salt",
            "1/4 tsp. cayenne pepper",
            "1/4 cup chopped jarred pimiento peppers",
            "5 Tbsp. chilled unsalted butter, cut into pieces",
            "3 Tbsp. white or black sesame seeds"
        ],
        "instructions": [
            "Pulse cheese, flour, salt, and cayenne in a food processor to combine (4–6 pulses should do it). Add pimiento peppers and pulse until mixture turns orange (another 2 or 3 pulses). Add butter and pulse until largest pieces are about the size of a pea (4–6 pulses). Drizzle in 2 Tbsp. ice water and pulse 2 or 3 more times. Dough should stick together when squeezed in your hand. If not, pulse in another tablespoonful of ice water.",
            "Transfer dough to a work surface and form into a tightly packed 2\"-diameter log. Gently sprinkle sesame seeds over surface and roll log over sesame seeds, pressing them into dough to adhere, until completely coated. Discard any sesame seeds that don’t stick. Wrap dough in plastic and chill at least 4 hours and up to 2 days before rolling out.",
            "Place a rack in the middle of oven; preheat to 350°F. Unwrap dough and using a sharp knife, slice into thin rounds; aim for 1/8\"–1/4\" thick. Transfer rounds to a parchment-lined baking sheet, spacing about 1\" apart (they won’t all fit in one batch). Prick each cracker 3–4 times with a fork to keep them from puffing up and bake, rotating baking sheet front to back halfway through, until tops and edges are golden, 25–30 minutes. Let cool on baking sheet; crackers will crisp as they cool. Repeat with remaining rounds and a fresh parchment-lined baking sheet."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c1149673e9ec157ff93ded2/6:4/w_274%2Ch_169/pimento-cheese-crackers-recipe-BA-121218.jpg"
    }
}