{
    "recipe": {
        "title": "Piña Colada Pastry Cream ",
        "ingredients": [
            "1 cup pineapple juice (240 grams)",
            "1 cup coconut milk (240 grams)",
            "1/2 cup sugar (100 grams)",
            "3 tablespoons cornstarch (24 grams)",
            "1/4 teaspoon kosher salt (1 gram)",
            "4 large egg yolks",
            "1 large egg",
            "2 tablespoons (1/4 stick) cold unsalted butter, diced (28 grams)",
            "2 tablespoons light rum (optional) (30 grams)"
        ],
        "instructions": [
            "In a medium saucepan, whisk the pineapple juice and coconut milk together. Heat over medium heat, stirring occasionally, for about 3 minutes, until the liquid is hot and steaming but not boiling.",
            "Meanwhile, in a small bowl, whisk the sugar, cornstarch, and salt together. In a medium bowl, whisk the egg yolks and whole egg until well mixed and homogenous. Whisk the sugar mixture into the eggs until lightened and fluffy. While whisking, pour about a third of the hot pineapple and coconut milk mixture over the yolk mixture and whisk very well until combined. Add another third and whisk well. Whisk in the remaining hot liquid and pour the mixture back into the saucepan. Return the pan to medium heat and whisk constantly until the mixture begins to boil.",
            "Once it is bubbling, whisk the mixture vigorously at a boil for 3 to 4 full minutes. Remove the pan from the heat and whisk in the butter, a little at a time. Mix in the rum, if using, after the butter has been incorporated.",
            "Pass the mixture through a fine-mesh strainer into a small baking sheet or cake pan, pressing the cream in the strainer to remove any cooked egg bits. Spread the pastry cream into a thin layer on the sheet; lay a sheet of plastic wrap directly on the surface.",
            "Cool the pastry cream to room temperature; refrigerate for at least 2 hours and preferably overnight. When ready to use, transfer the pastry cream to a bowl and stir with a rubber spatula to loosen it. Pastry cream should be used within 3 days."
        ],
        "picture_link": null,
        "color": 14251627
    }
}