{
    "recipe": {
        "title": "Pineapple Anise Sherbet ",
        "ingredients": [
            "2 cups water",
            "1 2/3 cups sugar",
            "2 teaspoons anise seeds",
            "1 teaspoon Pernod or other anise-flavored liqueur (optional)",
            "1 (4-lb) pineapple (labeled \"extra sweet\"), trimmed, peeled, halved lengthwise, and cored",
            "1 tablespoon fresh lemon juice",
            "an ice cream maker"
        ],
        "instructions": [
            "Bring water, sugar, and anise seeds to a boil in a 2 1/2- to 3-quart heavy saucepan, stirring until sugar is dissolved, then reduce heat and simmer, uncovered, 5 minutes. Remove pan from heat and stir in Pernod (if using). Cool syrup to room temperature, about 1 hour, then pour through a fine-mesh sieve into a bowl. While syrup cools, cut enough pineapple into 1-inch chunks to measure 5 1/4 cups (reserve remainder for another use), then purée pineapple in 3 batches in a blender at high speed until very smooth, about 1 minute per batch. Stir purée and lemon juice into cooled syrup until combined well, then chill, covered, until very cold, about 4 hours. Freeze in ice cream maker, then transfer to an airtight container and put in freezer to harden, at least 1 hour.",
            "Bring water, sugar, and anise seeds to a boil in a 2 1/2- to 3-quart heavy saucepan, stirring until sugar is dissolved, then reduce heat and simmer, uncovered, 5 minutes. Remove pan from heat and stir in Pernod (if using). Cool syrup to room temperature, about 1 hour, then pour through a fine-mesh sieve into a bowl.",
            "While syrup cools, cut enough pineapple into 1-inch chunks to measure 5 1/4 cups (reserve remainder for another use), then purée pineapple in 3 batches in a blender at high speed until very smooth, about 1 minute per batch. Stir purée and lemon juice into cooled syrup until combined well, then chill, covered, until very cold, about 4 hours.",
            "Freeze in ice cream maker, then transfer to an airtight container and put in freezer to harden, at least 1 hour."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df2e2f9a84192308a86f6/6:4/w_274%2Ch_169/231216.jpg"
    }
}