{
    "recipe": {
        "title": "Pineapple Coconut Meringue Torte ",
        "ingredients": [
            "Batter for Crunchy Meringue Cookies",
            "1/2 fresh pineapple, peeled and cored",
            "Olive oil, for searing",
            "Coarse salt, for sprinkling",
            "1/2 cup heavy cream (120 grams)",
            "2 tablespoons confectioners' sugar (16 grams)",
            "Pina Colada Pastry Cream",
            "1/2 cup unsweetened flaked coconut, lightly toasted (36 grams)",
            "a piping bag with a 1/2-inch plain tip"
        ],
        "instructions": [
            "Preheat the oven to 200°F. Line 2 baking sheets with parchment paper.",
            "Prepare the meringue cookie batter as directed. Using a piping bag with a 1/2-inch plain tip, or using a spoon, form the meringue into three 8-inch disks on the lined baking sheets, each about 1/2 inch thick.",
            "Bake for about 45 minutes, until crisp on the outside but still moist in the center. Cool completely in the oven.",
            "Halve the pineapple lengthwise and cut the pieces crosswise into 1/4-inch-thick slices. Heat a very thin layer of oil in large nonstick skillet or griddle over medium-high heat and add the pineapple. Cook for 4 to 5 minutes, until seared and golden, then flip the pieces and sear the other side. Transfer the pieces to a plate and sprinkle them lightly with salt; cool to room temperature.",
            "Whip the cream until soft peaks form; sift the confectioners' sugar over it and whip until combined and the cream forms medium-firm peaks. Put the pastry cream in a large bowl and whisk to loosen it.",
            "Add about a third of the whipped cream and whisk it into the pastry cream to lighten it. Using a large spatula, add the remaining whipped cream and fold it into the pastry cream until just combined. Reserve about 1/2 cup of the cream and transfer the remainder to a piping bag fitted with a 1/2-inch plain tip.",
            "Put one meringue disk onto a serving plate and pipe a spiral of pastry cream (using a little less than half of it) over it, covering it completely but leaving a 1/2-inch border around the edge. Blot the pineapple pieces with a paper towel and arrange half of them, fanning them in a concentric circle, over the pastry cream. Put another meringue disk on top and repeat with the remaining pastry cream and pineapple. Top with the remaining meringue disk and, using a small off set spatula, spread the reserved pastry cream in a thin even layer over the top. Sprinkle the coconut evenly over the top.",
            "The torte can be sliced immediately and served but is better if refrigerated for at least 1 hour and no longer than 3 hours to soften the meringue."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ab442919925f464b3a299e/6:4/w_274%2Ch_169/51254230_pineapple-coconut-torte_1x1.jpg",
        "color": 5729809
    }
}