{
    "recipe": {
        "title": "Pink Greens ",
        "ingredients": [
            "1 large bunch beet greens",
            "2 teaspoons chopped garlic",
            "1 shallot, chopped",
            "1/4 teaspoon crushed red pepper flakes",
            "1 teaspoon olive oil",
            "1/2 teaspoon coarsely ground black pepper",
            "2 teaspoons sugar",
            "1/4 teaspoon salt",
            "2 teaspoons sherry vinegar"
        ],
        "instructions": [
            "1. Wash and trim the beet greens. If the stems are very thick, it's worth trimming them back a bit. 2. In a large sauté pan over medium heat, sauté the garlic, shallot, and red pepper flakes in the olive oil until slightly browned. Add the black pepper, sugar, and salt. 3. Place the beet greens in the pan, pour 1/4 cup water over them, and immediately cover. Once the greens have cooked down, 1 to 2 minutes, remove the lid and stir. Cook for another 1 to 2 minutes, allowing the water to evaporate. 4. Just before serving, pour the vinegar over the greens. Serve and enjoy!",
            "1. Wash and trim the beet greens. If the stems are very thick, it's worth trimming them back a bit.",
            "2. In a large sauté pan over medium heat, sauté the garlic, shallot, and red pepper flakes in the olive oil until slightly browned. Add the black pepper, sugar, and salt.",
            "3. Place the beet greens in the pan, pour 1/4 cup water over them, and immediately cover. Once the greens have cooked down, 1 to 2 minutes, remove the lid and stir. Cook for another 1 to 2 minutes, allowing the water to evaporate.",
            "4. Just before serving, pour the vinegar over the greens. Serve and enjoy!",
            "Tips and Techniques If you double the amounts as we did, so that it serves 4 people, add vinegar to taste. Twice the amount may be too much. You could use the same technique with spinach, arugula, chard, or any other dark leafy green.",
            "If you double the amounts as we did, so that it serves 4 people, add vinegar to taste. Twice the amount may be too much. You could use the same technique with spinach, arugula, chard, or any other dark leafy green.",
            "About the cook Marissa Grace Desmond and her husband, Ian Kaminski‐Coughlin, live in Cambridge, Massachusetts. Their favorite entertaining tip: \"For dinner parties, we share online spreadsheets with our guests, so everyone can see who has responded. It also makes it much easier to coordinate who is bringing what and whether or not we need more wine!\"",
            "Marissa Grace Desmond and her husband, Ian Kaminski‐Coughlin, live in Cambridge, Massachusetts. Their favorite entertaining tip: \"For dinner parties, we share online spreadsheets with our guests, so everyone can see who has responded. It also makes it much easier to coordinate who is bringing what and whether or not we need more wine!\"",
            "What the Community Said Alli51: \"This recipe would work great for various types of Asian greens (which I typically just cook with a bit of oil, kosher salt, and some soy/fish sauce and maybe some chicken broth). This will be much more interesting!\"",
            "Alli51: \"This recipe would work great for various types of Asian greens (which I typically just cook with a bit of oil, kosher salt, and some soy/fish sauce and maybe some chicken broth). This will be much more interesting!\""
        ],
        "picture_link": "https://assets.epicurious.com/photos/560400e17bdffb1205b6add1/6:4/w_274%2Ch_169/388629_hires.jpg"
    }
}