{
    "recipe": {
        "title": "Piquillo Pepper and Sardine Tartines ",
        "ingredients": [
            "12 1/3-inch-thick baguette slices, cut on diagonal into 3- to 4-inch lengths",
            "Extra-virgin olive oil",
            "1 garlic clove, peeled, halved",
            "1 1/2 3.75-ounce cans skinless boneless sardines (preferably wild-caught) packed in olive oil, drained well",
            "Sriracha sauce or other hot chili sauce (optional)",
            "Fresh lemon juice plus lemon wedges for garnish",
            "Very thin onion slices",
            "1 1/2 tablespoons (about) drained capers",
            "12 thick strips piquillo peppers or roasted red peppers from jar, drained"
        ],
        "instructions": [
            "Preheat broiler. Brush both sides of each bread slice lightly with olive oil. Arrange bread slices on small baking sheet. Broil until beginning to color, about 1 minute per side. Rub 1 side of each bread slice with cut side of garlic and cool.",
            "Place bread slices, garlic side up, on serving platter. Divide sardines among bread slices. Spread out sardines in thin layer. Sprinkle a few drops of sriracha sauce over each, if desired, then a few drops of lemon juice. Top each tartine with onion slices, several capers, then strip of drained piquillo pepper. Garnish platter with lemon wedges and serve.",
            "What to Drink: With the tartines, pour a refreshing Albariño, a white wine from Spain. We like the Carballal 2008 \"Sete Cepas\" from Rías Baixas ($15). The wine's mineral notes are balanced beautifully by stone-fruit flavors.",
            "With the tartines, pour a refreshing Albariño, a white wine from Spain. We like the Carballal 2008 \"Sete Cepas\" from Rías Baixas ($15). The wine's mineral notes are balanced beautifully by stone-fruit flavors."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b33991460b4423363f0c40/6:4/w_274%2Ch_169/357261_sardine-tartines_1x1.jpg"
    }
}