{
    "recipe": {
        "title": "Piri-Piri Chicken ",
        "ingredients": [
            "3 tablespoons butter",
            "3 tablespoons chopped fresh cilantro",
            "2 garlic cloves, minced",
            "2 tablespoons piri-piri sauce or other hot pepper sauce",
            "2 tablespoons fresh lemon juice",
            "1/4 cup chopped fresh cilantro",
            "1 2-inch piece fresh ginger, peeled, thinly sliced",
            "1 large shallot, peeled, quartered",
            "3 garlic cloves, peeled",
            "1/2 cup piri-piri sauce or other hot pepper sauce",
            "1/4 cup extra-virgin olive oil plus additional for brushing",
            "1/4 cup fresh lemon juice",
            "1 teaspoon coarse kosher salt",
            "1 teaspoon freshly ground black pepper",
            "1 3 1/2- to 4-pound chicken, backbone removed, opened flat",
            "1 11 3/4 x 8 1/2 x 1 1/4-inch disposable aluminum baking pan (to catch drips)",
            "Ingredient info: Bottled piri-piri sauce is available at specialty foods stores and online from africantradingco.com. Choose the heat level that suits you, keeping in mind that the mild version still has a nice kick to it"
        ],
        "instructions": [
            "Melt butter in small saucepan over medium-high heat. Add cilantro and garlic; cook until garlic begins to brown, about 2 minutes. Add piri-piri sauce and lemon juice. Reduce heat to medium-low; simmer 2 minutes. DO AHEAD: Glaze can be made up to 1 day ahead. Cover and chill. Rewarm before using.",
            "For chicken: Finely chop cilantro, ginger, shallot, and garlic in processor. Add piri-piri sauce, 1/4 cup oil, lemon juice, coarse salt, and pepper; process marinade to blend. Place chicken, skin side up, on work surface. Using palm of hand, press on breastbone to flatten chicken. Tuck wing tips under. Pour half of marinade into 11x7x2-inch glass baking dish. Open chicken like book; place skin side down in single layer in dish. Pour remaining marinade over. Cover; chill at least 4 hours or overnight, turning chicken occasionally. Remove top rack from barbecue. Prepare barbecue (medium heat). If using 2-burner gas grill, light 1 burner. If using 3-burner gas grill, do not light center burner. If using charcoal grill, light briquettes in chimney and pour onto 1 side of lower grill rack. Place disposable aluminum pan on unlit part of grill. Place upper grill rack on barbecue; brush with oil. Remove chicken from marinade. Arrange skin side up on grill rack above drip pan. Cover barbecue; grill until skin is browned and instant-read thermometer inserted into thickest part of thigh registers 165°F, turning often, about 40 minutes. Transfer to platter. Pour warm glaze over.",
            "Finely chop cilantro, ginger, shallot, and garlic in processor. Add piri-piri sauce, 1/4 cup oil, lemon juice, coarse salt, and pepper; process marinade to blend.",
            "Place chicken, skin side up, on work surface. Using palm of hand, press on breastbone to flatten chicken. Tuck wing tips under. Pour half of marinade into 11x7x2-inch glass baking dish. Open chicken like book; place skin side down in single layer in dish. Pour remaining marinade over. Cover; chill at least 4 hours or overnight, turning chicken occasionally.",
            "Remove top rack from barbecue. Prepare barbecue (medium heat). If using 2-burner gas grill, light 1 burner. If using 3-burner gas grill, do not light center burner. If using charcoal grill, light briquettes in chimney and pour onto 1 side of lower grill rack. Place disposable aluminum pan on unlit part of grill. Place upper grill rack on barbecue; brush with oil.",
            "Remove chicken from marinade. Arrange skin side up on grill rack above drip pan. Cover barbecue; grill until skin is browned and instant-read thermometer inserted into thickest part of thigh registers 165°F, turning often, about 40 minutes. Transfer to platter. Pour warm glaze over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aea2995d45cb704e7b87dab/6:4/w_274%2Ch_169/piri-piri-chicken-recipe-050218.jpg",
        "color": 138554
    }
}