{
    "recipe": {
        "title": "Pissaladiere Strips ",
        "ingredients": [
            "1 medium onion, finely chopped",
            "2 flat anchovy fillets, rinsed and chopped",
            "1/2 cup chopped red bell pepper",
            "1/2 cup chopped yellow bell pepper",
            "1/2 teaspoon finely chopped fresh rosemary",
            "3 tablespoons extra-virgin olive oil",
            "1/2 cup Niçoise or other brine-cured black olives, pitted and coarsely chopped",
            "1 1/3 cups all-purpose flour",
            "2 teaspoons baking powder",
            "1/2 teaspoon salt",
            "3 1/2 tablespoons cold unsalted butter, cut into small pieces",
            "1/2 cup whole milk"
        ],
        "instructions": [
            "Cook onion, anchovy, bell peppers, rosemary, a rounded 1/4 teaspoon salt, and 1/8 teaspoon pepper in oil in a heavy medium skillet over medium heat, stirring occasionally, until onion is golden, about 10 minutes. Transfer to a bowl and stir in olives, then cool filling.",
            "Make dough while filling cools: Preheat oven to 400°F with rack in middle. Whisk together flour, baking powder, and salt in a bowl. Blend in butter with a pastry blender or your fingertips until most of mixture resembles coarse meal with some small (roughly pea-size) butter lumps. Add milk and stir with a fork until a shaggy dough forms. Gently knead dough 8 to 10 times with floured hands on a lightly floured surface.",
            "Preheat oven to 400°F with rack in middle.",
            "Whisk together flour, baking powder, and salt in a bowl. Blend in butter with a pastry blender or your fingertips until most of mixture resembles coarse meal with some small (roughly pea-size) butter lumps. Add milk and stir with a fork until a shaggy dough forms. Gently knead dough 8 to 10 times with floured hands on a lightly floured surface.",
            "Assemble tarts: Roll out dough into a 12-inch square (1/4 inch thick) on a lightly floured surface with a floured rolling pin. Cut into 3 equal strips. Arrange strips 1 inch apart on an ungreased baking sheet and spread with filling, leaving a 1/2-inch border around edges. Bake until crust is golden, 20 to 25 minutes. Transfer to a rack using a large metal spatula and cool to warm or room temperature. Cut crosswise into 1-inch pieces.",
            "Roll out dough into a 12-inch square (1/4 inch thick) on a lightly floured surface with a floured rolling pin. Cut into 3 equal strips. Arrange strips 1 inch apart on an ungreased baking sheet and spread with filling, leaving a 1/2-inch border around edges.",
            "Bake until crust is golden, 20 to 25 minutes. Transfer to a rack using a large metal spatula and cool to warm or room temperature. Cut crosswise into 1-inch pieces."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d99dc7b55306961bf7725/6:4/w_274%2Ch_169/238925.jpg"
    }
}