{
    "recipe": {
        "title": "Pistachio Ice Cream ",
        "ingredients": [
            "1 cup unsalted shelled pistachios",
            "3/4 cup sugar",
            "2 cups milk (do not use low-fat or nonfat)",
            "1/2 teaspoon almond extract",
            "4 large egg yolks",
            "1 cup whipping cream",
            "3/4 cup unsalted shelled pistachios, toasted, coarsely chopped"
        ],
        "instructions": [
            "Finely grind 1 cup pistachios and 1/4 cup sugar in processor. Bring milk and ground pistachio mixture to boil in heavy large saucepan. Remove from heat. Mix in almond extract. Whisk egg yolks and remaining 1/2 cup sugar in medium bowl. Gradually whisk in hot milk mixture. Return custard to saucepan. Cook over low heat until custard thickens and leaves path on back of spoon when finger is drawn across, stirring constantly, about 10 minutes (do not boil). Strain into large bowl. Chill until cold, about 2 hours. Stir 1 cup whipping cream and chopped pistachios into custard. Process mixture in ice cream maker according to manufacturer's instructions. Transfer to container and freeze. (Ice cream can be prepared 3 days ahead.)",
            "Finely grind 1 cup pistachios and 1/4 cup sugar in processor. Bring milk and ground pistachio mixture to boil in heavy large saucepan. Remove from heat. Mix in almond extract.",
            "Whisk egg yolks and remaining 1/2 cup sugar in medium bowl. Gradually whisk in hot milk mixture. Return custard to saucepan. Cook over low heat until custard thickens and leaves path on back of spoon when finger is drawn across, stirring constantly, about 10 minutes (do not boil). Strain into large bowl. Chill until cold, about 2 hours.",
            "Stir 1 cup whipping cream and chopped pistachios into custard. Process mixture in ice cream maker according to manufacturer's instructions. Transfer to container and freeze. (Ice cream can be prepared 3 days ahead.)"
        ],
        "picture_link": "https://assets.epicurious.com/photos/5747b49a5a5fbbae31ae4aed/6:4/w_274%2Ch_169/shutterstock_303021722.jpg"
    }
}