{
    "recipe": {
        "title": "Pistachio-Crusted Pork with Plum Sauce and Fried Leeks ",
        "ingredients": [
            "1/2 cup chicken stock or canned low-salt chicken broth",
            "1/3 cup oyster sauce*",
            "1/3 cup plum sauce*",
            "1/4 cup mirin (sweet Japanese rice wine)*",
            "1/4 cup orange juice",
            "2 tablespoons chili-garlic sauce*",
            "3 kaffir lime leaves**",
            "1 tablespoon apple cider vinegar",
            "1 tablespoon sugar",
            "1 tablespoon oriental sesame oil",
            "1 1/2 pounds pork tenderloin, cut into 12 rounds (each about 1 1/2 inches thick)",
            "1/2 cup (about 4 ounces) roasted natural pistachios, finely chopped",
            "2 tablespoons (1/4 stick) chilled unsalted butter, cut into 4 pieces",
            "Crispy Fried Leeks (optional)"
        ],
        "instructions": [
            "Combine chicken stock, oyster sauce, plum sauce, mirin, orange juice, chili-garlic sauce and kaffir lime leaves in heavy small saucepan over medium-high heat. Simmer until sauce is reduced to 1 cup, whisking occasionally, about 25 minutes. Whisk in apple cider vinegar and sugar. Remove from heat. (Sauce can be prepared 3 days ahead. Cover and refrigerate.) Remove lime leaves.",
            "Preheat oven to 350°F. Heat sesame oil in heavy large skillet over high heat. Sprinkle pork with salt and pepper. Sauté pork until golden brown, about 1 minute per side. Transfer pork to work surface; brush each piece with sauce and dip in pistachios, turning to coat. Transfer pork to rimmed baking sheet. Bake until thermometer inserted into center registers 150°F, about 10 minutes.",
            "Bring sauce to boil. Add butter one piece at a time, whisking just until melted before adding next piece. Transfer 2 pork medallions to each of 6 plates. Drizzle sauce around pork. Top with fried leeks, if desired. Serve immediately.",
            "*Available at Asian markets and in the Asian foods section of many supermarkets. **Leaves of the kaffir lime tree; available frozen or sometimes fresh at Asian markets. If unavailable, substitute 2 tablespoons fresh lime juice and 1 teaspoon grated lime peel.",
            "*Available at Asian markets and in the Asian foods section of many supermarkets.",
            "**Leaves of the kaffir lime tree; available frozen or sometimes fresh at Asian markets. If unavailable, substitute 2 tablespoons fresh lime juice and 1 teaspoon grated lime peel."
        ],
        "picture_link": null,
        "color": 11111921
    }
}