{
    "recipe": {
        "title": "Pistachio-Crusted Arctic Char ",
        "ingredients": [
            "1 cup shelled pistachios (not dyed red; 4 ounces)",
            "1/2 cup packed fresh basil leaves",
            "2 tablespoons minced shallot",
            "1/4 teaspoon salt",
            "1/4 teaspoon black pepper",
            "6 1/2 tablespoons unsalted butter, softened",
            "6 pieces arctic char fillet (1 to 1 1/4 inches thick) with skin (6 ounces each)",
            "1/2 tablespoon vegetable oil"
        ],
        "instructions": [
            "Coarsely chop pistachios in a food processor, then add basil, shallot, salt, pepper, and 6 tablespoons butter and purée until mixture forms a paste. Preheat oven to 400°F. Remove any bones from fish with tweezers and pat fish dry. Heat oil and remaining 1/2 tablespoon butter in a 12-inch nonstick skillet over moderately high heat until foam subsides, then brown skin sides of fillets in 2 batches, 3 to 4 minutes per batch. Transfer fillets as browned, skin sides down, to a lightly oiled shallow baking pan (1 inch deep). Divide pistachio paste among fillet pieces and spread evenly in a 1/8-inch-thick layer over top of each. Bake fillets in middle of oven until just cooked through, 9 to 11 minutes.",
            "Coarsely chop pistachios in a food processor, then add basil, shallot, salt, pepper, and 6 tablespoons butter and purée until mixture forms a paste.",
            "Preheat oven to 400°F.",
            "Remove any bones from fish with tweezers and pat fish dry.",
            "Heat oil and remaining 1/2 tablespoon butter in a 12-inch nonstick skillet over moderately high heat until foam subsides, then brown skin sides of fillets in 2 batches, 3 to 4 minutes per batch. Transfer fillets as browned, skin sides down, to a lightly oiled shallow baking pan (1 inch deep).",
            "Divide pistachio paste among fillet pieces and spread evenly in a 1/8-inch-thick layer over top of each.",
            "Bake fillets in middle of oven until just cooked through, 9 to 11 minutes."
        ],
        "picture_link": null
    }
}