{
    "recipe": {
        "title": "Pistachio-Crusted Rack of Lamb ",
        "ingredients": [
            "1 cup pomegranate juice",
            "1/4 cup dried currants",
            "1 garlic clove, peeled",
            "3 tablespoons chilled butter, cut into 1/2-inch cubes",
            "1/2 teaspoon ground cinnamon",
            "1/4 teaspoon ground cumin",
            "1 large rack of lamb (2 1/4 pounds), well trimmed",
            "1/4 cup chopped natural unsalted pistachios",
            "1/4 cup panko (Japanese breadcrumbs)*"
        ],
        "instructions": [
            "Preheat oven to 400°F. Boil pomegranate juice, currants, and garlic in medium skillet until liquid is syrupy and mixture is reduced to 1/4 cup, stirring often, about 10 minutes. Transfer mixture to mini processor. Add butter, cinnamon, and cumin and blend until coarse puree forms. Place processor bowl in freezer 10 minutes to firm butter slightly. Line small rimmed baking sheet with foil. Place lamb, bone side down, on sheet. Sprinkle with salt and pepper. Spread pomegranate butter over; sprinkle pistachios and panko over, pressing to adhere. Roast rack of lamb until instant-read thermometer inserted into side registers 135°F for medium-rare, about 30 minutes. Transfer to work surface and let rest 10 minutes. Cut lamb between bones. Drizzle with any juices from foil. Available in the Asian foods section of some supermarkets and at Asian markets.",
            "Preheat oven to 400°F. Boil pomegranate juice, currants, and garlic in medium skillet until liquid is syrupy and mixture is reduced to 1/4 cup, stirring often, about 10 minutes. Transfer mixture to mini processor. Add butter, cinnamon, and cumin and blend until coarse puree forms. Place processor bowl in freezer 10 minutes to firm butter slightly.",
            "Line small rimmed baking sheet with foil. Place lamb, bone side down, on sheet. Sprinkle with salt and pepper. Spread pomegranate butter over; sprinkle pistachios and panko over, pressing to adhere.",
            "Roast rack of lamb until instant-read thermometer inserted into side registers 135°F for medium-rare, about 30 minutes. Transfer to work surface and let rest 10 minutes. Cut lamb between bones. Drizzle with any juices from foil.",
            "Available in the Asian foods section of some supermarkets and at Asian markets.",
            "Available in the Asian foods section of some supermarkets and at Asian markets."
        ],
        "picture_link": null
    }
}