{
    "recipe": {
        "title": "Pistou of Summer Vegetables ",
        "ingredients": [
            "10 medium asparagus spears (about 6 ounces), trimmed and cut into 1/2-inch pieces",
            "1 1/2 pounds fresh fava beans*",
            "1 cup (3 ounces) sugar snap peas",
            "4 cups fresh basil leaves, loosely packed",
            "3/4 cup extra-virgin olive oil",
            "1 small shallot, finely chopped",
            "1 1/2 cups vegetable stock or canned vegetable broth",
            "1/2 teaspoon fine sea salt",
            "1/2 teaspoon freshly ground black pepper",
            "3 tablespoons mixed herbs such as chervil, chives, oregano, and parsley, coarsely chopped",
            "*If fresh fava beans are unavailable, fresh soy or lima beans can be substituted."
        ],
        "instructions": [
            "Blanch asparagus: Have ready large bowl ice water. In medium saucepan over high heat, bring salted water to boil. Add asparagus and boil, uncovered, until crisp-tender, 2 to 3 minutes. Drain, then immediately plunge spears into ice water to stop cooking. Drain again and pat dry.",
            "Have ready large bowl ice water. In medium saucepan over high heat, bring salted water to boil. Add asparagus and boil, uncovered, until crisp-tender, 2 to 3 minutes. Drain, then immediately plunge spears into ice water to stop cooking. Drain again and pat dry.",
            "Blanch fava beans: Have ready large bowl ice water. In medium saucepan over high heat, bring salted water to boil. Add fava beans and boil, uncovered, 1 minute. Drain in colander, then immediately plunge colander into ice water to stop cooking. Drain again. Slip outer skin off each bean and discard.",
            "Have ready large bowl ice water. In medium saucepan over high heat, bring salted water to boil. Add fava beans and boil, uncovered, 1 minute. Drain in colander, then immediately plunge colander into ice water to stop cooking. Drain again. Slip outer skin off each bean and discard.",
            "Blanch sugar snap peas: Have ready large bowl ice water. In medium saucepan over high heat, bring salted water to boil. Add peas and boil, uncovered, until tender, 2 to 3 minutes. Drain in colander, then immediately plunge colander into ice water to stop cooking. Drain again and spread on paper towels to dry.",
            "Have ready large bowl ice water. In medium saucepan over high heat, bring salted water to boil. Add peas and boil, uncovered, until tender, 2 to 3 minutes. Drain in colander, then immediately plunge colander into ice water to stop cooking. Drain again and spread on paper towels to dry.",
            "Blanch basil: Have ready large bowl ice water. In medium saucepan over high heat, bring salted water to boil. Add basil and boil, uncovered, 45 seconds. Drain in colander, then immediately plunge colander into ice water to stop cooking. Drain again and spread on paper towels to dry. (Asparagus, fava beans, sugar snap peas, and basil can be blanched up to 4 hours ahead, then dried well, and chilled, covered until needed.)",
            "Have ready large bowl ice water. In medium saucepan over high heat, bring salted water to boil. Add basil and boil, uncovered, 45 seconds. Drain in colander, then immediately plunge colander into ice water to stop cooking. Drain again and spread on paper towels to dry.",
            "(Asparagus, fava beans, sugar snap peas, and basil can be blanched up to 4 hours ahead, then dried well, and chilled, covered until needed.)",
            "Make pistou: In large bowl, toss together asparagus, fava beans, and peas. Transfer half vegetable mixture to blender and add basil. Blend until chopped, then add 5 tablespoons olive oil in slow, steady stream, and blend until smooth. In heavy, large saucepan, over moderately high heat, heat remaining 1 tablespoon oil until hot but not smoking. Add shallot and sauté until translucent, 3 to 5 minutes. Stir in vegetable stock, vegetable purée, remaining blanched vegetables, salt, and pepper and bring to simmer. Cook, uncovered, stirring occasionally until vegetables are heated through, 3 to 5 minutes. Ladle into bowls, sprinkle each with herb mixture, and serve immediately.",
            "In large bowl, toss together asparagus, fava beans, and peas. Transfer half vegetable mixture to blender and add basil. Blend until chopped, then add 5 tablespoons olive oil in slow, steady stream, and blend until smooth.",
            "In heavy, large saucepan, over moderately high heat, heat remaining 1 tablespoon oil until hot but not smoking. Add shallot and sauté until translucent, 3 to 5 minutes. Stir in vegetable stock, vegetable purée, remaining blanched vegetables, salt, and pepper and bring to simmer. Cook, uncovered, stirring occasionally until vegetables are heated through, 3 to 5 minutes. Ladle into bowls, sprinkle each with herb mixture, and serve immediately."
        ],
        "picture_link": null
    }
}