{
    "recipe": {
        "title": "Pistachio-Rose Shortbread Squares ",
        "ingredients": [
            "2 1/4 cups all-purpose flour",
            "1/4 tsp. baking powder",
            "1 tsp. kosher salt",
            "1 1/2 cups powdered sugar",
            "1 cup (2 sticks) unsalted butter, softened",
            "1 large egg",
            "2 Tbsp. rose rooibos tea or other rooibos tea, crushed",
            "1 tsp. finely grated lemon zest",
            "1/2 tsp. vanilla extract",
            "1/2 cup raw pistachios, chopped",
            "1/4 cup freeze-dried raspberries",
            "1/4 cup pink or red sanding sugar"
        ],
        "instructions": [
            "Whisk flour, baking powder, and salt in a medium bowl.",
            "Using an electric mixer on medium-high speed, beat powdered sugar and butter in a large bowl until aerated and pale, about 3 minutes. (Alternatively, use a stand mixer fitted with the paddle attachment.) Scrape down sides of bowl, then beat 2 minutes more. Reduce mixer speed to medium, add egg, and beat until well incorporated. Add tea, lemon zest, and vanilla and beat, scraping down sides of bowl, until combined, about 30 seconds more.",
            "Reduce mixer speed to low and beat in dry ingredients, followed by pistachios. Stir dough a few times with a spatula, making sure to get to bottom of bowl.",
            "Turn out dough onto a clean work surface and divide into quarters. Working one quarter at a time, place dough on a sheet of parchment paper and pat with your hands into a log, then pull the parchment up around the log and, using the parchment to help contain the dough, press it firmly against your work surface, rotating and squaring off edges until you have a long 1\"-thick rectangle. Wrap parchment-wrapped dough tightly in plastic wrap and chill at least 3 hours.",
            "Place racks in upper and lower thirds of oven; preheat to 325°F. Line 2 rimmed baking sheets with parchment paper. Unwrap dough and let sit at room temperature 10–15 minutes.",
            "Pulverize raspberries into a fine powder in a food processor or spice mill. Transfer to a plate and mix in sanding sugar.",
            "Roll dough in raspberry sugar, pressing with your hands to adhere. Using a thin, sharp knife, cut into 1/3\"-thick slices, rotating rectangle a quarter turn after each slice to help maintain its shape. Arrange slices on prepared baking sheets, spacing 1/2\" apart. Bake cookies, rotating pans top to bottom and front to back halfway through, until opaque and barely golden, 14–16 minutes. Transfer pans to wire racks and let cool.",
            "Do Ahead: Dough can be made 4 days ahead. Keep chilled. Cookies can be made 1 week ahead. Store in an airtight container at room",
            "Dough can be made 4 days ahead. Keep chilled. Cookies can be made 1 week ahead. Store in an airtight container at room"
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c0014dfee64922f1980ece6/6:4/w_274%2Ch_169/Speckled-Cherry-Rose-Squares-27112018.jpg"
    }
}