{
    "recipe": {
        "title": "\"Pizza\" Sandwiches ",
        "ingredients": [
            "4 tablespoons extra-virgin olive oil plus additional for drizzling",
            "4 large garlic cloves, pressed",
            "2 6-ounce cans tomato paste",
            "2 teaspoons sugar",
            "1 teaspoon dried oregano",
            "1 teaspoon coarse kosher salt",
            "4 ciabatta rolls or other Italian bread rolls, split horizontally",
            "2 8-ounce balls mozzarella cheese, thinly sliced, drained on several layers of paper towels",
            "2 cups arugula or mixed greens (optional)"
        ],
        "instructions": [
            "Place 4 tablespoons oil and garlic in small saucepan. Stir over medium heat until garlic is golden, about 1 minute. Remove pan from heat; stir in tomato paste. Stir in sugar, oregano, and 1 teaspoon coarse salt. Return pan to heat; cook until tomato spread is bubbling, 2 to 3 minutes. Remove from heat. Cool. DO AHEAD: Can be made 1 day ahead. Cover and chill. Spread 1 teaspoon tomato spread on top and bottom halves of rolls. Divide cheese slices among bottom halves of rolls. Drizzle with oil; sprinkle with salt and pepper. Top with arugula, if using. Cover with roll tops. Cut sandwiches in half; wrap. DO AHEAD: Can be made 1 day ahead. Chill.",
            "Place 4 tablespoons oil and garlic in small saucepan. Stir over medium heat until garlic is golden, about 1 minute.",
            "Remove pan from heat; stir in tomato paste. Stir in sugar, oregano, and 1 teaspoon coarse salt. Return pan to heat; cook until tomato spread is bubbling, 2 to 3 minutes. Remove from heat. Cool. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
            "Spread 1 teaspoon tomato spread on top and bottom halves of rolls. Divide cheese slices among bottom halves of rolls. Drizzle with oil; sprinkle with salt and pepper. Top with arugula, if using. Cover with roll tops. Cut sandwiches in half; wrap. DO AHEAD: Can be made 1 day ahead. Chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3e85e21388ef838b0e58a/6:4/w_274%2Ch_169/354873_pizza-sandwiches_1x1.jpg"
    }
}