{
    "recipe": {
        "title": "Pizza Rustica ",
        "ingredients": [
            "1 1/4 cups all-purpose flour",
            "6 tablespoons cold unsalted butter, cut into 1/2 inch pieces",
            "1/4 teaspoon salt",
            "1/8 teaspoon freshly ground black pepper",
            "3 to 5 tablespoons ice water",
            "1 cup ricotta (preferably fresh or homemade ; 8 ounces)",
            "2 large eggs, lightly beaten",
            "3 tablespoons grated Pecorino Romano",
            "2/3 cup coarsely grated aged provolone",
            "3 ounces thinly sliced Italian deli meats such as soppressata, prosciutto, capicolla ham, and salami, finely chopped",
            "3 tablespoons chopped flat-leaf parsley",
            "Freshly ground black pepper",
            "1 (9-inch) tart pan with a removable bottom",
            "pie weights or dried beans"
        ],
        "instructions": [
            "Blend together flour, butter, salt, and pepper in a bowl with your fingertips or a pastry blender (or pulse in a food processor) just until mixture resembles coarse meal with some roughly pea-size butter lumps. Drizzle 3 tablespoons ice water evenly over mixture and gently stir with a fork (or pulse) until incorporated.",
            "Squeeze a small handful of dough: If it doesn't hold together, add more ice water, 1 tablespoon at a time, stirring (or pulsing) until incorporated. Do not overwork dough, or pastry will be tough.",
            "Turn out dough onto a work surface and divide into 4 portions. With heel of your hand, smear each portion once or twice in a forward motion to help distribute fat. Gather all dough together, with a pastry scraper if you have one, and press into a 5-inch disk. Wrap dough in plastic wrap and chill until firm, at least 1 hour.",
            "Make tart: Preheat oven to 375°F with rack in middle. Roll out dough on a lightly floured surface with a lightly floured rolling pin into a 13-inch round (about 1/8 inch thick). Fit dough into tart pan and trim excess, leaving a 1/2-inch overhang. Fold overhang inward and press against side of pan to reinforce edge. Prick dough in pan all over with a fork. Chill pan until dough is firm, about 15 to 30 minutes. Line shell with foil and fill with pie weights. Bake until edges are pale golden, 18 to 25 minutes. Carefully remove foil and weights and bake until shell is golden all over, about 10 to 15 minutes more. Cool completely in pan, about 20 minutes.",
            "Preheat oven to 375°F with rack in middle.",
            "Roll out dough on a lightly floured surface with a lightly floured rolling pin into a 13-inch round (about 1/8 inch thick). Fit dough into tart pan and trim excess, leaving a 1/2-inch overhang. Fold overhang inward and press against side of pan to reinforce edge. Prick dough in pan all over with a fork. Chill pan until dough is firm, about 15 to 30 minutes.",
            "Line shell with foil and fill with pie weights. Bake until edges are pale golden, 18 to 25 minutes. Carefully remove foil and weights and bake until shell is golden all over, about 10 to 15 minutes more. Cool completely in pan, about 20 minutes.",
            "Make filling and bake tart: Reduce oven temperature to 350°F. Stir together ricotta, eggs, Pecorino, provolone, meats, parsley, and 1/4 teaspoon pepper. Spread filling evenly in baked shell. Bake tart until filling is set and pale golden, 30 to 40 minutes. Cool tart in pan on a rack, about 15 minutes, then carefully remove sides of pans and slide the tart off bottom. Serve warm or at room temperature.",
            "Reduce oven temperature to 350°F. Stir together ricotta, eggs, Pecorino, provolone, meats, parsley, and 1/4 teaspoon pepper. Spread filling evenly in baked shell.",
            "Bake tart until filling is set and pale golden, 30 to 40 minutes. Cool tart in pan on a rack, about 15 minutes, then carefully remove sides of pans and slide the tart off bottom. Serve warm or at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b877ed4bf78b800d89a684/6:4/w_274%2Ch_169/51233410_pizza-rustica-2_1x1.jpg"
    }
}