{
    "recipe": {
        "title": "Pizza with Eggs, Roasted Red Peppers, Olives and Arugula ",
        "ingredients": [
            "2 tablespoons warm water (115°F)",
            "1/2 teaspoon active dry yeast",
            "1 1/3 cups all purpose flour",
            "1/3 cup whole wheat flour",
            "1/2 cup cool water (65°F to 70°F)",
            "1 teaspoon coarse kosher salt",
            "Olive oil",
            "Cornmeal (for sprinkling)",
            "Olive oil",
            "3/4 cup drained roasted red peppers from jar, cut into 1/3-inch strips",
            "1/3 cup Kalamata olives, pitted, quartered",
            "1 cup Parmesan cheese shavings",
            "1 1/2 teaspoons chopped fresh rosemary",
            "4 large red onion rings (each 3 1/2 to 4 inches in diameter and 1/2 inch thick)",
            "4 large eggs",
            "2 cups (lightly packed) arugula"
        ],
        "instructions": [
            "Pour 2 tablespoons warm water into large bowl of stand mixer fitted with dough hook; sprinkle yeast over. Let stand until yeast dissolves, about 15 minutes (mixture will not be foamy). Add both flours, 1/2 cup cool water, and 1 teaspoon coarse salt; mix on medium-low speed 4 minutes. Let rest 5 minutes, then mix on medium speed until dough is smooth, elastic, and slightly sticky, about 3 minutes.",
            "Lightly oil medium bowl. Gather dough into ball and transfer to prepared bowl; turn to coat with oil. Cover bowl with plastic wrap and let rest at room temperature 30 minutes. Chill dough overnight. DO AHEAD: Can be made 2 days ahead. Keep chilled.",
            "Transfer bowl to warm draft-free area and let dough rise, covered, until very slightly puffy, at least 2 hours.",
            "For topping: Place pizza stone or rimless baking sheet in oven; preheat to 500°F. Sprinkle pizza paddle or another baking sheet generously with cornmeal. Roll out dough on lightly floured surface to 12-inch round; transfer to paddle. Brush dough with oil; scatter peppers, then olives over. Sprinkle with Parmesan and rosemary. Arrange onion rings atop pizza, spacing apart. Slide pizza onto stone or baking sheet in oven; bake until lightly browned but not crisp, about 7 minutes. Remove pizza from oven and gently crack 1 egg into each onion ring. Return pizza to oven and continue to bake until eggs are softly set and crust is golden, about 6 minutes. Sprinkle pizza with salt and pepper. Scatter arugula over.",
            "Place pizza stone or rimless baking sheet in oven; preheat to 500°F. Sprinkle pizza paddle or another baking sheet generously with cornmeal. Roll out dough on lightly floured surface to 12-inch round; transfer to paddle. Brush dough with oil; scatter peppers, then olives over. Sprinkle with Parmesan and rosemary. Arrange onion rings atop pizza, spacing apart. Slide pizza onto stone or baking sheet in oven; bake until lightly browned but not crisp, about 7 minutes. Remove pizza from oven and gently crack 1 egg into each onion ring. Return pizza to oven and continue to bake until eggs are softly set and crust is golden, about 6 minutes. Sprinkle pizza with salt and pepper. Scatter arugula over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d79a8f3a00aeb2f1cb857/6:4/w_274%2Ch_169/351051_hires.jpg",
        "color": 3641723
    }
}