{
    "recipe": {
        "title": "Platter of Roasted Shellfish with Trio of Sauces ",
        "ingredients": [
            "8 tablespoons extra-virgin olive oil, divided",
            "1/4 cup minced shallots",
            "2 tablespoons minced fresh Italian parsley",
            "1/2 teaspoon finely grated lemon peel",
            "3 large frozen uncooked lobster tails, thawed, cut lengthwise in half",
            "6 uncooked jumbo shrimp (about 12 ounces), peeled, deveined, butterflied",
            "6 very large sea scallops",
            "2 pounds cooked large Alaska King crab legs, cut lengthwise in half",
            "3 tablespoons water",
            "Lemon wedges",
            "Fresh Italian parsley sprigs",
            "Lemongrass and Cilantro Sauce",
            "Saffron Mayonnaise",
            "Roasted Grape Tomato, Orange, and Basil Relish"
        ],
        "instructions": [
            "Preheat oven to 450°F. Brush 2 large roasting pans with 1 tablespoon olive oil each. Mix shallots, minced parsley, and lemon peel in small bowl. Arrange lobster tails, cut side up, in 1 roasting pan; brush with 2 tablespoons olive oil. Sprinkle with salt and pepper, then 2 tablespoons shallot mixture. Roast until just opaque in center, about 15 minutes.",
            "Meanwhile, combine shrimp, scallops, 2 tablespoons olive oil, and 2 tablespoons shallot mixture in medium bowl; sprinkle with salt and pepper and toss gently to coat. Arrange in single layer in second prepared roasting pan. Roast alongside lobster until shrimp and scallops are just opaque in center, about 5 minutes for shrimp and 7 minutes for scallops. Transfer lobster to large platter; cover with foil. Arrange crab legs in lobster roasting pan; drizzle with remaining 2 tablespoons olive oil, sprinkle with remaining shallot mixture, then drizzle with 3 tablespoons water. Roast just until heated through, about 5 minutes.",
            "Arrange shrimp, scallops, and crab legs on platter with lobster. Pour any pan drippings over shellfish. Garnish with lemon wedges and parsley sprigs. Serve with Lemongrass and Cilantro Sauce; Saffron Mayonnaise; and Roasted Grape Tomato, Orange, and Basil Relish."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd768f9a84192308a4db3/6:4/w_274%2Ch_169/235153.jpg"
    }
}