{
    "recipe": {
        "title": "Pluot Pinwheel Tart ",
        "ingredients": [
            "1 1/4 cups all purpose flour",
            "1/4 cup whole wheat flour",
            "2 1/2 teaspoons sugar",
            "1/4 teaspoon salt",
            "1/2 cup (1 stick) unsalted butter, chilled, cut into 1/2-inch pieces",
            "1/4 cup (or more) ice water",
            "1 large egg white, room temperature",
            "1/4 cup plus 2 tablespoons sugar",
            "1/4 cup almond flour or almond meal*",
            "13/4 pounds Pluots (about 5 large or 12 small)",
            "1 tablespoon butter, melted"
        ],
        "instructions": [
            "Whisk flours, sugar, and salt in large bowl. Add butter. Using fingertips, rub in butter until coarse meal forms. Add 1/4 cup ice water, stirring until clumps form, adding more water by teaspoonfuls if dough is dry. Gather into ball; flatten into disk. Wrap in plastic; chill 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled. Let rest 15 minutes at room temperature before rolling out.",
            "Preheat oven to 425°F. Place sheet of parchment on work surface; sprinkle with flour. Roll out crust on parchment to 13-inch round. Using pot lid as guide, trim dough to 12-inch round. Slide crust on parchment onto rimless baking sheet. Chill dough.",
            "For meringue: Using electric mixer, beat egg white in medium bowl until foamy. With machine running, gradually add 1/4 cup sugar, beating until firm peaks form. Fold in almond meal. Set 1 Pluot, stem side up, on work surface. Working parallel to pit, cut 1/8-inch-thick rounds off both sides of Pluot. Repeat with remaining Pluots. Spread meringue over crust. Arrange Pluot slices, slightly overlapping, in spiral pattern atop meringue, beginning at outer edge and working toward center, turning any end pieces cut side up. Finish with 1 Pluot slice in center. Brush melted butter over Pluots; sprinkle tart with 2 tablespoons sugar. Bake tart 15 minutes. Reduce heat to 400°F and bake tart until edges are brown, about 20 minutes. Cool tart slightly on pan. Loosen with spatula. Serve warm or at room temperature.",
            "Using electric mixer, beat egg white in medium bowl until foamy. With machine running, gradually add 1/4 cup sugar, beating until firm peaks form. Fold in almond meal. Set 1 Pluot, stem side up, on work surface. Working parallel to pit, cut 1/8-inch-thick rounds off both sides of Pluot. Repeat with remaining Pluots.",
            "Spread meringue over crust. Arrange Pluot slices, slightly overlapping, in spiral pattern atop meringue, beginning at outer edge and working toward center, turning any end pieces cut side up. Finish with 1 Pluot slice in center. Brush melted butter over Pluots; sprinkle tart with 2 tablespoons sugar. Bake tart 15 minutes. Reduce heat to 400°F and bake tart until edges are brown, about 20 minutes. Cool tart slightly on pan. Loosen with spatula. Serve warm or at room temperature."
        ],
        "picture_link": null
    }
}