{
    "recipe": {
        "title": "Poached Shrimp with Lemon-Horseradish Dipping Sauce ",
        "ingredients": [
            "1 cup dry white wine",
            "6 whole black peppercorns",
            "1/2 lemon",
            "1 Turkish bay leaf",
            "Pinch of coarse kosher salt",
            "8 uncooked unpeeled large shrimp",
            "1/4 cup crème fraîche or sour cream",
            "1 tablespoon chopped fresh chives",
            "1 teaspoon prepared white horseradish",
            "1/2 teaspoon finely grated lemon peel",
            "Coarse kosher salt",
            "Whole fresh chives (for garnish)"
        ],
        "instructions": [
            "For shrimp: Fill medium bowl with ice water; set aside. Combine 2 cups water, wine, and next 4 ingredients in medium saucepan. Bring to boil. Add shrimp; reduce heat to low, cover, and poach just until shells are pink and shrimp are opaque in center, 3 to 4 minutes. Using slotted spoon, transfer shrimp to bowl with ice water; reserve poaching liquid and lemon half. Drain and peel shrimp, leaving tails intact. Devein shrimp.",
            "Fill medium bowl with ice water; set aside. Combine 2 cups water, wine, and next 4 ingredients in medium saucepan. Bring to boil. Add shrimp; reduce heat to low, cover, and poach just until shells are pink and shrimp are opaque in center, 3 to 4 minutes. Using slotted spoon, transfer shrimp to bowl with ice water; reserve poaching liquid and lemon half. Drain and peel shrimp, leaving tails intact. Devein shrimp.",
            "For dipping sauce: Squeeze juice from reserved lemon half into poaching liquid in pan. Boil liquid until reduced to generous 2 tablespoons, about 20 minutes. Strain; cool. Mix crème fraîche, chopped chives, horseradish, lemon peel, and 1 tablespoon reduced poaching liquid in small bowl. Season sauce with coarse salt and black pepper. DO AHEAD: Shrimp and sauce can be made 1 day ahead. Cover separately; chill. Spoon dipping sauce into short glasses. Arrange shrimp on rims. Garnish with whole fresh chives.",
            "Squeeze juice from reserved lemon half into poaching liquid in pan. Boil liquid until reduced to generous 2 tablespoons, about 20 minutes. Strain; cool.",
            "Mix crème fraîche, chopped chives, horseradish, lemon peel, and 1 tablespoon reduced poaching liquid in small bowl. Season sauce with coarse salt and black pepper. DO AHEAD: Shrimp and sauce can be made 1 day ahead. Cover separately; chill.",
            "Spoon dipping sauce into short glasses. Arrange shrimp on rims. Garnish with whole fresh chives."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56b24b5726061a683fd29b1e/6:4/w_274%2Ch_169/0211-BA-FD2-01.jpg"
    }
}