{
    "recipe": {
        "title": "Poached Pears in Phyllo Overcoat with Madeira Zabaglione `21' Club ",
        "ingredients": [
            "4 small firm-ripe pears (preferably Bosc) with stems intact",
            "3 cups water",
            "1/2 cup dry white wine",
            "1/3 cup sugar",
            "1 cinnamon stick",
            "2 whole cloves",
            "1 small dried chili such as habanero or 1/4 teaspoon dried hot red pepper flakes",
            "12 sheets phyllo, thawed if frozen, stacked between 2 sheets wax paper and covered with a dampened kitchen towel",
            "1 stick (1/2 cup) unsalted butter, melted",
            "1/4 cup sugar",
            "3 large egg yolks",
            "1/4 cup Portuguese Madeira (preferably sweet, such as Malmsey)",
            "Garnish: 1/4 cup dried cranberries or dried sour cherries, soaked in hot water 20 minutes and drained"
        ],
        "instructions": [
            "In a saucepan just large enough to hold pears upright in one layer simmer water, wine, sugar, cinnamon stick, cloves, and chili 10 minutes to blend flavors. Peel pears, leaving stems intact, and cut a thin slice from bottom of each so pears will stand upright. Add pears to poaching liquid and simmer until tender when pierced with a sharp knife, 10 to 12 minutes. Transfer pears to a plate and cool completely. Core pears from bottom, leaving stem ends intact, and pat dry.",
            "Preheat oven to 400°F.",
            "On a work surface brush a phyllo sheet with some melted butter and top with 2 more layers phyllo and butter in same manner. Put a pear in center of phyllo and gather phyllo up around top of pear, allowing excess to fold back and leaving stem exposed. Trim excess phyllo to about 3 inches if necessary and brush outside of phyllo with more butter. Make more wrapped pears with remaining pears, phyllo, and butter in same manner. On a baking sheet bake pears 20 minutes, or until phyllo is golden, and cool slightly. Pears in phyllo may be made 4 hours ahead and kept at room temperature.",
            "Make zabaglione while pears are baking: In a metal bowl whisk together sugar, yolks, and Madeira until combined. Set bowl over a saucepan of simmering water and heat mixture, whisking, until frothy, pale golden, and each whisk stroke leaves a clean path. (An instant-read thermometer should register 140°F. for 3 minutes to ensure eggs are safely cooked.)",
            "In a metal bowl whisk together sugar, yolks, and Madeira until combined. Set bowl over a saucepan of simmering water and heat mixture, whisking, until frothy, pale golden, and each whisk stroke leaves a clean path. (An instant-read thermometer should register 140°F. for 3 minutes to ensure eggs are safely cooked.)",
            "Divide zabaglione and pears among 4 dessert plates and garnish with dried fruit.",
            "Divide zabaglione and pears among 4 dessert plates and garnish with dried fruit."
        ],
        "picture_link": null
    }
}