{
    "recipe": {
        "title": "Poached Salmon Fillets with Dill Crème Fraîche ",
        "ingredients": [
            "6 tablespoons chopped cornichons",
            "3 tablespoons chopped fresh dill",
            "1 tablespoon fresh lemon juice",
            "1 cup crème fraîche or sour cream",
            "3 8-ounce bottles clam juice",
            "3 cups dry white wine",
            "10 whole peppercorns",
            "8 fresh dill sprigs",
            "6 lemon slices",
            "8 6- to 8-ounce salmon fillets",
            "Butter lettuce, lemon slices and fresh dill sprigs"
        ],
        "instructions": [
            "For Sauce: Place cornichons, dill and juice in small bowl and stir to blend. Add crème fraîche and stir gently just until combined; do not overmix or sauce will thin out. Season with salt and pepper. (Can be made 2 days ahead. Cover; chill.)",
            "Place cornichons, dill and juice in small bowl and stir to blend. Add crème fraîche and stir gently just until combined; do not overmix or sauce will thin out. Season with salt and pepper. (Can be made 2 days ahead. Cover; chill.)",
            "For Salmon: Combine first 5 ingredients in large, deep skillet; bring to simmer over medium heat. Simmer 5 minutes. Reduce heat to medium-low. Add half of salmon, cover and simmer until just cooked through, about 7 minutes. Transfer to platter. Repeat with remaining salmon. Cover salmon; chill until cold. (Can be made 1 day ahead. Keep chilled.)",
            "Combine first 5 ingredients in large, deep skillet; bring to simmer over medium heat. Simmer 5 minutes. Reduce heat to medium-low. Add half of salmon, cover and simmer until just cooked through, about 7 minutes. Transfer to platter. Repeat with remaining salmon. Cover salmon; chill until cold. (Can be made 1 day ahead. Keep chilled.)",
            "Line platter with lettuce. Top with salmon. Garnish with lemon slices and dill sprigs. Serve with sauce.",
            "Line platter with lettuce. Top with salmon. Garnish with lemon slices and dill sprigs. Serve with sauce."
        ],
        "picture_link": null
    }
}