{
    "recipe": {
        "title": "Pok Pok-Style Hot Wings with Peanuts and Cilantro ",
        "ingredients": [
            "2 pounds chicken wings, tips removed, drumettes and flats separated, patted dry",
            "2 teaspoons vegetable oil",
            "1/2 teaspoon kosher salt",
            "1/4 cup sugar",
            "1/2 medium garlic clove, finely grated",
            "1/4 cup fish sauce",
            "1–2 jalapeño or serrano chiles, stemmed, seeded, finely chopped",
            "1/2 cup finely chopped roasted peanuts",
            "3 tablespoons chopped fresh cilantro"
        ],
        "instructions": [
            "Preheat oven to 500°F. Set a wire rack inside a large rimmed baking sheet. Toss wings, oil, and salt in a large bowl. Arrange wings in a single layer on rack and bake until golden brown, crispy, and cooked through, about 30 minutes.",
            "Make the glaze: Heat a small saucepan over medium. Sprinkle a thin layer of sugar into pan, let melt, then add another layer (no stirring necessary). Repeat until all sugar is melted and turns into a syrup. Cook the syrup undisturbed until it becomes deep amber in color and smells nutty, 2–3 minutes. Remove from heat and slowly whisk in garlic and fish sauce (it might splatter); stir until smooth.",
            "Heat a small saucepan over medium. Sprinkle a thin layer of sugar into pan, let melt, then add another layer (no stirring necessary). Repeat until all sugar is melted and turns into a syrup. Cook the syrup undisturbed until it becomes deep amber in color and smells nutty, 2–3 minutes. Remove from heat and slowly whisk in garlic and fish sauce (it might splatter); stir until smooth.",
            "Serve the wings: Place cooked wings in a large bowl and toss well with glaze to coat. Add jalapeños, peanuts, and cilantro, toss, and serve.",
            "Place cooked wings in a large bowl and toss well with glaze to coat. Add jalapeños, peanuts, and cilantro, toss, and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/559a81822165ea1779868f8d/6:4/w_274%2Ch_169/56389618_pok-pok-hot-wings_6x4.jpg",
        "color": 10505928
    }
}