{
    "recipe": {
        "title": "Polenta with Mushroom Ragout ",
        "ingredients": [
            "2 cups water",
            "1/2 cup yellow cornmeal",
            "1/4 teaspoon salt",
            "1/4 teaspoon freshly ground black pepper",
            "1 tablespoon unsalted butter",
            "1 tablespoon peanut oil",
            "1 small onion, chopped (1/2 cup)",
            "5 ounces mushrooms (cultivated, wild, or a combination), trimmed, cleaned, and cut into 1/2-inch pieces (2 cups)",
            "3 garlic cloves, crushed and finely chopped (2 teaspoons)",
            "4 plum tomatoes, halved, seeded, and cut into 1/2-inch pieces (1 1/4 cups)",
            "2 small ears corn, husked and kernels cut off (1 cup)",
            "1/2 cup homemade chicken stock or low-salt canned chicken broth",
            "1/4 teaspoon salt, or to taste",
            "1/8 teaspoon freshly ground black pepper",
            "2 tablespoons chopped fresh chives"
        ],
        "instructions": [
            "Bring the water to a boil in a medium saucepan. Sprinkle the cornmeal on top while mixing it in with a whisk, and stir in the salt and pepper. Bring the mixture to a boil, then reduce the heat to low, cover with a lid to prevent splattering, and cook gently for 6 to 8 minutes, stirring occasionally, until the polenta is cooked and has the consistency of a creamy puree. Set aside, covered.",
            "FOR THE RAGOUT Heat the butter and oil in a large saucepan. When they are hot, add the onion and sauté for 30 seconds. Add the mushrooms and sauté over high heat for about 2 minutes, until the liquid emerges from them and evaporates. Add the garlic, tomatoes, corn, chicken stock, salt, and pepper and bring to a strong boil. Reduce the heat to medium and cook for 2 to 3 minutes. To serve, ladle the polenta into the center of four soup plates and pour the mushroom ragout on top of and around it. Sprinkle with the chives and serve.",
            "Heat the butter and oil in a large saucepan. When they are hot, add the onion and sauté for 30 seconds. Add the mushrooms and sauté over high heat for about 2 minutes, until the liquid emerges from them and evaporates. Add the garlic, tomatoes, corn, chicken stock, salt, and pepper and bring to a strong boil. Reduce the heat to medium and cook for 2 to 3 minutes.",
            "To serve, ladle the polenta into the center of four soup plates and pour the mushroom ragout on top of and around it. Sprinkle with the chives and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56043a6d7c9cb37c518d5c4e/6:4/w_274%2Ch_169/366509_hires.jpg",
        "color": 2856368
    }
}