{
    "recipe": {
        "title": "Polenta Bites with Wild Mushrooms and Fontina ",
        "ingredients": [
            "4 pounds prepared polenta, sliced into 1/2-inch-thick rounds (about 30 rounds)",
            "2 tablespoons extra-virgin olive oil, plus more for brushing",
            "1/4 cup (1/2 stick) unsalted butter",
            "2 pounds assorted wild mushrooms (such as oyster, crimini, and/or stemmed shiitake), cut into thick slices",
            "2 shallots, thinly sliced",
            "1/4 cup Sherry vinegar",
            "1 3/4 teaspoons kosher salt",
            "1/2 teaspoon freshly ground black pepper",
            "1/2 teaspoon crushed red pepper flakes",
            "1/2 cup chopped parsley leaves",
            "4 ounces Fontina cheese, coarsely grated (about 1 cup)"
        ],
        "instructions": [
            "Preheat oven to 450°F. Brush both sides of polenta slices very lightly with oil and arrange on 2 rimmed baking sheets. Roast polenta until lightly golden brown and warmed through, about 25 minutes. Meanwhile, melt butter with remaining 2 Tbsp. oil in large, deep skillet over medium-high heat. Add mushrooms and cook, stirring often, until tender and browned, about 12 minutes. Add shallots, vinegar, salt, black pepper, and red pepper and cook, stirring, until tender, about 5 minutes. Stir in parsley. Divide mushroom mixture between baking sheets with polenta. Top with cheese. Continue to roast until cheese is melted, about 5 minutes. Arrange polenta bites on a platter and serve.",
            "Preheat oven to 450°F. Brush both sides of polenta slices very lightly with oil and arrange on 2 rimmed baking sheets. Roast polenta until lightly golden brown and warmed through, about 25 minutes.",
            "Meanwhile, melt butter with remaining 2 Tbsp. oil in large, deep skillet over medium-high heat. Add mushrooms and cook, stirring often, until tender and browned, about 12 minutes. Add shallots, vinegar, salt, black pepper, and red pepper and cook, stirring, until tender, about 5 minutes. Stir in parsley.",
            "Divide mushroom mixture between baking sheets with polenta. Top with cheese. Continue to roast until cheese is melted, about 5 minutes.",
            "Arrange polenta bites on a platter and serve.",
            "Do Ahead Mushroom mixture can be made 1 day ahead. Transfer to an airtight container and chill.",
            "Mushroom mixture can be made 1 day ahead. Transfer to an airtight container and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a26fa29b13b9d3d414c6434/6:4/w_274%2Ch_169/Wild-Mushroom-Ragout-on-Crispy-Polenta-new-years-28112017.jpg"
    }
}