{
    "recipe": {
        "title": "Pomegranate-Glazed Chicken with Buttery Pine Nuts ",
        "ingredients": [
            "4 garlic cloves, finely grated",
            "1/4 cup plain whole-milk yogurt (not Greek)",
            "1/3 cup plus 2 tablespoons pomegranate molasses",
            "4 tablespoons honey, divided",
            "2 tablespoons Diamond Crystal or 3 1/2 teaspoons Morton kosher salt, plus more",
            "1 3 1/2–4-pounds chicken, backbone removed, halved",
            "Extra-virgin olive oil (for drizzling)",
            "2 tablespoons unsalted butter",
            "1/4 cup pine nuts or blanched slivered almonds",
            "1 1/2 cups pomegranate juice, room temperature",
            "1 lime, halved"
        ],
        "instructions": [
            "Combine garlic, yogurt, 1/3 cup pomegranate molasses, 2 Tbsp. honey, and 2 Tbsp. Diamond Crystal or 3 1/2 tsp. Morton kosher salt in a large resealable plastic bag. Place chicken in bag and seal, pressing out any air; turn to coat. Chill, turning occasionally, at least 12 hours and up to 2 days. Let chicken sit at room temperature 1 hour before cooking. Place a rack in top position of oven; preheat to 450°F. Stir remaining 2 Tbsp. pomegranate molasses and remaining 2 Tbsp. honey in a small bowl. Drizzle enough oil to barely coat the bottom of a large heavy skillet, preferably cast iron, that can hold both chicken halves (or you can roast chicken on a foil-lined rimmed baking sheet). Remove chicken from marinade, letting excess drip back into bag, and place in skillet, skin side up. Pat chicken dry with paper towels; season lightly with salt. Brush or spoon pomegranate molasses mixture evenly over skin. Roast chicken until skin is lacquered and deep mahogany over most of surface and juices run clear when thigh meat is pierced with a knife, 25–30 minutes. Transfer to a cutting board and let rest 15 minutes. Meanwhile, melt butter in a small skillet over medium-low heat. Cook pine nuts, tossing often, until golden and mixture smells nutty (don’t let the butter burn), about 3 minutes. Scrape buttery pine nuts into a small bowl and season with salt. Pour pomegranate juice into a large bowl or shallow platter and squeeze in lime. Season with a large pinch of salt and stir to dissolve. Add chicken to bowl (or divide between 2 shallow bowls) and spoon buttery pine nuts over to serve.",
            "Combine garlic, yogurt, 1/3 cup pomegranate molasses, 2 Tbsp. honey, and 2 Tbsp. Diamond Crystal or 3 1/2 tsp. Morton kosher salt in a large resealable plastic bag. Place chicken in bag and seal, pressing out any air; turn to coat. Chill, turning occasionally, at least 12 hours and up to 2 days.",
            "Let chicken sit at room temperature 1 hour before cooking.",
            "Place a rack in top position of oven; preheat to 450°F. Stir remaining 2 Tbsp. pomegranate molasses and remaining 2 Tbsp. honey in a small bowl.",
            "Drizzle enough oil to barely coat the bottom of a large heavy skillet, preferably cast iron, that can hold both chicken halves (or you can roast chicken on a foil-lined rimmed baking sheet). Remove chicken from marinade, letting excess drip back into bag, and place in skillet, skin side up. Pat chicken dry with paper towels; season lightly with salt. Brush or spoon pomegranate molasses mixture evenly over skin.",
            "Roast chicken until skin is lacquered and deep mahogany over most of surface and juices run clear when thigh meat is pierced with a knife, 25–30 minutes. Transfer to a cutting board and let rest 15 minutes.",
            "Meanwhile, melt butter in a small skillet over medium-low heat. Cook pine nuts, tossing often, until golden and mixture smells nutty (don’t let the butter burn), about 3 minutes. Scrape buttery pine nuts into a small bowl and season with salt.",
            "Pour pomegranate juice into a large bowl or shallow platter and squeeze in lime. Season with a large pinch of salt and stir to dissolve. Add chicken to bowl (or divide between 2 shallow bowls) and spoon buttery pine nuts over to serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a5fc85b53fa7a308b9c79fd/6:4/w_274%2Ch_169/pomegranate-glazed-chicken-with-buttery-pine-nuts-recipe-BA-011718.jpg"
    }
}