{
    "recipe": {
        "title": "Popeye Pie ",
        "ingredients": [
            "1 ball of Pizza Dough, shaped and waiting on a floured peel",
            "1 medium garlic clove, grated",
            "30 grams (about 1 ounce) pecorino fresco, cut into 1-inch cubes and slightly flattened by pressing between thumb and index finger",
            "18 grams (1/3 cup) finely grated Gruyère cheese",
            "50 grams (about 1 3/4 ounces) fresh mozzarella, pulled into shreds",
            "2 pinches of freshly ground black pepper",
            "120 grams (about 4 1/4 ounces) fresh spinach",
            "Generous pinch of fine sea salt",
            "Extra-virgin olive oil, for drizzling"
        ],
        "instructions": [
            "1 Place the pizza stone in a gas oven on the middle rack. Preheat the oven on bake at 500°F for 30 minutes. Switch to broil for 10 minutes and then back to bake at 500°F. (For an electric variation, see Cooks' Note.)",
            "2 With the dough on the peel, sprinkle the surface evenly with the garlic. Distribute the pecorino, Gruyère, and mozzarella evenly over the dough. Sprinkle evenly with pepper.",
            "3 With quick, jerking motions, slide the pie onto the stone. Bake for 2 minutes.",
            "4 Pull the rack partially out of the oven. Quickly add the spinach in what will look like a big mound (the spinach will reduce, the mound flattening, as spinach always does when it cooks). Sprinkle evenly with salt. Return the pie to the oven for 3 1/2 to 4 minutes in a gas oven (somewhat longer with an electric oven; see Cooks' Note), until the crust is charred in spots, but not as deeply as with the other pizzas in this book.",
            "5 Using the peel, transfer the pizza to a tray or serving platter. Drizzle evenly with oil. Slice and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b41226d5e8c3e1070b0f84/6:4/w_274%2Ch_169/394589_popeye-pie_1x1.jpg",
        "color": 10117629
    }
}