{
    "recipe": {
        "title": "Poppy Seed and Pecan Strudel ",
        "ingredients": [
            "3 cups pecans (about 10 oz.)",
            "1 cup whole milk",
            "3/4 cup poppy seeds",
            "10 Tbsp. unsalted butter, divided",
            "3/4 cup (packed) light brown sugar",
            "1 1/2 tsp. kosher salt",
            "1 tsp. vanilla extract",
            "6 (17x12\") sheets fresh phyllo pastry or frozen, thawed",
            "1 large egg, beaten to blend",
            "Powdered sugar (for serving)"
        ],
        "instructions": [
            "Preheat oven to 325°F. Spread out pecans on a large rimmed baking sheet and toast until slightly darkened in color and fragrant, 13–15 minutes. Let cool.",
            "Bring milk and poppy seeds to a boil in a medium saucepan; reduce heat to medium-low and simmer, stirring occasionally, until milk is almost completely evaporated, 13–15 minutes. Let mixture cool.",
            "Scrape into a food processor. Cut 6 Tbsp. butter into pieces and add to food processor along with pecans, brown sugar, salt, and vanilla. Process until a paste forms.",
            "Melt remaining 4 Tbsp. butter in a small saucepan over medium heat (or in a microwave). Line a rimmed baking sheet with parchment, then brush with some of the melted butter.",
            "Place a stack of 6 phyllo sheets on a work surface. Cover with plastic wrap, then a damp kitchen towel.",
            "Arrange prepared baking sheet so a long side is facing you and stack 2 phyllo sheets on top; brush lightly with butter. Top with another sheet of phyllo and brush lightly with butter. Repeat with 2 more sheets, then top with final sheet; do not brush with butter.",
            "Using an offset or rubber spatula, spread poppy seed mixture over pastry in an even layer, leaving a 1\" border on all sides. Starting with the long side closest to you, gently roll up pastry and turn seam side down; tuck exposed ends underneath. Using a sharp knife, cut horizontal slits about halfway through roll, spacing every 1\" along length. Brush with egg.",
            "Bake strudel until golden and crisp, 40–45 minutes. Transfer baking sheet to a wire rack and let strudel cool.",
            "Just before serving, dust with powdered sugar and slice.",
            "Do Ahead: Strudel can be baked 1 day ahead. Let cool completely, then cover with plastic wrap and store at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aa9302a2133066cf9403ea0/6:4/w_274%2Ch_169/Poppy-Seed-and-Pecan-Strudel-easter-dessert-recipe-2-03012018.jpg"
    }
}