{
    "recipe": {
        "title": "Porcini Mushroom Soup ",
        "ingredients": [
            "3/4 ounces dried porcini mushrooms (1 cup)",
            "6 cups tepid water plus 2 cups hot water, divided",
            "1 medium onion, finely chopped",
            "1/2 stick unsalted butter",
            "2 celery ribs, finely chopped",
            "1 medium carrot, finely chopped",
            "3 garlic cloves, finely chopped",
            "1 1/2 pounds white mushrooms, sliced or quartered",
            "1 (15-ounce) can diced tomatoes, drained",
            "2 tablespoons finely chopped flat-leaf parsley",
            "2 tablespoons finely chopped dill"
        ],
        "instructions": [
            "Soak porcini in 2 cups hot water 15 minutes. Cook onion in butter with 1 teaspoon salt in a heavy medium pot over medium heat, stirring occasionally, until onion is golden brown, 10 to 12 minutes. Add celery, carrot, and garlic and cook, stirring occasionally, until softened, about 5 minutes. Transfer porcini with a slotted spoon to pot and strain soaking liquid through a fine-mesh sieve into a large glass measure. Add white mushrooms to pot with 1 teaspoon salt and 1/2 teaspoon pepper. Cook, stirring, until mushrooms are tender, 6 to 8 minutes. Stir in tomatoes, remaining 6 cups water, and porcini-soaking liquid. Simmer, partially covered, 30 minutes. Purée 1 cup vegetables and 1 cup liquid in a blender (use caution when blending hot liquids), then return to pot. Stir in parsley, dill, and salt to taste.",
            "Soak porcini in 2 cups hot water 15 minutes.",
            "Cook onion in butter with 1 teaspoon salt in a heavy medium pot over medium heat, stirring occasionally, until onion is golden brown, 10 to 12 minutes. Add celery, carrot, and garlic and cook, stirring occasionally, until softened, about 5 minutes.",
            "Transfer porcini with a slotted spoon to pot and strain soaking liquid through a fine-mesh sieve into a large glass measure. Add white mushrooms to pot with 1 teaspoon salt and 1/2 teaspoon pepper. Cook, stirring, until mushrooms are tender, 6 to 8 minutes. Stir in tomatoes, remaining 6 cups water, and porcini-soaking liquid. Simmer, partially covered, 30 minutes.",
            "Purée 1 cup vegetables and 1 cup liquid in a blender (use caution when blending hot liquids), then return to pot. Stir in parsley, dill, and salt to taste."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d79887b55306961bf3692/6:4/w_274%2Ch_169/350920_hires.jpg"
    }
}