{
    "recipe": {
        "title": "Porchetta-Style Roast Pork ",
        "ingredients": [
            "2 tablespoons fennel seeds",
            "1 tablespoon coarse kosher salt",
            "2 teaspoons black peppercorns",
            "1 teaspoon dried crushed red pepper",
            "1 (5 1/2- to 6-pound) boneless pork shoulder (Boston butt), excess fat trimmed with thin layer left intact",
            "6 large garlic cloves, minced",
            "2 tablespoons extra-virgin olive oil plus additional for brushing",
            "1 cup dry white wine",
            "1/2 cup low-salt chicken broth"
        ],
        "instructions": [
            "Stir fennel seeds in small skillet over medium-high heat until slightly darker in color and fragrant, 4 to 5 minutes. Transfer seeds to spice mill and cool. Add kosher salt, peppercorns, and dried crushed red pepper. Grind to medium-fine consistency (not powder).",
            "Place pork in 13 x 9 x 2-inch glass baking dish. Rub garlic all over pork, then coat with spice mixture. Loosely cover pork with waxed paper. Refrigerate overnight.",
            "Preheat oven to 450°F. Brush large rimmed baking sheet with oil. Place roast, fat side up and coating intact, in center of sheet. Drizzle evenly with 2 tablespoons oil. Roast pork 30 minutes. Reduce oven temperature to 300°F. Roast pork until very tender and thermometer inserted into center of pork registers 190°F, about 3 hours 15 minutes longer. Transfer pork to cutting board; reserve baking sheet. Let pork rest 15 to 30 minutes.",
            "Meanwhile, pour all pan juices into 2-cup measuring cup. Spoon off fat that rises to top. Place reserved baking sheet across 2 burners. Pour wine and broth onto baking sheet and bring to boil over medium-high heat, scraping up any browned bits. Boil until wine mixture is reduced to 3/4 cup, about 4 minutes. Add degreased pan juices and whisk to blend. Pour pan sauce into small bowl (sauce will be thin).",
            "Thinly slice roast. Serve with sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a8d846be0b0965d5c8229dc/6:4/w_274%2Ch_169/porchetta-recipe-022018.jpg",
        "color": 15121654
    }
}