{
    "recipe": {
        "title": "Pork Chops with Radishes and Charred Scallions ",
        "ingredients": [
            "1 tablespoon aniseed or fennel seeds",
            "4 (1-inch-thick) bone-in pork chops (about 4 pounds total), patted dry",
            "Kosher salt, freshly ground pepper",
            "1 teaspoon crushed red pepper flakes",
            "3 tablespoons olive oil, divided; plus more for grill",
            "1 tablespoon fresh lemon juice",
            "1 teaspoon finely chopped rinsed salt-packed anchovy fillet",
            "3 radishes, trimmed, thinly sliced on a mandoline",
            "1/4 cup parsley leaves with tender stems",
            "2 bunches scallions, roots trimmed",
            "A spice mill or mortar and pestle"
        ],
        "instructions": [
            "Toast aniseed in a dry small skillet over medium heat, tossing often, until fragrant, about 2 minutes. Let cool; coarsely grind in spice mill or with mortar and pestle. Season pork chops all over with salt and pepper; sprinkle with aniseed and red pepper flakes. Let sit at room temperature 30 minutes. Prepare a grill for medium-high heat; brush grate with oil. Grill chops, moving around on grate to avoid flare-ups, until deep golden brown on both sides and an instant-read thermometer inserted into the thickest part registers 140°F, 8–10 minutes. Transfer chops to a plate and let rest 10 minutes. Meanwhile, whisk lemon juice, anchovy, and 2 Tbsp. oil in a medium bowl to combine. Add radishes and parsley and toss to coat. Toss scallions on a rimmed baking sheet with remaining 1 Tbsp. oil; season with salt and pepper. Grill scallions directly on grate, turning once, until lightly charred, about 2 minutes. Transfer scallions to a platter, set pork chops on top, and scatter radish salad over.",
            "Toast aniseed in a dry small skillet over medium heat, tossing often, until fragrant, about 2 minutes. Let cool; coarsely grind in spice mill or with mortar and pestle. Season pork chops all over with salt and pepper; sprinkle with aniseed and red pepper flakes. Let sit at room temperature 30 minutes.",
            "Prepare a grill for medium-high heat; brush grate with oil. Grill chops, moving around on grate to avoid flare-ups, until deep golden brown on both sides and an instant-read thermometer inserted into the thickest part registers 140°F, 8–10 minutes. Transfer chops to a plate and let rest 10 minutes.",
            "Meanwhile, whisk lemon juice, anchovy, and 2 Tbsp. oil in a medium bowl to combine. Add radishes and parsley and toss to coat.",
            "Toss scallions on a rimmed baking sheet with remaining 1 Tbsp. oil; season with salt and pepper. Grill scallions directly on grate, turning once, until lightly charred, about 2 minutes. Transfer scallions to a platter, set pork chops on top, and scatter radish salad over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/596939288ae8df0e1bed8664/6:4/w_274%2Ch_169/pork-chops-with-radishes-and-charred-scallions-recipe-BA-071417.jpg"
    }
}