{
    "recipe": {
        "title": "Pork Tenderloin with Peach-Mustard Sauce ",
        "ingredients": [
            "2 large ripe peaches, peeled, cut into small pieces",
            "1/4 cup ketchup",
            "3 Tbsp. Dijon mustard",
            "1 tsp. light brown sugar",
            "1/2 tsp. freshly ground black pepper",
            "1/2 tsp. (or more) kosher salt",
            "2 pork tenderloins (about 1 lb. each)",
            "4 tsp. kosher salt",
            "1 tsp. freshly cracked black pepper",
            "Vegetable oil (for grill)",
            "1/2 cup peach preserves, warmed"
        ],
        "instructions": [
            "Purée peaches, ketchup, mustard, brown sugar, pepper, and 1/2 tsp. salt in a blender until mixture is smooth and creamy. Taste sauce and season with more salt if needed.",
            "Pork: Sprinkle pork with salt and pepper and rub all over. Let sit at room temperature 1 hour. Meanwhile, prepare a grill for medium heat and brush grate with oil. Brush pork with some preserves. Grill, turning every 4 minutes or so and brushing with any remaining preserves, until charred on all sides and an instant-read thermometer inserted into the thickest part registers 130°F, 10–12 minutes. Transfer to a cutting board and let rest 10 minutes. Slice 1/2\" thick. Serve sliced pork with Peach-Mustard Sauce alongside.",
            "Sprinkle pork with salt and pepper and rub all over. Let sit at room temperature 1 hour. Meanwhile, prepare a grill for medium heat and brush grate with oil.",
            "Brush pork with some preserves. Grill, turning every 4 minutes or so and brushing with any remaining preserves, until charred on all sides and an instant-read thermometer inserted into the thickest part registers 130°F, 10–12 minutes. Transfer to a cutting board and let rest 10 minutes. Slice 1/2\" thick.",
            "Serve sliced pork with Peach-Mustard Sauce alongside.",
            "Do Ahead Sauce can be made 1 day ahead. Cover and chill.",
            "Sauce can be made 1 day ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b16fb04bf24904d9ece7fbc/6:4/w_274%2Ch_169/grilled-pork-tenderloin-with-peach-mustard-sauce-recipe-BA-060518.jpg"
    }
}