{
    "recipe": {
        "title": "Pork Blade Steaks with Nduja and Honey and Arugula Salad ",
        "ingredients": [
            "3 cups water",
            "6 tablespoons coarse kosher salt plus additional (for sprinkling)",
            "3 tablespoons sugar",
            "4 1/2-inch-thick pork shoulder blade steaks (each about 10 inches long and 3 1/2 inches wide)",
            "3 tablespoons extra-virgin olive oil, divided",
            "4 ounces nduja (soft, spicy salami), cut into very thin slices",
            "2 tablespoons honey",
            "1 5-ounce package baby arugula",
            "1/2 cup coarsely grated Pecorino Romano cheese",
            "1 tablespoon fresh lemon juice",
            "Nduja is available at some specialty foods stores, Italian markets, and online from boccalone.com. This size of pork shoulder blade steaks may be hard to find at the supermarket, so you may have to ask the butcher to cut them for you.",
            "Large griddle"
        ],
        "instructions": [
            "Combine 3 cups water, 6 tablespoons coarse salt, and sugar in 15 x 10 x 2-inch glass baking dish. Stir until salt and sugar dissolve. Place pork steaks in brine in baking dish. Cover and chill at least 2 hours and up to 4 hours. Remove pork steaks from brine; pat dry. Brush both sides of steaks with 1 tablespoon oil; sprinkle with coarse salt and pepper. Heat griddle over medium-high heat until almost smoking. Place steaks on griddle and cook 3 minutes. Turn steaks over on griddle; immediately top each steak with nduja slices, dividing equally. Cook until pork is cooked through, about 3 minutes longer (nduja will soften). Transfer steaks to platter, nduja side down. Spoon 1/2 tablespoon honey over each. Toss arugula, cheese, lemon juice, and 2 tablespoons oil in bowl. Season salad with coarse salt and pepper; serve with steaks.",
            "Combine 3 cups water, 6 tablespoons coarse salt, and sugar in 15 x 10 x 2-inch glass baking dish. Stir until salt and sugar dissolve. Place pork steaks in brine in baking dish. Cover and chill at least 2 hours and up to 4 hours.",
            "Remove pork steaks from brine; pat dry. Brush both sides of steaks with 1 tablespoon oil; sprinkle with coarse salt and pepper. Heat griddle over medium-high heat until almost smoking. Place steaks on griddle and cook 3 minutes. Turn steaks over on griddle; immediately top each steak with nduja slices, dividing equally. Cook until pork is cooked through, about 3 minutes longer (nduja will soften).",
            "Transfer steaks to platter, nduja side down. Spoon 1/2 tablespoon honey over each.",
            "Toss arugula, cheese, lemon juice, and 2 tablespoons oil in bowl. Season salad with coarse salt and pepper; serve with steaks.",
            "What to drink: A robust red wine would be terrific with the pork. The Quinta da Garrida 2007 Vinho Tinto (Portugal, $11) is a good choice.",
            "A robust red wine would be terrific with the pork. The Quinta da Garrida 2007 Vinho Tinto (Portugal, $11) is a good choice."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b33d8921388ef838b07fca/6:4/w_274%2Ch_169/360672_pork-blade-steaks_1x1.jpg"
    }
}