{
    "recipe": {
        "title": "Pork Stew with Fennel and Butternut Squash ",
        "ingredients": [
            "3 pounds 2-inch pieces trimmed pork shoulder (Boston butt)",
            "2 teaspoons salt",
            "1 teaspoon ground black pepper",
            "1 teaspoon dried rubbed sage",
            "1/2 teaspoon cayenne pepper",
            "1/4 teaspoon ground nutmeg",
            "1/4 teaspoon ground ginger",
            "2 tablespoons olive oil",
            "1 cup chopped thinly sliced pancetta* (about 4 ounces)",
            "2 cups chopped onions",
            "3 garlic cloves, chopped",
            "1 28-ounce can diced tomatoes in juice",
            "2 cups low-salt chicken broth",
            "1 cup dry red wine",
            "2 large fresh fennel bulbs; fronds chopped and reserved, bulbs cut into 1-inch cubes (about 5 cups)",
            "20 1 1/2-inch cubes peeled butternut squash (part of 3-pound squash)"
        ],
        "instructions": [
            "Place pork in large bowl. Mix next 6 ingredients in small bowl; sprinkle over pork, turning pork to coat evenly. Let stand 30 minutes.",
            "Preheat oven to 350°F. Heat oil in large ovenproof pot over medium-high heat. Add pancetta and sauté until beginning to brown, about 3 minutes. Using slotted spoon, transfer pancetta to medium bowl. Add half of pork to pot; sauté until brown, about 8 minutes. Using slotted spoon, transfer pork to bowl with pancetta. Repeat with remaining pork. Add onions and garlic to pot; sauté until soft, about 5 minutes. Add tomatoes with juices, broth, wine, and pork mixture. Bring to boil, scraping up browned bits.",
            "Cover pot; place in oven. Cook stew 1 hour. Add fennel bulbs, chopped fronds, and squash cubes to stew. Cover and cook in oven until pork and vegetables are tender, about 30 minutes. Using slotted spoon, transfer meat and vegetables to large bowl; cover. Boil sauce over medium-high heat until thickened enough to coat spoon, about 25 minutes. Return meat and vegetables to sauce; season with salt and pepper. (Can be made 1 day ahead. Cool 30 minutes. Chill uncovered until cold, then cover and keep chilled.) Rewarm over low heat.",
            "*Pancetta, Italian bacon cured in salt, is available at Italian markets and some specialty foods stores and supermarkets.",
            "*Pancetta, Italian bacon cured in salt, is available at Italian markets and some specialty foods stores and supermarkets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea189f3a00aeb2f1d6c3f/6:4/w_274%2Ch_169/107648.jpg"
    }
}