{
    "recipe": {
        "title": "Pork Conserva with Green Tomato Agrodolce ",
        "ingredients": [
            "10 ounces 1-inch cubes pork shoulder (Boston butt)",
            "2 ounces finely chopped salt pork (fatty parts only; about 1/4 cup)",
            "2 garlic cloves, chopped",
            "1/2 cup dry white wine",
            "2 teaspoons vegetable oil plus additional (for brushing)",
            "1/2 cup chopped red onion",
            "3 tablespoons sugar",
            "2 cups chopped green tomatoes",
            "1/4 cup distilled white vinegar",
            "1/4 teaspoon dry mustard",
            "24 flatbread crackers",
            "Chopped fresh basil"
        ],
        "instructions": [
            "Mix first 3 ingredients in 9 x 5 x 3-inch glass loaf pan. Cover with plastic and refrigerate overnight.",
            "Preheat oven to 300°F. Uncover pork mixture; mix in wine. Cover tightly with foil. Place in oven; cook until pork is very tender, about 2 1/2 hours. Cool to lukewarm. Uncover and mash with potato masher until finely shredded. Cover; refrigerate until cold. DO AHEAD : Can be made 4 days ahead. Keep refrigerated.",
            "For green tomato agrodolce: Heat 2 teaspoons oil in heavy medium saucepan over medium heat. Add onion; cook until translucent, stirring often, about 6 minutes. Add sugar; cook until juices are thick, about 4 minutes. Add tomatoes, vinegar, and mustard. Sprinkle with salt, increase heat to high, and bring to boil; reduce heat to medium and cook until tomatoes are tender but not falling apart, stirring often, about 7 minutes. Strain tomatoes in sieve set over medium bowl. Return juices to saucepan and boil until reduced to scant 1/2 cup, about 4 minutes. Mix tomato mixture and reduced juices in same medium bowl. Cover and chill until cold, about 4 hours. DO AHEAD: Can be made 4 days ahead. Keep chilled. Spoon 1 tablespoonful pork conserva on each cracker. Spoon rounded teaspoonful agrodolce on top. Sprinkle with basil.",
            "Heat 2 teaspoons oil in heavy medium saucepan over medium heat. Add onion; cook until translucent, stirring often, about 6 minutes. Add sugar; cook until juices are thick, about 4 minutes. Add tomatoes, vinegar, and mustard. Sprinkle with salt, increase heat to high, and bring to boil; reduce heat to medium and cook until tomatoes are tender but not falling apart, stirring often, about 7 minutes. Strain tomatoes in sieve set over medium bowl. Return juices to saucepan and boil until reduced to scant 1/2 cup, about 4 minutes. Mix tomato mixture and reduced juices in same medium bowl. Cover and chill until cold, about 4 hours. DO AHEAD: Can be made 4 days ahead. Keep chilled.",
            "Spoon 1 tablespoonful pork conserva on each cracker. Spoon rounded teaspoonful agrodolce on top. Sprinkle with basil."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3b2f621388ef838b0a4da/6:4/w_274%2Ch_169/360756_pork-conserva_1x1.jpg"
    }
}