{
    "recipe": {
        "title": "Pork Shoulder Steaks with Grilled Mustard Greens ",
        "ingredients": [
            "2 Tbsp. fennel seeds",
            "1 Tbsp. yellow mustard seeds",
            "1 1/2 tsp. black peppercorns",
            "1 tsp. crushed red pepper flakes",
            "1 tsp. ground cinnamon",
            "4 (3/4\"-thick) boneless pork shoulder (Boston butt) steaks (about 2 lb.) or pork blade chops",
            "Kosher salt",
            "1 lemon, halved",
            "2 Tbsp. extra-virgin olive oil, plus more for drizzling",
            "2 garlic cloves",
            "2 bunches mustard greens, leaves torn into large pieces",
            "1/2 tsp. crushed red pepper flakes",
            "Vegetable oil (for grill)",
            "Kosher salt, freshly ground pepper",
            "Flaky sea salt",
            "A spice mill or a mortar and pestle"
        ],
        "instructions": [
            "Toast fennel and mustard seeds in a small saucepan over medium heat, stirring occasionally, until fragrant and mustard seeds are just beginning to pop, about 4 minutes. Transfer to spice mill or mortar and pestle and let cool. Add peppercorns and red pepper flakes and finely grind. Transfer to a small bowl and mix in cinnamon.",
            "Season pork steaks generously with salt and rub all over with spice mixture. Cover and let sit at room temperature 1 hour.",
            "Greens and assembly: Prepare a grill for medium heat; oil grate. Grill steaks, turning occasionally, until an instant-read thermometer inserted into the thickest part registers 145°F for medium, 5–7 minutes. Transfer steaks to a cutting board, squeeze a lemon half over, and drizzle with olive oil. Let rest 10 minutes. Meanwhile, grate garlic into a large bowl and whisk with 2 Tbsp. olive oil. Add mustard greens and toss to coat; season with kosher salt and pepper. Spread out greens over grate (save bowl) and grill until lightly charred and just wilted, about 45 seconds per side. Transfer back to bowl and squeeze remaining lemon half over. Add red pepper flakes and toss to coat. Transfer greens to a platter. Thinly slice pork against the grain and place on top of greens. Drizzle any accumulated juices left on your cutting board over and sprinkle with sea salt.",
            "Prepare a grill for medium heat; oil grate. Grill steaks, turning occasionally, until an instant-read thermometer inserted into the thickest part registers 145°F for medium, 5–7 minutes. Transfer steaks to a cutting board, squeeze a lemon half over, and drizzle with olive oil. Let rest 10 minutes.",
            "Meanwhile, grate garlic into a large bowl and whisk with 2 Tbsp. olive oil. Add mustard greens and toss to coat; season with kosher salt and pepper. Spread out greens over grate (save bowl) and grill until lightly charred and just wilted, about 45 seconds per side. Transfer back to bowl and squeeze remaining lemon half over. Add red pepper flakes and toss to coat.",
            "Transfer greens to a platter. Thinly slice pork against the grain and place on top of greens. Drizzle any accumulated juices left on your cutting board over and sprinkle with sea salt.",
            "Do Ahead Pork can be seasoned 1 day ahead. Cover and chill. Let sit at room temperature 1 hour before grilling.",
            "Pork can be seasoned 1 day ahead. Cover and chill. Let sit at room temperature 1 hour before grilling."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b16fb02100fee1fe1c8f358/6:4/w_274%2Ch_169/pork-shoulder-steaks-with-grilled-mustard-greens-recipe-BA-060518.jpg"
    }
}