{
    "recipe": {
        "title": "Pork Chops au Poivre ",
        "ingredients": [
            "1 tablespoon black peppercorns",
            "4 (1/2-inch-thick) rib pork chops (bone in)",
            "1 teaspoon salt",
            "2 tablespoons vegetable oil",
            "1/4 cup medium-dry or cream Sherry",
            "1/3 cup heavy cream"
        ],
        "instructions": [
            "Coarsely crush peppercorns by gently pounding once or twice with a heavy skillet. Pat chops dry and sprinkle both sides evenly with salt and peppercorns, pressing to help them adhere. Heat 1 tablespoon oil in a 12-inch heavy skillet over moderate heat until hot but not smoking, then cook 2 chops, turning over once, until browned and just cooked through, 4 to 6 minutes total. Transfer to a plate and wipe out skillet. Cook remaining 2 chops in remaining tablespoon oil in same manner, transferring to plate. (Do not wipe out skillet after second batch.) Add Sherry to skillet and boil, scraping up any brown bits, until reduced by half, about 1 minute. Add cream and any meat juices accumulated on plate, then boil, stirring occasionally, until slightly thickened, about 2 minutes. Season sauce with salt and serve over chops.",
            "Coarsely crush peppercorns by gently pounding once or twice with a heavy skillet. Pat chops dry and sprinkle both sides evenly with salt and peppercorns, pressing to help them adhere.",
            "Heat 1 tablespoon oil in a 12-inch heavy skillet over moderate heat until hot but not smoking, then cook 2 chops, turning over once, until browned and just cooked through, 4 to 6 minutes total. Transfer to a plate and wipe out skillet. Cook remaining 2 chops in remaining tablespoon oil in same manner, transferring to plate. (Do not wipe out skillet after second batch.)",
            "Add Sherry to skillet and boil, scraping up any brown bits, until reduced by half, about 1 minute. Add cream and any meat juices accumulated on plate, then boil, stirring occasionally, until slightly thickened, about 2 minutes. Season sauce with salt and serve over chops."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9988f3a00aeb2f1cf596/6:4/w_274%2Ch_169/238098.jpg"
    }
}