{
    "recipe": {
        "title": "Pork Tenderloin with Golden Beets ",
        "ingredients": [
            "1/4 cup walnuts",
            "3 tablespoons plus 1/2 cup olive oil",
            "1 1/2 pounds pork tenderloin",
            "Kosher salt",
            "2 medium onions, coarsely chopped",
            "3 medium golden beets, scrubbed, cut into bite-size pieces",
            "Freshly ground black pepper",
            "4 garlic cloves, chopped",
            "2 cups sauerkraut, plus 1/2 cup brine",
            "1 cup low-sodium chicken broth",
            "1/2 cup dry white wine",
            "4 tablespoons fresh lemon juice, divided",
            "1/2 cup finely chopped mint",
            "1/2 cup finely chopped parsley",
            "1/4 cup finely chopped dried tart apricots"
        ],
        "instructions": [
            "Preheat oven to 350°F. Toast walnuts on a rimmed baking sheet, tossing once, until golden brown, 7–10 minutes. Let cool, then chop.",
            "Heat 3 Tbsp. oil in a large skillet over medium-high. Season pork loin (look for one with a nice dark color and some fat on it) with salt and cook until browned on all sides, 10–15 minutes. Transfer pork to a platter.",
            "Add onions and beets to same skillet and cook, stirring often, until onions are slightly translucent and browned, 10–12 minutes; season with salt and pepper. Add garlic, sauerkraut, brine, broth, wine, and 2 Tbsp. lemon juice and bring to a simmer. Cover skillet, reduce heat to low, and cook until beets are fork-tender, 25–30 minutes.",
            "Return pork to skillet and push down into liquid. Turn heat up to medium and simmer, uncovered, turning meat occasionally until an instant-read thermometer inserted into the thickest part of loin registers 150°F, 20–30 minutes. Transfer pork to a cutting board and let rest 5 minutes before slicing.",
            "Meanwhile, mix walnuts, mint, parsley, apricots, remaining 2 Tbsp. lemon juice, and remaining 1/2 cup oil in a small bowl; season with salt and pepper.",
            "Spoon beet mixture onto plates and arrange sliced pork on top. Spoon a generous amount of walnut sauce over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59e8f2f0d7423f64057d4439/6:4/w_274%2Ch_169/pork-tenderloin-with-golden-beets-recipe-BA-101917.jpg"
    }
}