{
    "recipe": {
        "title": "Pork Enchiladas Rojas ",
        "ingredients": [
            "1 teaspoon coriander seeds",
            "2 tablespoons cumin seeds",
            "14 guajillo chiles, seeds removed",
            "4 ancho chiles, seeds removed",
            "3 morita chiles",
            "4 cups homemade chicken stock or low-sodium chicken broth",
            "8 cloves garlic, peeled",
            "2 tablespoons tomato paste",
            "1 teaspoon crushed Mexican or Italian oregano",
            "1 tablespoon vegetable oil",
            "1 pound boneless pork shoulder (Boston butt), fat trimmed",
            "Kosher salt",
            "2 bay leaves",
            "1 cup vegetable oil",
            "8 (6-inch) white corn tortillas",
            "10 ounces queso fresco, crumbled, plus more for serving",
            "1 avocado",
            "2 tablespoons sour cream",
            "1 tablespoon fresh lime juice",
            "Kosher salt",
            "1/2 onion, sliced into thin rings",
            "Lime wedges, (for serving)",
            "A spice mill or mortar and pestle"
        ],
        "instructions": [
            "For the sauce and filling: Toast coriander seeds in a small skillet over medium heat, swirling pan often and adding cumin seeds during the last 30 seconds of cooking, until fragrant, about 2 minutes. Let cool, then finely grind in spice mill or with mortar and pestle. Bring guajillo, ancho, and morita chiles and stock to a boil in a medium saucepan over medium-high heat. Cover, remove from heat, and let sit 30 minutes to let chiles soften. Transfer chile mixture to a blender and add toasted spices, garlic, tomato paste, and oregano and purée until smooth, about 2 minutes. Preheat oven to 250°F. Heat oil in a medium heavy pot over medium-high. Season pork with salt and cook, turning occasionally, until browned on all sides, 10–12 minutes. Pour off excess oil and add chile purée and bay leaves. Bring to a boil, cover, and transfer to oven. Braise pork until meat is very tender and shreds easily, 1 1/2–2 hours; season with salt. Skim excess fat from chile sauce; discard bay leaves. Transfer pork to a large bowl. Let cool slightly, then shred with 2 forks. Mix 1/2 cup chile sauce into pork; season with salt. Set remaining sauce aside.",
            "Toast coriander seeds in a small skillet over medium heat, swirling pan often and adding cumin seeds during the last 30 seconds of cooking, until fragrant, about 2 minutes. Let cool, then finely grind in spice mill or with mortar and pestle.",
            "Bring guajillo, ancho, and morita chiles and stock to a boil in a medium saucepan over medium-high heat. Cover, remove from heat, and let sit 30 minutes to let chiles soften.",
            "Transfer chile mixture to a blender and add toasted spices, garlic, tomato paste, and oregano and purée until smooth, about 2 minutes.",
            "Preheat oven to 250°F. Heat oil in a medium heavy pot over medium-high. Season pork with salt and cook, turning occasionally, until browned on all sides, 10–12 minutes. Pour off excess oil and add chile purée and bay leaves. Bring to a boil, cover, and transfer to oven. Braise pork until meat is very tender and shreds easily, 1 1/2–2 hours; season with salt.",
            "Skim excess fat from chile sauce; discard bay leaves. Transfer pork to a large bowl. Let cool slightly, then shred with 2 forks. Mix 1/2 cup chile sauce into pork; season with salt. Set remaining sauce aside.",
            "For the assembly: Preheat oven to 425°F. Heat oil in a medium skillet over medium-high until it bubbles immediately when edge of tortilla touches the surface. Working one at a time, fry tortillas until just starting to brown and crisp, about 10 seconds per side (they should still be somewhat pliable). Transfer to paper towels to drain. Dip both sides of each tortilla in chile sauce just to coat, then transfer to a rimmed baking sheet. Spread 1 cup sauce down the length of a 13x9\" baking dish. Spoon 1/4 cup pork mixture across the center of a tortilla and fold one side over filling, then continue to roll up tortilla. Place seam side down in prepared baking dish. Repeat with more sauce and remaining tortillas (enchiladas should be nestled right up against each other in pan). Top with cheese and remaining sauce. Bake until sauce is bubbling and cheese is beginning to brown, 15–20 minutes. Let sit 10 minutes. Meanwhile, purée avocado, sour cream, lime juice, and 1/4 cup water in a food processor, adding more water to thin as needed, until smooth and creamy; season with salt. Top enchiladas with onion slices and drizzle with avocado cream. Serve with lime wedges for squeezing over.",
            "Preheat oven to 425°F. Heat oil in a medium skillet over medium-high until it bubbles immediately when edge of tortilla touches the surface. Working one at a time, fry tortillas until just starting to brown and crisp, about 10 seconds per side (they should still be somewhat pliable). Transfer to paper towels to drain.",
            "Dip both sides of each tortilla in chile sauce just to coat, then transfer to a rimmed baking sheet. Spread 1 cup sauce down the length of a 13x9\" baking dish. Spoon 1/4 cup pork mixture across the center of a tortilla and fold one side over filling, then continue to roll up tortilla. Place seam side down in prepared baking dish. Repeat with more sauce and remaining tortillas (enchiladas should be nestled right up against each other in pan). Top with cheese and remaining sauce. Bake until sauce is bubbling and cheese is beginning to brown, 15–20 minutes. Let sit 10 minutes.",
            "Meanwhile, purée avocado, sour cream, lime juice, and 1/4 cup water in a food processor, adding more water to thin as needed, until smooth and creamy; season with salt.",
            "Top enchiladas with onion slices and drizzle with avocado cream. Serve with lime wedges for squeezing over.",
            "Do Ahead Pork can be braised 3 days ahead. Let cool in chile sauce (do not shred); cover and chill.",
            "Pork can be braised 3 days ahead. Let cool in chile sauce (do not shred); cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56c79dced322f7fb05b7cfdc/6:4/w_274%2Ch_169/0216-BA-MPRI-12.jpg"
    }
}