{
    "recipe": {
        "title": "Pork Shoulder Braciola with Ragù ",
        "ingredients": [
            "1 (4-lb.) piece skinless, boneless pork shoulder (Boston butt)",
            "Kosher salt",
            "2 large eggs, beaten to blend",
            "1 head of garlic, cloves separated, half finely chopped, half thinly sliced",
            "1/2 cup panko (Japanese breadcrumbs)",
            "1/3 cup chopped parsley",
            "1 Tbsp. chopped rosemary",
            "1 tsp. freshly ground black pepper",
            "1/2 tsp. crushed red pepper flakes",
            "3 oz. Parmesan, coarsely grated, plus finely grated for serving",
            "2 Tbsp. extra-virgin olive oil",
            "2 (28-oz.) cans whole peeled tomatoes",
            "1 lb. pasta (any shape)"
        ],
        "instructions": [
            "Preheat oven to 225°F. Place pork shoulder, fat side down, on a cutting board with a short end facing you. Holding a long, sharp knife about 1\" above cutting board, make a shallow cut along the entire length of a long side of roast. Continue cutting deeper into the roast, lifting and unfurling meat with your free hand, until it lies flat (be careful not to cut all the way through). Season generously on both sides with salt.",
            "Mix eggs, chopped garlic, panko, parsley, rosemary, black pepper, red pepper flakes, and 3 oz. Parmesan in a medium bowl. Keeping fattier side of pork shoulder facing downward, smear filling all over top side. Roll up roast and tie closed in 3–4 places with kitchen twine.",
            "Heat oil in a large Dutch oven or other heavy pot over medium-high. Sear pork roast until browned all over, 10–12 minutes total. Arrange tomatoes and their juices and sliced garlic all around roast and bring to a simmer. Make sure roast is turned fat side up, cover pot, and transfer to oven. Roast until a skewer easily passes through meat (a thermometer inserted into the center should register 200–205°F), 4–5 hours. Keep covered and let rest in pot 30 minutes.",
            "Transfer pork roast to a cutting board and remove kitchen twine. Gently mash sauce in pot with a spoon or a potato masher (simmer it gently to thicken, if desired). Taste ragù and season with salt if needed. Slice pork 1\" thick.",
            "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente; drain.",
            "Spoon pasta into a serving dish and top with some ragù; toss to coat. Sprinkle with finely grated Parmesan. Transfer pork to a platter; spoon remaining ragù over.",
            "Do Ahead Pork can be stuffed and rolled 2 days before roasting; cover and chill. Pork can be roasted 3 days ahead; let cool, then cover and chill. Reheat gently in sauce before serving.",
            "Pork can be stuffed and rolled 2 days before roasting; cover and chill. Pork can be roasted 3 days ahead; let cool, then cover and chill. Reheat gently in sauce before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aa0123769042d7d145a1692/6:4/w_274%2Ch_169/pork-shoulder-braciola-with-ragu-recipe-BA-030718.jpg",
        "color": 16162682
    }
}