{
    "recipe": {
        "title": "Pork Stew with Sweet & Hot Peppers from the Abruzzo ",
        "ingredients": [
            "6 tablespoons olive oil, plus extra as needed",
            "2 pounds boneless pork shoulder, cut into 1 1/2-inch cubes",
            "Salt and freshly ground black pepper",
            "1 cup dry red wine",
            "1 large yellow onion, finely chopped",
            "5 garlic cloves, minced",
            "1 tablespoon fennel seeds, toasted and crushed",
            "1 fresh hot chile pepper (jalapño or serrano), chopped, or 1/2 teaspoon chile pepper flakes, plus more as needed",
            "One 28-ounce can crushed plum tomatoes with juice",
            "2 large red bell peppers, cut into large dice",
            "Red wine vinegar (optional)"
        ],
        "instructions": [
            "In a skillet or large sauté pan, heat 4 tablespoons of the olive oil over high heat. Working in batches, brown the pork on all sides, adding more olive oil,l as needed and seasoning with salt and black pepper as you turn the meat. Each batch should take 8 to 10 minutes. When a batch is ready, use a slotted spoon to transfer the pieces to the tagine. Deglaze the pan with about one-half the wine and pour the juices over the meat. In a skillet or sauté pan, warm the remaining 2 tablespoons olive oil over medium heat and add the onion. Sauté for about 10 minutes, until very soft. Add the garlic, fennel seeds, and chile pepper and cook for 3 minutes longer. Add the remaining wine and the tomatoes and simmer for a few minutes to blend the flavors. Transfer the sauce to the tagine along with the pork and its juices. Add the bell peppers, raise the heat to medium, and bring to a gentle boil. Reduce the heat to low, cover, and simmer for 1 to 1 1/2 hours, until the pork is meltingly tender. Taste the stew and adjust the seasoning. You can add a few spoonfuls of vinegar for balance.",
            "In a skillet or large sauté pan, heat 4 tablespoons of the olive oil over high heat. Working in batches, brown the pork on all sides, adding more olive oil,l as needed and seasoning with salt and black pepper as you turn the meat. Each batch should take 8 to 10 minutes. When a batch is ready, use a slotted spoon to transfer the pieces to the tagine. Deglaze the pan with about one-half the wine and pour the juices over the meat.",
            "In a skillet or sauté pan, warm the remaining 2 tablespoons olive oil over medium heat and add the onion. Sauté for about 10 minutes, until very soft. Add the garlic, fennel seeds, and chile pepper and cook for 3 minutes longer. Add the remaining wine and the tomatoes and simmer for a few minutes to blend the flavors. Transfer the sauce to the tagine along with the pork and its juices. Add the bell peppers, raise the heat to medium, and bring to a gentle boil. Reduce the heat to low, cover, and simmer for 1 to 1 1/2 hours, until the pork is meltingly tender.",
            "Taste the stew and adjust the seasoning. You can add a few spoonfuls of vinegar for balance."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a4ee62fa7a9917c25780/6:4/w_274%2Ch_169/351490_hires.jpg"
    }
}