{
    "recipe": {
        "title": "Pork Chops with Fig and Grape Agrodolce ",
        "ingredients": [
            "4 (1\"-thick) bone-in pork chops, preferably Frenched (about 2 pounds)",
            "1 1/2 teaspoons kosher salt, divided",
            "1 1/4 teaspoon freshly ground black pepper, divided",
            "4 tablespoons extra-virgin olive oil, divided",
            "3/4 cup balsamic vinegar",
            "1/2 teaspoon crushed red pepper flakes (optional)",
            "2 tablespoons plus 1 teaspoon honey, divided",
            "2 cups seedless red grapes, halved (about 10 ounces)",
            "8 ounces fresh black Mission figs, halved",
            "3 sprigs rosemary",
            "1/4 cup (1/2 stick) cold unsalted butter, cubed",
            "1 tablespoon fresh lemon juice",
            "1/2 teaspoon Dijon mustard",
            "1 small head of radicchio (about 10 ounces), leaves separated and cut into medium pieces",
            "1 cup (loosely packed) parsley leaves"
        ],
        "instructions": [
            "Preheat oven to 400°F. Season pork chops on both sides with 1 1/4 tsp. salt and 1 tsp. pepper.",
            "Heat 1 Tbsp. oil in a large skillet over high. Working in batches if needed, sear pork chops until browned, about 2 minutes per side. Transfer chops to a wire rack set inside a rimmed baking sheet; reserve pan drippings in skillet. Roast pork until an instant-read thermometer inserted into the center registers 135°F, about 15 minutes. Let pork rest 5 minutes.",
            "Meanwhile, heat skillet with drippings over medium-high. Add vinegar and cook, scraping up drippings with a wooden spoon. Stir in red pepper flakes, if using, 2 Tbsp. honey, and 1/4 tsp. salt. Add grapes, figs, and rosemary and stir to coat. Continue to cook, stirring occasionally, until sauce is thickened and fruit is softened, about 8 minutes. Remove from heat and stir in butter.",
            "Whisk lemon juice, mustard, and remaining 3 Tbsp. oil, 1 tsp. honey, 1/2 tsp. salt, and 1/4 tsp. pepper in a large bowl. Add radicchio and parsley and toss to coat.",
            "Divide radicchio salad and pork chops among plates. Top with agrodolce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59d3b675db1b7a7ffca98a9c/6:4/w_274%2Ch_169/GFAF-Pork-Chops-with-Grape-and-Fig-Agrodolce-and-Radicchio-Salad-recipe-28092017.jpg"
    }
}