{
    "recipe": {
        "title": "Pork Shoulder Cutlets with Fennel and Asparagus Salad ",
        "ingredients": [
            "1 1/4 pounds boneless pork shoulder (Boston butt), fat trimmed to 1/4\", cut into 4 steaks",
            "3/4 cup all-purpose flour",
            "2 large eggs, room temperature",
            "1 1/2 cups dried breadcrumbs",
            "2 tablespoons cornstarch",
            "Kosher salt, freshly ground pepper",
            "3/4 cup vegetable oil",
            "Flaky sea salt",
            "1 small fennel bulb, cored, thinly sliced, plus 2 tablespoons fennel fronds",
            "6 asparagus, shaved lengthwise into ribbons with a vegetable peeler",
            "1/2 small red onion, thinly sliced",
            "1/2 cup fresh parsley leaves",
            "2 tablespoons fresh lemon juice, plus lemon wedges for serving",
            "2 tablespoons olive oil"
        ],
        "instructions": [
            "Pound pork steaks between 2 layers of plastic wrap to 1/4\" thick. Place flour in a shallow bowl. Lightly beat eggs in another shallow bowl. Toss breadcrumbs and cornstarch in a third shallow bowl; season with kosher salt and pepper.",
            "Working one at a time, season cutlets with kosher salt and pepper, then dredge in flour, shaking off excess. Transfer to bowl with egg and turn to coat. Lift from bowl, allowing excess to drip off. Coat with breadcrumb mixture, pressing to adhere.",
            "Heat vegetable oil in a large skillet over medium-high. Working in 2 batches, cook cutlets, shaking pan occasionally, until golden brown and cooked through, about 3 minutes per side. Transfer to a wire rack; season with sea salt.",
            "Combine fennel, fennel fronds, asparagus, onion, and parsley in a medium bowl. Toss with lemon juice and olive oil; season with kosher salt and pepper. Serve salad alongside cutlets with lemon wedges for squeezing over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5537e19567c3a7e837c3e7f3/6:4/w_274%2Ch_169/56389370_pork-shoulder-fennel-asparagus-salad_1x1.jpg",
        "color": 8748949
    }
}