{
    "recipe": {
        "title": "Pork Tenderloin with Pears and Shallots ",
        "ingredients": [
            "3 tablespoons olive oil",
            "2 garlic cloves, finely chopped",
            "1 tablespoon chopped fresh thyme plus fresh thyme sprigs for garnish",
            "1 1 1/4-pound pork tenderloin",
            "3 large shallots, each cut into 6 wedges through stem end, peeled",
            "3 unpeeled small Bosc or Anjou pears, quartered, cored",
            "4 teaspoons butter, room temperature",
            "2 teaspoons all purpose flour",
            "1 1/2 cups low-salt chicken broth",
            "3/4 cup pear nectar"
        ],
        "instructions": [
            "Preheat oven to 475°F. Mix oil, garlic, and chopped thyme in small bowl. Rub mixture over pork, shallots, and pears. Heat large ovenproof nonstick skillet over mediumhigh heat. Add pork and shallots; brown on all sides, turning, about 7 minutes. Transfer shallots to platter. Transfer pork to baking sheet (do not clean skillet). Roast pork until thermometer inserted into center registers 145°F, about 10 minutes. Meanwhile, add pears to same skillet and cook over medium-high heat until brown on cut side, turning once or twice, about 4 minutes. Transfer pears to platter (do not clean skillet). Mix butter and flour in small cup. Add broth, pear nectar, and butter mixture to same skillet; boil until sauce thickens, scraping up browned bits, about 7 minutes. Slice pork; arrange on platter. Surround with pears and shallots. Drizzle sauce over pork. Garnish with thyme sprigs.",
            "Preheat oven to 475°F. Mix oil, garlic, and chopped thyme in small bowl. Rub mixture over pork, shallots, and pears. Heat large ovenproof nonstick skillet over mediumhigh heat. Add pork and shallots; brown on all sides, turning, about 7 minutes. Transfer shallots to platter. Transfer pork to baking sheet (do not clean skillet). Roast pork until thermometer inserted into center registers 145°F, about 10 minutes.",
            "Meanwhile, add pears to same skillet and cook over medium-high heat until brown on cut side, turning once or twice, about 4 minutes. Transfer pears to platter (do not clean skillet).",
            "Mix butter and flour in small cup. Add broth, pear nectar, and butter mixture to same skillet; boil until sauce thickens, scraping up browned bits, about 7 minutes.",
            "Slice pork; arrange on platter. Surround with pears and shallots. Drizzle sauce over pork. Garnish with thyme sprigs."
        ],
        "picture_link": null
    }
}