{
    "recipe": {
        "title": "Portobello and Poblano Enchiladas ",
        "ingredients": [
            "1/4 cup distilled white vinegar",
            "1 tablespoon sugar",
            "5 tablespoons fresh lime juice (from about 2 limes), divided",
            "1 large red onion, thinly sliced, divided",
            "1 canned chipotle chile in adobo",
            "2 1/4 cups heavy cream, divided",
            "1 teaspoon kosher salt, divided",
            "3 tablespoons vegetable oil",
            "3 large portobello mushrooms, stemmed, thinly sliced",
            "1 poblano chile, cut into 1/4\" strips",
            "1 garlic clove, finely chopped",
            "12 corn tortillas",
            "6 ounces queso fresco, crumbled (about 1 cup), divided",
            "1/3 cup cilantro, coarsely chopped, divided",
            "3/4 cup grated cheddar"
        ],
        "instructions": [
            "Preheat oven to 350°F. Combine vinegar, sugar, and 4 Tbsp. lime juice in a small bowl. Stir in half of the onion, cover, and set aside. Purée chipotle chile and 1/4 cup cream in a blender until smooth. Transfer to a medium bowl; stir in 1/4 tsp. salt and remaining 2 cups cream and 1 Tbsp. lime juice. Heat oil in a large heavy skillet over medium-high until hot but not smoking. Add mushrooms, poblano chile, garlic, and remaining onion and cook, stirring occasionally, until mushrooms are tender and onions are translucent, about 10 minutes. Season with remaining 3/4 tsp. salt. Meanwhile, stack tortillas with damp paper towels between each one, then wrap the stack in a clean dish cloth. Microwave for 45 seconds. Keep stack wrapped. Spread 1/2 cup cream sauce on the bottom of a 9x13\" baking dish. Transfer remaining sauce to a wide shallow bowl and dip tortillas, one at a time, into sauce to coat. Stack dipped tortillas on a work surface. Sprinkle 1 Tbsp. queso fresco down center of 1 tortilla. Top with 1/4 cup mushroom mixture, arranging down center over cheese. Top with 1 tsp. cilantro. Roll up tortilla and place, seam side down, in prepared baking dish. Repeat with remaining tortillas. Spoon remaining sauce over enchiladas, making sure to cover entirely with sauce. Top with cheddar and remaining 3 Tbsp. queso fresco. Bake enchiladas until cheese is melted and edges of tortillas are toasted, 25–30 minutes. Top with reserved pickled onion and remaining 1 Tbsp. cilantro.",
            "Preheat oven to 350°F. Combine vinegar, sugar, and 4 Tbsp. lime juice in a small bowl. Stir in half of the onion, cover, and set aside.",
            "Purée chipotle chile and 1/4 cup cream in a blender until smooth. Transfer to a medium bowl; stir in 1/4 tsp. salt and remaining 2 cups cream and 1 Tbsp. lime juice.",
            "Heat oil in a large heavy skillet over medium-high until hot but not smoking. Add mushrooms, poblano chile, garlic, and remaining onion and cook, stirring occasionally, until mushrooms are tender and onions are translucent, about 10 minutes. Season with remaining 3/4 tsp. salt.",
            "Meanwhile, stack tortillas with damp paper towels between each one, then wrap the stack in a clean dish cloth. Microwave for 45 seconds. Keep stack wrapped.",
            "Spread 1/2 cup cream sauce on the bottom of a 9x13\" baking dish. Transfer remaining sauce to a wide shallow bowl and dip tortillas, one at a time, into sauce to coat. Stack dipped tortillas on a work surface.",
            "Sprinkle 1 Tbsp. queso fresco down center of 1 tortilla. Top with 1/4 cup mushroom mixture, arranging down center over cheese. Top with 1 tsp. cilantro. Roll up tortilla and place, seam side down, in prepared baking dish. Repeat with remaining tortillas. Spoon remaining sauce over enchiladas, making sure to cover entirely with sauce. Top with cheddar and remaining 3 Tbsp. queso fresco.",
            "Bake enchiladas until cheese is melted and edges of tortillas are toasted, 25–30 minutes. Top with reserved pickled onion and remaining 1 Tbsp. cilantro.",
            "Do ahead Sauce can be made 1 day ahead. Cover and chill.",
            "Sauce can be made 1 day ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5643c3504cc2d53b6f514d97/6:4/w_274%2Ch_169/EP_-32.jpg"
    }
}