{
    "recipe": {
        "title": "Porterfield Pumpkin Bundt with Snow White Glaze ",
        "ingredients": [
            "3 1/3 cups sifted all-purpose flour",
            "1 1/2 teaspoons baking powder",
            "1/4 teaspoon baking soda",
            "3/4 teaspoon salt",
            "2 teaspoons ground cinnamon",
            "1 1/2 teaspoons ground nutmeg",
            "3/4 teaspoon ground ginger",
            "1/2 teaspoon ground allspice or mace",
            "1/8 teaspoon ground cloves",
            "1 1/2 cups granulated sugar",
            "1 1/4 cups dark brown sugar, packed",
            "1 cup canola or light olive oil",
            "5 large eggs, at room temperature",
            "2 cups canned unsweetened pumpkin",
            "2/3 cup orange juice or milk (or buttermilk if using)",
            "1 1/2 cups sifted confectioners' sugar",
            "2 tablespoons honey",
            "Scant pinch of salt",
            "2 to 3 drops fresh lemon juice",
            "1/4 teaspoon vanilla extract",
            "2 to 3 tablespoons milk or cream, or as needed",
            "Garnish: 1/4 cups chopped walnuts, optional",
            "Pan Preparation: Generously coat the pan with butter-flavor nonstick vegetable spray or solid shortening, dust with flour, and tap out the excess flour.",
            "A 9 1/2- to 10-inch (10- to 12-cup) Bundt or plain tube pan; baking parchment, wax paper, or aluminum foil; sifter; foil-covered 10-inch cardboard cake disk or flat plate; wooden skewer or cake tester"
        ],
        "instructions": [
            "Make pumpkin bundt: Position rack in lower third of oven. Preheat oven to 350°F and bake 65 to 70 minutes. Prepare the pan as directed. In a medium bowl, whisk together the sifted flour, baking powder (if using), baking soda, salt and spices. Set aside. Add the granulated sugar to the large bowl of an electric mixer and crumble in the dark brown sugar, breaking up any clumps with your fingers. Add the oil and 2 eggs and beat until blended, then beat in the remaining eggs and the pumpkin. Scrape down the bowl and beater. With the mixer on the lowest speed, alternately add the juice or milk (or buttermilk if using) and the dry ingredients. When everything is blended, scrape down the bowl, then beat a few seconds longer until the batter is smooth and creamy. Scoop the batter into the prepared pan. Bake for 65 to 70 minutes (or for the time indicated for your altitude in the chart) or until the cake has risen, is springy to the touch and is cracked on top, and a cake tester inserted in the center comes out dry. Cool the cake in its pan on a rack for 20 to 25 minutes. Slide a knife around the pan sides and the top of the tube to release the cake. Top the cake with a foil-covered cardboard cake disk or a flat plate, invert, and lift off the pan. Peel off the paper, if you used it. Cool the cake completely.",
            "Position rack in lower third of oven. Preheat oven to 350°F and bake 65 to 70 minutes. Prepare the pan as directed.",
            "In a medium bowl, whisk together the sifted flour, baking powder (if using), baking soda, salt and spices. Set aside.",
            "Add the granulated sugar to the large bowl of an electric mixer and crumble in the dark brown sugar, breaking up any clumps with your fingers. Add the oil and 2 eggs and beat until blended, then beat in the remaining eggs and the pumpkin. Scrape down the bowl and beater.",
            "With the mixer on the lowest speed, alternately add the juice or milk (or buttermilk if using) and the dry ingredients. When everything is blended, scrape down the bowl, then beat a few seconds longer until the batter is smooth and creamy.",
            "Scoop the batter into the prepared pan. Bake for 65 to 70 minutes (or for the time indicated for your altitude in the chart) or until the cake has risen, is springy to the touch and is cracked on top, and a cake tester inserted in the center comes out dry. Cool the cake in its pan on a rack for 20 to 25 minutes.",
            "Slide a knife around the pan sides and the top of the tube to release the cake. Top the cake with a foil-covered cardboard cake disk or a flat plate, invert, and lift off the pan. Peel off the paper, if you used it. Cool the cake completely.",
            "Make glaze: Whisk together all the ingredients until smooth and creamy. Add a drop more of milk if necessary. The glaze should have a soft, just slightly runny (but not liquefied) consistency. Use the glaze as soon as it is prepared.",
            "Whisk together all the ingredients until smooth and creamy. Add a drop more of milk if necessary. The glaze should have a soft, just slightly runny (but not liquefied) consistency. Use the glaze as soon as it is prepared.",
            "Spread the glaze on the top of the cake, letting it drip down the sides. While the glaze is still soft, sprinkle on the nuts, if desired. The glaze hardens as it dries.",
            "Spread the glaze on the top of the cake, letting it drip down the sides. While the glaze is still soft, sprinkle on the nuts, if desired. The glaze hardens as it dries."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a4af3a00aeb2f1cf7d2/6:4/w_274%2Ch_169/240344.jpg"
    }
}