{
    "recipe": {
        "title": "Portuguese Chicken ",
        "ingredients": [
            "1 cup all purpose flour",
            "1 tablespoon plus 1/4 teaspoon Hungarian sweet paprika",
            "1 3- to 3 1/4-pound chicken, cut into 8 pieces",
            "2 tablespoons extra-virgin olive oil",
            "1 14.5-ounce can diced tomatoes in juice",
            "4 ounces thinly sliced prosciutto, chopped",
            "12 cipolline onions or 1-inch-diameter pearl onions, blanched 1 minute, peeled",
            "2 large roasted red peppers from jar, halved, cut into 3/4-inch-wide strips",
            "6 large garlic cloves, pressed",
            "4 large fresh Italian parsley sprigs",
            "4 large fresh bay leaves, bruised",
            "1/2 cup dry white wine",
            "1/2 cup tawny Port",
            "1 tablespoon Dijon mustard",
            "1 tablespoon tomato paste",
            "1 tablespoon butter, room temperature (optional)"
        ],
        "instructions": [
            "Preheat oven to 350°F. Whisk 1 cup flour, 1 tablespoon paprika, 1 1/2 teaspoons salt, and 1/2 teaspoon freshly ground black pepper in large bowl. Add chicken pieces to seasoned flour, 1 at a time, and turn to coat. Heat oil in heavy large skillet over medium-high heat. Add chicken, skin side down, and sauté until brown, 3 to 5 minutes per side. Transfer chicken to plate; reserve skillet.",
            "Arrange chicken in single layer in large ovenproof pot. Top with tomatoes and juice, prosciutto, onions, peppers, garlic, parsley, and bay leaves; sprinkle with 1/4 teaspoon paprika. Add wine and Port to reserved skillet. Bring to boil, scraping up browned bits. Remove from heat. Whisk in mustard and tomato paste; pour mixture over chicken and bring to boil. Cover; transfer to oven.",
            "Braise chicken until very tender, about 1 1/2 hours. Discard bay leaves and parsley. Using tongs, transfer chicken and toppings to platter. Return sauce in pot to simmer. If thicker sauce is desired, stir 1 tablespoon flour and butter in small bowl until smooth paste forms. Add flour paste to sauce and whisk to blend. Simmer until sauce thickens to desired consistency, whisking often. Season sauce to taste with salt and pepper. Spoon over chicken and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b42485d5e8c3e1070b2a16/6:4/w_274%2Ch_169/363753_portuguese-chicken_1x1.jpg",
        "color": 16066137
    }
}