{
    "recipe": {
        "title": "Porterhouse Steak with Herbed Butter ",
        "ingredients": [
            "1/4 cup mixed fresh herbs, such as chives, thyme leaves, and marjoram leaves, finely chopped",
            "1/2 cup (1 stick) unsalted butter, at room temperature",
            "Kosher salt",
            "Freshly ground black pepper",
            "2 porterhouse steaks, (2-inch thick), about 4 pounds",
            "2 tablespoons vegetable oil",
            "2 tablespoons butter",
            "Kosher salt",
            "Freshly ground black pepper"
        ],
        "instructions": [
            "In a bowl, using a wooden spoon, stir together the herbs and butter. Season to taste with salt and pepper. Spoon mixture generously into ramekins and use the back of a butter knife to smooth the surface, removing any extra. Cover with plastic wrap and place in the refrigerator.",
            "Cook the steak: Preheat oven to 350°F. Let steak sit at room temperature for 30 minutes. Pat steaks dry and season generously with salt and pepper. Heat a large skillet over medium-high heat, and add 1 tablespoon oil to pan. When oil begins to smoke, add the first steak and cook until brown and crusted, 3 to 4 minutes per side. Melt 1 tablespoon of butter in pan and spoon over steak to baste. Remove steak from heat and set aside. Wipe out the skillet and repeat with the second steak. Place both steaks on a rimmed baking sheet fitted with a wire rack and place in oven to cook until an instant-read thermometer inserted into the center of the steak registers 120°F for medium-rare, about 5 minutes (or 125°F for medium, about 10 minutes). Transfer steaks to a wooden board to rest, about 10 minutes. To serve: Cut meat off both sides of the bone, leaving you with two pieces of steak. Slice each steak across the grain, then rearrange the slices around the bone on a platter. Serve with herbed butter.",
            "Preheat oven to 350°F. Let steak sit at room temperature for 30 minutes.",
            "Pat steaks dry and season generously with salt and pepper. Heat a large skillet over medium-high heat, and add 1 tablespoon oil to pan. When oil begins to smoke, add the first steak and cook until brown and crusted, 3 to 4 minutes per side. Melt 1 tablespoon of butter in pan and spoon over steak to baste. Remove steak from heat and set aside. Wipe out the skillet and repeat with the second steak.",
            "Place both steaks on a rimmed baking sheet fitted with a wire rack and place in oven to cook until an instant-read thermometer inserted into the center of the steak registers 120°F for medium-rare, about 5 minutes (or 125°F for medium, about 10 minutes). Transfer steaks to a wooden board to rest, about 10 minutes.",
            "To serve: Cut meat off both sides of the bone, leaving you with two pieces of steak. Slice each steak across the grain, then rearrange the slices around the bone on a platter. Serve with herbed butter."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54bd65ede231becc7f3d565b/6:4/w_274%2Ch_169/porterhouse-steak-herbed-butter-6x4.jpg"
    }
}