{
    "recipe": {
        "title": "Pot Roast with Orange and Dates ",
        "ingredients": [
            "2 (2 1/2-pound) boneless beef chuck roasts, each about 7x4x2 inches",
            "4 teaspoons sugar",
            "3 tablespoons olive oil, divided",
            "1 pound onions, thinly sliced",
            "6 tablespoons red wine vinegar",
            "1/2 teaspoon ground allspice",
            "2 cups low-salt chicken broth",
            "1 cup orange juice",
            "1/2 cup tomato sauce",
            "2 cups pitted dates",
            "1/2 cup chopped fresh Italian parsley"
        ],
        "instructions": [
            "Preheat oven to 350°F. Sprinkle roasts on each side with salt, pepper, and 1 teaspoon sugar. Heat 2 tablespoons oil in heavy wide ovenproof pot over medium-high heat. Add roasts. Cook until brown, about 8 minutes per side; transfer to plate. Add 1 tablespoon oil and onions to pot. Sauté until dark brown, stirring often, about 10 minutes. Mix in vinegar and allspice; boil until reduced to glaze, scraping up browned bits. Add broth, orange juice, and tomato sauce; bring to boil. Return roasts and accumulated juices to pot. Scatter dates around roasts; sprinkle with parsley. Cover pot; place in oven. Braise roasts 1 hour. Turn roasts over, cover, and braise until tender, about 1 hour. Tilt pot; spoon off fat from top of sauce. Cool uncovered 1 hour. DO AHEAD Can be made 2 days ahead. Chill uncovered until cold; cover and keep chilled. Preheat oven to 350°F. Transfer roasts to board, scraping sauce into pot. Cut crosswise into 1/2-inch-thick slices; overlap slices in baking dish. Spoon sauce over. Cover; rewarm about 25 minutes.",
            "Preheat oven to 350°F. Sprinkle roasts on each side with salt, pepper, and 1 teaspoon sugar. Heat 2 tablespoons oil in heavy wide ovenproof pot over medium-high heat. Add roasts. Cook until brown, about 8 minutes per side; transfer to plate. Add 1 tablespoon oil and onions to pot. Sauté until dark brown, stirring often, about 10 minutes. Mix in vinegar and allspice; boil until reduced to glaze, scraping up browned bits. Add broth, orange juice, and tomato sauce; bring to boil. Return roasts and accumulated juices to pot. Scatter dates around roasts; sprinkle with parsley.",
            "Cover pot; place in oven. Braise roasts 1 hour. Turn roasts over, cover, and braise until tender, about 1 hour. Tilt pot; spoon off fat from top of sauce. Cool uncovered 1 hour. DO AHEAD Can be made 2 days ahead. Chill uncovered until cold; cover and keep chilled.",
            "Preheat oven to 350°F. Transfer roasts to board, scraping sauce into pot. Cut crosswise into 1/2-inch-thick slices; overlap slices in baking dish. Spoon sauce over. Cover; rewarm about 25 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9974f9a84192308a19cc/6:4/w_274%2Ch_169/237903.jpg"
    }
}