{
    "recipe": {
        "title": "Potato Rolls with Caraway Salt ",
        "ingredients": [
            "1 8-ounce russet potato, peeled, cut into 1\" pieces",
            "4 tablespoons (1/2 stick) unsalted butter plus more for bowl and pan",
            "1 cup whole milk",
            "2 tablespoons sugar, divided",
            "1 1/2 teaspoons kosher salt, divided",
            "1 1/4-ounce package (2 1/2 teaspoons) active dry yeast",
            "3 3/4 cups (or more) all-purpose flour, divided, plus more for surface",
            "1 teaspoon toasted caraway seeds, lightly crushed",
            "1 teaspoon pretzel salt or sea salt",
            "1 large egg",
            "2 teaspoons heavy cream",
            "A 13x9x2\" baking pan"
        ],
        "instructions": [
            "Place the potato in a small saucepan and add water to cover by 1\". Bring to a boil; reduce heat to medium and simmer until potato is tender, about 15 minutes. Drain, reserving 1/4 cup cooking liquid in a small microwave-safe bowl.",
            "Meanwhile, melt 4 tablespoons butter in another small saucepan. Add milk; stir until warm, about 1 minute, and set aside. Transfer cooked potato to a large bowl.",
            "Mash with a fork, then stir in milk mixture, 1 tablespoon sugar, and 1/2 teaspoon salt (mixture will be slightly lumpy).",
            "Rewarm potato cooking liquid in microwave (or let cool) until an instant-read thermometer registers 105°F-110°F. Stir in remaining 1 tablespoon sugar, 1 teaspoon salt, and yeast; let stand until foamy, about 10 minutes. Add yeast mixture to potato mixture and stir to combine. Add 3 1/4 cups flour with a wooden spoon and stir until a sticky dough forms.",
            "Turn dough onto a floured surface and knead, dusting surface, dough, and your hands often with remaining 1/2 cup flour to keep dough from sticking, until dough is smooth, elastic, and slightly sticky, 7-8 minutes. Form into a ball and transfer to a buttered bowl. Turn to coat dough with butter and cover bowl with plastic wrap. Let dough rise, chilled, overnight.",
            "Butter baking pan. Mix caraway seeds and pretzel salt in a small bowl; set aside. Punch down dough (do not knead). Cut dough in half, then roll each piece into a 12\"-long log. Cut each log into 12 equal pieces, then roll each piece into a ball (for 24 total). Arrange in pan, evenly spaced, in 6 rows of 4. Cover loosely with plastic wrap. Let rise in a warm, draft-free place until almost doubled in size, about 1 hour.",
            "Arrange a rack in middle of oven and preheat to 375°F. Whisk egg and cream in a small bowl; brush tops of rolls with some of egg wash. Sprinkle with caraway salt. Bake, rotating pan once, until rolls are cooked through and deep golden, 25-30 minutes. Transfer to wire rack and let cool in pan for 5 minutes, then run a sharp knife around edges to loosen from pan; do not separate rolls. Transfer to rack and let cool for 10 minutes. DO AHEAD: Can be made 8 hours ahead. Rewarm, wrapped in foil, in a 300°F oven until heated through. Serve warm."
        ],
        "picture_link": "https://assets.epicurious.com/photos/563cec929978979816f026e6/6:4/w_274%2Ch_169/368965_potato-rolls_1x1.jpg"
    }
}