{
    "recipe": {
        "title": "Potato Salad with Bacon and Eggs ",
        "ingredients": [
            "6 medium russet potatoes (about 2 lb.), peeled, cut into 1\" pieces",
            "2 Tbsp. plus 1/2 tsp. kosher salt",
            "3 large eggs",
            "4 slices bacon",
            "1 cup mayonnaise",
            "1/2 cup sour cream",
            "2 Tbsp. dill relish",
            "1 Tbsp. Dijon mustard",
            "1 Tbsp. garlic powder",
            "1 Tbsp. freshly ground black pepper",
            "1 cup halved cherry tomatoes",
            "1/2 cup halved pitted black olives from a can"
        ],
        "instructions": [
            "Place potatoes in a large pot and pour in cold water to cover by 2\". Add 2 Tbsp. salt and bring to a boil. Reduce heat and simmer until potatoes are just tender, about 15 minutes. Drain, then let cool slightly (the potatoes should be warm when you dress them, which will help them soak up the dressing). Meanwhile, cook eggs in a large saucepan of boiling water 8 minutes (whites and yolks will be set). Drain; transfer to a bowl of ice water and let cool. Drain, peel, and quarter eggs. Cook bacon in a large skillet over medium heat, turning halfway through, until brown and crisp, 8–10 minutes. Transfer bacon to paper towels to drain and let cool slightly. Tear into 1\" pieces. Reserve 2 Tbsp. bacon fat in pan. Whisk mayonnaise, sour cream, relish, mustard, garlic powder, pepper, and remaining 1/2 tsp. salt in a large bowl. Add potatoes, eggs, tomatoes, olives, half of bacon, and reserved bacon fat and fold gently until combined and completely coated. Transfer salad to a platter and top with remaining bacon.",
            "Place potatoes in a large pot and pour in cold water to cover by 2\". Add 2 Tbsp. salt and bring to a boil. Reduce heat and simmer until potatoes are just tender, about 15 minutes. Drain, then let cool slightly (the potatoes should be warm when you dress them, which will help them soak up the dressing).",
            "Meanwhile, cook eggs in a large saucepan of boiling water 8 minutes (whites and yolks will be set). Drain; transfer to a bowl of ice water and let cool. Drain, peel, and quarter eggs.",
            "Cook bacon in a large skillet over medium heat, turning halfway through, until brown and crisp, 8–10 minutes. Transfer bacon to paper towels to drain and let cool slightly. Tear into 1\" pieces. Reserve 2 Tbsp. bacon fat in pan.",
            "Whisk mayonnaise, sour cream, relish, mustard, garlic powder, pepper, and remaining 1/2 tsp. salt in a large bowl. Add potatoes, eggs, tomatoes, olives, half of bacon, and reserved bacon fat and fold gently until combined and completely coated. Transfer salad to a platter and top with remaining bacon."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b16faff100fee1fe1c8f356/6:4/w_274%2Ch_169/potato-and-egg-salad-with-cherry-tomatoes-and-olives-recipe-BA-060518.jpg"
    }
}