{
    "recipe": {
        "title": "Potato Gratin with Gruyère and Crème Fraîche ",
        "ingredients": [
            "3 pounds russet potatoes, peeled, cut into 1/8-inch-thick rounds",
            "1 1/2 cups crème fraîche,* stirred to loosen",
            "1 1/2 cups (packed) grated Gruyère cheese (about 6 ounces)",
            "2 tablespoons chopped fresh Italian parsley"
        ],
        "instructions": [
            "Preheat oven to 400°F. Generously butter 13x9x2-inch glass baking dish. Arrange half of potato slices in bottom of prepared dish, overlapping slightly. Sprinkle generously with salt and pepper. Spread half of crème fraîche over potatoes and sprinkle with half of cheese. Top with remaining potatoes, overlapping slightly; sprinkle generously with salt and pepper. Spread with remaining crème fraîche; sprinkle with remaining cheese. Bake gratin uncovered 30 minutes. Reduce oven temperature to 350°F. Continue to bake gratin until potatoes are tender and top is golden brown, about 45 minutes. Remove from oven; let stand 10 minutes. Sprinkle with parsley and serve.",
            "Preheat oven to 400°F. Generously butter 13x9x2-inch glass baking dish. Arrange half of potato slices in bottom of prepared dish, overlapping slightly. Sprinkle generously with salt and pepper. Spread half of crème fraîche over potatoes and sprinkle with half of cheese. Top with remaining potatoes, overlapping slightly; sprinkle generously with salt and pepper. Spread with remaining crème fraîche; sprinkle with remaining cheese.",
            "Bake gratin uncovered 30 minutes. Reduce oven temperature to 350°F. Continue to bake gratin until potatoes are tender and top is golden brown, about 45 minutes. Remove from oven; let stand 10 minutes. Sprinkle with parsley and serve.",
            "Available at some supermarkets. If unavailable, heat 1 1/2 cups whipping cream to lukewarm (85°F). Remove from heat and mix in 3 tablespoons buttermilk. Cover and let stand in warm draft-free area until slightly thickened, 24 to 48 hours, depending on temperature of room. Chill until ready to use.",
            "Available at some supermarkets. If unavailable, heat 1 1/2 cups whipping cream to lukewarm (85°F). Remove from heat and mix in 3 tablespoons buttermilk. Cover and let stand in warm draft-free area until slightly thickened, 24 to 48 hours, depending on temperature of room. Chill until ready to use.",
            "Available at some supermarkets. If unavailable, heat 1 1/2 cups whipping cream to lukewarm (85°F). Remove from heat and mix in 3 tablespoons buttermilk. Cover and let stand in warm draft-free area until slightly thickened, 24 to 48 hours, depending on temperature of room. Chill until ready to use."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea14df9a84192308a94f3/6:4/w_274%2Ch_169/107310.jpg"
    }
}