{
    "recipe": {
        "title": "Potatoes with Roasted Poblano Chiles and Mexican Sour Cream (Papas con Rajas y Crema Ácida) ",
        "ingredients": [
            "5 large poblano chiles, stemmed, seeded, and veins removed (or not, depending on how spicy you want this to be)",
            "2 large Yukon gold potatoes or another waxy potato, cut into 1/2-inch / 12mm cubes",
            "1 Tbsp sea salt, plus more as needed",
            "1 Tbsp safflower oil",
            "1 large white onion, thinly sliced",
            "1 cup / 240g Homemade Mexican Crema or crème fraîche"
        ],
        "instructions": [
            "On an ungreased comal or in a cast-iron skillet over high heat, roast the chiles, turning them over every couple of minutes using tongs or your hands (carefully, so you don’t get burned). You’re looking for uniform blistering, but you don’t want them to become too soggy in the process, especially if you intend to stuff them, since they need to hold their shape. The process will probably take 10 to 15 minutes. Once they are well blistered and before the flesh is completely charred through in any spots, place the peppers in a plastic container with a tight-fitting lid or in a bowl that you can cover with a plate (not a towel or anything porous) and set aside to “sweat” for about 10 minutes, or until they are cool enough to handle.",
            "Remove the charred skin from the whole chiles. Once you have removed and discarded the skin and seeds, cut them into rajas, or strips, about the width of fettuccine.",
            "In a small saucepan, cover the potatoes with 2 inches / 5cm water and add the salt. Bring to a boil over medium-high heat, then decrease to low and simmer for about 5 minutes. Remove one of the potatoes and taste it. The piece should be soft but not falling apart, still holding its cube shape. Cubed like this, they will cook quite quickly, so be attentive. Once they have the right texture, drain the potatoes and set aside in a medium bowl with a lid or cover the pan with a plate to keep them warm.",
            "Using the same comal or skillet in which you toasted your chiles, heat the oil over medium-high heat until it’s hot but not smoking. Add the onion and sauté until it’s translucent but not browned.",
            "In a saucepan, combine the potatoes, chiles, onion, and crema or crème fraîche. Bring to a boil, then turn off the heat and let it sit for 5 to 10 minutes. As the mixture cools, the starches will absorb some of the melted cream and help it firm up. Taste and add more salt if needed. Serve as you wish!",
            "Do Ahead: These potatoes can be stored in a sealed container in the refrigerator for up to 2 days."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5cc8b4ea3efaa816c72da90f/6:4/w_274%2Ch_169/Papas-con-Rajas-18042019.jpg",
        "color": 11883912
    }
}