{
    "recipe": {
        "title": "Potato Blinis ",
        "ingredients": [
            "1 pound Yukon Gold potatoes, scrubbed",
            "3 large egg yolks, room temperature",
            "1 large egg, room temperature",
            "1/2 cup sour cream, room temperature",
            "1/4 cup all-purpose flour",
            "1 1/2 teaspoon kosher salt",
            "1/2 teaspoon finely ground black pepper",
            "1/4 teaspoon baking soda",
            "1/4 teaspoon ground nutmeg",
            "2 tablespoons unsalted butter, melted, slightly cooled",
            "A food mill or potato ricer"
        ],
        "instructions": [
            "Preheat oven to 425°F. Prick potatoes all over with a fork and bake on a rimmed baking sheet until very tender and a knife slides easily through flesh, 60–70 minutes. Let cool slightly. Reduce oven temperature to 200°F.",
            "Meanwhile, whisk egg yolks, egg, and sour cream in a medium bowl to combine; set sour cream mixture aside.",
            "Cut potatoes in half lengthwise and scoop flesh from skins; discard skins. Pass flesh through food mill or ricer fitted with the small-hole disk into a large bowl. Working quickly, sprinkle flour, salt, pepper, baking soda, and nutmeg over potatoes; toss lightly with a fork to distribute ingredients, fluff potatoes, and break up any clumps. Make a well in the center and pour in reserved sour cream mixture. Whisk in a circular motion, working from the center out to incorporate, just until smooth (it should look like a thick pancake batter). Cover; let sit 10 minutes.",
            "Heat a large skillet, preferably nonstick or cast iron, over medium-low. Brush skillet with a thin layer of butter. Spoon scant tablespoonfuls of batter into skillet, spacing about 1” apart. Cook blinis until undersides are golden brown and surfaces look matte and bubbles form on top, about 90 seconds. Gently flip and cook until other sides are golden brown, about 1 minute. Transfer to a wire rack set inside a rimmed baking sheet and keep warm until ready to serve (up to 1 hour before). Repeat with remaining batter, wiping out skillet between batches and brushing with more butter."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58486ca4090516be27b93bde/6:4/w_274%2Ch_169/potato-blinis-120716.jpg"
    }
}