{
    "recipe": {
        "title": "Potato and Poblano Chile Gratin ",
        "ingredients": [
            "3 pounds red-skinned potatoes",
            "1 tablespoon olive oil",
            "5 fresh poblano chiles, seeded, peeled, chopped (about 4 cups)",
            "1 medium onion, sliced",
            "2 cups whipping cream",
            "1 cup whole milk",
            "1 large garlic clove",
            "2 1/2 cups (packed) grated Gruyère cheese (about 10 ounces)"
        ],
        "instructions": [
            "Preheat oven to 350°F. Butter 13x9x2-inch glass baking dish. Cook potatoes in pot of boiling salted water until tender, about 25 minutes. Drain potatoes in colander; cool completely. Peel and slice potatoes into 1/2-inch-thick rounds; place in large bowl. Sprinkle potatoes with salt and pepper. Heat oil in heavy large skillet over medium-high heat. Add chiles and onion and sauté until onion is very soft, about 15 minutes. Transfer chile mixture to food processor. Add cream, milk, and garlic; blend to form thick sauce. Season sauce to taste with salt and pepper. Pour sauce over potatoes; stir gently to coat. Overlap half of potatoes with sauce in bottom of prepared dish. Sprinkle with half of cheese. Top with remaining potatoes and sauce, then remaining cheese. Bake gratin until heated through and brown on top, about 30 minutes.",
            "Preheat oven to 350°F. Butter 13x9x2-inch glass baking dish. Cook potatoes in pot of boiling salted water until tender, about 25 minutes. Drain potatoes in colander; cool completely. Peel and slice potatoes into 1/2-inch-thick rounds; place in large bowl. Sprinkle potatoes with salt and pepper.",
            "Heat oil in heavy large skillet over medium-high heat. Add chiles and onion and sauté until onion is very soft, about 15 minutes. Transfer chile mixture to food processor. Add cream, milk, and garlic; blend to form thick sauce. Season sauce to taste with salt and pepper. Pour sauce over potatoes; stir gently to coat. Overlap half of potatoes with sauce in bottom of prepared dish. Sprinkle with half of cheese. Top with remaining potatoes and sauce, then remaining cheese. Bake gratin until heated through and brown on top, about 30 minutes."
        ],
        "picture_link": null
    }
}