{
    "recipe": {
        "title": "Potato Curry with Tamarind ",
        "ingredients": [
            "3 dried hot red chiles (about 3 inches long), stems removed",
            "1 tablespoon cumin seeds",
            "1 lb medium boiling potatoes (about 5), scrubbed well",
            "3 tablespoons vegetable oil",
            "2 Turkish bay leaves or 1 California",
            "3/4 teaspoon panch phoron (Bengali spice mix)",
            "1/8 teaspoon asafetida powder",
            "1/2 teaspoon ground turmeric",
            "1 cup water plus 1/4 cup boiling water",
            "1 1/2 teaspoons tamarind concentrate",
            "1/2 teaspoon salt",
            "an electric coffee/spice grinder; a wok"
        ],
        "instructions": [
            "Toast chiles and cumin seeds in a dry small heavy skillet, shaking pan occasionally, until fragrant and just a shade darker, about 1 minute. Remove from heat and cool mixture, then finely grind in grinder. Cover potatoes with salted cold water by 1 inch in a 2 1/2- to 3-quart saucepan. Bring to a boil, then simmer, partially covered, until potatoes are just tender when pierced with a small sharp knife, about 12 minutes. Drain. Once cool enough to handle, peel potatoes with a small sharp knife or a vegetable peeler and cut into 1-inch pieces. Heat oil in wok over moderately high heat until hot but not smoking. Add bay leaves, panch phoron, and asafetida and cook, stirring frequently, until seeds from panch phoron stop sputtering, about 1 minute. Add potatoes and turmeric and sauté, stirring, until potatoes are pale golden brown, 3 to 5 minutes. Add 1 cup water and bring to a boil, then simmer briskly, stirring occasionally, 5 minutes. While potatoes are simmering, whisk together boiling water and tamarind. 3Add salt, 2 teaspoons cumin chile powder, and tamarind mixture to potatoes and simmer, stirring occasionally, until sauce is slightly thickened, 2 to 3 minutes. Season with salt. Discard bay leaves.",
            "Toast chiles and cumin seeds in a dry small heavy skillet, shaking pan occasionally, until fragrant and just a shade darker, about 1 minute. Remove from heat and cool mixture, then finely grind in grinder.",
            "Cover potatoes with salted cold water by 1 inch in a 2 1/2- to 3-quart saucepan. Bring to a boil, then simmer, partially covered, until potatoes are just tender when pierced with a small sharp knife, about 12 minutes. Drain. Once cool enough to handle, peel potatoes with a small sharp knife or a vegetable peeler and cut into 1-inch pieces.",
            "Heat oil in wok over moderately high heat until hot but not smoking. Add bay leaves, panch phoron, and asafetida and cook, stirring frequently, until seeds from panch phoron stop sputtering, about 1 minute. Add potatoes and turmeric and sauté, stirring, until potatoes are pale golden brown, 3 to 5 minutes. Add 1 cup water and bring to a boil, then simmer briskly, stirring occasionally, 5 minutes.",
            "While potatoes are simmering, whisk together boiling water and tamarind. 3Add salt, 2 teaspoons cumin chile powder, and tamarind mixture to potatoes and simmer, stirring occasionally, until sauce is slightly thickened, 2 to 3 minutes. Season with salt. Discard bay leaves."
        ],
        "picture_link": null
    }
}