{
    "recipe": {
        "title": "Potato Purée ",
        "ingredients": [
            "6 medium russet or other starchy potatoes (about 2 1/2 to 3 pounds), scrubbed and quartered but unpeeled",
            "2 medium carrots, peeled and cut into 1/4-inch dice",
            "1 cup tiny new peas, fresh or frozen",
            "3/4 cup Mexican crema or heavy cream",
            "1 large egg, beaten",
            "2 teaspoons prepared yellow mustard, or to taste",
            "4 tablespoons (1/2 stick) unsalted butter",
            "1 medium onion, finely chopped",
            "1/4 cup minced Italian parsley leaves",
            "One 3-ounce jar pickled pearl onions, drained",
            "One 3-ounce jar (1/2 cup) pitted green brined olives, drained and sliced",
            "1/4 cup (or to taste) pickled jalapeño chiles, drained and finely chopped",
            "Freshly ground black pepper",
            "1/2 teaspoon salt (optional)"
        ],
        "instructions": [
            "Prepare the vegetables: Have ready a medium-size saucepan of boiling salted water. Add the potatoes and cook until barely tender, 12 to 15 minutes. Lift out, letting them drain well, and peel. Set aside. Add the diced carrots to the water and cook just until crisp-tender, about 4 minutes. Scoop out with a strainer or slotted spoon, letting them drain well, and set aside. Add the peas and cook until barely tender, about 3 minutes; remove and drain.",
            "In a large bowl, mash the potatoes with a potato masher. Add the crema and beat with a wooden spoon to eliminate most of the lumps. Add the egg and mustard, continuing to beat until the mixture is smooth and fluffy.",
            "Preheat the oven to 350° F.",
            "In a medium-size skillet, melt the butter over medium-high heat until fragrant and sizzling but not browned. Add the onion and cook, stirring, until the onion is translucent, about 3 minutes. Add the parsley, cook for 1 minute longer, and beat the mixture into the mashed potatoes. Stir in the carrots, peas, pickled onions, olives, and jalapeños. Taste for seasoning and add the pepper and optional salt. Transfer the mixture to a buttered 2-quart baking dish and bake 20 minutes. Serve at once."
        ],
        "picture_link": null
    }
}