{
    "recipe": {
        "title": "Potato Latkes with Watercress, Smoked Salmon, and Avocado Salad ",
        "ingredients": [
            "2 cups finely chopped onions, divided",
            "1 large egg",
            "1 1/4 teaspoons coarse kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "2 pounds russet potatoes, peeled, cut into 1-inch pieces",
            "1 tablespoon all purpose flour",
            "1 teaspoon baking powder",
            "Vegetable oil (for frying)",
            "6 tablespoons olive oil",
            "2 tablespoons Sherry wine vinegar",
            "1/4 teaspoon dry mustard",
            "2 large bunches watercress, thick stems trimmed (about 8 cups)",
            "1 large avocado, pitted, peeled, diced",
            "4 ounces thinly sliced smoked salmon, cut into strips"
        ],
        "instructions": [
            "For latkes: Line colander with kitchen towel. Stir 1 1/2 cups onions, egg, salt, and pepper in large bowl. Place remaining 1/2 cup onions in processor; add potatoes. Blend until potatoes are very finely chopped and some of mixture is pureed; transfer to prepared colander. Wrap towel around potatoes, squeezing out as much liquid as possible. Scrape into bowl with egg mixture. Stir in all purpose flour and baking powder. Heat 4 tablespoons vegetable oil in heavy large skillet over medium-high heat. Drop potato mixture by scant 1/4 cupfuls into skillet; flatten each latke to 2 1/2-inch round with metal spatula. Reduce heat to medium. Cook until golden, about 4 minutes per side. Transfer to large rimmed baking sheet. Repeat, adding more oil to skillet as needed. DO AHEAD: Latkes can be made 2 hours ahead. Let stand at room temperature. Preheat oven to 425°F. Bake latkes until crisp and deep brown, about 6 minutes per side.",
            "Line colander with kitchen towel. Stir 1 1/2 cups onions, egg, salt, and pepper in large bowl. Place remaining 1/2 cup onions in processor; add potatoes. Blend until potatoes are very finely chopped and some of mixture is pureed; transfer to prepared colander. Wrap towel around potatoes, squeezing out as much liquid as possible. Scrape into bowl with egg mixture. Stir in all purpose flour and baking powder.",
            "Heat 4 tablespoons vegetable oil in heavy large skillet over medium-high heat. Drop potato mixture by scant 1/4 cupfuls into skillet; flatten each latke to 2 1/2-inch round with metal spatula. Reduce heat to medium. Cook until golden, about 4 minutes per side. Transfer to large rimmed baking sheet. Repeat, adding more oil to skillet as needed. DO AHEAD: Latkes can be made 2 hours ahead. Let stand at room temperature.",
            "Preheat oven to 425°F. Bake latkes until crisp and deep brown, about 6 minutes per side.",
            "For salad: Whisk oil, vinegar, and dry mustard in small bowl to blend. Season with salt and pepper. Combine watercress, avocado, and salmon in large bowl. Toss with enough dressing to coat. Arrange 2 latkes on each plate. Mound salad alongside.",
            "Whisk oil, vinegar, and dry mustard in small bowl to blend. Season with salt and pepper. Combine watercress, avocado, and salmon in large bowl. Toss with enough dressing to coat.",
            "Arrange 2 latkes on each plate. Mound salad alongside.",
            "WHAT TO DRINK: Bubbles. Louis Bouillot \"Perle d'Aurore\" Crémant de Bourgogne Rosé (France, $17) will taste great with the latkes and everything in the salad.",
            "Bubbles. Louis Bouillot \"Perle d'Aurore\" Crémant de Bourgogne Rosé (France, $17) will taste great with the latkes and everything in the salad."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5665b55187cc73f607397db9/6:4/w_274%2Ch_169/240703_hires.jpg"
    }
}