{
    "recipe": {
        "title": "Potato Latkes with Smoked Salmon, Caviar, and Tarragon Crème Fraîche ",
        "ingredients": [
            "3 pounds unpeeled Yukon Gold potatoes",
            "1 medium onion",
            "3 large eggs, beaten to blend",
            "4 1/2 tablespoons all purpose flour",
            "1 1/2 teaspoons salt",
            "3/4 teaspoon ground black pepper",
            "2 tablespoons (or more) vegetable oil",
            "3/4 cup crème fraîche",
            "1 tablespoon chopped fresh tarragon",
            "12 ounces sliced smoked salmon",
            "2 ounces caviar"
        ],
        "instructions": [
            "Preheat oven to 300°F. Using coarse side of box grater or food processor fitted with coarse grater blade, shred potatoes. Working in batches, wrap potatoes in kitchen towel and squeeze out excess liquid. Transfer to large bowl. Repeat process with onion; add to bowl with potatoes. Mix next 4 ingredients into potato mixture. Heat 2 tablespoons oil in large skillet over medium–high heat. Working in batches, drop potato mixture by 1/4 cupfuls into skillet; flatten to 3–inch rounds. Fry latkes until golden brown on bottom, adding more oil by tablespoonfuls as needed, about 4 minutes per side. Transfer latkes to rimmed baking sheet; keep warm in oven. Mix crème fraîche and chopped fresh tarragon in small bowl to blend. Divide smoked salmon among latkes. Top each latke with dollop of tarragon crème fraîche, then caviar.",
            "Preheat oven to 300°F. Using coarse side of box grater or food processor fitted with coarse grater blade, shred potatoes. Working in batches, wrap potatoes in kitchen towel and squeeze out excess liquid. Transfer to large bowl. Repeat process with onion; add to bowl with potatoes. Mix next 4 ingredients into potato mixture.",
            "Heat 2 tablespoons oil in large skillet over medium–high heat. Working in batches, drop potato mixture by 1/4 cupfuls into skillet; flatten to 3–inch rounds. Fry latkes until golden brown on bottom, adding more oil by tablespoonfuls as needed, about 4 minutes per side. Transfer latkes to rimmed baking sheet; keep warm in oven.",
            "Mix crème fraîche and chopped fresh tarragon in small bowl to blend. Divide smoked salmon among latkes. Top each latke with dollop of tarragon crème fraîche, then caviar."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd7fc7b55306961bfabbf/6:4/w_274%2Ch_169/236767.jpg"
    }
}