{
    "recipe": {
        "title": "Pot-Roasted Artichokes with White Wine and Capers ",
        "ingredients": [
            "1/4 cup extra-virgin olive oil",
            "3 1/2 pounds baby artichokes (about 18), turned (see below)",
            "2 medium garlic cloves, thinly sliced",
            "1 1/2 teaspoons Maldon or another flaky sea salt",
            "1 1/2 cups dry white wine, such as Sauvignon Blanc",
            "1 heaping tablespoon drained capers",
            "A five-finger pinch of mint leaves (preferably black mint), torn at the last minute",
            "A pinch of delicate flat-leaf parsley sprigs"
        ],
        "instructions": [
            "Heat the oil in a heavy pot (wide enough to hold the artichokes with room to spare) over medium-high heat until it just begins to smoke. Stand the artichokes cut sides down in the oil, wait a minute, then reduce the heat to medium-low, sprinkle in the garlic and salt, and cook, without stirring, just until the garlic turns golden and smells toasty, about 3 minutes. Slowly pour in the wine, cover the pot, and cook, without stirring, at a vigorous simmer until you can insert a sharp knife into the thick artichoke bottoms with barely any resistance, about 25 minutes. Five minutes or so before they're fully tender, remove the lid and scatter on the capers. Raise the heat to medium-high, and bring the liquid to a boil. Cook until all the wine has evaporated (the bubbling sound will become a sizzle), about 3 minutes. Add the mint and parsley and keep cooking the artichokes in the oil (it's OK if a few of them tip over), until the cut sides of the artichokes are deep golden brown, 3 to 5 minutes. Lower the heat if necessary to prevent the artichokes from getting too dark. Arrange the artichokes prettily on a plate, and scoop the capers, oil, and slightly crispy herbs over top. Serve straightaway or at room temperature.",
            "Heat the oil in a heavy pot (wide enough to hold the artichokes with room to spare) over medium-high heat until it just begins to smoke. Stand the artichokes cut sides down in the oil, wait a minute, then reduce the heat to medium-low, sprinkle in the garlic and salt, and cook, without stirring, just until the garlic turns golden and smells toasty, about 3 minutes.",
            "Slowly pour in the wine, cover the pot, and cook, without stirring, at a vigorous simmer until you can insert a sharp knife into the thick artichoke bottoms with barely any resistance, about 25 minutes. Five minutes or so before they're fully tender, remove the lid and scatter on the capers.",
            "Raise the heat to medium-high, and bring the liquid to a boil. Cook until all the wine has evaporated (the bubbling sound will become a sizzle), about 3 minutes. Add the mint and parsley and keep cooking the artichokes in the oil (it's OK if a few of them tip over), until the cut sides of the artichokes are deep golden brown, 3 to 5 minutes. Lower the heat if necessary to prevent the artichokes from getting too dark.",
            "Arrange the artichokes prettily on a plate, and scoop the capers, oil, and slightly crispy herbs over top. Serve straightaway or at room temperature.",
            "Turning Artichokes I suppose some people might find it a bother, but I quite like turning artichokes. It's like an advanced version of shelling peas—similarly meditative and even a bit fun. Choosing artichokes whose leaves don't move much when you pinch the tops will make your life a bit easier, because typically they have smaller chokes or sometimes none at all. Fill a big bowl with water and squeeze in the juice of a lemon. Working with one artichoke at a time, pluck off and discard the green leaves until only the soft yellowish leaves are left. Cut off about 1/2 inch of the stem. Use a peeler or small knife to trim away the tough green stuff at the base of the artichoke. Take a peek at the cut end of the stem. You'll see a pale green circle surrounded by a darker border. Peel the stem, getting as close as you can to the pale green center. Drop the artichoke into the lemony water (to prevent discoloration). Repeat with the remaining artichokes. Cut about 1 inch from the tip of each artichoke, then use a small spoon to scoop out and discard the feathery choke. Gently squeeze each artichoke over the bowl as you go, and set them cut sides down on paper towels to drain for about 5 minutes.",
            "I suppose some people might find it a bother, but I quite like turning artichokes. It's like an advanced version of shelling peas—similarly meditative and even a bit fun. Choosing artichokes whose leaves don't move much when you pinch the tops will make your life a bit easier, because typically they have smaller chokes or sometimes none at all.",
            "Fill a big bowl with water and squeeze in the juice of a lemon. Working with one artichoke at a time, pluck off and discard the green leaves until only the soft yellowish leaves are left. Cut off about 1/2 inch of the stem. Use a peeler or small knife to trim away the tough green stuff at the base of the artichoke. Take a peek at the cut end of the stem. You'll see a pale green circle surrounded by a darker border. Peel the stem, getting as close as you can to the pale green center. Drop the artichoke into the lemony water (to prevent discoloration). Repeat with the remaining artichokes.",
            "Cut about 1 inch from the tip of each artichoke, then use a small spoon to scoop out and discard the feathery choke. Gently squeeze each artichoke over the bowl as you go, and set them cut sides down on paper towels to drain for about 5 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5548dfd2c4e7df4e3316014d/6:4/w_274%2Ch_169/56389515_pot-roasted-artichokes_1x1.jpg"
    }
}