{
    "recipe": {
        "title": "Poulet Vallée d'Auge ",
        "ingredients": [
            "5 tablespoons unsalted butter, divided",
            "3 firm, tart apples (such as Pink Lady or Braeburn; about 1 pound), peeled, cored, quartered",
            "1 tablespoon olive oil",
            "2 3 1/2–4-pound chickens, quartered",
            "Kosher salt, freshly ground pepper",
            "1 leek, white and pale-green parts only, halved lengthwise, sliced crosswise 1/4\" thick",
            "2 shallots, finely chopped",
            "1/4 cup Calvados (apple brandy)",
            "3/4 cup apple cider",
            "4 sprigs thyme",
            "2 bay leaves",
            "1/2 cup low-sodium chicken broth",
            "1/2 pound crimini (baby bella) mushrooms, trimmed, halved",
            "1/2 cup crème fraîche",
            "1 large egg yolk"
        ],
        "instructions": [
            "Heat 2 tablespoons butter in a large heavy pot over medium heat. Add apples and cook, turning occasionally, until golden in spots, 10–12 minutes. Transfer apples to a plate and set aside. Increase heat to medium-high and add oil and 1 tablespoon butter to pot. Season chicken with salt and pepper and, working in batches, cook until browned, about 5 minutes per side. Transfer chicken to another plate; set aside. Add leek and shallots to pot; cook, stirring often, until softened, about 4 minutes. Remove pot from heat, add Calvados, and ignite with a long match or lighter. After flames die down, return pot to heat and add cider. Bring to a boil, reduce heat, and simmer until slightly reduced, about 3 minutes. Return reserved chicken to pot and add thyme, bay leaves, and broth. Bring to a boil; reduce heat, cover pot, and simmer, adding reserved apples back to pot halfway through, until chicken is cooked through, 20–25 minutes. Meanwhile, heat remaining 2 tablespoons butter in a large skillet over medium-high heat. Add mushrooms and cook, tossing occasionally, until browned and softened, 6–8 minutes; season with salt and pepper. Transfer mushrooms to a plate. Whisk crème fraîche and egg yolk in a small bowl. Using a slotted spoon, transfer chicken and apples to a baking sheet and remove pot from heat. Whisk crème fraîche mixture into cooking liquid in pot. Gently mix in chicken, apples, and mushrooms. DO AHEAD: Chicken and apples can be cooked 1 day ahead. Cover and chill. Cook mushrooms and finish sauce just before serving.",
            "Heat 2 tablespoons butter in a large heavy pot over medium heat. Add apples and cook, turning occasionally, until golden in spots, 10–12 minutes. Transfer apples to a plate and set aside.",
            "Increase heat to medium-high and add oil and 1 tablespoon butter to pot. Season chicken with salt and pepper and, working in batches, cook until browned, about 5 minutes per side. Transfer chicken to another plate; set aside.",
            "Add leek and shallots to pot; cook, stirring often, until softened, about 4 minutes. Remove pot from heat, add Calvados, and ignite with a long match or lighter. After flames die down, return pot to heat and add cider. Bring to a boil, reduce heat, and simmer until slightly reduced, about 3 minutes.",
            "Return reserved chicken to pot and add thyme, bay leaves, and broth. Bring to a boil; reduce heat, cover pot, and simmer, adding reserved apples back to pot halfway through, until chicken is cooked through, 20–25 minutes.",
            "Meanwhile, heat remaining 2 tablespoons butter in a large skillet over medium-high heat. Add mushrooms and cook, tossing occasionally, until browned and softened, 6–8 minutes; season with salt and pepper. Transfer mushrooms to a plate.",
            "Whisk crème fraîche and egg yolk in a small bowl. Using a slotted spoon, transfer chicken and apples to a baking sheet and remove pot from heat. Whisk crème fraîche mixture into cooking liquid in pot. Gently mix in chicken, apples, and mushrooms.",
            "DO AHEAD: Chicken and apples can be cooked 1 day ahead. Cover and chill. Cook mushrooms and finish sauce just before serving."
        ],
        "picture_link": null
    }
}