{
    "recipe": {
        "title": "Pound Cake with Grand Marnier-Poached Apricots ",
        "ingredients": [
            "2 cups (4 sticks) unsalted butter, room temperature, plus more for pan",
            "3 cups all-purpose flour, plus more for pan",
            "1 teaspoon kosher salt",
            "1/2 teaspoons cream of tartar",
            "1/2 teaspoons ground cardamom",
            "2 cups superfine sugar",
            "6 large eggs",
            "1/2 cup heavy cream",
            "1 teaspoon vanilla extract",
            "2/3 cup Grand Marnier",
            "2/3 cup granulated sugar",
            "2 cups dried apricots (about 8 ounces)",
            "1 1 1/2\" piece peeled ginger, sliced",
            "Lightly sweetened whipped cream (for serving)",
            "A 10\"-diameter tube pan or angel food cake pan"
        ],
        "instructions": [
            "Place a rack in middle of oven; preheat to 325°F. Butter and flour pan. Whisk salt, cream of tartar, cardamom, and 3 cups flour in a medium bowl.",
            "Using an electric mixer on high speed, beat 2 cups butter until very light and fluffy, about 5 minutes. Reduce speed to low and gradually add superfine sugar. Increase speed to high and beat until very light and creamy, 6–8 minutes longer. Add eggs 1 at a time, beating to blend between additions. Beat in cream and vanilla. Reduce speed to low; gradually add dry ingredients, mixing until mostly combined. Finish mixing with a rubber spatula just until combined. Scrape batter into prepared pan.",
            "Bake cake, rotating halfway through, until top is golden brown and a tester inserted into the center comes out clean, 70–80 minutes. Transfer pan to a wire rack; let cake cool completely before turning out.",
            "DO AHEAD: Cake can be baked 3 days ahead. Store tightly wrapped at room temperature.",
            "For apricots and assembly: Bring Grand Marnier, granulated sugar, and 2/3 cup water to a boil in a small saucepan, stirring to dissolve sugar. Add apricots and ginger, reduce heat to low, and simmer gently until apricots are very soft, 20–25 minutes. Let cool. Remove ginger just before serving. Serve cake with apricots and syrup and whipped cream. DO AHEAD: Apricots can be poached 1 week ahead. Cover and chill.",
            "Bring Grand Marnier, granulated sugar, and 2/3 cup water to a boil in a small saucepan, stirring to dissolve sugar. Add apricots and ginger, reduce heat to low, and simmer gently until apricots are very soft, 20–25 minutes. Let cool.",
            "Remove ginger just before serving. Serve cake with apricots and syrup and whipped cream.",
            "DO AHEAD: Apricots can be poached 1 week ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/578e3f5df84bcc2e07511d44/6:4/w_274%2Ch_169/pound-cake-with-grand-marnier-poached-apricots07192016.jpg"
    }
}