{
    "recipe": {
        "title": "Praline Ice Cream Sandwiches ",
        "ingredients": [
            "1 cup pecans (3 1/2 ounces), coarsely chopped",
            "1 1/2 teaspoons salt",
            "1 cup sugar",
            "1 1/2 sticks (3/4 cup) unsalted butter at room temperature plus additional for greasing pan",
            "1 1/2 cups all-purpose flour",
            "1 teaspoon baking powder",
            "1/4 teaspoon baking soda",
            "1/2 teaspoon salt",
            "1 1/4 cups packed dark brown sugar",
            "2 large eggs",
            "1 teaspoon vanilla",
            "2 pt store-bought premium vanilla ice cream, softened",
            "2 (15 1/2- by 10 1/2-inch) baking pans (3/4 inch deep; also called jelly roll pans); parchment paper; an offset metal spatula"
        ],
        "instructions": [
            "Stir together pecans and salt in a small bowl. Put a large sheet of foil on a work surface.",
            "Cook sugar in a 10-inch heavy skillet over moderate heat, undisturbed, until it begins to melt. Continue to cook, stirring occasionally, until sugar melts into a golden caramel. Add salted pecans, stirring until coated well, then spread on foil and cool completely, about 15 minutes. Peel praline off foil and finely chop with a large heavy knife.",
            "Make sandwich layers: Put oven racks in upper and lower thirds of oven and preheat oven to 375°F. Draw a large X with butter from corner to corner in each baking pan, then line bottom of each pan with parchment paper, leaving a 1-inch overhang on each side, pressing to help parchment adhere to X. Whisk together flour, baking powder, baking soda, and salt in a small bowl. Beat together butter and brown sugar in another bowl with an electric mixer at medium-high speed until pale and fluffy, about 3 minutes. Add eggs 1 at a time, beating well after each addition, then beat in vanilla. Reduce speed to low and add flour mixture in 2 batches, mixing until just combined. Divide batter between baking pans (about 1 1/2 cups each) and spread into thin, even layers with offset spatula. Sprinkle with praline and bake, switching position of pans halfway through baking, until sandwich layers are golden brown but still tender, about 10 minutes. Cool in pans 10 minutes, then transfer with parchment to racks and cool completely, about 30 minutes. Clean 1 baking pan. Line cleaned baking pan with fresh parchment, leaving a 1-inch overhang on each side. Invert sandwich layers onto work surface and carefully peel off and discard parchment, then trim edges.",
            "Put oven racks in upper and lower thirds of oven and preheat oven to 375°F. Draw a large X with butter from corner to corner in each baking pan, then line bottom of each pan with parchment paper, leaving a 1-inch overhang on each side, pressing to help parchment adhere to X.",
            "Whisk together flour, baking powder, baking soda, and salt in a small bowl. Beat together butter and brown sugar in another bowl with an electric mixer at medium-high speed until pale and fluffy, about 3 minutes. Add eggs 1 at a time, beating well after each addition, then beat in vanilla. Reduce speed to low and add flour mixture in 2 batches, mixing until just combined.",
            "Divide batter between baking pans (about 1 1/2 cups each) and spread into thin, even layers with offset spatula. Sprinkle with praline and bake, switching position of pans halfway through baking, until sandwich layers are golden brown but still tender, about 10 minutes. Cool in pans 10 minutes, then transfer with parchment to racks and cool completely, about 30 minutes. Clean 1 baking pan.",
            "Line cleaned baking pan with fresh parchment, leaving a 1-inch overhang on each side. Invert sandwich layers onto work surface and carefully peel off and discard parchment, then trim edges.",
            "Assemble sandwiches: Transfer 1 sandwich layer, praline side down, to baking pan and spread evenly with ice cream. Top ice cream with second sandwich layer, praline side up, pressing gently to form an even sandwich. Wrap baking pan in plastic wrap and freeze ice cream sandwich at least 1 hour. Cut into 24 sandwiches before serving.",
            "Transfer 1 sandwich layer, praline side down, to baking pan and spread evenly with ice cream. Top ice cream with second sandwich layer, praline side up, pressing gently to form an even sandwich. Wrap baking pan in plastic wrap and freeze ice cream sandwich at least 1 hour.",
            "Cut into 24 sandwiches before serving."
        ],
        "picture_link": null,
        "color": 11179519
    }
}