{
    "recipe": {
        "title": "Praline French Toast Bread Pudding ",
        "ingredients": [
            "One 1-pound loaf challah (preferably the braided one) or brioche",
            "8 extra-large eggs",
            "2 cups heavy whipping cream",
            "1 1/2 cups whole milk",
            "1 cup granulated sugar",
            "1 tablespoon pure vanilla extract",
            "1/2 teaspoon table salt",
            "1/2 teaspoon ground nutmeg",
            "1/2 cup (1 stick) unsalted butter, softened",
            "1 cup firmly packed dark brown sugar",
            "3/4 cup coarsely chopped pecans",
            "1 teaspoon ground cinnamon",
            "3 tablespoonsn maple syrup for drizzling"
        ],
        "instructions": [
            "1. Generously butter a rectangular baking dish (13 x 9 x 2 1/2 inches); use the prettiest one you have. Set out a large shallow pan for the water bath. Cut the bread across into 3/4-inch-thick slices. If you are not using a braided bread, cut slices into four triangles each. Arrange bread slices in rows, leaning and overlapping them, if necessary.",
            "2. In a large bowl, using an electric mixer, beat the eggs on high until light golden and slightly thickened, about 3 minutes. Beat in the cream, milk, granulated sugar, vanilla, salt, and nutmeg. Pour over the bread in the dish, lifting the bread up slightly to pour between the slices and letting the custard soak in (this is important; see The Junior's Way).",
            "3. Using a pastry cutter or two knives, combine all praline topping ingredients, except syrup. Using your hands, spread the mixture over the top of the soaked challah, pushing some down between the slices. Cover the plastic wrap and refrigerate for at least 1 hour or preferably overnight.",
            "4. Preheat the oven to 350°F. Remove the plastic wrap and drizzle the maple syrup over the top. Place the dish in the center of a larger pan. Pour hot water into the pan until it comes 1 inch up the side of the baking dish. Bake until the pudding is puffy, souffléd, and golden brown, 35 to 40 minutes (don't let it overbake or get too brown). Touch it: The top should be spongy, not dry or crusty. The bread pudding is best served piping hot, right out of the oven."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad4d6019925f464b3b4438/6:4/w_274%2Ch_169/51200810_french-toast-bread_1x1.jpg",
        "color": 5659988
    }
}