{
    "recipe": {
        "title": "Pressed Broccoli Rabe and Mozzarella Sandwiches ",
        "ingredients": [
            "3/4 lb [340 g] broccoli rabe (an average bunch), tough stems discarded, roughly chopped",
            "3 Tbsp olive oil",
            "Kosher salt",
            "2 large garlic cloves, minced",
            "Pinch of red pepper flakes",
            "1/4 cup [40 g] green olives, pitted and finely chopped",
            "1 1/2 Tbsp drained brined capers, finely chopped",
            "1 Tbsp red wine vinegar",
            "4 individual-size sandwich rolls, split (I like rolls with sesame seeds for this, but you do you)",
            "1 lb [455 g] fresh mozzarella cheese, sliced"
        ],
        "instructions": [
            "Pour water to a depth of 1 in [2.5 cm] into a medium pot and set over high heat. When the water boils, add a large pinch of salt and then the broccoli rabe and cook, stirring, until bright green and slightly wilted, about 30 seconds. Drain the broccoli rabe in a colander, wipe the pot dry, and return it to high heat. Add 2 Tbsp of the olive oil, the garlic, and the red pepper flakes and stir the garlic into the oil until it’s fragrant, just 15 seconds. Immediately add the drained broccoli rabe and a large pinch of salt and cook, stirring, until the broccoli rabe is coated with the garlicky oil and is a bit more softened, about 3 minutes. Remove from the heat and set the broccoli rabe aside to cool down a bit. In a small bowl, combine the olives, capers, vinegar, the remaining 1 Tbsp olive oil, and a small pinch of salt and stir together. Place the rolls, cut-side up, on a work surface and evenly distribute the olive mixture among the rolls, putting some on both halves of each roll. Divide the mozzarella and broccoli rabe evenly among the rolls, close the rolls, and then tightly wrap each sandwich in plastic wrap. Place something flat and heavy on top of the sandwiches, such as a large cast-iron skillet. Let the sandwiches sit under this weight for at least an hour before eating or putting them in your backpack.",
            "Pour water to a depth of 1 in [2.5 cm] into a medium pot and set over high heat. When the water boils, add a large pinch of salt and then the broccoli rabe and cook, stirring, until bright green and slightly wilted, about 30 seconds. Drain the broccoli rabe in a colander, wipe the pot dry, and return it to high heat. Add 2 Tbsp of the olive oil, the garlic, and the red pepper flakes and stir the garlic into the oil until it’s fragrant, just 15 seconds. Immediately add the drained broccoli rabe and a large pinch of salt and cook, stirring, until the broccoli rabe is coated with the garlicky oil and is a bit more softened, about 3 minutes. Remove from the heat and set the broccoli rabe aside to cool down a bit.",
            "In a small bowl, combine the olives, capers, vinegar, the remaining 1 Tbsp olive oil, and a small pinch of salt and stir together. Place the rolls, cut-side up, on a work surface and evenly distribute the olive mixture among the rolls, putting some on both halves of each roll. Divide the mozzarella and broccoli rabe evenly among the rolls, close the rolls, and then tightly wrap each sandwich in plastic wrap. Place something flat and heavy on top of the sandwiches, such as a large cast-iron skillet. Let the sandwiches sit under this weight for at least an hour before eating or putting them in your backpack."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5bbe45810242ff2d565da3e8/6:4/w_274%2Ch_169/0.jpg"
    }
}