{
    "recipe": {
        "title": "Pretzel Bites with Quick Cheddar Dip ",
        "ingredients": [
            "1 cup warm water (100° to 110°F)",
            "1 (1/4-ounce) envelope active dry yeast",
            "3 cups bread flour or all-purpose flour plus more for work surface",
            "1 tablespoon coarse kosher salt",
            "2 tablespoons packed light brown sugar",
            "1/2 stick (4 tablespoons) unsalted butter, well softened",
            "Vegetable oil for bowl",
            "8 cups water",
            "1/2 cup baking soda",
            "Pretzel salt (see Cooks' Notes) or coarse kosher salt",
            "12 ounces good-quality Cheddar cheese, cut into 1-inch cubes",
            "6 to 8 tablespoons dry white wine or water"
        ],
        "instructions": [
            "Make Pretzel Dough: Stir together warm water and yeast in a large bowl and let stand until a creamy beige foam develops on the surface, about 10 minutes. (If mixture doesn't foam, start over with new yeast.) Meanwhile, in a smaller bowl, stir together flour, salt, and light brown sugar. Add flour mixture and butter to yeast mixture, and stir together first with a wooden spoon and then with your hands, until it forms a dough. On a lightly floured surface, knead dough until it is smooth and elastic, 8 to 10 minutes, dusting with more flour as needed if dough sticks to work surface. Transfer dough to a lightly oiled large bowl and turn over to coat with oil. Cover with a kitchen towel (not terry cloth) and let rise in a draft-free place at room temperature until doubled, 2 to 3 hours. Alternatively, after kneading, let dough rest at room temperature for 15 minutes, then transfer to oiled bowl as above, and let rise in the refrigerator overnight (12 hours or up to 2 days). Punch down dough and divide into quarters. Form each quarter into 4 balls. Roll each ball into a 12-inch-long rope. Cut each rope into six (2-inch) pieces, and transfer to wax paper-lined rimmed baking sheets.",
            "Stir together warm water and yeast in a large bowl and let stand until a creamy beige foam develops on the surface, about 10 minutes. (If mixture doesn't foam, start over with new yeast.)",
            "Meanwhile, in a smaller bowl, stir together flour, salt, and light brown sugar.",
            "Add flour mixture and butter to yeast mixture, and stir together first with a wooden spoon and then with your hands, until it forms a dough. On a lightly floured surface, knead dough until it is smooth and elastic, 8 to 10 minutes, dusting with more flour as needed if dough sticks to work surface.",
            "Transfer dough to a lightly oiled large bowl and turn over to coat with oil. Cover with a kitchen towel (not terry cloth) and let rise in a draft-free place at room temperature until doubled, 2 to 3 hours.",
            "Alternatively, after kneading, let dough rest at room temperature for 15 minutes, then transfer to oiled bowl as above, and let rise in the refrigerator overnight (12 hours or up to 2 days).",
            "Punch down dough and divide into quarters. Form each quarter into 4 balls. Roll each ball into a 12-inch-long rope. Cut each rope into six (2-inch) pieces, and transfer to wax paper-lined rimmed baking sheets.",
            "Bake Pretzels: Heat oven to 450°F with racks in upper and lower third. Well oil 2 large baking sheets (about 17- by 12- inches). In a 4- to 5-quart saucepan, bring water and baking soda to a boil (mixture will be foamy at first, but foam will dissipate). Add 12 pretzel bites and cook 30 seconds (they will rise to the surface almost immediately), then transfer with a slotted spoon to baking sheets. Quickly sprinkle pretzel bites lightly on both sides with pretzel salt before they dry (so salt sticks). Repeat with remaining pretzel bites, returning water to a boil between batches. Bake pretzel bites in oven, switching sheets between racks and rotating sheets halfway through baking, until deep chestnut brown, 8 to 10 minutes (watch closely toward end of baking; bites brown quickly in last few minutes). Immediately transfer pretzel bites to wire racks to cool.",
            "Heat oven to 450°F with racks in upper and lower third. Well oil 2 large baking sheets (about 17- by 12- inches).",
            "In a 4- to 5-quart saucepan, bring water and baking soda to a boil (mixture will be foamy at first, but foam will dissipate). Add 12 pretzel bites and cook 30 seconds (they will rise to the surface almost immediately), then transfer with a slotted spoon to baking sheets. Quickly sprinkle pretzel bites lightly on both sides with pretzel salt before they dry (so salt sticks). Repeat with remaining pretzel bites, returning water to a boil between batches.",
            "Bake pretzel bites in oven, switching sheets between racks and rotating sheets halfway through baking, until deep chestnut brown, 8 to 10 minutes (watch closely toward end of baking; bites brown quickly in last few minutes). Immediately transfer pretzel bites to wire racks to cool.",
            "Make Cheddar Dip: Purée cheese with 6 tablespoons wine or water in a food processor fitted with knife blade, stopping and scraping down sides with a spatula occasionally, until mixture is creamy and smooth, about 2 minutes. Thin to desired consistency with additional wine or water, adding it 1 tablespoon at a time. Serve immediately, or chill, covered, and return to room temperature before serving.",
            "Purée cheese with 6 tablespoons wine or water in a food processor fitted with knife blade, stopping and scraping down sides with a spatula occasionally, until mixture is creamy and smooth, about 2 minutes. Thin to desired consistency with additional wine or water, adding it 1 tablespoon at a time. Serve immediately, or chill, covered, and return to room temperature before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b097891cc76a014cfaba41/6:4/w_274%2Ch_169/51107840_pretzel-bites_1x1.jpg"
    }
}