{
    "recipe": {
        "title": "Provolone and Broccoli Rabe Panini ",
        "ingredients": [
            "1/2 lb broccoli rabe, tough ends discarded",
            "2 flat anchovies, rinsed, patted dry, and chopped",
            "1 garlic clove, minced",
            "3 tablespoons extra-virgin olive oil",
            "1 (8- to 9-inch) sliced (1/4 inch thick) fine-quality round Italian loaf",
            "1/3 lb sliced provolone"
        ],
        "instructions": [
            "Cook broccoli rabe in a 4-quart pot of boiling salted water , uncovered, until tender, about 3 minutes. Drain well in a colander, then chop. Cook anchovies and garlic in 1 1/2 tablespoons oil in a 10-inch heavy skillet over moderate heat, stirring, until garlic just begins to turn golden, about 1 minute. Add broccoli rabe and cook, stirring, 1 minute. Heat a panini or sandwich press according to manufacturer's instructions until hot. (Alternatively, heat a well-seasoned ridged grill pan over moderate heat.) Brush 4 center slices of bread on 1 side with remaining 1 1/2 tablespoons oil. (Reserve remainder of loaf for another use.) Put slices, oiled sides down, on a work surface, then divide half of cheese between 2 slices. Top with all of broccoli rabe mixture, remaining cheese, and remaining 2 bread slices, oiled sides up. Put sandwiches on press, then pull down top onto sandwiches and cook until sandwiches are browned and crisp, 4 to 8 minutes. (If using grill pan, put a heavy pan on top of sandwiches and cook, turning sandwiches over once.)",
            "Cook broccoli rabe in a 4-quart pot of boiling salted water , uncovered, until tender, about 3 minutes. Drain well in a colander, then chop.",
            "Cook anchovies and garlic in 1 1/2 tablespoons oil in a 10-inch heavy skillet over moderate heat, stirring, until garlic just begins to turn golden, about 1 minute. Add broccoli rabe and cook, stirring, 1 minute.",
            "Heat a panini or sandwich press according to manufacturer's instructions until hot. (Alternatively, heat a well-seasoned ridged grill pan over moderate heat.)",
            "Brush 4 center slices of bread on 1 side with remaining 1 1/2 tablespoons oil. (Reserve remainder of loaf for another use.) Put slices, oiled sides down, on a work surface, then divide half of cheese between 2 slices. Top with all of broccoli rabe mixture, remaining cheese, and remaining 2 bread slices, oiled sides up.",
            "Put sandwiches on press, then pull down top onto sandwiches and cook until sandwiches are browned and crisp, 4 to 8 minutes. (If using grill pan, put a heavy pan on top of sandwiches and cook, turning sandwiches over once.)"
        ],
        "picture_link": "https://assets.epicurious.com/photos/57a337e8437fcffe02f723b0/6:4/w_274%2Ch_169/Provolone-and-broccoli-Rabe-Panini-04082016.jpg"
    }
}