{
    "recipe": {
        "title": "Prune and Walnut Crecents ",
        "ingredients": [
            "2 sticks (1 cup) cold unsalted butter, cut into tablespoon pieces",
            "1 (8-oz) package cold cream cheese, quartered",
            "1/4 cup sugar",
            "3/4 teaspoon salt",
            "2 cups all-purpose flour",
            "3/4 cup walnuts (3 oz), toasted",
            "1 cup pitted prunes (6 oz)",
            "1/4 cup sugar",
            "1/8 teaspoon cinnamon",
            "1 tablespoon cream Sherry or water",
            "1 large egg yolk beaten with 1 tablespoon water",
            "a 2 1/2-inch round cookie cutter"
        ],
        "instructions": [
            "Make pastry dough: Pulse butter, cream cheese, sugar, salt, and flour in a food processor just until a dough forms. (Do not overwork dough, or pastry will be tough.) Turn out dough onto a lightly floured surface and divide into 6 portions. With heel of your hand, smear each portion once or twice in a forward motion to help distribute fat. Gather dough and form into 2 balls, then flatten each ball into a 6-inch disk. Chill disks, each wrapped in plastic wrap, until firm, at least 1 hour.",
            "Pulse butter, cream cheese, sugar, salt, and flour in a food processor just until a dough forms. (Do not overwork dough, or pastry will be tough.)",
            "Turn out dough onto a lightly floured surface and divide into 6 portions. With heel of your hand, smear each portion once or twice in a forward motion to help distribute fat. Gather dough and form into 2 balls, then flatten each ball into a 6-inch disk. Chill disks, each wrapped in plastic wrap, until firm, at least 1 hour.",
            "Make filling: Pulse walnuts, prunes, sugar, cinnamon, and Sherry in food processor until nuts are finely chopped and filling forms a thick paste.",
            "Pulse walnuts, prunes, sugar, cinnamon, and Sherry in food processor until nuts are finely chopped and filling forms a thick paste.",
            "Form and bake crescents: Preheat oven to 375°F. Roll out 1 disk of dough (keep the other chilled) into a roughly 14-inch round (about 1/8 inch thick) on a lightly floured surface with a floured rolling pin. Cut out rounds with floured cookie cutter. Chill scraps. Put 1/2 teaspoon of filling in center of 1 dough round. Brush some of egg wash halfway around pastry, near edge, then fold dough over filling, forming a half-moon shape. Pinch edges to seal. Make more crescents in same manner, rerolling scraps (but only once). Arrange crescents 1/2 inch apart on 2 buttered large baking sheets and lightly brush tops with egg wash. Bake, 1 sheet at a time, in middle of oven until tops are pale golden, 15 to 20 minutes. Transfer to racks to cool.",
            "Preheat oven to 375°F.",
            "Roll out 1 disk of dough (keep the other chilled) into a roughly 14-inch round (about 1/8 inch thick) on a lightly floured surface with a floured rolling pin. Cut out rounds with floured cookie cutter. Chill scraps.",
            "Put 1/2 teaspoon of filling in center of 1 dough round. Brush some of egg wash halfway around pastry, near edge, then fold dough over filling, forming a half-moon shape. Pinch edges to seal. Make more crescents in same manner, rerolling scraps (but only once).",
            "Arrange crescents 1/2 inch apart on 2 buttered large baking sheets and lightly brush tops with egg wash. Bake, 1 sheet at a time, in middle of oven until tops are pale golden, 15 to 20 minutes. Transfer to racks to cool."
        ],
        "picture_link": null
    }
}