{
    "recipe": {
        "title": "Puffed Pancake with Strawberries ",
        "ingredients": [
            "1 pound small strawberries, hulled, sliced (about 1 2/3 cups)",
            "2 tablespoons powdered sugar plus additional for dusting",
            "3 tablespoons unsalted butter",
            "3/4 cup whole milk, room temperature",
            "3 large eggs, room temperature",
            "3/4 cup all purpose flour",
            "Pinch of salt",
            "Lemon wedges"
        ],
        "instructions": [
            "Preheat oven to 450°F. Stir strawberries and 2 tablespoons sugar in medium bowl. Let stand at room temperature while preparing pancake. Melt butter in 10-inch ovenproof skillet (preferably cast iron) over medium-high heat, swirling to coat bottom and sides of skillet. Blend milk and eggs in blender until smooth. Add flour and salt; blend batter just until incorporated. Pour batter into hot skillet. Transfer skillet to oven and bake pancake until puffed and golden in spots, about 11 minutes. Immediately cut pancake into quarters. Transfer 1 wedge to each of 4 plates. Spoon strawberries on top, dust with powdered sugar, garnish with lemon, and serve.",
            "Preheat oven to 450°F. Stir strawberries and 2 tablespoons sugar in medium bowl. Let stand at room temperature while preparing pancake.",
            "Melt butter in 10-inch ovenproof skillet (preferably cast iron) over medium-high heat, swirling to coat bottom and sides of skillet. Blend milk and eggs in blender until smooth. Add flour and salt; blend batter just until incorporated. Pour batter into hot skillet.",
            "Transfer skillet to oven and bake pancake until puffed and golden in spots, about 11 minutes.",
            "Immediately cut pancake into quarters. Transfer 1 wedge to each of 4 plates. Spoon strawberries on top, dust with powdered sugar, garnish with lemon, and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d99b67b55306961bf76b9/6:4/w_274%2Ch_169/238536.jpg"
    }
}