{
    "recipe": {
        "title": "Pull-Apart Potato Rolls ",
        "ingredients": [
            "1 large Yukon Gold potato (about 12 ounces), scrubbed",
            "1 cup whole milk",
            "1/2 cup (1 stick) unsalted butter, melted, plus more for brushing",
            "1 1/2 cups all-purpose flour",
            "2 (1/4-ounce) envelopes active dry yeast (about 2 1/4 teaspoons)",
            "3 (heaping) tablespoons sugar",
            "2 large eggs, beaten to blend",
            "1 large egg yolk, beaten to blend",
            "2 2/3 cups (or more) bread flour",
            "1 Tbsp. flaky sea salt, plus more",
            "Vegetable oil (for surface)",
            "A potato ricer"
        ],
        "instructions": [
            "Boil potato in a small saucepan of boiling water (no need to add salt) until a paring knife passes through flesh with no resistance, 30–40 minutes; drain. When cool enough to handle, pass through ricer into a small bowl (peel won't go through; discard). Mix milk and 3/4 cup riced potato in the bowl of a stand mixer with whisk attachment until no lumps remain. Add 1/2 cup butter and mix until incorporated. Switch to dough hook. Add all-purpose flour, yeast, and sugar and mix on medium speed, scraping bottom and sides of bowl as needed, until a very wet, sticky dough forms, about 2 minutes. Let dough rise, uncovered, in a warm spot, 30 minutes (it will have puffed slightly). Add eggs, egg yolk, 2 2/3 cups bread flour, and 1 Tbsp. salt and mix on medium-high, adding more bread flour if needed, until dough is smooth and elastic, about 5 minutes. Brush surface of dough with butter, cover, and let rise in a warm spot 30 minutes (dough should rise 1 1/2 times its initial size). Turn out dough onto a lightly oiled surface and divide into 18 pieces; roll each into a ball using your palm. Brush a 13x9\" baking dish with butter and place balls side by side in dish (rolls will be touching). Brush tops with more butter. Let sit, uncovered, in a warm spot 1 hour. Preheat oven to 400°F. Brush dough again with butter and sprinkle with salt. Bake rolls until deep golden brown, 15–20 minutes. Transfer dish to a wire rack and let rolls cool in dish 10 minutes. Turn out rolls onto rack and let cool 30 minutes before serving.",
            "Boil potato in a small saucepan of boiling water (no need to add salt) until a paring knife passes through flesh with no resistance, 30–40 minutes; drain. When cool enough to handle, pass through ricer into a small bowl (peel won't go through; discard).",
            "Mix milk and 3/4 cup riced potato in the bowl of a stand mixer with whisk attachment until no lumps remain. Add 1/2 cup butter and mix until incorporated. Switch to dough hook. Add all-purpose flour, yeast, and sugar and mix on medium speed, scraping bottom and sides of bowl as needed, until a very wet, sticky dough forms, about 2 minutes.",
            "Let dough rise, uncovered, in a warm spot, 30 minutes (it will have puffed slightly).",
            "Add eggs, egg yolk, 2 2/3 cups bread flour, and 1 Tbsp. salt and mix on medium-high, adding more bread flour if needed, until dough is smooth and elastic, about 5 minutes. Brush surface of dough with butter, cover, and let rise in a warm spot 30 minutes (dough should rise 1 1/2 times its initial size).",
            "Turn out dough onto a lightly oiled surface and divide into 18 pieces; roll each into a ball using your palm. Brush a 13x9\" baking dish with butter and place balls side by side in dish (rolls will be touching). Brush tops with more butter. Let sit, uncovered, in a warm spot 1 hour.",
            "Preheat oven to 400°F. Brush dough again with butter and sprinkle with salt. Bake rolls until deep golden brown, 15–20 minutes. Transfer dish to a wire rack and let rolls cool in dish 10 minutes. Turn out rolls onto rack and let cool 30 minutes before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57f2a3d13947aa8713ba2b65/6:4/w_274%2Ch_169/pull-apart-dinner-rolls-100316.jpg"
    }
}