{
    "recipe": {
        "title": "Pulled Chicken with Cherry-Chile Barbecue Sauce ",
        "ingredients": [
            "2 tablespoons vegetable oil",
            "1/2 cup coarsely chopped shallots (about 1 large)",
            "1 tablespoon peeled chopped fresh ginger (about one 1 1/2-inch piece)",
            "1 teaspoon minced fresh jalapeño (seeds and membranes removed)",
            "Scant 4 cups dark sweet fresh cherries, pitted and de-stemmed (3 cups afterwards)",
            "Two 14 1/2-ounce cans diced tomatoes, no salt added (you'll only use 1 1/2 cans; save the rest for another use)",
            "1/4 cup blackstrap molasses",
            "1/4 cup cider vinegar",
            "1 tablespoon chipotle chile from a can of chipotle chiles en adobo",
            "3 tablespoons Dijon mustard, divided",
            "1 1/4 teaspoons chile powder, divided",
            "2 teaspoons coarse salt, divided",
            "15 grinds black pepper, divided",
            "2 teaspoons light brown sugar",
            "3 pounds bone-in, skinless chicken thighs, trimmed if necessary (about 8)",
            "4 to 6 warmed burger buns, for serving"
        ],
        "instructions": [
            "1. Heat the oil in a large heavy saucepan over medium-high heat. When hot, add the shallots, ginger, and jalapeño and sauté until softened, about 2 minutes. Add the cherries, tomatoes, molasses, vinegar, chipotle, 1 tablespoon mustard, 3/4 teaspoon chile powder, 1 1/2 teaspoons salt, and 5 grinds pepper, and bring to a boil over high heat. Reduce to a simmer over medium heat, and cook until aromatic and thickened, about 5 minutes. Remove from the heat and carefully transfer half to a blender; purée until smooth, about 20 seconds. Purée the second half until smooth (you should have about 5 1/4 cups). Set aside.",
            "2. Meanwhile, mix 2 tablespoons mustard, 1/2 teaspoon chile powder, 1/2 teaspoons salt, 10 grinds pepper, and the brown sugar in a large bowl; add the chicken and mix well with your hands. Put the chicken in the bottom of the slow cooker and pour 1 1/2 cups of the barbecue sauce on top (reserve the remainder for serving and extras). Cover and cook on low until the meat is cooked through and tender, 4 to 4 1/2 hours.",
            "3. Use tongs to transfer the chicken to a cutting board and carefully use a fork to separate the meat from the bones, discarding the bones (you should have about 4 cups meat).",
            "4. To serve, stir together 1 cup of the remaining sauce and the shredded meat, and reheat in the microwave or on the stovetop. Spoon some meat and sauce onto the bottom half of each bun, cover with the top bun, and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560048c18bed7b35040ac49e/6:4/w_274%2Ch_169/51152400_pulled-chicken.jpg"
    }
}