{
    "recipe": {
        "title": "Pumpkin Pie ",
        "ingredients": [
            "Pastry dough",
            "15-oz can canned solid-pack pumpkin (about 2 cups)",
            "1 cup heavy cream",
            "1/2 cup whole milk",
            "2 large eggs",
            "3/4 cup packed light brown sugar",
            "1 teaspoon ground cinnamon",
            "1 teaspoon ground ginger",
            "Pinch of ground cloves",
            "1/4 teaspoon salt",
            "Accompaniment: lightly whipped cream",
            "pie weights or raw rice"
        ],
        "instructions": [
            "Make pastry dough as directed. Roll out dough into a 14-inch round on a lightly floured surface and fit into a 9-inch glass pie plate (4-cup capacity). Crimp edge decoratively and prick bottom all over. Chill 30 minutes. Preheat oven to 375°°F. Line shell with foil and fill with pie weights. Bake in middle of oven 20 minutes. Remove weights and foil and bake shell until pale golden, 6 to 10 minutes more. Cool in pan on a rack. Whisk together pumpkin, cream, milk, eggs, brown sugar, spices, and salt, then pour into shell. Bake pie in middle of oven 45 to 50 minutes, or until filling is set but center still trembles slightly. (Filling will continue to set as pie cools.) Transfer to rack and cool completely.",
            "Make pastry dough as directed. Roll out dough into a 14-inch round on a lightly floured surface and fit into a 9-inch glass pie plate (4-cup capacity). Crimp edge decoratively and prick bottom all over. Chill 30 minutes.",
            "Preheat oven to 375°°F.",
            "Line shell with foil and fill with pie weights. Bake in middle of oven 20 minutes. Remove weights and foil and bake shell until pale golden, 6 to 10 minutes more. Cool in pan on a rack. Whisk together pumpkin, cream, milk, eggs, brown sugar, spices, and salt, then pour into shell.",
            "Bake pie in middle of oven 45 to 50 minutes, or until filling is set but center still trembles slightly. (Filling will continue to set as pie cools.) Transfer to rack and cool completely."
        ],
        "picture_link": "https://assets.epicurious.com/photos/583f2feee703bab774cf891a/6:4/w_274%2Ch_169/pumpkin-pie.jpg"
    }
}