{
    "recipe": {
        "title": "Pumpkin Clafouti ",
        "ingredients": [
            "1 4- to 5- pound cheese pumpkin or butternut or Hubbard squash",
            "5 large eggs",
            "3/4 cup plus 2 tablespoons sugar",
            "1/2 cup milk",
            "1/2 cup heavy cream",
            "1 teaspoon vanilla extract",
            "1-inch piece of vanilla bean, split lengthwise, pulp scraped",
            "Pinch of salt",
            "1/4 cup all-purpose flour",
            "1 tablespoon unsalted butter, melted",
            "1/3 chopped toasted hazelnuts"
        ],
        "instructions": [
            "1. Preheat oven to 350°F. Cut the pumpkin or squash in half and scrape out the seeds. Place the halves, cut side up, on a baking sheet, and bake for 1 1/2 hours.",
            "2. When cool enough to handle, scrape the flesh into a food processor and blend to a smooth purée. Line a sieve with a double layer of cheesecloth or a clean kitchen towel and place over a bowl. Spoon the purée into the lined sieve and let it drain in the refrigerator overnight. The next day, pass the drained purée through a fine sieve to yield 2/3 cup (use any remaining purée for another purpose).",
            "3. Place the eggs, 3/4 cup of the sugar, the milk, cream, vanilla extract, vanilla pulp, and salt in a blender or food processor. Blend or pulse the mixture until very smooth, about 30 seconds. Add the pumpkin purée and blend well. Add the flour and pulse until well combined.",
            "4. Pass the batter through a fine sieve, then let it rest at room temperature for 30 minutes.",
            "5. Preheat oven to 425°F. Brush a 9-inch quiche or pie plate with the melted butter and sprinkle with the remaining 2 tablespoons of sugar. Sprinkle the hazelnuts in the pan. Pour the batter over the nuts. Bake the clafouti for 15 minutes, then lower the heat to 375°F and bake until the center is just set, about 12 minutes. Serve immediately."
        ],
        "picture_link": null,
        "color": 4994831
    }
}