{
    "recipe": {
        "title": "Pumpkin Brownie Pops ",
        "ingredients": [
            "12 (2 ¾- x 2 ¾-inch) brownies* made from Dylan's Candy Bar Brownie Mix or your favorite recipe",
            "Seven Minute Frosting or 1 (16-ounce) container purchased vanilla frosting",
            "Liquid food coloring in red and yellow",
            "1 (8.25 ounce) container orange sugar crystal sprinkles",
            "36 candy corn (less than ½ cup)",
            "48 sugar candy bats (also called dextrose candy bats)",
            "1 (7-inch) green apple licorice twist, cut into 12 (1/2-inch-long) pieces",
            "24 mini green gummy candies",
            "12 old-fashioned candy sticks or craft sticks*",
            "1 (2 ¾-inch) round cookie cutter",
            "*Baking the brownies in a 9- x 13-inch pan allows you to cut them into 12 (2 ¾- x 2 ¾-inch) squares.",
            "**Old-fashioned candy sticks can be purchased at candy stores or ohnuts.com. Craft sticks can be purchased at craft stores or craftsetc.com."
        ],
        "instructions": [
            "Using 2 3/4-inch round cookie cutter, cut each brownie into circle.",
            "Place frosting in small bowl and tint orange (see Decorating Tips). Using small offset spatula or knife, spread frosting in thin even layer on top of each brownie.",
            "Decorate brownie pops: Sprinkle each brownie with orange sprinkles. To create eyes, arrange 2 candy corn near top of 1 brownie and press gently to secure. To make nose, arrange 1 candy corn in between eyes and perpendicular to brownie. To create smile, arrange sugar candy bats in smile shape below nose and press into place. To make stem, push green apple licorice into top of brownie. To create leaves, arrange 2 mini green gummy candies alongside stem, gently pressing into frosting to secure. Decorate remaining brownies in same manner. Insert candy or craft stick into one side of each brownie.",
            "Sprinkle each brownie with orange sprinkles.",
            "To create eyes, arrange 2 candy corn near top of 1 brownie and press gently to secure. To make nose, arrange 1 candy corn in between eyes and perpendicular to brownie. To create smile, arrange sugar candy bats in smile shape below nose and press into place. To make stem, push green apple licorice into top of brownie. To create leaves, arrange 2 mini green gummy candies alongside stem, gently pressing into frosting to secure. Decorate remaining brownies in same manner.",
            "Insert candy or craft stick into one side of each brownie."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d79167b55306961bf3565/6:4/w_274%2Ch_169/350145.jpg"
    }
}