{
    "recipe": {
        "title": "Pumpkin Cheesecake Pie with Cornmeal Crust ",
        "ingredients": [
            "3 tablespoons (or more) ice water",
            "1 large egg yolk",
            "1 1/3 cups all purpose flour",
            "1/4 cup yellow cornmeal",
            "1 tablespoon sugar",
            "1/2 teaspoon salt",
            "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces",
            "6 ounces cream cheese, room temperature",
            "1/2 cup sugar",
            "1/2 cup (packed) golden brown sugar",
            "2 large eggs",
            "1 large egg yolk",
            "1 cup canned pure pumpkin",
            "3/4 cup half and half",
            "1 teaspoon ground cinnamon",
            "1 teaspoon ground nutmeg",
            "1/2 teaspoon grated lemon peel",
            "1/2 teaspoon ground ginger",
            "1/4 teaspoon salt"
        ],
        "instructions": [
            "Whisk 3 tablespoons ice water and egg yolk in small bowl to blend. Mix all purpose flour, yellow cornmeal, sugar and salt in processor. Add chilled butter. Using on/off turns, process until mixture resembles coarse meal. Drizzle egg yolk mixture over. Using on/off turns, process until moist clumps form, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball. Flatten dough into disk; wrap disk in plastic and refrigerate 30 minutes. (Can be prepared 1 day ahead. Keep refrigerated.)",
            "Position rack in bottom third of oven and preheat to 350°F. Roll out dough between 2 sheets of waxed paper to 12-inch round. Remove top sheet of waxed paper. Invert dough, paper side up, into 9-inch-diameter glass pie dish. Remove waxed paper from dough. Crimp dough edges decoratively.",
            "For filling: Using electric mixer, beat 6 ounces cream cheese in large bowl until fluffy. Add 1/2 cup sugar and 1/2 cup golden brown sugar and beat until light and fluffy. Beat in eggs and egg yolk 1 at a time. Add remaining ingredients and beat until well blended. Pour filling into prepared crust. Bake pie until filling is slightly puffed and just set in center, about 55 minutes. Transfer pie to rack and cool completely. Cover pie and refrigerate until cold, at least 4 hours. (Can be prepared 1 day ahead. Keep pie refrigerated.) Serve pie cold.",
            "Using electric mixer, beat 6 ounces cream cheese in large bowl until fluffy. Add 1/2 cup sugar and 1/2 cup golden brown sugar and beat until light and fluffy. Beat in eggs and egg yolk 1 at a time. Add remaining ingredients and beat until well blended. Pour filling into prepared crust.",
            "Bake pie until filling is slightly puffed and just set in center, about 55 minutes. Transfer pie to rack and cool completely. Cover pie and refrigerate until cold, at least 4 hours. (Can be prepared 1 day ahead. Keep pie refrigerated.) Serve pie cold."
        ],
        "picture_link": null
    }
}