{
    "recipe": {
        "title": "Pumpkin-Caramel Tart with Toasted-Hazelnut Crust ",
        "ingredients": [
            "1 1/4 cups skin-on hazelnuts",
            "1 cup all-purpose flour",
            "2 tablespoons granulated sugar",
            "3/4 teaspoons kosher salt",
            "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
            "Pinch of cream of tartar",
            "1 1/4 cups granulated sugar, divided",
            "1 cup heavy cream",
            "1 cup canned pumpkin purée",
            "2 tablespoons light brown sugar",
            "1 tablespoon all-purpose flour",
            "1 1/2 teaspoons finely grated peeled ginger",
            "3/4 teaspoon ground cinnamon",
            "3/4 teaspoon kosher salt",
            "3 large eggs",
            "Whipped cream (for serving)",
            "A 9\" springform pan"
        ],
        "instructions": [
            "Crust: Preheat oven to 350°F. Toast hazelnuts on a rimmed baking sheet, tossing once, until fragrant and slightly darkened, 8–10 minutes; let cool. Using a kitchen towel, rub hazelnuts together to remove most of the skins (don't worry about some stubborn bits remaining). Pulse flour, sugar, salt, and 3/4 cup hazelnuts in a food processor until the consistency of coarse meal. Reserve remaining 1/2 cup hazelnuts for filling. Add butter to dry ingredients and pulse until there are only a few pea-size pieces of butter remaining. Transfer mixture to a large bowl; drizzle 3 Tbsp. ice water over and mix, adding another splash or so of water if needed, just to bring dough together. Using your fingers, press dough evenly 1 1/2\"–2\" up the sides and then into the bottom of pan; compact and smooth with a flat, straight-sided measuring cup or glass. Chill 20 minutes. Bake crust until golden but not totally baked through, 15–20 minutes. Transfer to a wire rack and let cool 10 minutes.",
            "Preheat oven to 350°F. Toast hazelnuts on a rimmed baking sheet, tossing once, until fragrant and slightly darkened, 8–10 minutes; let cool. Using a kitchen towel, rub hazelnuts together to remove most of the skins (don't worry about some stubborn bits remaining).",
            "Pulse flour, sugar, salt, and 3/4 cup hazelnuts in a food processor until the consistency of coarse meal. Reserve remaining 1/2 cup hazelnuts for filling. Add butter to dry ingredients and pulse until there are only a few pea-size pieces of butter remaining.",
            "Transfer mixture to a large bowl; drizzle 3 Tbsp. ice water over and mix, adding another splash or so of water if needed, just to bring dough together.",
            "Using your fingers, press dough evenly 1 1/2\"–2\" up the sides and then into the bottom of pan; compact and smooth with a flat, straight-sided measuring cup or glass. Chill 20 minutes.",
            "Bake crust until golden but not totally baked through, 15–20 minutes. Transfer to a wire rack and let cool 10 minutes.",
            "Filling and assembly: Meanwhile, bring cream of tartar, 1 cup granulated sugar, and 2 Tbsp. water to a boil in a medium saucepan over medium heat, stirring until sugar dissolves. Increase heat to mediumhigh and cook, swirling pan occasionally (do not stir), until caramel is a deep amber color, 8-10 minutes. Remove from heat. Whisking constantly, carefully add cream (mixture will be extremely hot and will bubble vigorously); whisk until smooth. Let caramel cool slightly in pot. Whisk pumpkin purée, brown sugar, flour, ginger, cinnamon, and salt in a large bowl. Gradually add caramel and eggs, whisking until well blended. Scrape filling into prepared crust. Bake tart, rotating halfway through, until filling is set around edges and center barely jiggles, 30-35 minutes. Transfer to a wire rack and let cool in pan. Meanwhile, coarsely chop reserved 1/2 cup hazelnuts and cook in a small skillet over medium heat with remaining 1/4 cup sugar and 1 Tbsp. water, stirring constantly, until sugar caramelizes and evenly coats hazelnuts. Transfer caramelized hazelnuts to a sheet of parchment paper and let cool completely. Coarsely chop. Scatter caramelized hazelnuts over tart and serve with whipped cream.",
            "Meanwhile, bring cream of tartar, 1 cup granulated sugar, and 2 Tbsp. water to a boil in a medium saucepan over medium heat, stirring until sugar dissolves. Increase heat to mediumhigh and cook, swirling pan occasionally (do not stir), until caramel is a deep amber color, 8-10 minutes. Remove from heat. Whisking constantly, carefully add cream (mixture will be extremely hot and will bubble vigorously); whisk until smooth. Let caramel cool slightly in pot.",
            "Whisk pumpkin purée, brown sugar, flour, ginger, cinnamon, and salt in a large bowl. Gradually add caramel and eggs, whisking until well blended. Scrape filling into prepared crust.",
            "Bake tart, rotating halfway through, until filling is set around edges and center barely jiggles, 30-35 minutes. Transfer to a wire rack and let cool in pan.",
            "Meanwhile, coarsely chop reserved 1/2 cup hazelnuts and cook in a small skillet over medium heat with remaining 1/4 cup sugar and 1 Tbsp. water, stirring constantly, until sugar caramelizes and evenly coats hazelnuts. Transfer caramelized hazelnuts to a sheet of parchment paper and let cool completely. Coarsely chop. Scatter caramelized hazelnuts over tart and serve with whipped cream.",
            "Do ahead Tart (without nuts) can be made 2 days ahead; cover and chill. Hazelnuts can be caramelized 2 days ahead; store airtight at room temperature.",
            "Tart (without nuts) can be made 2 days ahead; cover and chill. Hazelnuts can be caramelized 2 days ahead; store airtight at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/563a3d4c9978979816f022c9/6:4/w_274%2Ch_169/pumpkin-caramel-tart-with-toasted-hazelnut-crust.jpg"
    }
}