{
    "recipe": {
        "title": "Pumpkin Icebox Pie With Snickerdoodle Crust ",
        "ingredients": [
            "4 tablespoons (1/2 stick) unsalted butter, room temperature, plus more for pan",
            "1 teaspoon ground cinnamon",
            "1/2 cup plus 1 tablespoon sugar, divided",
            "3/4 cup all-purpose flour",
            "1/4 teaspoon baking soda",
            "1/4 teaspoon kosher salt",
            "1 large egg yolk",
            "1/2 teaspoon vanilla extract",
            "4 ounces cream cheese, room temperature",
            "3/4 cup canned pumpkin purée",
            "3/4 cup pure maple syrup, preferably dark",
            "1/2 teaspoon ground ginger",
            "1/4 teaspoon ground nutmeg",
            "1/4 teaspoon kosher salt",
            "1/2 teaspoon ground cinnamon, plus more for sprinkling",
            "1 tablespoon brandy",
            "1 3/4 teaspoons unflavored gelatin",
            "1 1/2 cups heavy cream, divided",
            "A 9\" pie pan (not deep dish)"
        ],
        "instructions": [
            "Preheat oven to 375°F. Butter pie pan.",
            "Whisk cinnamon and 1 Tbsp. sugar in a large bowl. Whisk flour, baking soda, and salt in a medium bowl.",
            "Beat 4 Tbsp. butter and remaining 1/2 cup sugar in the bowl of a stand mixer fitted with the paddle attachment on medium-high speed until pale and fluffy, about 3 minutes. Add egg yolk and vanilla and beat until just combined. Reduce speed to low and gradually add flour mixture; beat until just combined.",
            "Transfer dough to a work surface, flatten into a disc, then press into cinnamon sugar to coat both sides. Transfer to prepared pan and press evenly into bottom and up sides with a flat measuring cup. Poke holes all over the bottom with a fork, then freeze 15 minutes.",
            "Bake crust until lightly golden brown, 10–12 minutes. Let cool completely.",
            "Make the filling: Beat cream cheese and pumpkin purée in the bowl of stand mixer fitted with the paddle attachment on high speed until smooth, about 3 minutes. Add maple syrup, ginger, nutmeg, salt, and 1/2 tsp. cinnamon and continue to beat until streak-free. Meanwhile, cook brandy, gelatin, and 1/4 cup water in a small saucepan over low heat, stirring constantly, until dissolved. Stir into pumpkin mixture. Using an electric mixer on high speed, beat 1/2 cup cream in a large bowl until stiff peaks form, then fold into pumpkin mixture. Pour filling into crust and smooth surface. Chill at least 6 hours or up to overnight. Before serving, beat remaining 1 cup cream in a large bowl with electric mixer on high speed until soft peaks form. Top pie with whipped cream and sprinkle with cinnamon.",
            "Beat cream cheese and pumpkin purée in the bowl of stand mixer fitted with the paddle attachment on high speed until smooth, about 3 minutes. Add maple syrup, ginger, nutmeg, salt, and 1/2 tsp. cinnamon and continue to beat until streak-free.",
            "Meanwhile, cook brandy, gelatin, and 1/4 cup water in a small saucepan over low heat, stirring constantly, until dissolved. Stir into pumpkin mixture.",
            "Using an electric mixer on high speed, beat 1/2 cup cream in a large bowl until stiff peaks form, then fold into pumpkin mixture. Pour filling into crust and smooth surface. Chill at least 6 hours or up to overnight.",
            "Before serving, beat remaining 1 cup cream in a large bowl with electric mixer on high speed until soft peaks form. Top pie with whipped cream and sprinkle with cinnamon.",
            "Do Ahead Crust can be made up to six hours before filling. Filled pie can be stored in the refrigerator for one day before serving.",
            "Crust can be made up to six hours before filling. Filled pie can be stored in the refrigerator for one day before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/561d75b46c04e16c328c5d29/6:4/w_274%2Ch_169/EP_09292015_thanksgivingpie_pumpkinhero.jpg"
    }
}