{
    "recipe": {
        "title": "Pumpkin Pie Brûlée ",
        "ingredients": [
            "Flaky Pie Crust Dough",
            "1 15-ounce can pure pumpkin",
            "3/4 cup plus 4 tablespoons sugar",
            "3 large eggs",
            "1 1/4 cups whipping cream",
            "1 teaspoon ground cinnamon",
            "1 teaspoon ground ginger",
            "1/4 teaspoon ground nutmeg",
            "Pinch of ground cloves",
            "1/4 teaspoon salt"
        ],
        "instructions": [
            "Preheat oven to 375°F. Roll out dough on lightly floured surface to 12-inch round. Transfer to 9-inch-diameter glass pie dish. Fold overhang under and crimp decoratively. Pierce dough all over with fork. Freeze 15 minutes. Line crust with foil; fill with dried beans or pie weights. Bake until sides are set, about 12 minutes. Remove foil and beans. Reduce oven temperature to 350°F. Whisk pumpkin and 3/4 cup sugar in large bowl to blend. Whisk in eggs, then cream, spices, and salt. Pour filling into warm crust. Bake pie until filling is set in center, about 50 minutes. Transfer pie to rack; cool 30 minutes. Chill until cold, at least 2 hours and up to 1 day. Preheat broiler. Sprinkle pie evenly with 2 tablespoons sugar. Broil until sugar melts and begins to caramelize, turning pie for even browning, about 1 minute. Let pie stand until topping hardens, about 20 minutes. Sprinkle pie again with remaining 2 tablespoons sugar. Broil again until sugar browns, about 1 minute. Refrigerate pie until topping hardens, about 30 minutes. Serve or keep refrigerated no more than 2 hours longer.",
            "Preheat oven to 375°F. Roll out dough on lightly floured surface to 12-inch round. Transfer to 9-inch-diameter glass pie dish. Fold overhang under and crimp decoratively. Pierce dough all over with fork. Freeze 15 minutes. Line crust with foil; fill with dried beans or pie weights. Bake until sides are set, about 12 minutes. Remove foil and beans. Reduce oven temperature to 350°F.",
            "Whisk pumpkin and 3/4 cup sugar in large bowl to blend. Whisk in eggs, then cream, spices, and salt. Pour filling into warm crust. Bake pie until filling is set in center, about 50 minutes. Transfer pie to rack; cool 30 minutes. Chill until cold, at least 2 hours and up to 1 day.",
            "Preheat broiler. Sprinkle pie evenly with 2 tablespoons sugar. Broil until sugar melts and begins to caramelize, turning pie for even browning, about 1 minute. Let pie stand until topping hardens, about 20 minutes. Sprinkle pie again with remaining 2 tablespoons sugar. Broil again until sugar browns, about 1 minute. Refrigerate pie until topping hardens, about 30 minutes. Serve or keep refrigerated no more than 2 hours longer."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea89a7b55306961bff7f8/6:4/w_274%2Ch_169/105850.jpg"
    }
}