{
    "recipe": {
        "title": "Pumpkin Whoopie Pies ",
        "ingredients": [
            "1 1/2 cups all-purpose flour",
            "1/2 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "1/2 teaspoon salt",
            "1 teaspoon ground cinnamon",
            "1/2 teaspoon ground ginger",
            "1/4 teaspoon freshly grated nutmeg",
            "1/4 teaspoon ground cloves",
            "1 cup packed light brown sugar",
            "1/2 cup vegetable oil",
            "1 (15-ounce) can pure pumpkin (not pie filling)",
            "1 large egg",
            "1 teaspoon pure vanilla extract",
            "2 tablespoons packed light brown sugar",
            "Pinch of salt",
            "1/2 tablespoon water",
            "1/2 cup pecans",
            "6 ounces cream cheese, softened",
            "3/4 stick (6 tablespoons) unsalted butter, softened",
            "Pinch of salt",
            "1 1/2 cups confectioners' sugar",
            "1 tablespoon bourbon (optional; substitute 1 teaspoon vanilla extract)",
            "2 large baking sheets; parchment paper; 1-ounce round ice cream scoop (optional; see Cooks' Notes)"
        ],
        "instructions": [
            "Preheat oven to 350°F with rack in middle. Line 2 large baking sheets with parchment paper.",
            "Whisk together flour, baking powder, soda, salt, and spices in a bowl.",
            "Whisk together sugar, oil, pumpkin, egg, and vanilla in a separate large bowl until well combined, then stir in flour mixture.",
            "Using a 1-ounce ice cream scoop or tablespoon measure, drop a scant scoop's worth of batter or 2 scant tablespoons of batter onto a lined baking sheet to form 1 mound. Make 15 more mounds, arranging them 2 inches apart until baking sheet is full (you will have batter left over).",
            "Bake until springy to the touch, 12 to 18 minutes. Transfer cookie-cakes to rack to cool.",
            "Form and bake remaining batter on the other parchment-lined sheet. You should have a total of 32 cookie-cakes.",
            "Leave oven on.",
            "For candied pecans: Line a small sheet pan with parchment paper. Stir together sugar, salt, and 1/2 tablespoon water in a small saucepan. Heat over moderate heat until sugar dissolves, then bring to a boil. Stir in pecans. Spread mixture on lined sheet pan and bake until coating is bubbling and golden brown, about 10 minutes. Cool completely on pan on a rack. Coarsely chop candied pecans.",
            "Line a small sheet pan with parchment paper.",
            "Stir together sugar, salt, and 1/2 tablespoon water in a small saucepan. Heat over moderate heat until sugar dissolves, then bring to a boil. Stir in pecans.",
            "Spread mixture on lined sheet pan and bake until coating is bubbling and golden brown, about 10 minutes.",
            "Cool completely on pan on a rack.",
            "Coarsely chop candied pecans.",
            "For filling: While cookie-cakes are baking, beat cream cheese, butter, and salt in a bowl with an electric mixer until smooth. Add confectioners' sugar and bourbon and mix on low speed until smooth. Chill filling until firm enough to hold its shape when spread, 30 minutes to 1 hour.",
            "While cookie-cakes are baking, beat cream cheese, butter, and salt in a bowl with an electric mixer until smooth. Add confectioners' sugar and bourbon and mix on low speed until smooth.",
            "Chill filling until firm enough to hold its shape when spread, 30 minutes to 1 hour.",
            "Assemble whoopie pies: Spread 1 heaping tablespoon of filling each on flat side of half the cooled cookie-cakes, then top with other half of cookie-cakes. If necessary, chill whoopie pies just long enough to firm up filling again, about 30 minutes. Gently press pecans onto filling around middle of each whoopie pie to help them adhere to filling.",
            "Spread 1 heaping tablespoon of filling each on flat side of half the cooled cookie-cakes, then top with other half of cookie-cakes. If necessary, chill whoopie pies just long enough to firm up filling again, about 30 minutes.",
            "Gently press pecans onto filling around middle of each whoopie pie to help them adhere to filling."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b2804c9a93d64c380b043a/6:4/w_274%2Ch_169/369375_pumpkin-whoopie-pies_1x1.jpg",
        "color": 6093426
    }
}