{
    "recipe": {
        "title": "Pumpkin and Shrimp Bisque ",
        "ingredients": [
            "1 pound large shrimp (16 to 20)",
            "2 tablespoons extra-virgin olive oil",
            "3/4 cup dry white wine",
            "3 cups homemade or canned low-sodium chicken stock",
            "Pinch saffron threads (about 24)",
            "2 ribs celery, coarsely chopped",
            "1 medium onion (about 8 ounces), coarsely chopped",
            "4 fresh bay laurel leaves, torn, or 2 dried",
            "3 3-inch springs fresh sage",
            "2 cups pumpkin purée, fresh (see Note) or canned",
            "1/2 cup heavy cream",
            "About 3/4 teaspoon salt, less if using canned stock",
            "Scant 1/8 teaspoon cayenne pepper",
            "1 tablespoon freshly squeezed lemon juice",
            "Freshly ground black pepper",
            "1 tablespoon extra-virgin olive oil",
            "2 teaspoons finely chopped fresh sage"
        ],
        "instructions": [
            "1. Shrimp stock: Peel and devein shrimp, reserving the shells. Cover the shrimp and refrigerate. Heat the olive oil in a medium (3-quart) heavy-bottomed saucepan over high heat until it begins to smoke. Add the shrimp shells to the pan and cook, stirring constantly, until they turn deep orange and are just beginning to brown, 3 to 4 minutes. This step—pan roasting the shells—gives the stock much of its flavor, so take the time to do it carefully. The roasted shells should release a concentrated, toasty, shrimp aroma that will fill your kitchen. Add the wine to the pan, first turning off gas flames to prevent the alcohol from igniting, then boil it over medium heat until all the liquid is evaporated. Add the chicken stock, saffron, celery, onion, bay leaves, and sage. Bring to a boil, then reduce the heat to the lowest setting. Partially cover the pan and simmer gently for 30 minutes. Strain the stock through a fine sieve, pushing down on the solids with the back of a spoon to extract all the liquid. Rinse out the saucepan and pour the stock back into it. 2. Soup: Whisk the pumpkin, cream, salt (omit if using canned stock), and cayenne into the shrimp stock. Bring the soup to a simmer, then cook very gently uncovered over low heat for 10 minutes. Stir in the lemon juice, taste, and season with black pepper and more salt if needed. (The soup can be made up to this point up to 1 day ahead store covered in the refrigerator. Keep the peeled shrimp in a resealable bag buried in a bowl of ice in the refrigerator.) 3. Finishing the soup: Pour the olive oil into a large sauté pan placed over medium heat. When hot, add the reserved shrimp and sage and cook, tossing often, until the shrimp is just cooked through, pink, and no longer translucent, but not curled into a circle, 2 to 3 minutes. They should still have a tender snap when you bite into them. Arrange the shrimp in warmed serving bowls or a tureen. Bring the soup back to a simmer and then ladle it over the shrimp. Serve right away.",
            "1. Shrimp stock: Peel and devein shrimp, reserving the shells. Cover the shrimp and refrigerate. Heat the olive oil in a medium (3-quart) heavy-bottomed saucepan over high heat until it begins to smoke. Add the shrimp shells to the pan and cook, stirring constantly, until they turn deep orange and are just beginning to brown, 3 to 4 minutes. This step—pan roasting the shells—gives the stock much of its flavor, so take the time to do it carefully. The roasted shells should release a concentrated, toasty, shrimp aroma that will fill your kitchen. Add the wine to the pan, first turning off gas flames to prevent the alcohol from igniting, then boil it over medium heat until all the liquid is evaporated. Add the chicken stock, saffron, celery, onion, bay leaves, and sage. Bring to a boil, then reduce the heat to the lowest setting. Partially cover the pan and simmer gently for 30 minutes. Strain the stock through a fine sieve, pushing down on the solids with the back of a spoon to extract all the liquid. Rinse out the saucepan and pour the stock back into it.",
            "2. Soup: Whisk the pumpkin, cream, salt (omit if using canned stock), and cayenne into the shrimp stock. Bring the soup to a simmer, then cook very gently uncovered over low heat for 10 minutes. Stir in the lemon juice, taste, and season with black pepper and more salt if needed. (The soup can be made up to this point up to 1 day ahead store covered in the refrigerator. Keep the peeled shrimp in a resealable bag buried in a bowl of ice in the refrigerator.)",
            "3. Finishing the soup: Pour the olive oil into a large sauté pan placed over medium heat. When hot, add the reserved shrimp and sage and cook, tossing often, until the shrimp is just cooked through, pink, and no longer translucent, but not curled into a circle, 2 to 3 minutes. They should still have a tender snap when you bite into them. Arrange the shrimp in warmed serving bowls or a tureen. Bring the soup back to a simmer and then ladle it over the shrimp. Serve right away.",
            "Variation Substitute winter squash purée, such as butternut or acorn, for the pumpkin.",
            "Substitute winter squash purée, such as butternut or acorn, for the pumpkin."
        ],
        "picture_link": "https://assets.epicurious.com/photos/561026aaf9a84192308aa44d/6:4/w_274%2Ch_169/104123.jpg"
    }
}