{
    "recipe": {
        "title": "Purslane and Avocado Tacos with Pico de Gallo ",
        "ingredients": [
            "1 pint grape tomatoes, quartered",
            "1/2 cup chopped white onion",
            "1 tablespoon lime juice, or to taste",
            "2 teaspoons minced fresh Serrano chile, or to taste",
            "1/4 cup chopped cilantro",
            "Salt",
            "Freshly ground pepper",
            "2 large garlic cloves, finely chopped",
            "1 tablespoon olive oil",
            "1 lb purslane, including tender upper stems, chopped (about 6 cups)",
            "8 fresh corn tortillas",
            "2 avocados",
            "1/2 cup crumbled cotija cheese (about 3 ounces), or to taste",
            "cilantro sprigs and lime wedges for serving"
        ],
        "instructions": [
            "Combine tomatoes, onion, lime juice, chile, and cilantro in a bowl and season with salt and pepper. Let it stand while assembling the tacos.",
            "Cook garlic in oil in a 12-inch heavy skillet over medium heat, stirring, until pale golden. Add purslane with salt to taste and cook, stirring, until wilted and tender, about 3 minutes. Transfer to a sieve set over a bowl and let it drain. Have a folded kitchen towel ready for the tortillas. Heat a 10-inch cast-iron skillet over medium heat until hot, then heat a tortilla, keeping the others covered, flipping it occasionally with tongs, until it puffs slightly and gets brown in spots, 1 to 1 1/2 minutes. Transfer tortilla, as toasted, to towel, enclosing it, and repeat with remaining tortillas. Keep them warm in towel. Quarter avocados lengthwise and remove pit, then peel. Cut each section into thin slices (lengthwise or crosswise, it doesn't matter) and season with salt. Assemble tacos by spooning some purslane into a folded taco and topping it with avocado slices, cotija cheese, cilantro sprigs, and pico de gallo. Serve with lime wedges.",
            "Cook garlic in oil in a 12-inch heavy skillet over medium heat, stirring, until pale golden. Add purslane with salt to taste and cook, stirring, until wilted and tender, about 3 minutes. Transfer to a sieve set over a bowl and let it drain.",
            "Have a folded kitchen towel ready for the tortillas. Heat a 10-inch cast-iron skillet over medium heat until hot, then heat a tortilla, keeping the others covered, flipping it occasionally with tongs, until it puffs slightly and gets brown in spots, 1 to 1 1/2 minutes. Transfer tortilla, as toasted, to towel, enclosing it, and repeat with remaining tortillas. Keep them warm in towel.",
            "Quarter avocados lengthwise and remove pit, then peel. Cut each section into thin slices (lengthwise or crosswise, it doesn't matter) and season with salt.",
            "Assemble tacos by spooning some purslane into a folded taco and topping it with avocado slices, cotija cheese, cilantro sprigs, and pico de gallo. Serve with lime wedges."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac13a66529d92b2c036c6e/6:4/w_274%2Ch_169/51240610_purslane-and-avocado-tacos_1x1.jpg"
    }
}