{
    "recipe": {
        "title": "Quail Escabeche (Caille en Escabeche) ",
        "ingredients": [
            "4 whole quail (1 1/2 pounds)",
            "2 tablespoons extra-virgin olive oil plus additional for drizzling",
            "2 fennel bulbs (1 pound total), stalks discarded and bulbs chopped",
            "3 medium shallots, finely chopped (1/2 cup)",
            "1 garlic clove, finely chopped",
            "1 lemongrass stalk, 1 or 2 outer layers discarded and lower 4 inches of stalk minced",
            "1/2 cup raisins",
            "1 (2-inch) cinnamon stick (preferably Mexican/Ceylon canela)",
            "1 cup dry white wine"
        ],
        "instructions": [
            "Preheat oven to 350°F with rack in middle. Pat quail dry and season all over with 1/2 teaspoon salt and 1/4 teaspoon pepper (total). Heat oil in an ovenproof 12-inch heavy skillet over medium-high heat until it shimmers. Sear quail, breast side down, until golden, 3 to 4 minutes. Transfer to a plate. Add fennel, shallots, garlic, 1 teaspoon salt, and 1/2 teaspoon pepper to skillet and sauté until fennel is pale golden, 5 to 7 minutes. Stir in lemongrass, raisins, cinnamon stick, and wine. Bring to a boil, then cover pot and braise in oven 30 minutes. Nestle quail, breast side up, in vegetables, then cover and braise until thighs pull easily from joints, about 20 minutes. Cool completely, uncovered. Serve at room temperature, drizzled with olive oil.",
            "Preheat oven to 350°F with rack in middle.",
            "Pat quail dry and season all over with 1/2 teaspoon salt and 1/4 teaspoon pepper (total). Heat oil in an ovenproof 12-inch heavy skillet over medium-high heat until it shimmers. Sear quail, breast side down, until golden, 3 to 4 minutes. Transfer to a plate.",
            "Add fennel, shallots, garlic, 1 teaspoon salt, and 1/2 teaspoon pepper to skillet and sauté until fennel is pale golden, 5 to 7 minutes. Stir in lemongrass, raisins, cinnamon stick, and wine. Bring to a boil, then cover pot and braise in oven 30 minutes. Nestle quail, breast side up, in vegetables, then cover and braise until thighs pull easily from joints, about 20 minutes. Cool completely, uncovered. Serve at room temperature, drizzled with olive oil."
        ],
        "picture_link": null
    }
}