{
    "recipe": {
        "title": "Quark Spatzle with Cheese ",
        "ingredients": [
            "1 cup quark cheese (see tips, below)",
            "4 extra-large eggs",
            "3 large egg yolks",
            "2 cups all-purpose flour",
            "1 teaspoon fine sea salt",
            "1/4 teaspoon freshly grated nutmeg",
            "Freshly ground white pepper",
            "6 tablespoons unsalted butter",
            "1 cup chopped onion",
            "Fine sea salt and freshly ground black pepper",
            "2 garlic cloves, chopped",
            "1/2 nutmeg, freshly grated",
            "Sea salt and freshly ground white pepper",
            "1/2 pound Alpine Gruyère-style cheese, such as Hoch Ybrig or Gruyère (see Note), grated",
            "1 cup beef stock or low-sodium canned beef broth",
            "3 shallots, thinly sliced, for garnish",
            "2 tablespoons chopped fresh chives, for garnish"
        ],
        "instructions": [
            "1. Prepare the spätzle: Bring a large pot of water to a boil and salt it until it tastes like sea water (about 2 teaspoons per quart). Whisk the quark, eggs, and yolks together in a large bowl. Use a rubber spatula to stir in the flour until smooth. Season with the salt, nutmeg, and white pepper. 2. Using half of the spätzle dough at a time and working quickly, push the dough through the holes of a colander (or spätzle maker) into the boiling water. Stir the spätzle and cook until the water returns to a simmer, about 1 minute. Then, using a skimmer or a large slotted spoon, transfer the spätzle to another colander. Run cold water over the spätzle to stop them from cooking further. Set that batch of spätzle aside. When the water returns to a boil, make the rest of the spätzle, repeating the procedure. 3. Heat a large cast-iron skillet over medium heat. Add 3 tablespoons of the butter and then the onions. Season with salt and pepper, and cook, stirring occasionally, until soft and light brown, about 15 minutes. Add the garlic and cook until tender, another 2 minutes. Raise the heat to high and add the spätzle. Fry, stirring frequently, until the spätzle begin to turn golden, about 10 minutes. Season with the nutmeg, salt, and pepper. 4. Add the cheese and fry, stirring, until it begins to brown, about 10 minutes. Add 1/2 cup of the beef stock and cook, stirring often, until it is absorbed. Add more stock until a thick, soupy consistency is achieved. 5. Meanwhile, melt the remaining 3 tablespoons butter in a small saucepan over medium-high heat. Add the shallots, season with salt and pepper, and fry until they are brown and slightly crisp. 6. Serve immediately, garnished with the fried shallots and chives.",
            "1. Prepare the spätzle: Bring a large pot of water to a boil and salt it until it tastes like sea water (about 2 teaspoons per quart). Whisk the quark, eggs, and yolks together in a large bowl. Use a rubber spatula to stir in the flour until smooth. Season with the salt, nutmeg, and white pepper.",
            "2. Using half of the spätzle dough at a time and working quickly, push the dough through the holes of a colander (or spätzle maker) into the boiling water. Stir the spätzle and cook until the water returns to a simmer, about 1 minute. Then, using a skimmer or a large slotted spoon, transfer the spätzle to another colander. Run cold water over the spätzle to stop them from cooking further. Set that batch of spätzle aside. When the water returns to a boil, make the rest of the spätzle, repeating the procedure.",
            "3. Heat a large cast-iron skillet over medium heat. Add 3 tablespoons of the butter and then the onions. Season with salt and pepper, and cook, stirring occasionally, until soft and light brown, about 15 minutes. Add the garlic and cook until tender, another 2 minutes. Raise the heat to high and add the spätzle. Fry, stirring frequently, until the spätzle begin to turn golden, about 10 minutes. Season with the nutmeg, salt, and pepper.",
            "4. Add the cheese and fry, stirring, until it begins to brown, about 10 minutes. Add 1/2 cup of the beef stock and cook, stirring often, until it is absorbed. Add more stock until a thick, soupy consistency is achieved.",
            "5. Meanwhile, melt the remaining 3 tablespoons butter in a small saucepan over medium-high heat. Add the shallots, season with salt and pepper, and fry until they are brown and slightly crisp.",
            "6. Serve immediately, garnished with the fried shallots and chives.",
            "Note: Hoch Ybrig is made in Zurich from cow's milk. It is a buttery, nutty, pungent cheese, similar in flavor to Gruyère. It is available at specialty cheese stores.",
            "Note: Hoch Ybrig is made in Zurich from cow's milk. It is a buttery, nutty, pungent cheese, similar in flavor to Gruyère. It is available at specialty cheese stores."
        ],
        "picture_link": null
    }
}