{
    "recipe": {
        "title": "Quiche Sardou ",
        "ingredients": [
            "1/2 cup (1 stick) chilled unsalted butter, cut into cubes",
            "1/8 teaspoon kosher salt",
            "1 1/4 cups all-purpose flour, plus more for surface",
            "1 large egg yolk",
            "5 ounces baby spinach (about 4 packed cups)",
            "2 tablespoons unsalted butter",
            "1 medium onion, thinly sliced",
            "1/2 cup frozen artichoke hearts, thawed, coarsely chopped",
            "1 teaspoon kosher salt",
            "1/2 teaspoon freshly ground black pepper",
            "4 large eggs",
            "2/3 cup heavy cream",
            "2/3 cup whole milk",
            "A 9-9 1/2-inch round fluted tart pan (1 inch deep) with removable bottom; pie weights or raw rice"
        ],
        "instructions": [
            "Make the crust: Pulse butter, salt, and 1 1/4 cups flour in a food processor until mixture resembles coarse meal with a few pea-size pieces of butter remaining. Add 1/4 cup ice water; pulse 1–2 times just until moistened. Turn out dough and gather into a ball, kneading once or twice. Flatten into a disc, wrap in plastic, and chill until firm, about 30 minutes. Position rack in middle of oven and preheat oven to 375°F. Roll out dough on a lightly floured surface to an 11\" round. Press into bottom and up sides of tart pan; trim excess. Prick bottom of shell all over with a fork and freeze 10 minutes. Line shell with parchment paper and fill with pie weights. Bake until pastry is nearly dry, about 30 minutes. Beat egg yolk with 2 Tbsp. water in a small bowl just to combine. Remove parchment and pie weights and brush bottom and sides of shell lightly with egg yolk mixture. Return to oven and continue baking until lightly golden, about 25 minutes more. Let cool on a wire rack. Reduce oven temperature to 350°F.",
            "Pulse butter, salt, and 1 1/4 cups flour in a food processor until mixture resembles coarse meal with a few pea-size pieces of butter remaining. Add 1/4 cup ice water; pulse 1–2 times just until moistened. Turn out dough and gather into a ball, kneading once or twice. Flatten into a disc, wrap in plastic, and chill until firm, about 30 minutes.",
            "Position rack in middle of oven and preheat oven to 375°F. Roll out dough on a lightly floured surface to an 11\" round. Press into bottom and up sides of tart pan; trim excess. Prick bottom of shell all over with a fork and freeze 10 minutes.",
            "Line shell with parchment paper and fill with pie weights. Bake until pastry is nearly dry, about 30 minutes.",
            "Beat egg yolk with 2 Tbsp. water in a small bowl just to combine. Remove parchment and pie weights and brush bottom and sides of shell lightly with egg yolk mixture. Return to oven and continue baking until lightly golden, about 25 minutes more. Let cool on a wire rack. Reduce oven temperature to 350°F.",
            "Make the filling: Cook spinach and 2 Tbsp. water in a large skillet, stirring occasionally, until wilted, about 5 minutes. Transfer spinach to a colander; reserve skillet. Drain spinach, pressing out excess liquid, then coarsely chop. Melt butter in same skillet over medium heat. Add onion and cook, stirring occasionally, until caramelized, about 15 minutes. Add artichokes and cook, stirring, until warmed through, about 5 minutes more. Stir in chopped spinach and season with salt and pepper. Spread vegetable mixture into crust. Whisk eggs, cream, and milk in a medium bowl and pour over vegetable mixture. Bake quiche until set and lightly golden, 30–35 minutes. Transfer to a wire rack and let cool 15 minutes. Serve warm or at room temperature.",
            "Cook spinach and 2 Tbsp. water in a large skillet, stirring occasionally, until wilted, about 5 minutes. Transfer spinach to a colander; reserve skillet. Drain spinach, pressing out excess liquid, then coarsely chop.",
            "Melt butter in same skillet over medium heat. Add onion and cook, stirring occasionally, until caramelized, about 15 minutes. Add artichokes and cook, stirring, until warmed through, about 5 minutes more. Stir in chopped spinach and season with salt and pepper. Spread vegetable mixture into crust.",
            "Whisk eggs, cream, and milk in a medium bowl and pour over vegetable mixture. Bake quiche until set and lightly golden, 30–35 minutes. Transfer to a wire rack and let cool 15 minutes. Serve warm or at room temperature.",
            "Do ahead Crust can be baked 1 day ahead; let cool and store tightly wrapped at room temperature. Filling can be prepared 1 day ahead; keep chilled. Return to room temperature before filling crust.",
            "Crust can be baked 1 day ahead; let cool and store tightly wrapped at room temperature. Filling can be prepared 1 day ahead; keep chilled. Return to room temperature before filling crust."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56686587dfc05f4039b5d7b2/6:4/w_274%2Ch_169/EP_12012015_dannymeyers_bluesmoke_Quiche-Sardou.jpg"
    }
}