{
    "recipe": {
        "title": "Quick and Easy Cioppino ",
        "ingredients": [
            "1 fennel bulb, stalks discarded and bulb cut lengthwise into 6 wedges",
            "1 medium onion, quartered",
            "3 garlic cloves, smashed and peeled",
            "3 tablespoons extra-virgin olive oil",
            "2 Turkish bay leaves or 1 California",
            "1 1/2 teaspoons dried thyme",
            "1/8 teaspoon dried hot red-pepper flakes",
            "1 (28-ounce) can crushed tomatoes in juice",
            "1 1/2 cups water",
            "1 cup full-bodied red wine such as Zinfandel or Syrah",
            "1 (8-ounce) bottle clam juice",
            "1 pound skinless fillets of thick white-fleshed fish such as halibut, hake, or pollack, cut into 2-inch chunks",
            "1 pound cultivated mussels"
        ],
        "instructions": [
            "Pulse fennel, onion, and garlic in a food processor until coarsely chopped. Heat oil in a 5- to 6-quart heavy pot over medium-high heat until it shimmers, then stir in chopped vegetables, bay leaves, thyme, red-pepper flakes, 1 1/2 teaspoons salt, and 1/2 teaspoon black pepper. Cook, covered, over medium heat, stirring once or twice, until vegetables begin to soften, about 4 minutes. Add tomatoes with their juice, water, wine, and clam juice and boil, covered, 20 minutes. Stir in seafood and cook, uncovered, until fish is just cooked through and mussels open wide, 4 to 6 minutes (discard any that remain unopened after 6 minutes). Discard bay leaves.",
            "Pulse fennel, onion, and garlic in a food processor until coarsely chopped.",
            "Heat oil in a 5- to 6-quart heavy pot over medium-high heat until it shimmers, then stir in chopped vegetables, bay leaves, thyme, red-pepper flakes, 1 1/2 teaspoons salt, and 1/2 teaspoon black pepper.",
            "Cook, covered, over medium heat, stirring once or twice, until vegetables begin to soften, about 4 minutes.",
            "Add tomatoes with their juice, water, wine, and clam juice and boil, covered, 20 minutes. Stir in seafood and cook, uncovered, until fish is just cooked through and mussels open wide, 4 to 6 minutes (discard any that remain unopened after 6 minutes). Discard bay leaves."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a47f3a00aeb2f1cf7be/6:4/w_274%2Ch_169/240279_hires.jpg"
    }
}