{
    "recipe": {
        "title": "Quick Thanksgiving Turkey with Lemon-Garlic Butter ",
        "ingredients": [
            "3/4 cup (1 1/2 sticks) unsalted butter",
            "6 garlic cloves, pressed",
            "2 tablespoons finely grated lemon zest",
            "3 sprigs rosemary",
            "2 bone-in turkey legs (thigh and drumstick attached) and 2 bone-in turkey breasts (about 8 pounds total; from one 10–12-lb. turkey)",
            "1 tablespoon plus 1 teaspoon kosher salt, plus more",
            "1 tablespoon freshly ground black pepper, plus more",
            "1 cup dry white wine, divided",
            "1 tablespoon cornstarch",
            "2 cups low-sodium chicken or turkey broth"
        ],
        "instructions": [
            "Preheat oven to 425°F. Cook butter, garlic, lemon zest, and rosemary in a small pot over medium heat, stirring occasionally, until butter is melted. Reduce heat to low and let simmer to infuse flavors, about 5 minutes. Brush turkey generously with butter mixture on all sides and under skin, getting some garlic and lemon zest under skin—that’ll make it taste so much better. Season turkey with 1 Tbsp. plus 1 tsp. salt and 1 Tbsp. pepper on all sides and arrange skin side up on a rimmed baking sheet. Pour 1/2 cup wine around turkey pieces. Cover with foil and roast turkey 20 minutes. Uncover, brush tops of each piece with butter mixture, and continue to roast until an instant-read thermometer inserted into the thickest part of each piece registers 165°F, 40–50 minutes. Some pieces might be done before others, so test each one. Let turkey rest 20 minutes before slicing. Meanwhile, strain pan drippings through a fine-mesh sieve into a heatproof measuring cup or bowl. Skim fat off surface (or use a fat separator if you have one). You should have about 1/2 cup drippings. Whisk in cornstarch until smooth. Bring remaining 1/2 cup wine to a boil in a large skillet over high heat. Cook until reduced by half, about 3 minutes. Add broth and continue to cook, stirring occasionally, until reduced slightly, about 5 minutes. Whisk in turkey drippings and bring to a boil. Cook, stirring occasionally, until thick enough to coat the back of a spoon, about 6 minutes. Season with salt and pepper. Transfer turkey to a platter. Serve with pan sauce alongside.",
            "Preheat oven to 425°F. Cook butter, garlic, lemon zest, and rosemary in a small pot over medium heat, stirring occasionally, until butter is melted. Reduce heat to low and let simmer to infuse flavors, about 5 minutes.",
            "Brush turkey generously with butter mixture on all sides and under skin, getting some garlic and lemon zest under skin—that’ll make it taste so much better. Season turkey with 1 Tbsp. plus 1 tsp. salt and 1 Tbsp. pepper on all sides and arrange skin side up on a rimmed baking sheet. Pour 1/2 cup wine around turkey pieces.",
            "Cover with foil and roast turkey 20 minutes. Uncover, brush tops of each piece with butter mixture, and continue to roast until an instant-read thermometer inserted into the thickest part of each piece registers 165°F, 40–50 minutes. Some pieces might be done before others, so test each one. Let turkey rest 20 minutes before slicing.",
            "Meanwhile, strain pan drippings through a fine-mesh sieve into a heatproof measuring cup or bowl. Skim fat off surface (or use a fat separator if you have one). You should have about 1/2 cup drippings. Whisk in cornstarch until smooth.",
            "Bring remaining 1/2 cup wine to a boil in a large skillet over high heat. Cook until reduced by half, about 3 minutes. Add broth and continue to cook, stirring occasionally, until reduced slightly, about 5 minutes. Whisk in turkey drippings and bring to a boil. Cook, stirring occasionally, until thick enough to coat the back of a spoon, about 6 minutes. Season with salt and pepper.",
            "Transfer turkey to a platter. Serve with pan sauce alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59e90d56d0d0fa3a0951d64d/6:4/w_274%2Ch_169/Quick-Thanksgiving-Turkey-with-Lemon-Garlic-Butter-10102017.jpg"
    }
}