{
    "recipe": {
        "title": "Quick Coq au Vin ",
        "ingredients": [
            "3 tablespoons olive oil",
            "2 or 3 thick slices bacon, roughly chopped",
            "1 (4-pound) chicken, cut into six pieces",
            "1 handful flour, seasoned with salt and pepper to taste",
            "8 to 10 ounces button or cremini mushrooms, rinsed and halved (optional)",
            "20 whole baby carrots, cut in half",
            "1 clove garlic, peeled and minced",
            "2 large sweet onions, chopped, or 2 cups pearl onions",
            "1 bottle red wine (white works, too)",
            "1 cup chicken broth",
            "1 bay leaf",
            "2 sprigs thyme"
        ],
        "instructions": [
            "1. Heat the olive oil in a large pot over medium-high heat. Add the bacon and cook until crisp. Transfer to a large plate. 2. Shake the chicken pieces with the seasoned flour in a paper or plastic bag. 3. Brown the chicken in the pot, 4 to 5 minutes per side. Transfer to the plate with the bacon. 4. Sauté the mushrooms (if using), carrots, garlic, and onions in the pot until they just begin to brown, 5 minutes. 5. Pour half the wine into the pan and cook over high heat for about 8 minutes. 6. Add the broth and the remaining wine. Bring to a boil and add the chicken, bacon, and herbs. 7. Return to a boil, then cover and simmer for 45 minutes. Remove the bay leaf and thyme and serve.",
            "1. Heat the olive oil in a large pot over medium-high heat. Add the bacon and cook until crisp. Transfer to a large plate.",
            "2. Shake the chicken pieces with the seasoned flour in a paper or plastic bag.",
            "3. Brown the chicken in the pot, 4 to 5 minutes per side. Transfer to the plate with the bacon.",
            "4. Sauté the mushrooms (if using), carrots, garlic, and onions in the pot until they just begin to brown, 5 minutes.",
            "5. Pour half the wine into the pan and cook over high heat for about 8 minutes.",
            "6. Add the broth and the remaining wine. Bring to a boil and add the chicken, bacon, and herbs.",
            "7. Return to a boil, then cover and simmer for 45 minutes. Remove the bay leaf and thyme and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/580694bfe69a1515419d3ee5/6:4/w_274%2Ch_169/coq-au-vin-101816.jpg"
    }
}