{
    "recipe": {
        "title": "Quinoa Salad with Peaches and Pickled Onions ",
        "ingredients": [
            "1 1/2 cups quinoa (any color) rinsed well",
            "4 teaspoons kosher salt plus more",
            "1 medium red onion, sliced 1/4\" thick",
            "1/2 cup apple cider vinegar",
            "3 tablespoons sugar",
            "2 large ripe firm peaches, cut into 1/2\" pieces",
            "1/2 bunch arugula, thick stems trimmed, leaves torn (about 2 cups)",
            "2 cups small cherry tomatoes (about 1 pint), halved",
            "1/4 cup olive oil",
            "1/2 cup 1/2\" pieces chives, divided",
            "Freshly ground black pepper"
        ],
        "instructions": [
            "Bring quinoa and 4 cups water to a boil in a medium saucepan. Season with salt. Cover, reduce heat, and simmer until quinoa is tender, 8-10 minutes. Drain, return quinoa to pan, and cover. Remove from heat and let sit 15 minutes. Fluff with a fork and spread out on a rimmed baking sheet; let cool. Meanwhile, place onion in a small bowl. Bring vinegar, sugar, and 4 teaspoon salt to a boil in a small saucepan, stirring to dissolve sugar and salt. Pour over onion and let stand 20 minutes. Drain, reserving pickling liquid. Toss pickled onion, peaches, arugula, tomatoes, oil, 1/4 cup chives, and 3 tablespoons reserved pickling liquid in a large bowl; season with salt, pepper, and more pickling liquid, if desired. Fold in quinoa. Serve salad topped with remaining 1/4 cup chives. DO AHEAD: Quinoa salad can be made 6 hours ahead (do not add arugula and chives). Cover and chill. Bring to room temperature and toss in arugula and chives just before serving.",
            "Bring quinoa and 4 cups water to a boil in a medium saucepan. Season with salt. Cover, reduce heat, and simmer until quinoa is tender, 8-10 minutes. Drain, return quinoa to pan, and cover. Remove from heat and let sit 15 minutes. Fluff with a fork and spread out on a rimmed baking sheet; let cool.",
            "Meanwhile, place onion in a small bowl. Bring vinegar, sugar, and 4 teaspoon salt to a boil in a small saucepan, stirring to dissolve sugar and salt. Pour over onion and let stand 20 minutes. Drain, reserving pickling liquid.",
            "Toss pickled onion, peaches, arugula, tomatoes, oil, 1/4 cup chives, and 3 tablespoons reserved pickling liquid in a large bowl; season with salt, pepper, and more pickling liquid, if desired. Fold in quinoa.",
            "Serve salad topped with remaining 1/4 cup chives.",
            "DO AHEAD: Quinoa salad can be made 6 hours ahead (do not add arugula and chives). Cover and chill. Bring to room temperature and toss in arugula and chives just before serving."
        ],
        "picture_link": null
    }
}