{
    "recipe": {
        "title": "Quince Calvados Crêpe Souffles ",
        "ingredients": [
            "2/3 cup whole milk",
            "1/4 cup plus 1 tablespoon all-purpose flour",
            "1 large egg",
            "11/2 tablespoons unsalted butter, melted, plus additional for brushing skillet",
            "1 teaspoon sugar",
            "1/4 teaspoon salt",
            "3 cups water",
            "2/3 cup sugar",
            "4 (3-inch-long) strips of fresh lemon zest (1/2 inch wide)",
            "1 1/2 lb quince (2 medium), peeled and halved, then each half cut into 6 wedges and cored",
            "1/2 teaspoon vanilla",
            "2 tablespoons Calvados",
            "2 teaspoons fresh lemon juice",
            "2 large egg whites",
            "1 1/2 tablespoons granulated sugar",
            "1 1/2 tablespoons unsalted butter, melted",
            "Confectioners sugar for dusting"
        ],
        "instructions": [
            "Whisk together all crêpe ingredients until smooth, then chill, covered, 30 minutes.",
            "Poach quince: Combine water, sugar, zest, and a pinch of salt in a 3-quart heavy saucepan and cook over moderate heat, stirring, until sugar is dissolved. Add quince and simmer, covered, until fruit is very tender but not falling apart, 1 to 1 1/4 hours. Discard zest.",
            "Combine water, sugar, zest, and a pinch of salt in a 3-quart heavy saucepan and cook over moderate heat, stirring, until sugar is dissolved. Add quince and simmer, covered, until fruit is very tender but not falling apart, 1 to 1 1/4 hours. Discard zest.",
            "Cook crêpes while fruit poaches: Lightly brush an 8- to 9-inch nonstick skillet with butter, then heat over moderately high heat until hot but not smoking. Holding skillet off heat, pour in a scant 1/4 cup batter, immediately tilting and rotating skillet to coat bottom. (If batter sets before skillet is coated, reduce heat slightly.) Return skillet to heat and cook crêpe until just set and golden around edges, 10 to 15 seconds. Loosen edge of crêpe with a heatproof rubber spatula, then transfer crêpe to a plate. Brush skillet with more butter and make 3 more crêpes in same manner, stacking crêpes on plate.",
            "Lightly brush an 8- to 9-inch nonstick skillet with butter, then heat over moderately high heat until hot but not smoking. Holding skillet off heat, pour in a scant 1/4 cup batter, immediately tilting and rotating skillet to coat bottom. (If batter sets before skillet is coated, reduce heat slightly.) Return skillet to heat and cook crêpe until just set and golden around edges, 10 to 15 seconds. Loosen edge of crêpe with a heatproof rubber spatula, then transfer crêpe to a plate. Brush skillet with more butter and make 3 more crêpes in same manner, stacking crêpes on plate.",
            "Finish preparing quince: Measure out 3/4 cup poached fruit with a slotted spoon and 3 tablespoons cooking syrup (reserve remainder in saucepan), then purée in a food processor with vanilla and 1 tablespoon Calvados until smooth. Transfer remaining fruit from reserved syrup with a slotted spoon to a bowl. Pour syrup through a fine-mesh sieve into another bowl, then return to saucepan and boil until reduced to about 1/2 cup, 8 to 12 minutes. Stir in lemon juice and remaining tablespoon Calvados and cool. Measure out 3/4 cup reserved fruit, then chop and set aside. Stir remaining fruit into reduced syrup and set aside separately.",
            "Measure out 3/4 cup poached fruit with a slotted spoon and 3 tablespoons cooking syrup (reserve remainder in saucepan), then purée in a food processor with vanilla and 1 tablespoon Calvados until smooth.",
            "Transfer remaining fruit from reserved syrup with a slotted spoon to a bowl. Pour syrup through a fine-mesh sieve into another bowl, then return to saucepan and boil until reduced to about 1/2 cup, 8 to 12 minutes. Stir in lemon juice and remaining tablespoon Calvados and cool.",
            "Measure out 3/4 cup reserved fruit, then chop and set aside. Stir remaining fruit into reduced syrup and set aside separately.",
            "Make soufflés: Put oven rack in middle position and preheat oven to 400°F. Beat whites with a pinch of salt using an electric mixer at medium-high speed until they just hold soft peaks. Add granulated sugar in a slow stream, beating, and beat at medium-high speed until whites just hold stiff peaks. Fold one third of whites into quince purée, then fold in remaining whites gently but thoroughly. Gently fold in chopped fruit. Brush bottom sides of crêpes with some melted butter and put in a 15- by 10-inch shallow baking pan (about half of each crêpe will hang over). Divide soufflé mixture among crêpes, spooning it in center and spreading it over half of each crêpe. Gently fold other half of each crêpe over filling to rest on top. Bake until filling is puffed, set, and pale golden in spots, 10 to 12 minutes. Dust crêpes with confectioners sugar and serve immediately with reserved quince and syrup.",
            "Put oven rack in middle position and preheat oven to 400°F.",
            "Beat whites with a pinch of salt using an electric mixer at medium-high speed until they just hold soft peaks. Add granulated sugar in a slow stream, beating, and beat at medium-high speed until whites just hold stiff peaks. Fold one third of whites into quince purée, then fold in remaining whites gently but thoroughly. Gently fold in chopped fruit.",
            "Brush bottom sides of crêpes with some melted butter and put in a 15- by 10-inch shallow baking pan (about half of each crêpe will hang over). Divide soufflé mixture among crêpes, spooning it in center and spreading it over half of each crêpe. Gently fold other half of each crêpe over filling to rest on top. Bake until filling is puffed, set, and pale golden in spots, 10 to 12 minutes.",
            "Dust crêpes with confectioners sugar and serve immediately with reserved quince and syrup."
        ],
        "picture_link": "https://assets.epicurious.com/photos/557079b7153c29e92c454860/6:4/w_274%2Ch_169/6x4-5.jpg",
        "color": 10909191
    }
}