{
    "recipe": {
        "title": "Quinoa, Lime and Chili-Crumbed Snapper With Sweet Potato Wedges ",
        "ingredients": [
            "1 teaspoon ground cumin",
            "2 teaspoons chili flakes",
            "1 teaspoon sea salt, plus more for sprinkling",
            "1 1/2 pounds sweet potatoes, cut into wedges",
            "Cracked black pepper",
            "2 tablespoons extra-virgin olive oil",
            "2 cups quinoa flakes",
            "1 tablespoon finely grated lime zest",
            "2 eggs",
            "4 (5 1/4-ounce) snapper fillets",
            "1/2 cup flat-leaf parsley leaves, finely chopped",
            "Mayonnaise and lime wedges, to serve"
        ],
        "instructions": [
            "Preheat oven to 425°F. Place the cumin, 1/2 teaspoon of the chili flakes and 1 teaspoon of the salt in a bowl and mix to combine. Place the sweet potatoes on a rimmed baking sheet and sprinkle with half the salt mixture, pepper and 1 tablespoon of the oil. Roast, turning halfway, for 20 minutes or until golden. Place the quinoa, lime zest, remaining chili flakes, salt and pepper in a bowl and mix to combine. Place the eggs in a bowl and whisk to combine. Heat the remaining oil in a large non-stick frying pan over medium heat. Dip the fish into the egg and press into the quinoa mixture to coat. Cook for 2–3 minutes on each side or until golden and cooked through. Serve the fish and potatoes with the remaining salt mixture, the parsley, mayonnaise and lime wedges.",
            "Preheat oven to 425°F. Place the cumin, 1/2 teaspoon of the chili flakes and 1 teaspoon of the salt in a bowl and mix to combine. Place the sweet potatoes on a rimmed baking sheet and sprinkle with half the salt mixture, pepper and 1 tablespoon of the oil. Roast, turning halfway, for 20 minutes or until golden.",
            "Place the quinoa, lime zest, remaining chili flakes, salt and pepper in a bowl and mix to combine. Place the eggs in a bowl and whisk to combine.",
            "Heat the remaining oil in a large non-stick frying pan over medium heat. Dip the fish into the egg and press into the quinoa mixture to coat. Cook for 2–3 minutes on each side or until golden and cooked through. Serve the fish and potatoes with the remaining salt mixture, the parsley, mayonnaise and lime wedges."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d5bc67b55306961becce9/6:4/w_274%2Ch_169/QuinoaLimeChiliCrumbed-Snapper_Sweet_Potato_wedges.jpg"
    }
}