{
    "recipe": {
        "title": "Radicchio and Citrus Salad with Burrata ",
        "ingredients": [
            "1/2 cup Marcona almonds",
            "1 teaspoon plus 1 tablespoon sugar",
            "1/4 teaspoon kosher salt, plus more",
            "1 (8-ounce) ball burrata",
            "6 tablespoon olive oil, divided",
            "3 medium oranges, peeled, sliced into rounds",
            "1 large head of radicchio, preferably Castelfranco, leaves separated",
            "2 tablespoons sherry vinegar or red wine vinegar",
            "1 teaspoon herbes de Provence"
        ],
        "instructions": [
            "Toast almonds in a dry medium skillet over medium heat, tossing often, until beginning to brown in spots, about 3 minutes. Add 1 tsp. sugar, 1/4 tsp. salt, and 2 Tbsp. water. Remove from heat and stir with a heatproof rubber spatula until water is evaporated. Sprinkle in remaining 1 Tbsp. sugar and stir until almonds are coated. Transfer to a plate and let cool. Coarsely chop. Meanwhile, pulse burrata in a food processor to a coarse purée. It should look a little like cottage cheese. Add 2 Tbsp. oil and season with salt; pulse just to incorporate. (Or you can tear it with your hands, arrange on plates, and drizzle with the oil and sprinkle with salt.) Toss oranges, radicchio, vinegar, and remaining 4 Tbsp. oil in a large bowl to combine; season with salt. Divide burrata among plates and sprinkle with herbes de Provence; top with salad. Scatter almonds over.",
            "Toast almonds in a dry medium skillet over medium heat, tossing often, until beginning to brown in spots, about 3 minutes. Add 1 tsp. sugar, 1/4 tsp. salt, and 2 Tbsp. water. Remove from heat and stir with a heatproof rubber spatula until water is evaporated. Sprinkle in remaining 1 Tbsp. sugar and stir until almonds are coated. Transfer to a plate and let cool. Coarsely chop.",
            "Meanwhile, pulse burrata in a food processor to a coarse purée. It should look a little like cottage cheese. Add 2 Tbsp. oil and season with salt; pulse just to incorporate. (Or you can tear it with your hands, arrange on plates, and drizzle with the oil and sprinkle with salt.)",
            "Toss oranges, radicchio, vinegar, and remaining 4 Tbsp. oil in a large bowl to combine; season with salt.",
            "Divide burrata among plates and sprinkle with herbes de Provence; top with salad. Scatter almonds over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59cbd10066394706a3451ebf/6:4/w_274%2Ch_169/radicchio-and-citrus-salad-with-burrata-and-almonds.jpg"
    }
}