{
    "recipe": {
        "title": "Ragout of Lamb Shoulder with Cavatelli ",
        "ingredients": [
            "1/4 cup olive oil",
            "1 5-pound bone-in lamb shoulder",
            "1 teaspoon fennel seeds, crushed",
            "Leaves from 1 sprig fresh rosemary, chopped",
            "Salt",
            "Freshly ground black pepper",
            "1 bunch leeks, trimmed, chopped, and cleaned",
            "1 stalk celery, chopped",
            "4 cloves garlic, chopped",
            "Pinch red pepper flakes",
            "3 filets salt-cured anchovies",
            "2 tablespoons tomato paste",
            "Leaves from 4 sprigs fresh thyme, chopped",
            "1 bay leaf",
            "1 1/2 cups red wine",
            "Peel of 1/2 orange",
            "1 cup red pearl onions, peeled",
            "2 cups Basic Fond de Veau",
            "1 16-ounce package cavatelli pasta, cooked",
            "1 cup fresh sweet peas"
        ],
        "instructions": [
            "1. Heat the oil in a large, heavy-bottomed pot over high heat. Season the lamb shoulder with the fennel, rosemary, salt, and pepper. Add the lamb to the pot and sear on all sides, turning occasionally, until golden brown, 5–7 minutes. Transfer to a platter. 2. Add the leeks, celery, garlic, and red pepper flakes to the pot and cook until softened, about 5 minutes. Add the anchovies, tomato paste, thyme, and bay leaf and cook, stirring constantly, until a dark, mahogany-colored crust forms on the bottom of the pot, 3–4 minutes. 3. Add the wine and bring to a boil, stirring constantly. Return the lamb to the pot and add the orange peel, red onions, and Fond de Veau. Cover and bring to a boil. Reduce the heat to a slow simmer and cook until the lamb is tender, about 2 hours. Remove from the heat and let the lamb cool in the pot, covered. Discard the bay leaf. 4. When you're ready to serve, pull the lamb meat from the bone and return to the rich sauce in the pot along with the cooked pasta. Add the sweet peas and warm thoroughly before serving.",
            "1. Heat the oil in a large, heavy-bottomed pot over high heat. Season the lamb shoulder with the fennel, rosemary, salt, and pepper. Add the lamb to the pot and sear on all sides, turning occasionally, until golden brown, 5–7 minutes. Transfer to a platter.",
            "2. Add the leeks, celery, garlic, and red pepper flakes to the pot and cook until softened, about 5 minutes. Add the anchovies, tomato paste, thyme, and bay leaf and cook, stirring constantly, until a dark, mahogany-colored crust forms on the bottom of the pot, 3–4 minutes.",
            "3. Add the wine and bring to a boil, stirring constantly. Return the lamb to the pot and add the orange peel, red onions, and Fond de Veau. Cover and bring to a boil. Reduce the heat to a slow simmer and cook until the lamb is tender, about 2 hours. Remove from the heat and let the lamb cool in the pot, covered. Discard the bay leaf.",
            "4. When you're ready to serve, pull the lamb meat from the bone and return to the rich sauce in the pot along with the cooked pasta. Add the sweet peas and warm thoroughly before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad36676529d92b2c04077e/6:4/w_274%2Ch_169/51208220_lamb-shoulder_1x1.jpg"
    }
}