{
    "recipe": {
        "title": "Ragout of Lamb and Spring Vegetables with Farro ",
        "ingredients": [
            "4 sprigs oregano",
            "4 sprigs thyme",
            "2 sprigs rosemary",
            "2 bay leaves",
            "1/4 cup olive oil, plus more",
            "2 pounds lamb shoulder, cut into 1\" pieces",
            "Kosher salt, freshly ground pepper",
            "0 freshly ground pepper",
            "8 ounces pearl onions, peeled",
            "4 garlic cloves, thinly sliced",
            "2 tablespoons balsamic vinegar",
            "1 cup dry red wine",
            "6 cups low-sodium chicken broth",
            "1 cup semi-pearled farro or wheat berries, rinsed",
            "1 3/4 pounds baby turnips, trimmed, scrubbed, halved if large",
            "1 bunch asparagus, trimmed, cut into 1\" pieces on a diagonal",
            "2 cups fresh (or frozen, thawed) peas",
            "1 bunch dandelion greens, trimmed"
        ],
        "instructions": [
            "Tie together oregano, thyme, rosemary, and bay leaves with kitchen twine.",
            "Heat 1/4 cup oil in a large heavy pot over medium-high. Season lamb with salt and pepper. Working in batches, cook, turning occasionally, until browned, 12–15 minutes per batch. Transfer to a plate as you go.",
            "Add onions to pot and stir to coat. Season with salt and pepper and cook until starting to brown, about 4 minutes. Stir in garlic; cook 30 seconds before adding vinegar. Cook, scraping up browned bits, until syrupy, about 1 minute.",
            "Add wine, bring to a boil, and cook until reduced by about one-fourth, about 4 minutes. Add broth, lamb, and herb bundle. Bring to a boil, reduce heat, and simmer gently, partially covered, until lamb is tender, 75–85 minutes.",
            "Stir in farro and cook until nearly al dente, 15–20 minutes. Remove herb bundle; add turnips. Cook until farro is cooked through, turnips are tender, and lamb is almost falling apart, 30–40 minutes. Mix in asparagus and peas; cook until crisp-tender, 2 minutes. Add greens and stir to wilt. Season with salt and pepper. Serve drizzled with oil."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5537e45c67c3a7e837c3eff1/6:4/w_274%2Ch_169/56389406_ragout-of-lamb_1x1.jpg",
        "color": 11944132
    }
}