{
    "recipe": {
        "title": "Ragù di Agnello (Lamb) ",
        "ingredients": [
            "1 white onion",
            "1 small carrot",
            "1 small rib celery",
            "a few sprigs fresh marjoram",
            "3 fresh sage leaves",
            "1 small sprig fresh rosemary",
            "6 tablespoons extra virgin olive oil, preferably medium fruity",
            "1 pound (450 grams) boneless lamb stew meat, cut into 3/4-inch (2-centimeter) cubes",
            "1/2 cup (100 milliliters) dry white wine",
            "1 1-pound (450 grams) can peeled tomatoes, drained",
            "1 small piece dried chile",
            "salt",
            "1 pound (450 grams) pasta (see note below)",
            "6 rounded tablespoons (60 grams) grated pecorino abruzzese cheese or pecorino romano",
            "1 heaping tablespoon minced fresh flat-leaf parsley"
        ],
        "instructions": [
            "Mince finely together the onion, carrot, celery, marjoram, sage, and rosemary needles (in the food processor if desired) and put in a medium saucepan with the oil. Cook over low heat until the vegetables just turn pale gold, about 8 minutes. Add the meat and brown gently, stirring. Raise the heat and add the wine. Let it bubble until you can no longer smell any alcohol, about 2 minutes. Add the drained tomatoes, the chile, and 1 level teaspoon salt. Lower the heat and cook, covered, for about an hour, stirring occasionally. You'll know the sauce is done when it has visibly thickened and the fat has separated and bubbles on the surface. Make-ahead note: The sauce may be made ahead up to this point and refrigerated until the next day. After some hours of chilling, the fat will come to the surface and can be removed very easily. Bring 5 quarts (5 liters) of water to a boil in an 8-quart (8-liter) pot over high heat. Add 3 tablespoons kosher salt, then add the pasta and cook, stirring occasionally, until al dente. Warm a serving bowl or platter in a low oven. If the oven is not practical, warm the bowl just before use with hot water, even a ladleful of the pasta cooking water. Drain and transfer the pasta to the heated serving bowl. Toss the pasta first with the cheese and then with the sauce. Finish with a sprinkling of parsley and serve immediately.",
            "Mince finely together the onion, carrot, celery, marjoram, sage, and rosemary needles (in the food processor if desired) and put in a medium saucepan with the oil. Cook over low heat until the vegetables just turn pale gold, about 8 minutes.",
            "Add the meat and brown gently, stirring.",
            "Raise the heat and add the wine. Let it bubble until you can no longer smell any alcohol, about 2 minutes.",
            "Add the drained tomatoes, the chile, and 1 level teaspoon salt. Lower the heat and cook, covered, for about an hour, stirring occasionally. You'll know the sauce is done when it has visibly thickened and the fat has separated and bubbles on the surface.",
            "Make-ahead note: The sauce may be made ahead up to this point and refrigerated until the next day. After some hours of chilling, the fat will come to the surface and can be removed very easily.",
            "Bring 5 quarts (5 liters) of water to a boil in an 8-quart (8-liter) pot over high heat. Add 3 tablespoons kosher salt, then add the pasta and cook, stirring occasionally, until al dente.",
            "Warm a serving bowl or platter in a low oven. If the oven is not practical, warm the bowl just before use with hot water, even a ladleful of the pasta cooking water.",
            "Drain and transfer the pasta to the heated serving bowl. Toss the pasta first with the cheese and then with the sauce. Finish with a sprinkling of parsley and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56033a277bdffb1205b5d5a1/6:4/w_274%2Ch_169/51221430.jpg"
    }
}