{
    "recipe": {
        "title": "Raspberry Crème Fraîche Tart with Lavender Honey ",
        "ingredients": [
            "1 1/4 cups all-purpose flour",
            "1/4 cup sugar",
            "1/2 teaspoon salt",
            "7 tablespoons cold unsalted butter, cut into 1/2-inch cubes",
            "1 large egg",
            "4 oz cream cheese, softened",
            "1/4 cup crème frache",
            "3 1/2 tablespoons lavender honey",
            "4 cups raspberries (18 ounces)",
            "9-inch fluted round tart pan (1 inch deep) with a removable bottom; heavy-duty foil; pie weights or raw rice",
            "Accompaniment: warm lavender honey"
        ],
        "instructions": [
            "Pulse together all crust ingredients in a food processor just until mixture resembles coarse crumbs. Put tart pan on a baking sheet and press dough evenly onto bottom and up side of tart pan with your fingertips. Chill shell, covered, on baking sheet until firm, about 30 minutes.",
            "Put oven rack in middle position and preheat oven to 350°F. Line shell with a buttered sheet of heavy-duty foil (buttered side down) and fill shell one third of the way up with pie weights.",
            "Bake (on sheet) until edge is pale golden, 20 to 25 minutes. Carefully remove pie weights and foil, then bake until edge and bottom are golden, about 20 minutes more. Cool completely in pan on a rack.",
            "Make filling: Beat cream cheese in a bowl with a handheld electric mixer at high speed until smooth, then add crème frache and 1 1/2 tablespoons honey and beat until combined well. Spread filling evenly in shell, then top with raspberries. Heat remaining 2 tablespoons honey in a very small saucepan over moderately low heat, stirring constantly, until liquefied, then drizzle over raspberries. Serve with additional melted honey on the side.",
            "Beat cream cheese in a bowl with a handheld electric mixer at high speed until smooth, then add crème frache and 1 1/2 tablespoons honey and beat until combined well. Spread filling evenly in shell, then top with raspberries. Heat remaining 2 tablespoons honey in a very small saucepan over moderately low heat, stirring constantly, until liquefied, then drizzle over raspberries. Serve with additional melted honey on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59137592f95827731c3992d2/6:4/w_274%2Ch_169/raspberry-cream-cheese-tart-051017.jpg"
    }
}