{
    "recipe": {
        "title": "Raspberry and Pistachio Friands ",
        "ingredients": [
            "200g (1 3/4 sticks/14 Tbsp) butter, plus extra for greasing",
            "100g (3/4 cup) pistachio nuts, plus a few extra to serve",
            "200g (1 2/3 cups) confectioners' sugar, plus more for dusting",
            "85g (3/4 cup plus 2 1/4 Tbsp) ground almonds",
            "85g (2/3 cup) all-purpose flour",
            "5 large egg whites",
            "1 small container raspberries",
            "8- or 12-hole muffin or friand tin and a food processor."
        ],
        "instructions": [
            "Preheat the oven to 350°F/180°C/160°C fan/gas 4. Melt the butter in a small pan, then remove from the heat and leave to cool a little. Grease eight holes of the friand (or muffin) tin with a little bit of butter.",
            "Blitz 85g (2/3 cup) of the pistachio nuts in a food processor with the confectioners' sugar until very finely chopped. Tip into a bowl with the ground almonds and flour and mix together. Roughly chop the remaining pistachio nuts and set aside.",
            "Froth the egg whites lightly with a fork, then pour into the nuts and flour mixture with the melted butter and mix well.",
            "Pour the mixture into the friand tin holes, add a few raspberries to each one, then scatter with the chopped pistachios. Bake for 20–25 minutes until the friands are risen and springy to the touch and a skewer inserted comes out clean.",
            "Serve warm or at room temperature. Dust with a little confectioners' sugar if you like. They should be light and chewy!",
            "Twist: Pecan Pie Friands: Make the friand recipe above, swapping pistachios for 100g (1 cup) pecans and the raspberries for 75g (2.6 oz) chewy toffee, chopped into small pieces. Sprinkle the toffee over the friand batter before baking.",
            "Pecan Pie Friands: Make the friand recipe above, swapping pistachios for 100g (1 cup) pecans and the raspberries for 75g (2.6 oz) chewy toffee, chopped into small pieces. Sprinkle the toffee over the friand batter before baking."
        ],
        "picture_link": "https://assets.epicurious.com/photos/595d02e387ee53228621df61/6:4/w_274%2Ch_169/raspberry-pistachio-friands-recipe-HC-070517.jpg",
        "color": 1948143
    }
}