{
    "recipe": {
        "title": "Raw Mustard Greens Salad with Gruyère and Anchovy Croutons ",
        "ingredients": [
            "5 anchovy fillets, finely chopped",
            "3 garlic cloves, pressed",
            "1/2 cup extra-virgin olive oil",
            "3 cups 3/4-inch cubes crustless country bread",
            "1 cup (packed) coarsely grated Gruyère cheese (about 4 ounces), divided",
            "Nonstick vegetable oil spray",
            "1 bunch mustard greens (about 12 ounces), center rib and stem cut from each leaf, leaves cut crosswise into 1/2-inch-wide strips",
            "5 teaspoons (or more) fresh lemon juice"
        ],
        "instructions": [
            "Preheat oven to 375°F. Combine anchovies and garlic in small bowl. Gradually whisk in oil. Place bread cubes in medium bowl. Drizzle 2 tablespoons anchovy oil over, tossing to coat. Sprinkle bread with salt, pepper, and half of cheese; toss to coat. Spray rimmed baking sheet with nonstick spray. Scatter bread on sheet. Bake croutons until crisp and golden, stirring occasionally, about 20 minutes. Set aside. Measure 8 cups (loosely packed) mustard greens and place in large bowl (reserve any remaining greens for another use). Add croutons and remaining cheese to bowl. Whisk 5 teaspoons lemon juice into remaining anchovy oil; season dressing with salt, pepper, and more lemon juice, if desired. Add dressing to salad; toss to coat.",
            "Preheat oven to 375°F. Combine anchovies and garlic in small bowl. Gradually whisk in oil. Place bread cubes in medium bowl. Drizzle 2 tablespoons anchovy oil over, tossing to coat. Sprinkle bread with salt, pepper, and half of cheese; toss to coat.",
            "Spray rimmed baking sheet with nonstick spray. Scatter bread on sheet. Bake croutons until crisp and golden, stirring occasionally, about 20 minutes. Set aside.",
            "Measure 8 cups (loosely packed) mustard greens and place in large bowl (reserve any remaining greens for another use). Add croutons and remaining cheese to bowl. Whisk 5 teaspoons lemon juice into remaining anchovy oil; season dressing with salt, pepper, and more lemon juice, if desired. Add dressing to salad; toss to coat."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b427782413537c0d45d8f7/6:4/w_274%2Ch_169/362952_raw-mustard-greens-salad_1x1.jpg"
    }
}