{
    "recipe": {
        "title": "Red Potatoes Tossed in Roasted-Garlic Butter with Sage and Bacon ",
        "ingredients": [
            "12 large garlic cloves, peeled",
            "3 tablespoons olive oil",
            "3 tablespoons butter, room temperature",
            "8 bacon slices, chopped",
            "3 pounds 1- to 1 1/2-inch-diameter red-skinned potatoes",
            "4 teaspoons dried rubbed sage",
            "Fresh sage sprigs (optional)"
        ],
        "instructions": [
            "Preheat oven to 400°F. Combine garlic and oil in small ovenproof dish; cover tightly with foil. Bake until garlic is very tender, about 35 minutes. Cool slightly. Transfer garlic and oil to processor; add butter and process until almost smooth. Transfer garlic butter to small bowl. Sauté bacon in heavy large skillet over medium heat until crisp, about 4 minutes. Using slotted spoon, transfer bacon to paper towels to drain. (Garlic butter and bacon can be made 1 day ahead. Cover separately and chill. Bring garlic butter to room temperature before using.) Cook potatoes in large pot of boiling salted water until just tender, about 15 minutes. Drain. Cool slightly. Cut potatoes in half; transfer to heavy large skillet. Add garlic butter, bacon, and dried sage and toss over medium-high heat until potatoes are heated through, about 6 minutes. Season to taste with salt and pepper. Transfer potatoes to bowl. Garnish with sage sprigs, if desired.",
            "Preheat oven to 400°F. Combine garlic and oil in small ovenproof dish; cover tightly with foil. Bake until garlic is very tender, about 35 minutes. Cool slightly. Transfer garlic and oil to processor; add butter and process until almost smooth. Transfer garlic butter to small bowl.",
            "Sauté bacon in heavy large skillet over medium heat until crisp, about 4 minutes. Using slotted spoon, transfer bacon to paper towels to drain. (Garlic butter and bacon can be made 1 day ahead. Cover separately and chill. Bring garlic butter to room temperature before using.)",
            "Cook potatoes in large pot of boiling salted water until just tender, about 15 minutes. Drain. Cool slightly. Cut potatoes in half; transfer to heavy large skillet. Add garlic butter, bacon, and dried sage and toss over medium-high heat until potatoes are heated through, about 6 minutes. Season to taste with salt and pepper. Transfer potatoes to bowl. Garnish with sage sprigs, if desired."
        ],
        "picture_link": null
    }
}