{
    "recipe": {
        "title": "Red Curry Duck Wonton Napoleons ",
        "ingredients": [
            "1/2 cup minced scallion plus 1 whole scallion (1 bunch)",
            "1/2 cup finely chopped fresh cilantro plus 8 small fresh sprigs (1 large bunch)",
            "2 cups plus 1/4 cup vegetable oil",
            "1/4 cup minced peeled fresh ginger",
            "2 tablespoons minced garlic (3 to 4 large cloves)",
            "2 to 6 teaspoons Thai red curry paste*",
            "1 (3-pound) roast duck, meat cut into 1/2-inch dice (3 cups)",
            "1 (1-pound) firm-ripe mango, peeled, pitted, and cut into 1/3-inch dice",
            "1 cup diced (1/3 inch) fresh or canned pineapple (6 ounces)",
            "1/2 cup diced (1/3 inch) red bell pepper",
            "24 (4-inch) square wonton wrappers*",
            "a deep-fat thermometer"
        ],
        "instructions": [
            "Cut whole scallion crosswise into 2-inch pieces, then cut lengthwise into thin strips and chill, along with cilantro sprigs, in a bowl of ice and cold water (to crisp and curl) about 1 hour. Heat a wok or 12-inch heavy skillet over high heat until a bead of water dropped onto cooking surface evaporates immediately. Add 1/4 cup oil, swirling wok to coat, and heat until it begins to smoke. Add minced scallion, ginger, and garlic and stir-fry until softened, about 2 minutes. Add red curry paste (to taste) and stir-fry, breaking up lumps, 1 minute. Add duck and stir-fry 2 minutes. Transfer duck mixture to a large bowl and cool slightly. Add mango, pineapple, bell pepper, chopped cilantro, and salt and pepper to taste to duck mixture. Heat remaining 2 cups oil in cleaned wok over moderate heat until it registers 390°F on thermometer. Fry wonton wrappers, 1 at a time, turning over once, until golden, about 30 seconds each. Transfer with tongs to paper towels to drain. Drain scallion strips and cilantro sprigs in a sieve and pat dry. Put a wonton wrapper on a plate and top with 2 to 3 tablespoons duck mixture. Repeat layering twice, ending with duck mixture. (Napoleon will have 3 wonton layers.) Top with a cilantro sprig and a few scallion strips. Make 7 more napoleons in same manner.",
            "Cut whole scallion crosswise into 2-inch pieces, then cut lengthwise into thin strips and chill, along with cilantro sprigs, in a bowl of ice and cold water (to crisp and curl) about 1 hour.",
            "Heat a wok or 12-inch heavy skillet over high heat until a bead of water dropped onto cooking surface evaporates immediately. Add 1/4 cup oil, swirling wok to coat, and heat until it begins to smoke. Add minced scallion, ginger, and garlic and stir-fry until softened, about 2 minutes. Add red curry paste (to taste) and stir-fry, breaking up lumps, 1 minute. Add duck and stir-fry 2 minutes. Transfer duck mixture to a large bowl and cool slightly.",
            "Add mango, pineapple, bell pepper, chopped cilantro, and salt and pepper to taste to duck mixture.",
            "Heat remaining 2 cups oil in cleaned wok over moderate heat until it registers 390°F on thermometer. Fry wonton wrappers, 1 at a time, turning over once, until golden, about 30 seconds each. Transfer with tongs to paper towels to drain.",
            "Drain scallion strips and cilantro sprigs in a sieve and pat dry.",
            "Put a wonton wrapper on a plate and top with 2 to 3 tablespoons duck mixture. Repeat layering twice, ending with duck mixture. (Napoleon will have 3 wonton layers.) Top with a cilantro sprig and a few scallion strips. Make 7 more napoleons in same manner."
        ],
        "picture_link": null
    }
}