{
    "recipe": {
        "title": "Red Posole with Pork ",
        "ingredients": [
            "3 pounds pork shoulder (Boston butt)",
            "1 large white onion, halved through root end, plus chopped for serving",
            "2 heads of garlic, halved crosswise",
            "1 bay leaf",
            "3 whole cloves",
            "10 guajillo chiles, ribs and seeds removed",
            "6 dried chiles de árbol, ribs and seeds removed",
            "Kosher salt",
            "3 (15-ounce) cans white hominy, rinsed",
            "Thinly sliced cabbage, thinly sliced radishes, dried oregano, and lime wedges (for serving)"
        ],
        "instructions": [
            "Place pork shoulder, onion halves, garlic, bay leaf, and cloves in a large pot. Pour in 14 cups water (pork should be submerged). Bring to a simmer and cook, skimming as needed and turning pork occasionally, until meat is cooked through and tender but not yet falling apart, 2 1/2–3 hours. Transfer pork to a plate; let cool slightly. Strain broth into a large bowl, then transfer back to pot. Slice pork into 1/2\" slices and add to broth.",
            "Meanwhile, preheat oven to 350°F. Toast all the chiles on a rimmed baking sheet until brown (do not char) and starting to lightly puff in places, about 5 minutes. Bring 3 cups water to a boil in a medium saucepan; add chiles. Remove from heat and let chiles soak until softened, 10–12 minutes. Blend chiles and cooking liquid in a blender until smooth; season with salt.",
            "Add chile purée to pork and broth. Bring to a simmer, add hominy, and cook, skimming off fat from surface, until pork is so tender it’s nearly falling apart, 45–60 minutes; season with more salt.",
            "Divide posole among bowls, top with onion, cabbage, radishes, and oregano. Serve with lime wedges.",
            "Do Ahead Posole can be made 3 days ahead. Let cool; cover and chill.",
            "Posole can be made 3 days ahead. Let cool; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59233d7c4bc0fc506addbe84/6:4/w_274%2Ch_169/red-posole-with-pork-BA-052217.jpg",
        "color": 11838772
    }
}