{
    "recipe": {
        "title": "Red-Hot Buffalo Deviled Eggs ",
        "ingredients": [
            "1 dozen hard-cooked eggs",
            "3 tablespoons mayonnaise",
            "3 tablespoons sour cream",
            "1 tablespoon Frank's Red-Hot Buffalo Wings sauce",
            "2 tablespoons crumbled blue cheese",
            "1 tablespoon chopped fresh parsley",
            "1/4 teaspoon celery salt (or substitute table salt)",
            "2 tablespoons Frank's Red-Hot Buffalo Wings sauce",
            "1/3 cup very tiny-diced celery",
            "24 tiny celery leaves"
        ],
        "instructions": [
            "Halve the eggs lengthwise and transfer the yolks to a mixing bowl. Set the egg white halves on a platter, cover, and refrigerate. With a fork, mash the yolks to a smooth consistency. Add the mayonnaise, sour cream, Frank's sauce, blue cheese, parsley, and celery salt, and mix until smooth. (You can also do this using an electric mixer with a whip attachment.) Taste and season accordingly. Spoon the mixture into a pastry bag fitted with a plain or large star tip, then pipe the mixture evenly into the egg white halves. Or fill the eggs with a spoon, dividing the filling evenly. To make the topping, in a small bowl, mix Frank's sauce with the celery until well coated. Top each egg half with about 1 teaspoon of the mixture and a celery leaf.",
            "Halve the eggs lengthwise and transfer the yolks to a mixing bowl. Set the egg white halves on a platter, cover, and refrigerate.",
            "With a fork, mash the yolks to a smooth consistency. Add the mayonnaise, sour cream, Frank's sauce, blue cheese, parsley, and celery salt, and mix until smooth. (You can also do this using an electric mixer with a whip attachment.) Taste and season accordingly.",
            "Spoon the mixture into a pastry bag fitted with a plain or large star tip, then pipe the mixture evenly into the egg white halves. Or fill the eggs with a spoon, dividing the filling evenly.",
            "To make the topping, in a small bowl, mix Frank's sauce with the celery until well coated. Top each egg half with about 1 teaspoon of the mixture and a celery leaf."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b02aa2cae54b67034105f2/6:4/w_274%2Ch_169/51158400_buffalo-deviled-eggs_1x1.jpg"
    }
}