{
    "recipe": {
        "title": "Reginetti with Savoy Cabbage and Pancetta ",
        "ingredients": [
            "12 ounces reginetti or other short pasta",
            "Kosher salt",
            "2 tablespoons olive oil",
            "6 ounces thinly sliced pancetta (Italian bacon)",
            "1 small head of savoy cabbage, tough ribs removed, leaves torn",
            "1/4 cup (1/2 stick) unsalted butter, cut into pieces",
            "2 teaspoons fresh thyme leaves",
            "1/2 ounce Parmesan, finely grated (about 1/2 cup)",
            "Freshly ground black pepper",
            "Poppy seeds (for serving)"
        ],
        "instructions": [
            "Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente (pasta will still be opaque and very firm in the center). Drain pasta, reserving 1 1/2 cups pasta cooking liquid. Meanwhile, heat oil in a large skillet over medium and cook pancetta, turning halfway through, until brown and crisp, about 4 minutes. Drain on paper towels. Add cabbage to skillet and cook undisturbed until deeply browned in some spots, about 3 minutes. Toss, then cook undisturbed until deeply browned in other spots, about 2 minutes. Continue to cook and toss until cabbage is charred in some spots and bright green in others and beginning to wilt. Add butter and thyme and cook, tossing, until butter begins to brown, about 2 minutes. Add Parmesan, pasta, and 1 cup pasta cooking liquid and cook, tossing often and adding more cooking liquid to help finish cooking pasta, until pasta is al dente and sauce is thickened and emulsified and coats pasta, about 5 minutes. Add pancetta and toss to combine; taste and season with salt and pepper. Serve topped with poppy seeds.",
            "Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente (pasta will still be opaque and very firm in the center). Drain pasta, reserving 1 1/2 cups pasta cooking liquid.",
            "Meanwhile, heat oil in a large skillet over medium and cook pancetta, turning halfway through, until brown and crisp, about 4 minutes. Drain on paper towels.",
            "Add cabbage to skillet and cook undisturbed until deeply browned in some spots, about 3 minutes. Toss, then cook undisturbed until deeply browned in other spots, about 2 minutes. Continue to cook and toss until cabbage is charred in some spots and bright green in others and beginning to wilt. Add butter and thyme and cook, tossing, until butter begins to brown, about 2 minutes. Add Parmesan, pasta, and 1 cup pasta cooking liquid and cook, tossing often and adding more cooking liquid to help finish cooking pasta, until pasta is al dente and sauce is thickened and emulsified and coats pasta, about 5 minutes. Add pancetta and toss to combine; taste and season with salt and pepper. Serve topped with poppy seeds."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55f705bae7f5be0c7ccb6dba/6:4/w_274%2Ch_169/51264250_hires.jpg"
    }
}