{
    "recipe": {
        "title": "Rhubarb-Almond Cake ",
        "ingredients": [
            "1 cup (2 sticks) unsalted butter, room temperature, plus more for pan",
            "3/4 cup plus 3 tablespoons sugar, plus more for pan",
            "1 pound rhubarb stalks, trimmed",
            "1 1/4 cups all-purpose flour",
            "3/4 cup blanched almonds",
            "1 teaspoon baking powder",
            "3/4 teaspoon kosher salt",
            "1/2 vanilla bean, split lengthwise",
            "2 large eggs",
            "1/4 cup plain Greek yogurt or sour cream",
            "One 11x8\" tart pan or one 9\"-diameter tart pan with removable bottom."
        ],
        "instructions": [
            "Preheat oven to 350°F. Butter tart pan and sprinkle with sugar, tapping out excess. Slice rhubarb in half lengthwise (quarter if very large). Set 8 of the prettiest pieces aside for the top of the cake; chop remaining rhubarb into 1/2\" pieces. Pulse flour, almonds, baking powder, and salt in a food processor until almonds are finely ground (texture should be sandy). Place 1 cup butter and 3/4 cup sugar in a large bowl. Scrape in seeds from vanilla bean; reserve pod for another use. Using an electric mixer on high speed, beat until light and fluffy, about 4 minutes. Add eggs, one at a time, beating to blend first egg before adding second. Beat until mixture is pale and fluffy, about 4 minutes. Reduce speed to low and gradually add dry ingredients, followed by yogurt. Beat, scraping down the sides of bowl as needed, just to combine (batter will be thick). Fold in chopped rhubarb and scrape batter into prepared pan. Smooth batter and arrange reserved rhubarb over top; sprinkle with remaining 3 tablespoons sugar. Place tart pan on a large rimmed baking sheet (to catch any rogue juices) and bake, rotating once, until cake is golden brown and rhubarb on top is soft and beginning to brown, 70–80 minutes. Transfer to a wire rack and let cake cool before removing from pan.",
            "Preheat oven to 350°F. Butter tart pan and sprinkle with sugar, tapping out excess. Slice rhubarb in half lengthwise (quarter if very large). Set 8 of the prettiest pieces aside for the top of the cake; chop remaining rhubarb into 1/2\" pieces. Pulse flour, almonds, baking powder, and salt in a food processor until almonds are finely ground (texture should be sandy).",
            "Place 1 cup butter and 3/4 cup sugar in a large bowl. Scrape in seeds from vanilla bean; reserve pod for another use. Using an electric mixer on high speed, beat until light and fluffy, about 4 minutes. Add eggs, one at a time, beating to blend first egg before adding second. Beat until mixture is pale and fluffy, about 4 minutes.",
            "Reduce speed to low and gradually add dry ingredients, followed by yogurt. Beat, scraping down the sides of bowl as needed, just to combine (batter will be thick). Fold in chopped rhubarb and scrape batter into prepared pan. Smooth batter and arrange reserved rhubarb over top; sprinkle with remaining 3 tablespoons sugar.",
            "Place tart pan on a large rimmed baking sheet (to catch any rogue juices) and bake, rotating once, until cake is golden brown and rhubarb on top is soft and beginning to brown, 70–80 minutes. Transfer to a wire rack and let cake cool before removing from pan.",
            "Do Ahead Cake can be baked 3 days ahead. Keep tightly wrapped at room temperature.",
            "Cake can be baked 3 days ahead. Keep tightly wrapped at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5537e2d367c3a7e837c3eaa1/6:4/w_274%2Ch_169/56389380_rhubarb-almond-cake_1x1.jpg"
    }
}