{
    "recipe": {
        "title": "Rhubarb Sorbet with Vanilla Rhubarb Compote ",
        "ingredients": [
            "2 lb rhubarb stalks, trimmed and cut into 1-inch-long pieces (about 7 cups)",
            "1 2/3 cups sugar",
            "2 tablespoons light corn syrup",
            "3/4 cup sugar",
            "1/2 lb rhubarb stalks, trimmed and cut diagonally into 1/4-inch-thick slices (about 1 cup)",
            "2 drops vanilla",
            "an ice cream maker"
        ],
        "instructions": [
            "Make sorbet: Toss together rhubarb, sugar, and corn syrup in a 3 1/2- to 4-quart heavy saucepan and let stand, stirring occasionally, 30 minutes (to macerate). Cook mixture over low heat, stirring frequently, until rhubarb has released about 2 cups liquid, 10 to 15 minutes. Increase heat and simmer, stirring frequently, until rhubarb is very tender, 12 to 15 minutes. 3Purée mixture in 2 batches in a blender until very smooth (use caution when blending hot liquids). Transfer purée to a bowl, then set bowl in a larger bowl of ice and cold water and stir occasionally until cold, 10 to 15 minutes. Freeze purée in ice cream maker, then transfer to an airtight container and put in freezer to harden, at least 1 hour.",
            "Toss together rhubarb, sugar, and corn syrup in a 3 1/2- to 4-quart heavy saucepan and let stand, stirring occasionally, 30 minutes (to macerate).",
            "Cook mixture over low heat, stirring frequently, until rhubarb has released about 2 cups liquid, 10 to 15 minutes. Increase heat and simmer, stirring frequently, until rhubarb is very tender, 12 to 15 minutes. 3Purée mixture in 2 batches in a blender until very smooth (use caution when blending hot liquids). Transfer purée to a bowl, then set bowl in a larger bowl of ice and cold water and stir occasionally until cold, 10 to 15 minutes. Freeze purée in ice cream maker, then transfer to an airtight container and put in freezer to harden, at least 1 hour.",
            "Make compote while purée is chilling: Simmer sugar and 1 1/2 cups water in a 2- to 3-quart saucepan, stirring, until sugar is dissolved. Add rhubarb slices and return just to a simmer, then remove pan from heat and stir in vanilla gently (to avoid breaking up rhubarb). Cool mixture to room temperature, gently stirring once or twice, about 30 minutes. Chill, covered, until ready to use. Let sorbet soften at room temperature 5 minutes, then serve with compote.",
            "Simmer sugar and 1 1/2 cups water in a 2- to 3-quart saucepan, stirring, until sugar is dissolved. Add rhubarb slices and return just to a simmer, then remove pan from heat and stir in vanilla gently (to avoid breaking up rhubarb). Cool mixture to room temperature, gently stirring once or twice, about 30 minutes. Chill, covered, until ready to use.",
            "Let sorbet soften at room temperature 5 minutes, then serve with compote."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de579f3a00aeb2f1d5428/6:4/w_274%2Ch_169/232178.jpg"
    }
}