{
    "recipe": {
        "title": "Rhubarb Turnovers ",
        "ingredients": [
            "12 tablespoons (2 sticks) cold unsalted butter, cut into pieces",
            "2 ounces cream cheese",
            "2 1/2 cups all-purpose flour, plus additional for work surface",
            "1 teaspoon fine sea salt",
            "2 teaspoons sugar",
            "1 tablespoon apple cider vinegar",
            "4 cups (1/2-inch-diced) rhubarb (5 to 6 stalks)",
            "Pinch kosher salt",
            "1/8 teaspoon freshly grated nutmeg",
            "1 cup turbinado sugar, plus more for topping",
            "1 large egg",
            "Lemon Buttermilk Ice, optional"
        ],
        "instructions": [
            "Place the cut butter in the freezer to chill. Meanwhile, in a mixing bowl, combine the flour, salt, and sugar. Get some ice water ready. Add the chilled butter and cream cheese to the mixing bowl and, with both hands, rub the fat between your fingers through the flour until the texture resembles coarse meal, with some pea-size chunks remaining. Drizzle vinegar and 1 tablespoon ice water into the flour mixture and mix with a large spoon or spatula until the dough just comes together. On a floured surface, turn out the dough and pat gently into a disk. Lightly coat the top surface with flour, cover the disk in plastic wrap, and refrigerate for a minimum of 1 hour before rolling out.",
            "To make the turnovers: In a wide skillet, combine the rhubarb, salt, and nutmeg. Stir in 1 cup sugar and let rest for 10 minutes. Turn the burner on to medium heat and cook the rhubarb until the juices are released, about 5 minutes. Remove the rhubarb from the pan with a slotted spoon, transfer to a plate, and cool in the refrigerator. Continue to cook the remaining liquid until reduced to a syrupy glaze. Let the glaze cool. Return the strained, cooled rhubarb to the cooled glaze and toss to coat. Return the rhubarb mixture to the refrigerator. Remove the turnover dough from refrigerator. On a clean, floured surface, roll out the dough to 1/8-inch thick. Using a small plate, bowl, or saucer as a guide, cut out 6-inch circles of dough. Lay each circle on parchment paper, stack the circles, and refrigerate to keep the dough cold. Heat the oven to 350°F. In a small bowl, whisk the egg with 1 tablespoon water; set aside. Remove the dough circles from the refrigerator and transfer them to a parchment-lined cookie sheet or baking sheet. Spoon 1/4 cup of the rhubarb mixture onto one half of each dough circle, leaving 1/2 inch of space around the edge. Fold the dough over the rhubarb so the edges meet, and crimp the edges with a fork. Brush the top of the turnover with the egg wash and sprinkle with turbinado sugar. Cut thin slits in the top of the dough over the rhubarb with the tip of a paring knife to let steam escape. Bake on the middle rack of the oven until the dough is crisp and golden brown, 30 to 40 minutes. If desired, serve each turnover with 1/2 cup Lemon Buttermilk Ice.",
            "In a wide skillet, combine the rhubarb, salt, and nutmeg. Stir in 1 cup sugar and let rest for 10 minutes. Turn the burner on to medium heat and cook the rhubarb until the juices are released, about 5 minutes. Remove the rhubarb from the pan with a slotted spoon, transfer to a plate, and cool in the refrigerator. Continue to cook the remaining liquid until reduced to a syrupy glaze. Let the glaze cool. Return the strained, cooled rhubarb to the cooled glaze and toss to coat. Return the rhubarb mixture to the refrigerator.",
            "Remove the turnover dough from refrigerator. On a clean, floured surface, roll out the dough to 1/8-inch thick. Using a small plate, bowl, or saucer as a guide, cut out 6-inch circles of dough. Lay each circle on parchment paper, stack the circles, and refrigerate to keep the dough cold.",
            "Heat the oven to 350°F. In a small bowl, whisk the egg with 1 tablespoon water; set aside. Remove the dough circles from the refrigerator and transfer them to a parchment-lined cookie sheet or baking sheet. Spoon 1/4 cup of the rhubarb mixture onto one half of each dough circle, leaving 1/2 inch of space around the edge. Fold the dough over the rhubarb so the edges meet, and crimp the edges with a fork. Brush the top of the turnover with the egg wash and sprinkle with turbinado sugar. Cut thin slits in the top of the dough over the rhubarb with the tip of a paring knife to let steam escape.",
            "Bake on the middle rack of the oven until the dough is crisp and golden brown, 30 to 40 minutes. If desired, serve each turnover with 1/2 cup Lemon Buttermilk Ice."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5914ad90f95827731c3992de/6:4/w_274%2Ch_169/rhubarb-turnovers-051117.jpg"
    }
}