{
    "recipe": {
        "title": "Rhubarb and Peach Crisp ",
        "ingredients": [
            "2/3 cup old-fashioned oats",
            "2/3 cup packed dark brown sugar",
            "1/2 cup all purpose flour",
            "3/4 teaspoon ground cinnamon",
            "1/4 teaspoon salt",
            "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
            "1/2 cup hazelnuts, toasted, husked, chopped",
            "4 cups 3/4-inch-thick slices fresh rhubarb (about 1 1/2)",
            "1 16-ounce package frozen sliced peaches, thawed, drained",
            "1 cup sugar",
            "2 tablespoons quick-cooking tapioca",
            "2 teaspoons fresh lemon juice",
            "1 teaspoon ground cinnamon",
            "Pinch of ground nutmeg",
            "Vanilla frozen yogurt"
        ],
        "instructions": [
            "Combine first 5 ingredients in medium bowl. Add butter and cut in using pastry blender or rub with fingertips until mixture begins to clump together. Mix in hazelnuts. (Can be prepared 3 hours ahead. Cover and chill.)",
            "Make filling: Combine all ingredients except frozen yogurt in large bowl. Let stand 1 to 3 hours. Position rack in center of oven and preheat to 375°F. Butter 8 x 8 x 2-inch glass baking dish. Transfer filling to prepared dish. Sprinkle topping evenly over filling in dish, covering completely. Bake until fruit is tender, juice bubbles thickly around sides and topping begins to brown slightly, about 40 minutes. Remove crisp from oven. Preheat broiler. Broil heat just until topping is crisp and golden, watching closely, about 2 minutes. Transfer to rack and cool about 30 minutes. Serve warm with frozen yogurt.",
            "Combine all ingredients except frozen yogurt in large bowl. Let stand 1 to 3 hours.",
            "Position rack in center of oven and preheat to 375°F. Butter 8 x 8 x 2-inch glass baking dish. Transfer filling to prepared dish. Sprinkle topping evenly over filling in dish, covering completely. Bake until fruit is tender, juice bubbles thickly around sides and topping begins to brown slightly, about 40 minutes.",
            "Remove crisp from oven. Preheat broiler. Broil heat just until topping is crisp and golden, watching closely, about 2 minutes. Transfer to rack and cool about 30 minutes. Serve warm with frozen yogurt."
        ],
        "picture_link": null
    }
}