{
    "recipe": {
        "title": "Rib-Eye Steak and Crispy Smashed Potatoes for Two ",
        "ingredients": [
            "1 (1 3/4\"-thick) bone-in rib eye (about 1 1/2 lb.)",
            "1 1/2 tsp. kosher salt, divided, plus more",
            "1/2 tsp. freshly ground black pepper",
            "1 lb. baby Yukon Gold potatoes",
            "1/2 shallot, finely chopped",
            "4 tsp. sherry vinegar",
            "1/2 cup extra-virgin olive oil",
            "1/4 cup finely chopped parsley (from about 1/2 bunch)",
            "1/4 cup finely chopped basil (from about 1/2 bunch)",
            "1 tsp. finely grated orange zest",
            "1/2 tsp. smoked Spanish paprika"
        ],
        "instructions": [
            "Season steak with 1/2 tsp. salt and 1/2 tsp. pepper. Let sit at room temperature 1 hour.",
            "Meanwhile, fill a large pot with about 1\" water and season with a big pinch of salt. Set a steamer basket in pot. Cover and bring water to a boil. Add potatoes, cover, and steam until fork-tender, 20–25 minutes. Remove steamer basket with potatoes from heat and let cool to room temperature. Crush each flat with the back of a spatula to about 1\" thick (the skins will split and some potato flesh might crumble, which is fine).",
            "While potatoes cook, cover shallots with vinegar in a small bowl. Let sit at least 10 minutes and up to 30. Pour oil over, then stir in parsley, basil, orange zest, and 1/4 tsp. salt; set sauce aside until ready to serve.",
            "About half an hour before you want to eat, heat a large heavy skillet (preferably cast iron) over high. Using tongs, hold fat cap of steak against skillet while it heats until enough oil to coat pan is rendered, about 2 minutes. Lay steak down in hot beef fat and cook over high heat, turning every 2 minutes, until a deep brown crust forms and an instant-read thermometer inserted into thickest part of steak registers 120°F for medium-rare, 12–15 minutes. Transfer to a cutting board and let rest 10 minutes.",
            "Heat skillet with beef fat over medium. Add potatoes and paprika; season with remaining 3/4 tsp. salt. Cook, turning once, until potatoes are golden brown and crisp, about 10 minutes.",
            "Cut meat from bone and slice against the grain into thick slices. Transfer steak and potatoes to a platter. Drizzle some green sauce over and serve with remaining sauce alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a70997409de9619fbdda443/6:4/w_274%2Ch_169/Valentine's-Day-Steak-Dinner-For-Two-03012018.jpg"
    }
}