{
    "recipe": {
        "title": "Rib-Eye Steaks with Gorgonzola Butter and Crispy Sweet Onion Rings ",
        "ingredients": [
            "2 heads of garlic, top 3/4 inch cut off to expose cloves",
            "2 tablespoons olive oil",
            "1/2 cup (1 stick) unsalted butter, room temperature",
            "1/3 cup crumbled Gorgonzola cheese (about 2 ounces)",
            "2 tablespoons chopped fresh parsley",
            "3 cups buttermilk",
            "2 sweet onions (such as Vidalia or Walla Walla), thinly sliced into rounds, then separated into rings",
            "3 cups unbleached all purpose flour",
            "3 tablespoons onion powder",
            "3 tablespoons garlic powder",
            "1 1/2 teaspoons salt",
            "1 1/2 teaspoons ground black pepper",
            "4 cups canola oil (for frying)",
            "6 10- to 12-ounce rib-eye steaks",
            "2 tablespoons olive oil"
        ],
        "instructions": [
            "For gorgonzola butter: Preheat oven to 350°F. Place garlic on piece of foil; drizzle with olive oil. Enclose garlic in foil. Bake until garlic is very soft, about 1 hour. Cool. Squeeze garlic cloves out from papery skins into medium bowl; mash garlic with fork. Mix in butter, cheese, and parsley. Season with salt and pepper. Transfer Gorgonzola butter to sheet of plastic wrap. Using plastic wrap as aid, form butter into 1 1/4-inch-diameter log, wrapping plastic tightly around butter. Chill until firm. (Can be made 2 days ahead; keep chilled.) Cut into 1/2-inch-thick rounds.",
            "Preheat oven to 350°F. Place garlic on piece of foil; drizzle with olive oil. Enclose garlic in foil. Bake until garlic is very soft, about 1 hour. Cool. Squeeze garlic cloves out from papery skins into medium bowl; mash garlic with fork. Mix in butter, cheese, and parsley. Season with salt and pepper. Transfer Gorgonzola butter to sheet of plastic wrap. Using plastic wrap as aid, form butter into 1 1/4-inch-diameter log, wrapping plastic tightly around butter. Chill until firm. (Can be made 2 days ahead; keep chilled.) Cut into 1/2-inch-thick rounds.",
            "For onion rings: Pour buttermilk into large bowl. Add onion rings; toss to coat. Let stand 1 hour, tossing occasionally. Mix flour, onion powder, garlic powder, salt, and pepper in another large bowl. Preheat oven to 350°F. Pour enough oil into heavy large skillet to reach depth of 3 inches. Heat over medium-high heat to 350°F. Working with a few onion rings at a time, shake off excess buttermilk, then turn onion rings in flour mixture to coat. Fry onion rings until deep golden brown, adjusting heat as necessary for each batch to maintain temperature at 350°F, about 2 minutes. Transfer onion rings to paper towels to drain, then place on baking sheet and keep warm in oven while frying remaining onion rings.",
            "Pour buttermilk into large bowl. Add onion rings; toss to coat. Let stand 1 hour, tossing occasionally. Mix flour, onion powder, garlic powder, salt, and pepper in another large bowl.",
            "Preheat oven to 350°F. Pour enough oil into heavy large skillet to reach depth of 3 inches. Heat over medium-high heat to 350°F. Working with a few onion rings at a time, shake off excess buttermilk, then turn onion rings in flour mixture to coat. Fry onion rings until deep golden brown, adjusting heat as necessary for each batch to maintain temperature at 350°F, about 2 minutes. Transfer onion rings to paper towels to drain, then place on baking sheet and keep warm in oven while frying remaining onion rings.",
            "For steaks: Brush steaks with olive oil; sprinkle with salt and pepper. Heat 2 large nonstick skillets over medium-high heat. Add 3 steaks to each skillet and cook to desired doneness, about 4 minutes per side for medium-rare. Serve with Gorgonzola butter and onion rings.",
            "Brush steaks with olive oil; sprinkle with salt and pepper. Heat 2 large nonstick skillets over medium-high heat. Add 3 steaks to each skillet and cook to desired doneness, about 4 minutes per side for medium-rare. Serve with Gorgonzola butter and onion rings."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df29af9a84192308a862e/6:4/w_274%2Ch_169/230600.jpg"
    }
}