{
    "recipe": {
        "title": "Rib-Eye Fajitas on the Grill ",
        "ingredients": [
            "3 tablespoons soy sauce",
            "3 tablespoons freshly squeezed lime juice (about 1 1/2 medium limes)",
            "3 tablespoons Worcestershire sauce",
            "6 cloves garlic, crushed",
            "1 1/2 cups red wine",
            "1/4 cup vegetable oil",
            "5 pounds boneless rib-eye steaks",
            "1 poblano chile",
            "4 Anaheim chiles",
            "8 bell peppers (2 green plus 6 in any assortment of red, yellow, or orange)",
            "2 tablespoons freshly squeezed lemon juice (about 1 medium lemon)",
            "Pinch of kosher salt",
            "12 tortillas (flour or corn)",
            "2 large yellow onions, cut in 2-inch-thick slices",
            "Sour cream, for accompaniment",
            "Guacamole (page 255), for accompaniment",
            "Beans a la Charra (page 150), for accompaniment"
        ],
        "instructions": [
            "In a large (4-cup) measuring cup, combine the soy sauce, lime juice, Worcestershire sauce, garlic, wine, and vegetable oil to make the marinade. Put the steaks in a large, heavy-duty, self-sealing plastic bag, pour in the marinade, seal, and refrigerate for at least 4 hours or overnight.",
            "Preheat an outdoor grill; preheat the oven to 250°F. Grill the chiles and bell peppers whole until they blister and brown, turning with tongs every few minutes to ensure they roast on all sides; remove from the heat. Core and seed them, slice them lengthwise into 1/2-inch strips, and sprinkle them with lemon juice and a pinch of salt. Wrap them in aluminum foil and keep them warm in the oven until ready to serve. Wrap the tortillas in foil and put in the oven to warm with the peppers. Remove the steaks from the marinade, drain, and grill according to your preference. Grill the onion slices along with the steak, about 5 minutes per side. To serve, slice the steaks thinly; arrange on a large platter with the grilled sliced onion and the chiles and peppers. Alongside the platter, set out the warm tortillas and bowls of sour cream and guacamole. Beans à la Charra, served in small bowls, is another classic fajita accompaniment.",
            "Preheat an outdoor grill; preheat the oven to 250°F. Grill the chiles and bell peppers whole until they blister and brown, turning with tongs every few minutes to ensure they roast on all sides; remove from the heat. Core and seed them, slice them lengthwise into 1/2-inch strips, and sprinkle them with lemon juice and a pinch of salt. Wrap them in aluminum foil and keep them warm in the oven until ready to serve. Wrap the tortillas in foil and put in the oven to warm with the peppers. Remove the steaks from the marinade, drain, and grill according to your preference. Grill the onion slices along with the steak, about 5 minutes per side.",
            "To serve, slice the steaks thinly; arrange on a large platter with the grilled sliced onion and the chiles and peppers. Alongside the platter, set out the warm tortillas and bowls of sour cream and guacamole. Beans à la Charra, served in small bowls, is another classic fajita accompaniment.",
            "Variation Substitute boneless, skinless chicken breasts or shrimp for the beef. Marinate the chicken according to the directions above. For the shrimp, skip the marinade and just rub them with a little kosher salt and pepper before grilling.",
            "Substitute boneless, skinless chicken breasts or shrimp for the beef. Marinate the chicken according to the directions above. For the shrimp, skip the marinade and just rub them with a little kosher salt and pepper before grilling."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56098ecf6a59cdb91b5f7806/6:4/w_274%2Ch_169/358286.jpg",
        "color": 180154
    }
}