{
    "recipe": {
        "title": "Ribs with Black Vinegar Sauce ",
        "ingredients": [
            "2 pounds pork spareribs, cut into individual ribs",
            "1/4 cup cornstarch",
            "About 12 cups peanut or vegetable oil for frying, divided",
            "4 garlic cloves, thinly sliced",
            "1 medium shallot, thinly sliced",
            "2 tablespoons very thin matchsticks of peeled ginger",
            "1/2 cup packed light brown sugar",
            "2 tablespoons Chinese Shaoxing wine or medium-dry Sherry",
            "1/3 cup reduced-sodium chicken broth",
            "1/3 cup Chinese black vinegar",
            "1/3 cup reduced-sodium soy sauce"
        ],
        "instructions": [
            "Blanch ribs in a 4-quart pot of boiling water 4 minutes. Drain and pat dry. Whisk 1/2 teaspoon salt into cornstarch in a large bowl. Add ribs and toss. Heat 3 inches oil to 400°F in a 4- to 5-quart heavy pot, then fry ribs (in batches if necessary) 5 minutes per batch. Transfer with a slotted spoon to a bowl. Heat 2 tablespoons oil in a heavy medium saucepan over medium heat until it shimmers, then cook garlic, shallot, and ginger, stirring occasionally, until pale golden, about 2 minutes. Add brown sugar and cook, stirring, until dissolved, about 1 minute. Add wine and boil 1 minute. Add ribs with broth, vinegar, and soy sauce and simmer, covered, stirring and turning ribs occasionally, until tender, about 1 hour. Transfer ribs to a platter. Boil sauce, whisking, until thickened and emulsified, about 2 minutes; pour over ribs.",
            "Blanch ribs in a 4-quart pot of boiling water 4 minutes. Drain and pat dry. Whisk 1/2 teaspoon salt into cornstarch in a large bowl. Add ribs and toss.",
            "Heat 3 inches oil to 400°F in a 4- to 5-quart heavy pot, then fry ribs (in batches if necessary) 5 minutes per batch. Transfer with a slotted spoon to a bowl.",
            "Heat 2 tablespoons oil in a heavy medium saucepan over medium heat until it shimmers, then cook garlic, shallot, and ginger, stirring occasionally, until pale golden, about 2 minutes. Add brown sugar and cook, stirring, until dissolved, about 1 minute. Add wine and boil 1 minute.",
            "Add ribs with broth, vinegar, and soy sauce and simmer, covered, stirring and turning ribs occasionally, until tender, about 1 hour.",
            "Transfer ribs to a platter. Boil sauce, whisking, until thickened and emulsified, about 2 minutes; pour over ribs."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d7861f9a841923089d66d/6:4/w_274%2Ch_169/242300_hires.jpg"
    }
}