{
    "recipe": {
        "title": "Rice Cooked in Black Beans (Moros Y Cristianos) ",
        "ingredients": [
            "4 cloves garlic, peeled",
            "3 teaspoons salt",
            "1/4 pound bacon (about 6 strips), chopped",
            "2 tablespoons olive oil",
            "1 onion, finely chopped (about 1 cup)",
            "1 green pepper, seeded and finely chopped (about 3/4 cup)",
            "1 bay leaf",
            "1/4 teaspoon ground cumin",
            "1/2 teaspoon dried oregano",
            "1 1/2 cups long-grain white rice",
            "2 (15 1/2-ounce) cans black beans, not drained",
            "1 3/4 cups water",
            "1 tablespoon red wine vinegar"
        ],
        "instructions": [
            "Put the garlic on a cutting board and sprinkle 1 teaspoon of salt over the cloves, let it sit for a few minutes, and mince it into a paste with a knife. Set aside.",
            "Place the bacon and olive oil in a large pot and set it over medium-high heat. Sauté the bacon until it renders its fat and turns a golden brown color, about 6 minutes. Move the bacon around as it's cooking to prevent it from sticking to the bottom of the pot.",
            "Sauté the vegetables and rice Add the onion, green pepper, and garlic paste to the bacon and sauté until the vegetables are limp and translucent, about 5 minutes. Add the remaining 2 teaspoons of salt, the bay leaf, cumin, oregano, and rice and stir for 1 minute until well mixed and all the rice is coated in oil.",
            "Add the onion, green pepper, and garlic paste to the bacon and sauté until the vegetables are limp and translucent, about 5 minutes. Add the remaining 2 teaspoons of salt, the bay leaf, cumin, oregano, and rice and stir for 1 minute until well mixed and all the rice is coated in oil.",
            "Add the beans, simmer, and serve Add the beans and their liquid, along with the water and vinegar, to the pot. Cover and bring to a boil, then reduce to a simmer. Cook for 35 to 40 minutes, or until all the water has been absorbed by the rice. Allow the covered pot to sit off the heat for 5 minutes. Fluff the rice with a fork and serve.",
            "Add the beans and their liquid, along with the water and vinegar, to the pot. Cover and bring to a boil, then reduce to a simmer. Cook for 35 to 40 minutes, or until all the water has been absorbed by the rice. Allow the covered pot to sit off the heat for 5 minutes. Fluff the rice with a fork and serve."
        ],
        "picture_link": null,
        "color": 16380145
    }
}