{
    "recipe": {
        "title": "Rice Noodles with Peanut Sauce, Chicken, and Snap Peas ",
        "ingredients": [
            "3 tablespoons olive oil",
            "1/2 teaspoon ground cumin",
            "1 1/2 teaspoons kosher salt, divided",
            "3/4 teaspoon freshly ground black pepper, divided",
            "1 1/4 pounds boneless, skinless chicken thighs, trimmed",
            "2 limes, divided",
            "1 batch Kid-Friendly Peanut Sauce",
            "8 ounces dried thin rice noodles",
            "1/2 cup cilantro, coarsely chopped, divided",
            "1/2 cup toasted peanuts, coarsely chopped, divided",
            "2 Persian cucumbers, thinly sliced on the bias",
            "2 medium carrots (about 4 ounces each), grated",
            "1/2 pound sugar snap peas, trimmed"
        ],
        "instructions": [
            "Preheat oven to 425°F. Stir oil, cumin, 1 tsp. salt, and 1/2 tsp. pepper in a large bowl. Add chicken and toss to coat. Spread on a rimmed baking sheet and roast until an instant-read thermometer inserted into thickest part of thigh registers 165°F, 15–17 minutes. Transfer chicken to a cutting board and thinly slice.",
            "Meanwhile, juice 1 lime to yield 3 Tbsp. juice. Cut remaining lime into wedges. Whisk peanut sauce, lime juice, and remaining 1/2 tsp. salt and 1/4 tsp. pepper in a large bowl.",
            "Cook noodles according to package directions. Drain. Transfer noodles to another large bowl. Add 1 1/2 cups peanut sauce mixture, 1/3 cup cilantro, and 1/3 cup peanuts and toss to combine. Divide noodle mixture among bowls.",
            "Transfer sliced chicken to same large bowl and toss with 2 Tbsp. peanut sauce mixture; arrange in a section over noodles. Toss cucumbers and 2 Tbsp. peanut sauce mixture in same large bowl; arrange in another section over noodles. Toss carrot and 1/4 cup peanut sauce mixture in same large bowl; arrange in another section over noodles. Toss snap peas and 2 Tbsp. peanut sauce mixture in same bowl; arrange in another section over noodles. Serve remaining sauce mixture alongside or reserve for another use. Top bowls with remaining cilantro and peanuts and serve with lime wedges alongside.",
            "",
            "",
            "Do Ahead Sauce can be made 2 weeks ahead; transfer to an airtight container and chill. Chicken can be cooked 4 days ahead; cover and chill.",
            "Sauce can be made 2 weeks ahead; transfer to an airtight container and chill. Chicken can be cooked 4 days ahead; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59aed0a2f5802108ea9cac41/6:4/w_274%2Ch_169/Rice-Noodles-with-Peanut-Sauce-Chicken-and-Snap-Peas-Back-to-School-Grocery-Bag-766-14082017.jpg"
    }
}