{
    "recipe": {
        "title": "Rice Vermicelli with Chicken and Nuoc Cham ",
        "ingredients": [
            "1 1/2 pound skin-on, bone-in chicken breasts (about 2)",
            "Kosher salt",
            "1 large shallot, thinly sliced crosswise, separated into rings",
            "1/2 cup vegetable oil",
            "8 ounces rice vermicelli noodles",
            "1 Fresno chile or red jalapeño, with seeds, finely chopped",
            "1 small garlic clove, finely grated",
            "1/3 cup fresh lime juice",
            "1/4 cup fish sauce (such as nam pla or nuoc nam)",
            "2 tablespoons light brown sugar",
            "4 baby white turnips, trimmed, thinly sliced into rounds",
            "4 radishes, trimmed, thinly sliced into rounds",
            "1 1/2 cups fresh Thai or sweet basil leaves, divided"
        ],
        "instructions": [
            "Prepare grill for medium heat. Season chicken with salt and grill, turning often and moving away from direct heat if needed, until cooked through and an instant-read thermometer inserted into the center registers 165°, 20-25 minutes. Transfer chicken to a plate. Let cool slightly, then shred meat, discarding skin and bones. Set aside.",
            "Cook shallot in oil in a small saucepan over medium heat, stirring occasionally, until shallot is golden brown and crisp, 8-10 minutes (reserve shallot oil and use to make vinaigrettes). Using a slotted spoon, transfer shallot rings to a paper towel-lined plate and season with salt. Set aside.",
            "Meanwhile, place noodles in a large bowl and add boiling water to cover. Let noodles soak until tender but not mushy, 5-10 minutes; drain. Rinse under cold water and drain well.",
            "Mix chile, garlic, lime juice, fish sauce, and brown sugar in a large bowl to combine. Add noodles, turnips, radishes, half of basil, and reserved shredded chicken, and toss to combine. Top with reserved fried shallot rings and remaining basil.",
            "DO AHEAD: Shallot rings can be fried 3 days in advance. Store airtight at room temperature. Dressing can be made 2 days ahead."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54afe27d2edcf2b41143aca4/6:4/w_274%2Ch_169/51170200_rice-vermicelli-chicken_1x1.jpg",
        "color": 2532715
    }
}