{
    "recipe": {
        "title": "Ricotta Gnudi with Pomodoro Sauce ",
        "ingredients": [
            "16 ounces ricotta (about 2 cups)",
            "1 large egg, beaten to blend",
            "1 large egg yolk, beaten to blend",
            "1/2 teaspoons freshly ground black pepper",
            "1/2 cup finely grated Parmesan or Grana Padano plus more",
            "1/2 teaspoons kosher salt plus more",
            "1/2 cup all-purpose flour plus more",
            "3 cups Quick Pomodoro Sauce"
        ],
        "instructions": [
            "Mix ricotta, egg, egg yolk, pepper, 1/2 cup Parmesan, and 1/2 teaspoons salt in a large bowl until well combined. Add 1/2 cup flour; stir just until combined and mixture forms a ball (mixture will be soft and moist with some bits of ricotta remaining; add more flour by the tablespoonful if it feels wet). Dust a rimmed baking sheet generously with flour. Using 2 large soup spoons, shape heaping tablespoonfuls of dough into football shapes; place on baking sheet and dust with more flour (you should have 30). Cook gnudi in a large pot of boiling salted water, stirring occasionally, until cooked through and tender, 5-6 minutes (gnudi will quickly float to surface; continue cooking or gnudi will be gummy in the center). Using a slotted spoon, divide gnudi among bowls. Top with Quick Pomodoro Sauce and more Parmesan.",
            "Mix ricotta, egg, egg yolk, pepper, 1/2 cup Parmesan, and 1/2 teaspoons salt in a large bowl until well combined. Add 1/2 cup flour; stir just until combined and mixture forms a ball (mixture will be soft and moist with some bits of ricotta remaining; add more flour by the tablespoonful if it feels wet).",
            "Dust a rimmed baking sheet generously with flour. Using 2 large soup spoons, shape heaping tablespoonfuls of dough into football shapes; place on baking sheet and dust with more flour (you should have 30).",
            "Cook gnudi in a large pot of boiling salted water, stirring occasionally, until cooked through and tender, 5-6 minutes (gnudi will quickly float to surface; continue cooking or gnudi will be gummy in the center).",
            "Using a slotted spoon, divide gnudi among bowls. Top with Quick Pomodoro Sauce and more Parmesan."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b401c92413537c0d457aa6/6:4/w_274%2Ch_169/51143450_ricotta-gnudi_1x1.jpg"
    }
}