{
    "recipe": {
        "title": "Ricotta and Sage Fried Meatballs ",
        "ingredients": [
            "1/3 cup whole-milk ricotta",
            "2 tablespoons vegetable oil plus more for frying",
            "3 garlic cloves, minced",
            "2 teaspoons fennel seeds, toasted, lightly crushed",
            "1 1/4 teaspoons dried sage",
            "1 teaspoon crushed red pepper flakes",
            "1 teaspoon kosher salt",
            "1/2 teaspoon freshly ground black pepper",
            "8 ounces ground pork",
            "24 fresh sage leaves",
            "3/4 cup all-purpose flour",
            "1 large egg, beaten to blend",
            "2 cups panko (Japanese breadcrumbs)",
            "Marinara sauce, warmed (optional)",
            "A deep-fry thermometer"
        ],
        "instructions": [
            "Line a baking sheet with parchment. Stir ricotta and 2 tablespoons oil in a medium bowl until smooth. Mix in garlic and next 5 ingredients. Add pork; gently fold until just combined.",
            "Scoop out scant tablespoonfuls of pork mixture. With dampened hands, roll portions between your palms into 1\" balls; place on sheet. Wrap 1 sage leaf around each ball; press gently to adhere.",
            "Place flour, egg, and panko in 3 separate medium bowls. Working with 1 meatball at a time, dredge in flour, rolling between your hands to remove excess flour. Dip in egg; allow excess to drip back into bowl. Roll meatball in panko, pressing gently to coat. Return to sheet.",
            "Attach deep-fry thermometer to side of a large heavy pot. Pour in oil to a depth of 2\". Heat over medium heat until thermometer registers 350°F. Line another baking sheet with parchment; set a wire rack inside.",
            "Working in batches, fry meatballs, turning often, until light golden and crisp, about 1 minute (they will finish cooking in the oven). Transfer to wire rack; let cool. DO AHEAD: Meatballs can be fried 1 month ahead. Store airtight in freezer.",
            "Preheat oven to 275°F. Bake meatballs in batches on wire rack in baking sheet until cooked through, about 15 minutes. Serve, or keep warm in oven for up to 45 minutes.",
            "Pour some warm marinara, if using, into a small bowl. Serve alongside for dipping."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b0828ffca98987608b466d/6:4/w_274%2Ch_169/51117290_fried-meatballs_1x1.jpg"
    }
}