{
    "recipe": {
        "title": "Ricotta Cheesecake with Almond Praline ",
        "ingredients": [
            "1 cup (150g) plain (all-purpose) flour",
            "1/4 cup (55g) caster (superfine) sugar",
            "100g (7 tablespoons) unsalted butter, chopped",
            "330g (10 1/2 ounces) cream cheese, chopped and softened",
            "500g (2 cups) fresh ricotta",
            "1 1/3 cups (295g) caster (superfine) sugar",
            "1/4 cup (60ml) lemon juice",
            "2 tablespoons finely grated lemon rind",
            "1 teaspoon vanilla extract",
            "1 tablespoon cornstarch",
            "1 tablespoon water",
            "5 eggs",
            "3/4 cup (165g) raw caster (superfine) sugar",
            "1/2 cup (40g) flaked (blanched, sliced) almonds, toasted"
        ],
        "instructions": [
            "Preheat oven to 150°C (300°F). Lightly grease a 22cm round springform cake tin and line the base with non-stick baking paper. Set aside. To make the base, place the flour, sugar and butter in a food processor and process for 1 minute or until a rough dough forms. Using the back of a spoon, press the mixture into the base of the prepared tin. Bake for 30–35 minutes or until golden and just cooked. Set aside to cool slightly. While the base is baking, make the filling. Place the cream cheese, ricotta, sugar, lemon juice, lemon rind and vanilla in a food processor and process until smooth. Place the cornstarch and water in a small bowl and mix until smooth. Add the cornstarch mixture and the eggs to the filling and process to combine. Lightly re-grease the sides of the cake tin and pour the filling over the base, tapping gently to remove any air bubbles. Bake for 50 minutes–1 hour or until light golden and just set. Allow to cool in the closed oven for 50 minutes. Refrigerate for 1 hour or until chilled.",
            "Preheat oven to 150°C (300°F).",
            "Lightly grease a 22cm round springform cake tin and line the base with non-stick baking paper. Set aside.",
            "To make the base, place the flour, sugar and butter in a food processor and process for 1 minute or until a rough dough forms.",
            "Using the back of a spoon, press the mixture into the base of the prepared tin. Bake for 30–35 minutes or until golden and just cooked. Set aside to cool slightly.",
            "While the base is baking, make the filling. Place the cream cheese, ricotta, sugar, lemon juice, lemon rind and vanilla in a food processor and process until smooth. Place the cornstarch and water in a small bowl and mix until smooth. Add the cornstarch mixture and the eggs to the filling and process to combine.",
            "Lightly re-grease the sides of the cake tin and pour the filling over the base, tapping gently to remove any air bubbles.",
            "Bake for 50 minutes–1 hour or until light golden and just set. Allow to cool in the closed oven for 50 minutes.",
            "Refrigerate for 1 hour or until chilled.",
            "To make the almond praline: Preheat oven to 200°C (400°F). Sprinkle the sugar over a large lightly greased baking tray lined with non-stick baking paper. Bake for 12–15 minutes or until melted. Sprinkle with the almonds and allow to set completely on the tray. Crush the praline into small pieces. Sprinkle the cheesecake with the almond praline to serve, pressing gently to secure.",
            "Preheat oven to 200°C (400°F). Sprinkle the sugar over a large lightly greased baking tray lined with non-stick baking paper. Bake for 12–15 minutes or until melted. Sprinkle with the almonds and allow to set completely on the tray. Crush the praline into small pieces. Sprinkle the cheesecake with the almond praline to serve, pressing gently to secure."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a25c206f8072f0487b379f7/6:4/w_274%2Ch_169/ricotta-cheesecake-with-almond-praline-donna-hay-recipe-112917.jpg"
    }
}