{
    "recipe": {
        "title": "Ricotta Gnocchi with Asparagus, Peas, and Morels ",
        "ingredients": [
            "4 cups ricotta (from two 16-ounces containers)",
            "2 large eggs",
            "1 cup finely grated Parmesan",
            "2 teaspoons kosher salt",
            "Freshly ground black pepper",
            "1 cup all-purpose flour",
            "1 bunch asparagus, trimmed",
            "Kosher salt",
            "2 tablespoons olive oil, plus more",
            "1/4 pound fresh morel mushrooms",
            "1 small shallot, finely chopped",
            "1 cup shelled fresh peas (from about 1 pound pods) or frozen peas, thawed",
            "1/4 cup (1/2 stick) unsalted butter",
            "Freshly ground black pepper",
            "Chopped fresh chives, finely grated Parmesan, and finely grated lemon zest (for serving)",
            "Parmesan",
            "Finely grated lemon zest"
        ],
        "instructions": [
            "Line a baking dish with 3 layers of paper towels; spoon ricotta onto paper towels and let sit 20 minutes (if the ricotta is too wet, the dough won't hold together).",
            "Combine ricotta, eggs, Parmesan, and salt in a food processor; season with pepper and process until smooth. Add flour and pulse just to combine (mixture should be smooth and fairly wet). Transfer gnocchi mixture to a pastry bag fitted with 1/2\" round tip or a large resealable plastic bag.",
            "DO AHEAD: Gnocchi mixture can be made 1 day ahead. Cover pastry tip and chill.",
            "For vegetables and assembly: Cook asparagus in a large pot of boiling salted water until bright green and crisp-tender, about 1 minute. Using tongs or a mesh strainer, transfer to a bowl of ice water to cool; drain. Slice asparagus on the diagonal into bite-size pieces, leaving tips intact. Reduce heat so water is simmering. If using a resealable plastic bag for gnocchi mixture, cut a 1/2\" opening in bottom of bag. Working in 3 batches, pipe dough into pot, cutting off 1\" lengths with a paring knife and letting dough drop into water. Cook until doubled in size, about 3 minutes. Using a slotted spoon, transfer gnocchi to a lightly oiled baking sheet. Reserve 1/4 cup cooking liquid. Heat 2 tablespoons oil in a large skillet over medium heat. Cook morels, tossing occasionally, until slightly softened, about 5 minutes. Add shallot and cook, tossing occasionally, until shallot and morels are soft, about 5 minutes; set aside. Add gnocchi, asparagus, peas, butter, and reserved cooking liquid to skillet with morels. Cook, tossing gently, until vegetables are warm and sauce has thickened slightly, about 2 minutes; season with salt and pepper. Serve topped with chives, Parmesan, and lemon zest.",
            "Cook asparagus in a large pot of boiling salted water until bright green and crisp-tender, about 1 minute. Using tongs or a mesh strainer, transfer to a bowl of ice water to cool; drain. Slice asparagus on the diagonal into bite-size pieces, leaving tips intact.",
            "Reduce heat so water is simmering. If using a resealable plastic bag for gnocchi mixture, cut a 1/2\" opening in bottom of bag. Working in 3 batches, pipe dough into pot, cutting off 1\" lengths with a paring knife and letting dough drop into water. Cook until doubled in size, about 3 minutes. Using a slotted spoon, transfer gnocchi to a lightly oiled baking sheet. Reserve 1/4 cup cooking liquid.",
            "Heat 2 tablespoons oil in a large skillet over medium heat. Cook morels, tossing occasionally, until slightly softened, about 5 minutes. Add shallot and cook, tossing occasionally, until shallot and morels are soft, about 5 minutes; set aside.",
            "Add gnocchi, asparagus, peas, butter, and reserved cooking liquid to skillet with morels. Cook, tossing gently, until vegetables are warm and sauce has thickened slightly, about 2 minutes; season with salt and pepper. Serve topped with chives, Parmesan, and lemon zest."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac93b56529d92b2c03ca5d/6:4/w_274%2Ch_169/51232060_ricotta-gnocchi_1x1.jpg",
        "color": 7418251
    }
}