{
    "recipe": {
        "title": "Rigatoni with Southwestern-Style Ground-Turkey Sauce ",
        "ingredients": [
            "1/2 cup minced red onion",
            "2 tablespoons olive oil",
            "1 garlic clove, minced",
            "1 small red bell pepper, cut into 1/4-inch diced",
            "1/2 teaspoon chili powder",
            "1/4 teaspoon ground cumin",
            "1/8 teaspoon cayenne",
            "3/4 pound ground turkey",
            "1 14-ounce can plum tomatoes including-the juice",
            "1 pinch of dried hot red pepper",
            "1/4 cup finely chopped fresh coriander plus coriander sprigs for garnish if desired",
            "1/4 pound rigatoni",
            "coarsely grated Monterey Jack for sprinkling the pasta"
        ],
        "instructions": [
            "In a large skillet cook the onion in the oil over moderately low heat, stirring occasionally, until it is softened, add the garlic, the bell pepper, the chili powder, the cumin, and the cayenne, and cook the mixture, stirring, for 1 minute. Add the turkey and cook the mixture over moderately high heat, stirring and breaking up the turkey with a wooden spoon, for 3 to 4 minutes, or until the turkey is no longer pink. Stir in the tomatoes with the juice, breaking them up, the red pepper flakes, the chopped coriander, and salt and pepper to taste and simmer the sauce, stirring occasionally, for 10 minutes, or until it is thickened.",
            "While the sauce is simmering, in a kettle of boiling salted water cook the rigatoni untul it is al dente, drain it well, and divide it between 2 bowls. Divide the sauce between the bowls, sprinkle it with the Monterey Jack, and garnish each serving with a coriander sprig.",
            "While the sauce is simmering, in a kettle of boiling salted water cook the rigatoni untul it is al dente, drain it well, and divide it between 2 bowls. Divide the sauce between the bowls, sprinkle it with the Monterey Jack, and garnish each serving with a coriander sprig."
        ],
        "picture_link": null
    }
}