{
    "recipe": {
        "title": "Roast Turkey with Apple Cider Pan Gravy ",
        "ingredients": [
            "1 tablespoon butter",
            "1 pound turkey necks and/or wings",
            "1 pound onions, coarsely chopped",
            "3 cups coarsely chopped celery",
            "2 bay leaves",
            "4 whole cloves",
            "1/2 teaspoon salt",
            "1/2 teaspoon ground black pepper",
            "1/4 teaspoon ground cinnamon",
            "1/8 teaspoon ground nutmeg",
            "6 cups apple cider",
            "3 cups low-salt chicken broth",
            "1 8-ounce Granny Smith apple, finely chopped (including core and peel)",
            "2 tablespoons honey",
            "2 tablespoons apple cider vinegar",
            "1 16- to 17-pound turkey",
            "1 large onion, halved, cut into 1-inch-wide wedges",
            "1 Granny Smith apple, cut into 1-inch-wide wedges",
            "6 bay leaves, crumbled",
            "7 tablespoons butter, room temperature, divided",
            "2 cups low-salt chicken broth",
            "strong:Ingredient info:</strong> <em>The milder flavor and softer aroma of Turkish bay leaves are preferable in this dish.</em>"
        ],
        "instructions": [
            "For gravy base: Melt butter in heavy large pot over medium-high heat. Add turkey parts; sauté 10 minutes. Add onions, celery, and bay leaves; sauté until onions are soft, about 8 minutes. Add cloves, salt, pepper, cinnamon, and nutmeg; stir 10 seconds. Add cider, broth, and apple; bring to boil. Reduce heat to low; simmer uncovered 45 minutes, stirring occasionally. Strain stock into medium saucepan. Discard solids. Stir honey and vinegar into gravy base. (Can be prepared 1 day ahead. Cool slightly. Refrigerate uncovered until cold, then cover and keep chilled.)",
            "Melt butter in heavy large pot over medium-high heat. Add turkey parts; sauté 10 minutes. Add onions, celery, and bay leaves; sauté until onions are soft, about 8 minutes. Add cloves, salt, pepper, cinnamon, and nutmeg; stir 10 seconds. Add cider, broth, and apple; bring to boil. Reduce heat to low; simmer uncovered 45 minutes, stirring occasionally. Strain stock into medium saucepan. Discard solids. Stir honey and vinegar into gravy base. (Can be prepared 1 day ahead. Cool slightly. Refrigerate uncovered until cold, then cover and keep chilled.)",
            "For turkey: Set rack at lowest position in oven and preheat to 500°F. Rinse turkey inside and out; pat dry. Sprinkle main cavity generously with salt and pepper. Place onion wedges, apple wedges, and crumbled bay leaves in cavity. Starting at neck end, carefully slide hand between skin and breast meat of turkey to loosen skin. Rub 4 tablespoons butter over breast meat under skin. Place turkey on rack set in large roasting pan. Tuck wing tips under. Tie legs together loosely to hold shape. Rub remaining 3 tablespoons butter over outside of turkey. Sprinkle with salt and pepper. Place turkey in oven and immediately reduce oven temperature to 350°F. Roast turkey 1 hour; pour 1 cup chicken broth over turkey. Roast 1 hour, basting once with pan drippings. Pour 1 cup chicken broth over turkey. Roast until thermometer inserted into thickest part of thigh registers 175°F, basting once with pan drippings and covering turkey loosely with foil if browning too quickly, about 1 hour longer. Transfer turkey to platter; cover loosely with foil. Let turkey rest 20 to 30 minutes (internal temperature of turkey will increase 5 to 10 degrees). Pour pan juices into large measuring cup. Spoon fat off top of pan juices and discard. Return pan juices to roasting pan; add gravy base. Place roasting pan over 2 burners and bring gravy to boil. Reduce heat to medium-low and simmer until gravy is reduced to 31/4 cups, stirring occasionally and scraping up any browned bits, about 15 minutes. Season gravy to taste with salt and pepper. Strain gravy into bowl.",
            "Set rack at lowest position in oven and preheat to 500°F. Rinse turkey inside and out; pat dry. Sprinkle main cavity generously with salt and pepper. Place onion wedges, apple wedges, and crumbled bay leaves in cavity. Starting at neck end, carefully slide hand between skin and breast meat of turkey to loosen skin. Rub 4 tablespoons butter over breast meat under skin. Place turkey on rack set in large roasting pan. Tuck wing tips under. Tie legs together loosely to hold shape. Rub remaining 3 tablespoons butter over outside of turkey. Sprinkle with salt and pepper.",
            "Place turkey in oven and immediately reduce oven temperature to 350°F. Roast turkey 1 hour; pour 1 cup chicken broth over turkey. Roast 1 hour, basting once with pan drippings. Pour 1 cup chicken broth over turkey. Roast until thermometer inserted into thickest part of thigh registers 175°F, basting once with pan drippings and covering turkey loosely with foil if browning too quickly, about 1 hour longer. Transfer turkey to platter; cover loosely with foil. Let turkey rest 20 to 30 minutes (internal temperature of turkey will increase 5 to 10 degrees).",
            "Pour pan juices into large measuring cup. Spoon fat off top of pan juices and discard. Return pan juices to roasting pan; add gravy base. Place roasting pan over 2 burners and bring gravy to boil. Reduce heat to medium-low and simmer until gravy is reduced to 31/4 cups, stirring occasionally and scraping up any browned bits, about 15 minutes. Season gravy to taste with salt and pepper. Strain gravy into bowl.",
            "Serve turkey with gravy.",
            "Serve turkey with gravy."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df2c6f9a84192308a86c6/6:4/w_274%2Ch_169/231087.jpg"
    }
}