{
    "recipe": {
        "title": "Roast Lamb Loin Persillade ",
        "ingredients": [
            "1/4 cup plus 2 tablespoons packed fresh parsley leaves, chopped (wash and dry before chopping)",
            "3 tablespoons extra-virgin olive oil",
            "2 garlic cloves, minced, plus 1 teaspoon chopped garlic",
            "1/2 teaspoon finely grated fresh lemon zest",
            "1/4 teaspoon salt",
            "1 boneless lamb loin (one side only; about 1 1/2 pounds), rolled and tied by butcher",
            "1/2 teaspoon fresh lemon juice"
        ],
        "instructions": [
            "In a blender purée 2 tablespoons parsley, oil, 1 teaspoon chopped garlic, zest, and salt until parsley is finely chopped. Sauce may be make 1 day ahead and chilled, covered. Preheat oven to 425°F. Untie and unroll lamb. Season inside of lamb with salt and pepper and sprinkle with remaining parsley and minced garlic. Reroll lamb and retie with kitchen string. Season outside of lamb with salt and pepper. Put lamb on a rack in a roasting pan and roast in middle of oven 30 to 40 minutes, or until a meat thermometer registers 125°F. for medium-rare or 130°F. for medium. Transfer lamb to a cutting board and let stand 10 minutes. In a small saucepan heat sauce over moderate heat until hot and just before serving stir in lemon juice. Slice lamb about 1/2 inch thick.",
            "In a blender purée 2 tablespoons parsley, oil, 1 teaspoon chopped garlic, zest, and salt until parsley is finely chopped. Sauce may be make 1 day ahead and chilled, covered.",
            "Preheat oven to 425°F.",
            "Untie and unroll lamb. Season inside of lamb with salt and pepper and sprinkle with remaining parsley and minced garlic. Reroll lamb and retie with kitchen string. Season outside of lamb with salt and pepper. Put lamb on a rack in a roasting pan and roast in middle of oven 30 to 40 minutes, or until a meat thermometer registers 125°F. for medium-rare or 130°F. for medium. Transfer lamb to a cutting board and let stand 10 minutes.",
            "In a small saucepan heat sauce over moderate heat until hot and just before serving stir in lemon juice. Slice lamb about 1/2 inch thick.",
            "Divide sauce between 2 plates and top with lamb.",
            "Divide sauce between 2 plates and top with lamb."
        ],
        "picture_link": null
    }
}