{
    "recipe": {
        "title": "Roast Pumpkin with Cheese \"Fondue\" ",
        "ingredients": [
            "1 (15-inch) piece of baguette, cut into 1/2-inch slices (7 ounces total)",
            "1 (7-pound) orange pumpkin",
            "1 1/2 cups heavy cream",
            "1 cup reduced-sodium chicken or vegetable broth",
            "1/2 teaspoon grated nutmeg",
            "2 1/2 cups coarsely grated Gruyère (6 ounces)",
            "2 1/2 cups coarsely grated Emmental (6 ounces)",
            "1 tablespoon olive oil"
        ],
        "instructions": [
            "Preheat oven to 450°F with rack in lower third. Toast baguette slices in 1 layer on a baking sheet in oven until tops are crisp (bread will still be pale), about 7 minutes. Transfer to a rack to cool. Remove top of pumpkin by cutting a circle (3 inches in diameter) around stem with a small sharp knife. Scrape out seeds and any loose fibers from inside pumpkin with a spoon (including top of pumpkin; reserve seeds for another use if desired). Season inside of pumpkin with 1/2 teaspoon salt. Whisk together cream, broth, nutmeg, 1 teaspoon salt, and 1/2 teaspoon pepper in a bowl. Mix together cheeses in another bowl. Put a layer of toasted bread in bottom of pumpkin, then cover with about 1 cup cheese and about 1/2 cup cream mixture. Continue layering bread, cheese, and cream mixture until pumpkin is filled to about 1/2 inch from top, using all of cream mixture. (You may have some bread and cheese left over.) Cover pumpkin with top and put in an oiled small roasting pan. Brush outside of pumpkin all over with olive oil. Bake until pumpkin is tender and filling is puffed, 1 1/4 to 1 1/2 hours.",
            "Preheat oven to 450°F with rack in lower third.",
            "Toast baguette slices in 1 layer on a baking sheet in oven until tops are crisp (bread will still be pale), about 7 minutes. Transfer to a rack to cool.",
            "Remove top of pumpkin by cutting a circle (3 inches in diameter) around stem with a small sharp knife. Scrape out seeds and any loose fibers from inside pumpkin with a spoon (including top of pumpkin; reserve seeds for another use if desired). Season inside of pumpkin with 1/2 teaspoon salt.",
            "Whisk together cream, broth, nutmeg, 1 teaspoon salt, and 1/2 teaspoon pepper in a bowl. Mix together cheeses in another bowl.",
            "Put a layer of toasted bread in bottom of pumpkin, then cover with about 1 cup cheese and about 1/2 cup cream mixture. Continue layering bread, cheese, and cream mixture until pumpkin is filled to about 1/2 inch from top, using all of cream mixture. (You may have some bread and cheese left over.)",
            "Cover pumpkin with top and put in an oiled small roasting pan. Brush outside of pumpkin all over with olive oil. Bake until pumpkin is tender and filling is puffed, 1 1/4 to 1 1/2 hours."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5630f9c77218c5a0300adfc5/6:4/w_274%2Ch_169/1108-GT-TT01.01.jpg"
    }
}