{
    "recipe": {
        "title": "Roasted Chicken with Lemon, Ramps, and Green Olives ",
        "ingredients": [
            "4 tablespoons olive oil",
            "1 lemon, thinly sliced, seeds discarded",
            "2 chickens (about 3 pounds each), quartered, or 4 bone-in, skin-on legs (drumsticks and thighs) and 4 bone-in, skin-on breasts",
            "Kosher salt and freshly ground pepper",
            "1 large bunch ramps or scallions, trimmed and halved lengthwise",
            "4 garlic cloves, thinly sliced",
            "3 shallots, halved lengthwise and thinly sliced",
            "1/3 cup pitted mild green olives (such as Castelvetrano), quartered lengthwise",
            "1 tablespoon chopped fresh thyme",
            "1/2 cup dry white wine",
            "Fresh parsley leaves (for serving)"
        ],
        "instructions": [
            "Preheat oven to 425°F. Heat oil in a large skillet over medium-high. Fry lemon slices until just beginning to brown, 2-3 minutes. Transfer to a plate and reserve oil in pan.",
            "Season chicken with salt and pepper. Return pan to medium-high heat. Working in batches to avoid crowding the pan, cook chicken, without turning, until skin is nicely browned and crisped, 7-8 minutes per batch. Transfer chicken, skin-side up, to a large roasting pan; repeat with remaining chicken. Reserve skillet (do not wash).",
            "Arrange reserved lemon slices and ramps around chicken pieces. Transfer roasting pan to oven and cook until chicken is cooked through (it should reach an internal temperature of 165°F), 25-30 minutes. Transfer chicken, lemon slices, and ramps to a serving platter, reserving pan juices.",
            "Heat reserved skillet over medium; add garlic and shallots and cook until softened, about 5 minutes. Add olives and thyme and cook, stirring, until fragrant, about 1 minute. Add wine and cook, stirring, until reduced by about half, 2-3 minutes. Using a spoon, transfer chicken juices from roasting pan to skillet and cook until thickened, 3-5 minutes; season with salt and pepper. Spoon sauce around chicken and garnish with fresh parsley."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5507142bd7d414037b2b01d6/6:4/w_274%2Ch_169/EP-03132015-passover-chicken-6x4.jpg",
        "color": 7328493
    }
}