{
    "recipe": {
        "title": "Roasted Eggplant and Crispy Kale with Yogurt ",
        "ingredients": [
            "2 medium Italian eggplants (about 1 1/2 pounds total), quartered lengthwise, cut crosswise into 1-inch pieces",
            "1/4 cup vegetable oil",
            "Kosher salt",
            "1 teaspoon dried mango powder (amchoor; optional)",
            "1/2 teaspoon ground cumin",
            "6 Tuscan kale leaves, ribs and stems removed, leaves coarsely torn",
            "1 medium Persian cucumber",
            "1 cup plain whole-milk Greek yogurt",
            "1 teaspoon fresh lemon juice",
            "1 garlic clove, finely grated",
            "2 cups cherry tomatoes, halved",
            "Olive oil (for drizzling)"
        ],
        "instructions": [
            "Preheat oven to 450°F. Toss eggplants with vegetable oil on a rimmed baking sheet; season with salt. Roast, tossing halfway through, until eggplants are charred in spots and tender, 20–25 minutes. Remove from oven, sprinkle with mango powder (if using) and cumin, and toss to coat. Meanwhile, heat a dry large skillet, preferably cast iron, over medium-high. Add kale, arranging to fit in a single even layer (work in batches if needed), and cook, turning occasionally, until charred in spots and crisp, about 4 minutes. Grate cucumber on the medium holes of a box grater; squeeze out excess liquid with your hands and transfer to a medium bowl. Mix in yogurt, lemon juice, and garlic; season with salt. Toss tomatoes with a good pinch of salt and a drizzle of olive oil in a medium bowl. Spoon yogurt mixture onto a platter and layer eggplants, kale, and tomatoes on top. Drizzle with more olive oil.",
            "Preheat oven to 450°F. Toss eggplants with vegetable oil on a rimmed baking sheet; season with salt. Roast, tossing halfway through, until eggplants are charred in spots and tender, 20–25 minutes. Remove from oven, sprinkle with mango powder (if using) and cumin, and toss to coat.",
            "Meanwhile, heat a dry large skillet, preferably cast iron, over medium-high. Add kale, arranging to fit in a single even layer (work in batches if needed), and cook, turning occasionally, until charred in spots and crisp, about 4 minutes.",
            "Grate cucumber on the medium holes of a box grater; squeeze out excess liquid with your hands and transfer to a medium bowl. Mix in yogurt, lemon juice, and garlic; season with salt.",
            "Toss tomatoes with a good pinch of salt and a drizzle of olive oil in a medium bowl. Spoon yogurt mixture onto a platter and layer eggplants, kale, and tomatoes on top. Drizzle with more olive oil."
        ],
        "picture_link": "https://assets.epicurious.com/photos/594156f968bd4e58aaab1d31/6:4/w_274%2Ch_169/roasted-eggplant-and-crispy-kale-with-yogurt.jpg"
    }
}