{
    "recipe": {
        "title": "Roast Chicken and Potatoes with Balsamic-Black Pepper Sauce ",
        "ingredients": [
            "9 tablespoons olive oil",
            "3/4 cup chopped shallots",
            "1 tablespoon chopped fresh thyme or 1 teaspoon dried",
            "2 tablespoons all purpose flour",
            "3 1/2 cups chicken stock or canned low-salt chicken broth",
            "1 3/4 cups beef stock or canned beef broth",
            "2 1/2 tablespoons balsamic vinegar",
            "1/2 teaspoon ground black pepper",
            "2 pounds large red potatoes (about 6), each cut lengthwise into 1-inch wedges",
            "1 1/2 tablespoons chopped garlic",
            "1 tablespoon chopped fresh rosemary",
            "1 5- to 5 1/4-pound fryer chicken, halved lengthwise, backbone removed"
        ],
        "instructions": [
            "Heat 2 tablespoons oil in heavy large saucepan over medium-high heat. Add shallots and thyme and sauté until shallots begin to brown, about 4 minutes. Add flour and stir 1 minute. Gradually whisk in both stocks. Boil until liquid is reduced to 1 1/2 cups, stirring occasionally, about 20 minutes. Add vinegar and pepper. (Sauce can be prepared 1 day ahead. Cover and refrigerate.)",
            "Position 1 rack in top third of oven and another in bottom third; preheat to 375°F. Toss potatoes, 1 tablespoon oil, garlic and rosemary in large bowl. Arrange potato wedges, rounded side down, on large baking sheet. Sprinkle with salt and pepper. Set aside.",
            "Season chicken lightly with salt and pepper. Heat remaining 6 tablespoons oil in heavy large ovenproof skillet over medium-high heat. Add chicken halves, skin side down; cook until very brown, about 15 minutes. Using tongs, turn chicken over; cook 5 minutes longer.",
            "Place potatoes on top oven rack and transfer skillet with chicken to bottom rack. Roast potatoes and chicken until cooked through, about 45 minutes. Rewarm sauce. Cut each chicken half into 2 pieces. Arrange chicken and potatoes on platter. Serve with sauce."
        ],
        "picture_link": null,
        "color": 12137630
    }
}