{
    "recipe": {
        "title": "Roasted Fennel with Olives and Garlic ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "4 small (3-inch-diameter) fennel bulbs, trimmed, each cut vertically into 8 wedges with core attached to each wedge",
            "1/4 cup extra-virgin olive oil",
            "6 large garlic cloves, coarsely crushed",
            "1 tablespoon chopped fresh thyme",
            "1/8 teaspoon dried crushed red pepper",
            "Coarse kosher salt",
            "1/2 cup halved pitted Kalamata olives"
        ],
        "instructions": [
            "Preheat oven to 425°F. Spray large rimmed baking sheet with nonstick spray. Combine fennel, olive oil, garlic, thyme, and crushed red pepper in large bowl; toss to coat. Spread fennel out on baking sheet; sprinkle with coarse kosher salt and pepper. Roast fennel 15 minutes. Using tongs, turn wedges over. Continue to roast until tender, turning 1 more time, about 20 minutes. Sprinkle olives over fennel. Roast until fennel begins to brown at edges, about 8 minutes longer. Season fennel with salt and pepper. Transfer to bowl and serve. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature. Serve warm or at room temperature.",
            "Preheat oven to 425°F. Spray large rimmed baking sheet with nonstick spray. Combine fennel, olive oil, garlic, thyme, and crushed red pepper in large bowl; toss to coat. Spread fennel out on baking sheet; sprinkle with coarse kosher salt and pepper. Roast fennel 15 minutes. Using tongs, turn wedges over. Continue to roast until tender, turning 1 more time, about 20 minutes. Sprinkle olives over fennel. Roast until fennel begins to brown at edges, about 8 minutes longer. Season fennel with salt and pepper. Transfer to bowl and serve. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature.",
            "Serve warm or at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54be7f6a2a4b69f8647ed15e/6:4/w_274%2Ch_169/roasted-fennel-olives-garlic-6x4.jpg"
    }
}