{
    "recipe": {
        "title": "Roasted Stuffed Red Onions ",
        "ingredients": [
            "8 medium red onions, peeled, trimmed",
            "1 tablespoon kosher salt plus more",
            "1/2 cup extra-virgin olive oil, divided",
            "4 garlic cloves, finely chopped",
            "1/2 pound ground beef or lamb",
            "2 dried bay leaves",
            "2 teaspoons dried oregano",
            "1 1/2 teaspoons dried mint",
            "5 cups cooked white rice",
            "1 cup dry white wine, divided",
            "4 tablespoons fresh lemon juice, divided",
            "1/2 cup finely chopped fresh dill",
            "1 teaspoon finely grated lemon zest",
            "Freshly ground black pepper"
        ],
        "instructions": [
            "Cook onions in a pot of boiling salted water until slightly softened, about 10 minutes. Using a slotted spoon, transfer to a large bowl; let cool slightly.",
            "Working with 1 onion at a time, make a lengthwise slit from top to bottom with a paring knife, cutting through 2-3 layers of onion, depending on thickness of layers. Gently remove inside layers, allowing outer 2-3 layers to hold their shape. Finely chop enough of the inside layers to measure 1 cup.",
            "Heat 1/4 cup oil in a large heavy skillet over medium heat. Add garlic and chopped onions; cook, stirring often, until soft, about 2 minutes. Add 1 tablespoon salt, beef, bay leaves, oregano, and mint; cook, breaking up meat with the back of a spoon, until meat is cooked through, 2-3 minutes. Stir in rice, 1/2 cup wine, and 2 tablespoons lemon juice; cook, stirring often, until liquid is absorbed, about 3 minutes. Add dill and zest; mix well. Season filling with salt and pepper.",
            "Preheat oven to 400°F. Spoon about 1/2 cup filling into each onion (it should be tightly packed). Place onions in a 13x9x2\" baking dish, stuffed side up; drizzle with 1/4 cup oil, 1/2 cup wine, and 2 tablespoons lemon juice.",
            "Roast onions until crispy on top and slightly browned, about 30 minutes. Serve hot or at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54f8a112e77a7de93306746f/6:4/w_274%2Ch_169/395489_roasted-stuffed-red-onions_6x4.jpg",
        "color": 6826346
    }
}