{
    "recipe": {
        "title": "Roasted Strawberry Danish ",
        "ingredients": [
            "2 cups (1 pint) fresh strawberries, hulled and halved",
            "6 tablespoons sugar",
            "3/4 cup all-purpose flour",
            "1/4 teaspoon kosher salt",
            "4 tablespoons (1/2 stick) cold unsalted butter, cut into very small pieces",
            "2/3 cup cream cheese, softened slightly",
            "1 teaspoon fresh lemon juice",
            "1/4 cup confectioners' sugar, plus extra for dusting (optional)",
            "2 English muffins, halved and toasted"
        ],
        "instructions": [
            "Adjust an oven rack to the middle position and preheat the oven to 350°F. Line a rimmed sheet pan with parchment paper and set it aside.",
            "Toss the strawberries and 2 tablespoons sugar in a medium-size bowl. Turn the strawberries out onto the prepared sheet pan and turn them all cut side up. Roast until they are soft and juicy, about 20 minutes. Remove from the oven and return the strawberries to the bowl. Discard the parchment paper and set the sheet pan aside.",
            "Meanwhile, whisk the flour, remaining 3 tablespoons sugar, and the salt in a medium-size bowl. Add the butter pieces and, with your fingers, work the butter into the dry ingredients until the mixture forms a sandy streusel with some chunky pea-size pieces.",
            "In a separate medium-size bowl, stir together the cream cheese and lemon juice. Place the confectioners’ sugar in a sieve and sift it into the cream cheese; stir until smooth. Reduce the oven temperature to 325°F.",
            "Divide the cream cheese mixture among the toasted English muffin halves, spreading it evenly. Make a well in the center of the cream cheese mixture and add some strawberries to it, then sprinkle the streusel around the edges of the cream cheese–topped muffin halves.",
            "Return the sheet pan to the oven and bake until the streusel becomes golden, 12 to 15 minutes. Remove from the oven and cool slightly before serving. Dust with more confectioners' sugar, if you like."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a2193b0e269e068e10eab1f/6:4/w_274%2Ch_169/roasted-strawberry-danish-recipe-113017.jpg",
        "color": 15498612
    }
}