{
    "recipe": {
        "title": "Roasted Scottish Pheasants with Apricots and Dates '21' Club ",
        "ingredients": [
            "1/2 cup dried apricots",
            "1/2 cup dry white wine",
            "1/4 cup Grand Marnier or other orange liqueur",
            "1/4 cup fresh lime juice (from about 2 large limes)",
            "2 tablespoons sugar",
            "two 2 1/2- to 3-pound pheasants (preferably wild Scottish)*",
            "freshly ground black pepper to taste",
            "2 teaspoons dried thyme, crumbled",
            "2 bay leaves",
            "vegetable oil for brushing pheasants",
            "1/2 cup pitted dates, chopped",
            "Garnish: fresh thyme sprigs",
            "*available at some butcher shops and by mail order from D'Artagnan, tel.(800)327-8246 or (201) 792-0748"
        ],
        "instructions": [
            "In a small heatproof bowl cover apricots with boiling water and soak 10 minutes. Drain apricots and cut into quarters. In a small saucepan simmer wine, liqueur, lime juice, and sugar 5 minutes. Preheat oven to 375°F. Cut off legs of pheasants and reserve for another use. Sprinkle pheasants inside and out with pepper and salt to taste. Put 1 teaspoon thyme and 1 bay leaf in cavity of each pheasant and close cavities with skewers or toothpicks so that pheasants hold their shape. Brush pheasants with oil and in a roasting pan arrange, breast side down. Roast pheasants 20 minutes and discard any fat in roasting pan. Turn pheasants over and to pan add apricots, wine mixture, and dates. Roast pheasants, adding about 1/2 cup water if all liquid evaporates, 25 minutes more, or until thermometer inserted in thickest part of breast registers 160°F. Let pheasants stand 10 minutes.",
            "In a small heatproof bowl cover apricots with boiling water and soak 10 minutes. Drain apricots and cut into quarters. In a small saucepan simmer wine, liqueur, lime juice, and sugar 5 minutes.",
            "Preheat oven to 375°F.",
            "Cut off legs of pheasants and reserve for another use. Sprinkle pheasants inside and out with pepper and salt to taste. Put 1 teaspoon thyme and 1 bay leaf in cavity of each pheasant and close cavities with skewers or toothpicks so that pheasants hold their shape.",
            "Brush pheasants with oil and in a roasting pan arrange, breast side down. Roast pheasants 20 minutes and discard any fat in roasting pan. Turn pheasants over and to pan add apricots, wine mixture, and dates. Roast pheasants, adding about 1/2 cup water if all liquid evaporates, 25 minutes more, or until thermometer inserted in thickest part of breast registers 160°F. Let pheasants stand 10 minutes.",
            "Transfer pheasants to a cutting board and cut each in half. Serve pheasants with apricot date sauce and garnish with thyme.",
            "Transfer pheasants to a cutting board and cut each in half. Serve pheasants with apricot date sauce and garnish with thyme."
        ],
        "picture_link": null
    }
}