{
    "recipe": {
        "title": "Roasted Fingerlings with Red and Yellow Pipérade ",
        "ingredients": [
            "1/2 cup plus 2 tablespoons extra-virgin olive oil",
            "2 large red bell peppers, stemmed, seeded, cut into 1/4- to 1/3-inch-wide strips",
            "2 large yellow bell peppers, stemmed, seeded, cut into 1/4- to 1/3-inch-wide strips",
            "1 large red onion, halved through core, thinly sliced crosswise",
            "3 pounds fingerling potatoes, halved lengthwise",
            "1/2 cup chopped fresh parsley",
            "1/4 cup chopped shallots",
            "1/4 cup chopped fresh chives",
            "1/4 cup chopped fresh basil",
            "1 tablespoon chopped fresh thyme",
            "1/4 cup Champagne vinegar"
        ],
        "instructions": [
            "Preheat oven to 425°F. Pour 1/2 cup extra-virgin olive oil onto large rimmed baking sheet. Spread all peppers and sliced onion over, sprinkle with salt and pepper, and toss to coat. Roast 10 minutes. Place halved potatoes and remaining 2 tablespoons olive oil in large bowl. Sprinkle with salt and pepper; toss to coat. Arrange potatoes in single layer atop peppers. Roast until potatoes are tender and beginning to turn golden, about 50 minutes. DO AHEAD: Can be prepared 2 hours ahead. Let stand at room temperature. Rewarm in 425°F oven for 10 minutes before continuing. Sprinkle chopped parsley and shallots over potatoes and toss to coat. Roast potatoes 5 minutes longer. Transfer potatoes to large platter. Sprinkle with chives, basil, and thyme. Drizzle with Champagne vinegar and toss to coat. Season to taste with salt and pepper.",
            "Preheat oven to 425°F. Pour 1/2 cup extra-virgin olive oil onto large rimmed baking sheet. Spread all peppers and sliced onion over, sprinkle with salt and pepper, and toss to coat. Roast 10 minutes. Place halved potatoes and remaining 2 tablespoons olive oil in large bowl. Sprinkle with salt and pepper; toss to coat. Arrange potatoes in single layer atop peppers. Roast until potatoes are tender and beginning to turn golden, about 50 minutes. DO AHEAD: Can be prepared 2 hours ahead. Let stand at room temperature. Rewarm in 425°F oven for 10 minutes before continuing.",
            "Sprinkle chopped parsley and shallots over potatoes and toss to coat. Roast potatoes 5 minutes longer. Transfer potatoes to large platter. Sprinkle with chives, basil, and thyme. Drizzle with Champagne vinegar and toss to coat. Season to taste with salt and pepper.",
            "Pipérade refers to the classic Basque stew made with tomatoes, bell peppers, onions, and garlic.",
            "Pipérade refers to the classic Basque stew made with tomatoes, bell peppers, onions, and garlic."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a5bf9a84192308a1c4c/6:4/w_274%2Ch_169/240410_hires.jpg"
    }
}