{
    "recipe": {
        "title": "Roasted Garlic Pull-Apart Cheese Bread ",
        "ingredients": [
            "8 garlic cloves",
            "2 tablespoons olive oil",
            "Kosher salt and black pepper",
            "4 ounces mozzarella cheese, grated",
            "4 ounces Fontina cheese, grated",
            "4 ounces Parmesan cheese, grated",
            "4 ounces Pecorino Romano cheese, grated",
            "2 teaspoons chopped fresh chives",
            "2 teaspoons red pepper flakes",
            "1 round artisan or sourdough loaf",
            "8 tablespoons (1 stick) butter, melted"
        ],
        "instructions": [
            "Preheat the oven to 375°F.",
            "Place the garlic cloves on a square of heavy foil, drizzle the olive oil over them, and sprinkle with salt and pepper. Wrap it up into a parcel and roast for 1 hour or until the garlic is golden, nutty, and soft. Set it aside to cool and reduce the oven temperature to 350°F. (You can roast the garlic up to a couple of days ahead of time and keep it in a small jar of oil in the fridge. Roast a bunch of cloves! You never know when you’ll need 'em.)",
            "In a bowl, combine the cheeses, roasted garlic, chives, red pepper flakes, and some black pepper. Stir to mix everything together, smushing the garlic cloves so that little bits are distributed throughout the cheese. (You can get in there and use your fingers if you’d rather!)",
            "Cut the bread in 1 1/2-inch-wide strips in one direction, taking care not to cut all the way through the loaf. Rotate the bread 90 degrees and cut the bread crosswise again. Move slowly and use caution! A serrated knife helps immensely. Ta-da!",
            "Set the bread on a large piece of foil and stuff the cheese mixture in between the rows and keep going until that bread is so stuffed with cheese, it can’t see straight! Drizzle the melted butter evenly all over the surface of the bread. Wrap the bread in foil and bake for 25 minutes. Open up the foil and bake it for another 10 minutes.",
            "Carefully unwrap the bread and dig right in!",
            "Change things up! Make a pizza version: Add chopped pepperoni, diced green bell pepper, and spoonfuls of marinara sauce. How about a French onion version? Diced caramelized onions, Gruyère cheese, and chopped chives. Drizzle on beef broth instead of butter. Yum! My friend Meseidy has made a Buffalo chicken version: Add mozzarella and a bunch of shredded chicken simmered in Louisiana hot sauce. Barbecue chicken would also be dreamy.",
            "Make a pizza version: Add chopped pepperoni, diced green bell pepper, and spoonfuls of marinara sauce.",
            "How about a French onion version? Diced caramelized onions, Gruyère cheese, and chopped chives. Drizzle on beef broth instead of butter. Yum!",
            "My friend Meseidy has made a Buffalo chicken version: Add mozzarella and a bunch of shredded chicken simmered in Louisiana hot sauce. Barbecue chicken would also be dreamy."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a6119919c5f5560d88f3c98/6:4/w_274%2Ch_169/roasted-garlic-pull-apart-cheese-bread-recipe-HC-011818.jpg",
        "color": 2231313
    }
}