{
    "recipe": {
        "title": "Roast Pork Sandwiches with Sweet Peppers and Arugula ",
        "ingredients": [
            "2 small garlic cloves, smashed",
            "Coarse kosher salt",
            "4 teaspoons fresh lemon juice",
            "1/4 cup extra-virgin olive oil",
            "2 teaspoons minced fresh thyme",
            "2/3 cup mayonnaise",
            "1 20- to 24-inch-long crusty baguette",
            "4 (1-inch-thick) pork chops reserved from Pork Rib Roast with Fig and Pistachio Stuffing , cut from bone, very thinly sliced horizontally",
            "12 Peppadews or cherry peppers from jar (about 2 ounces), halved lengthwise, seeded, flattened",
            "1 small red onion, very thinly sliced",
            "2 cups arugula (about 2 ounces)"
        ],
        "instructions": [
            "Place garlic cloves in mortar. Add pinch of coarse salt and smash with pestle until paste forms. Alternatively, press garlic into small bowl; add coarse salt and mash with back of spoon to form paste. Whisk in lemon juice, then olive oil and thyme. Whisk in mayonnaise. Season with salt and pepper. DO AHEAD Garlic mayonnaise can be made 1 day ahead. Cover and chill. Spread cut sides of baguette pieces with garlic mayonnaise. Divide pork among bottom pieces of bread. Layer Peppadews, onion slices, and arugula atop pork. Add baguette tops to sandwiches and serve.",
            "Place garlic cloves in mortar. Add pinch of coarse salt and smash with pestle until paste forms. Alternatively, press garlic into small bowl; add coarse salt and mash with back of spoon to form paste. Whisk in lemon juice, then olive oil and thyme. Whisk in mayonnaise. Season with salt and pepper. DO AHEAD Garlic mayonnaise can be made 1 day ahead. Cover and chill.",
            "Spread cut sides of baguette pieces with garlic mayonnaise. Divide pork among bottom pieces of bread. Layer Peppadews, onion slices, and arugula atop pork. Add baguette tops to sandwiches and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d993f7b55306961bf75a1/6:4/w_274%2Ch_169/237066.jpg"
    }
}