{
    "recipe": {
        "title": "Roasted Salmon with Potatoes and Herbed Crème Fraîche ",
        "ingredients": [
            "1 1/2 pound small waxy potatoes, scrubbed",
            "Kosher salt",
            "2 tablespoons olive oil",
            "1 1 1/2-pound piece skin-on salmon",
            "1 tablespoon olive oil, plus more for drizzling",
            "Kosher salt",
            "1/2 cup crème fraîche",
            "2 tablespoons chopped fresh chives, dill, and/or tarragon, plus tarragon and dill sprigs for serving",
            "2 radishes, trimmed, thinly sliced"
        ],
        "instructions": [
            "Potatoes: Place potatoes in a medium saucepan and add cold water to cover by 1\"; season with salt. Bring to a boil, reduce heat, and simmer until tender, 15-20 minutes; drain and pat dry. Let cool slightly, halve potatoes and toss with oil; season with salt.",
            "Place potatoes in a medium saucepan and add cold water to cover by 1\"; season with salt. Bring to a boil, reduce heat, and simmer until tender, 15-20 minutes; drain and pat dry. Let cool slightly, halve potatoes and toss with oil; season with salt.",
            "Salmon and assembly: Preheat oven to 400°. Place salmon, skin side down, on a parchment-lined rimmed baking sheet; rub with 1 tablespoon oil and season with salt. Roast until medium-rare (mostly opaque but still slightly translucent in the center), 10-15 minutes. Break up salmon into pieces, removing skin if desired. Whisk crème fraîche and chopped herbs in a small bowl; season with salt. Spread herbed crème fraîche on plates and top with salmon, potatoes, radishes, and tarragon and dill sprigs; drizzle with oil.",
            "Preheat oven to 400°. Place salmon, skin side down, on a parchment-lined rimmed baking sheet; rub with 1 tablespoon oil and season with salt. Roast until medium-rare (mostly opaque but still slightly translucent in the center), 10-15 minutes. Break up salmon into pieces, removing skin if desired.",
            "Whisk crème fraîche and chopped herbs in a small bowl; season with salt.",
            "Spread herbed crème fraîche on plates and top with salmon, potatoes, radishes, and tarragon and dill sprigs; drizzle with oil."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac275519925f464b3a88e6/6:4/w_274%2Ch_169/51236440_roasted-salmon_1x1.jpg"
    }
}