{
    "recipe": {
        "title": "Roasted Ducklings in Orange Sauce ",
        "ingredients": [
            "2 ducklings, about 5 pounds each, giblets saved for the sauce",
            "1 tablespoon coarse salt",
            "1 bunch fresh thyme",
            "1 bunch fresh rosemary",
            "6 garlic cloves, peeled",
            "2 oranges, one quartered and seeded; the other sliced in 1/4-inch-thick rounds",
            "2 to 3 onions sliced in 1/2-inch-thick rounds",
            "1 bunch carrots, peeled and halved lengthwise",
            "1/4 cup Cointreau or other orange liqueur",
            "1 teaspoon salt",
            "2 teaspoons freshly ground black pepper",
            "16 ounces beef or chicken stock",
            "Giblets and necks from the ducklings",
            "2 to 3 tablespoons rendered duck fat (from the roasting ducklings)",
            "2 tablespoons all-purpose flour",
            "1/2 cup Cointreau or other orange liqueur",
            "1/4 cup red wine vinegar",
            "1/4 cup balsamic vinegar",
            "1/4 cup fresh orange juice",
            "1 cup orange marmalade",
            "2 tablespoons thinly sliced orange peel",
            "1 orange, sliced into thin rounds, for garnish"
        ],
        "instructions": [
            "Preheat the oven to 425°F. If convection is an option, choose it.",
            "Make the ducks. Cut away the flap of fatty skin from the neck, and scrape any loose fat from inside the cavities. Prick the skin all over gently with a sharp fork, or cross-hatch it with a sharp knife. Be careful not to pierce the meat.",
            "Fill an 18-quart stock pot (or as large as you have) about two-thirds full with water, and add the salt. Place the bunches of thyme and rosemary and the garlic cloves in it. Bring to a rapid boil. (You may need to use two pots if you do not have a single pot large enough to hold both ducklings at once; if so, divide the thyme and rosemary into smaller held-together bunches, and divide the garlic between the pots.) Place the ducks in the pot. If they pop up, keep them submerged using a smaller pot full of water or some other weight. Be aware of overflow. Bring the water back to a slow boil. Simmer the ducks for about 30 minutes. Remove them, and use paper towels to dry them thoroughly.",
            "Stuff each of the ducks’ cavities with half of the boiled thyme, rosemary, and garlic and the quartered orange.",
            "Line the bottom of a large shallow roasting pan with the onions, carrots, and the orange rounds. Place the ducks, breast-side down, on top. Massage them with the Cointreau. This will give them a mahogany finish. Let them sit for 10 minutes for the skin to absorb the liqueur. Sprinkle with salt and pepper.",
            "Roast until the bottoms brown, about 20 minutes. Turn them breast-side up, and lower the oven temperature to 350°F. Several times during roasting, spoon off any excess fat as it accumulates, or suck it up using a baster. Use some of the fat to baste the ducks, and set the rest aside, saving some for the sauce.",
            "Depending on how long you boiled the ducks and the size of the ducks, roasting time will be another hour or longer. The ducks are done when a meat thermometer inserted into the thickest part of the thigh registers at least 180°F, or until the juices run clear and the leg bones wiggle easily. You want the meat to slide off the bones. Don’t be afraid of overcooking these. Ducks don’t dry out easily. The skin should be crisp. If not, no worries. You will pass the pieces under the broiler before serving. (If the ducks are too crisp and the meat is not finished cooking, cover them with foil as you continue roasting.) Once the ducks are ready, remove them from the oven, and cover them with aluminum foil while you finish the sauce.",
            "Meanwhile, make the sauce. Combine the stock, giblets, and necks in a saucepot over medium-high heat, and bring to a boil. Reduce the heat to medium-low to maintain a gentle boil, until the stock is reduced by half.",
            "Finish the sauce when you have retrieved rendered duck fat from the roasting duck. In a medium saucepan, warm the duck fat over medium heat. Add the flour, whisking with a fork as you do so. Remove the giblets and necks from the stock reduction, and discard. Add the stock to the duck fat–flour mixture, raise the heat to medium-high, and stir continuously to prevent lumps as you bring it to a slow boil. Add the Cointreau, vinegars, orange juice, marmalade, and orange peel to the pan. Bring back to a boil, melting the marmalade, then simmer uncovered on low heat until the sauce thickens and is reduced. Preheat a broiler with the rack set a notch or two down from the top position.",
            "When the ducks have rested at least 20 minutes, use a sharp knife or poultry scissors to split them and cut the breasts from the legs. Discard the orange quarters, herbs, wings, and any pockets of fat that remain. Slip the breast meat from the bones. Leave the legs intact. Put a little sauce in a broiling pan, and lay the duck pieces on top. Spoon a little sauce on top of each piece. Put them under the broiler for about 1 minute to crisp and glaze. Watch them carefully; the sugar in the sauce caramelizes quickly.",
            "Place the pieces on a platter, and decorate with thin, round slices of orange. Serve with additional sauce on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c06a7653e45a22d240456b8/6:4/w_274%2Ch_169/roasted-ducklings-in-orange-sauce-recipe-HC-120418.jpg",
        "color": 192697
    }
}