{
    "recipe": {
        "title": "Roasted Veal Shanks with Rosemary ",
        "ingredients": [
            "2 2-to 2 1/2-pound veal shanks",
            "Coarse kosher salt",
            "6 tablespoons olive oil, divided",
            "2 cups 1/3-inch cubes peeled carrots",
            "2 cups thinly sliced onion",
            "1 1/2 cups 1/3-inch cubes celery",
            "2 tablespoons chopped fresh rosemary plus sprigs (for garnish)",
            "1 tablespoon chopped fresh sage",
            "2 garlic cloves, peeled, crushed",
            "1 cup dry white wine",
            "5 cups (or more) low-salt chicken broth, divided",
            "Chopped fresh Italian parsley",
            "Ingredient info: You'll need to order the large veal shanks from your butcher."
        ],
        "instructions": [
            "Preheat oven to 475°F. Sprinkle veal with coarse salt and black pepper. Heat 4 tablespoons oil in heavy large ovenproof pot over medium-high heat. Add veal; cook until dark brown, turning occasionally, 25 to 30 minutes. Transfer pot to oven; roast uncovered 30 minutes (veal will be dark brown). Maintain oven temperature. Meanwhile, heat 2 tablespoons oil in heavy large skillet over medium-high heat. Add carrots, onion, and celery; sauté until softened, about 12 minutes. Add chopped rosemary, sage, and garlic; sauté 2 minutes. Transfer veal to plate; pour off oil from pot. Add wine, 2 cups broth, and vegetables to pot and bring to boil. Return veal to pot (broth will not cover veal). Roast uncovered until meat is very tender, turning every 30 minutes and adding more broth by cupfuls as needed to moisten as broth evaporates, about 1 hour 15 minutes. Transfer veal to large plate. Set strainer over medium bowl. Pour juices and vegetables from pot into strainer, pressing on solids to extract liquid. Transfer vegetables to processor; puree until almost smooth. Skim fat from juices in bowl; discard fat. Whisk 1 cup vegetable puree into juices in bowl (discard remaining puree). Season with coarse salt and black pepper. Return puree mixture and veal to same pot. Return to oven and roast 10 minutes longer, turning veal once. Cut meat off bones into 1-inch-thick pieces. Transfer to bowl. Pour sauce over. Garnish with parsley and rosemary sprigs.",
            "Preheat oven to 475°F. Sprinkle veal with coarse salt and black pepper. Heat 4 tablespoons oil in heavy large ovenproof pot over medium-high heat. Add veal; cook until dark brown, turning occasionally, 25 to 30 minutes. Transfer pot to oven; roast uncovered 30 minutes (veal will be dark brown). Maintain oven temperature.",
            "Meanwhile, heat 2 tablespoons oil in heavy large skillet over medium-high heat. Add carrots, onion, and celery; sauté until softened, about 12 minutes. Add chopped rosemary, sage, and garlic; sauté 2 minutes.",
            "Transfer veal to plate; pour off oil from pot. Add wine, 2 cups broth, and vegetables to pot and bring to boil. Return veal to pot (broth will not cover veal). Roast uncovered until meat is very tender, turning every 30 minutes and adding more broth by cupfuls as needed to moisten as broth evaporates, about 1 hour 15 minutes. Transfer veal to large plate. Set strainer over medium bowl. Pour juices and vegetables from pot into strainer, pressing on solids to extract liquid. Transfer vegetables to processor; puree until almost smooth. Skim fat from juices in bowl; discard fat. Whisk 1 cup vegetable puree into juices in bowl (discard remaining puree). Season with coarse salt and black pepper. Return puree mixture and veal to same pot. Return to oven and roast 10 minutes longer, turning veal once. Cut meat off bones into 1-inch-thick pieces. Transfer to bowl. Pour sauce over. Garnish with parsley and rosemary sprigs."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3060511c5d6af478b7ffa/6:4/w_274%2Ch_169/361292_veal-shanks_1x1.jpg"
    }
}