{
    "recipe": {
        "title": "Roasted Sweet Potatoes with Chile Yogurt and Mint ",
        "ingredients": [
            "4 pounds medium sweet potatoes",
            "2 tablespoons extra-virgin olive oil, plus more for drizzling",
            "2 1/2 cups plain whole-milk Greek yogurt",
            "1 serrano chile, finely grated",
            "2 teaspoons finely grated lemon zest",
            "2 teaspoons fresh lemon juice",
            "Kosher salt",
            "2 tablespoons toasted sesame seeds",
            "1 1/2 cups mint leaves, torn if large",
            "Flaky sea salt"
        ],
        "instructions": [
            "Preheat oven to 400°F. Toss sweet potatoes with 2 Tbsp. oil on a parchment-lined rimmed baking sheet. Roast, turning halfway through, until tender, 50–60 minutes. Remove from oven; increase oven temperature to 450°F. Let sweet potatoes cool slightly, then tear into large pieces (including skin)—irregular pieces look best. Spread out on the same baking sheet and roast until browned and crisp around the edges, 20–25 minutes.",
            "Combine yogurt, chile, lemon zest, and lemon juice in a medium bowl; season with kosher salt. Coarsely crush sesame seeds on a cutting board with a flat-bottomed mug (or leave them whole).",
            "Spread chile yogurt on a platter; top with sweet potatoes. Scatter mint, sesame seeds, and sea salt over; drizzle with oil.",
            "Do Ahead Sweet potatoes can be roasted 6 hours ahead. Let sit at room temperature. Reheat in a 400°F oven just to warm through before serving. Chile yogurt can be made 1 day ahead; cover and chill.",
            "Sweet potatoes can be roasted 6 hours ahead. Let sit at room temperature. Reheat in a 400°F oven just to warm through before serving. Chile yogurt can be made 1 day ahead; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a05db0e8d4fcf21753e3a0e/6:4/w_274%2Ch_169/roasted-sweet-potatoes-with-chile-yogurt-and-mint-recipe-BA-111017.jpg"
    }
}