{
    "recipe": {
        "title": "Roast Beef with Dijon-Caper Sauce ",
        "ingredients": [
            "1 3-pound eye of round beef roast, trimmed of excess fat and sinew",
            "1/2 teaspoon salt",
            "1 teaspoon dried thyme",
            "1 teaspoon dried basil",
            "1/2 teaspoon freshly ground pepper",
            "1 tablespoon butter",
            "1 tablespoon all purpose flour",
            "2 cups low-salt beef broth",
            "2 tablespoons Dijon mustard",
            "2 tablespoons drained capers"
        ],
        "instructions": [
            "Sprinkle beef with 1/2 teaspoon salt; let stand 1 hour.",
            "Preheat oven to 350°F. Mix thyme, basil, and 1/2 teaspoon pepper in small bowl. Heat oil in large oven-proof skillet over medium-high heat. Add beef; cook until browned on all sides, turning occasionally, about 10 minutes. Sprinkle with herb mixture. Transfer skillet to oven. Roast until instant-read thermometer inserted into center of meat registers 130°F, about 40 minutes. Transfer to cutting board; let rest.",
            "For sauce: Place skillet with juices over medium-high heat. Add butter; stir until melted. Add flour; whisk until smooth. Gradually whisk in broth; bring to boil. Boil until sauce is reduced to 1 1/4 cups, whisking often, about 6 minutes. Whisk in mustard and capers. Season sauce with pepper. Cut beef crosswise into very thin slices. Transfer beef to platter. Serve with sauce.",
            "Place skillet with juices over medium-high heat. Add butter; stir until melted. Add flour; whisk until smooth. Gradually whisk in broth; bring to boil. Boil until sauce is reduced to 1 1/4 cups, whisking often, about 6 minutes. Whisk in mustard and capers. Season sauce with pepper.",
            "Cut beef crosswise into very thin slices. Transfer beef to platter. Serve with sauce.",
            "Test-kitchen tip: Eye of round is not the most tender cut of beef. For the best flavor and texture, be sure to slice it very thinly.",
            "Eye of round is not the most tender cut of beef. For the best flavor and texture, be sure to slice it very thinly.",
            "What to drink: With the beef, pour a full-bodied Syrah blend. One to try: Château de Jau 2007 \"Le Jaja de Jau\" ($11).",
            "With the beef, pour a full-bodied Syrah blend. One to try: Château de Jau 2007 \"Le Jaja de Jau\" ($11)."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d79a2f3a00aeb2f1cb843/6:4/w_274%2Ch_169/351037_hires.jpg"
    }
}