{
    "recipe": {
        "title": "Roasted Beet Soup with Crème Fraîche ",
        "ingredients": [
            "1/2 pound red beets (about 3 medium)",
            "1 1/2 teaspoons butter",
            "1 1/2 teaspoons olive oil",
            "1 leek (white and pale green parts only), chopped",
            "1 small onion, thinly sliced",
            "1 celery stalk, chopped",
            "1/8 teaspoon ground ginger",
            "1/8 teaspoon ground allspice",
            "1/8 teaspoon ground white pepper",
            "2 cups water",
            "1 small bay leaf",
            "1 fresh thyme sprig",
            "1 fresh parsley sprig",
            "1/4 cup whipping cream",
            "2 tablespoons crème fraîche or sour cream"
        ],
        "instructions": [
            "Preheat oven to 350°F. Wrap beets in foil and roast until tender when pierced with fork, about 1 hour. Cool. Peel beets. Cut 1/4 of 1 beet into 1/4-inch cubes; reserve for garnish. Cut remaining beets into 1/2-inch pieces.",
            "Melt butter with oil in heavy medium saucepan over medium-high heat. Add leek, onion, and celery and cook until beginning to brown, stirring frequently, about 13 minutes. Stir in ginger, allspice, white pepper, and 1/2-inch beet pieces. Cook until vegetables begin to stick to bottom of pot, stirring frequently, about 7 minutes. Add 2 cups water, bay leaf, thyme sprig, and parsley sprig. Bring to boil. Reduce heat to low, cover, and simmer until vegetables are very tender, about 25 minutes. Remove bay leaf, thyme sprig, and parsley sprig. Cool soup slightly. Working in batches, puree soup in blender with cream. Season to taste with salt and pepper. (Can be made 1 day ahead. Cool slightly, cover, and refrigerate.)",
            "Gently rewarm soup (do not boil). Divide between 2 bowls. Garnish each with 1 tablespoon crème fraîche. Sprinkle with reserved beet cubes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de5287b55306961bfd6b0/6:4/w_274%2Ch_169/231581.jpg",
        "color": 2591499
    }
}