{
    "recipe": {
        "title": "Roasted Loin of Veal with Foie Gras and Cherry-Red Grape Sauce ",
        "ingredients": [
            "2 cups low-salt chicken broth",
            "1 cup beef broth",
            "2 cups dry red wine",
            "1 1/2 cups small seedless red grapes",
            "1/4 cup (packed) golden brown sugar",
            "1 teaspoon Worcestershire sauce",
            "1/2 cup drained wild cherries in syrup (such as amarena)*",
            "1 3 1/2-pound trimmed boneless veal strip loin",
            "2 tablespoons olive oil plus more for brushing",
            "1 tablespoon chopped fresh rosemary plus whole sprigs for garnish",
            "1 tablespoon chopped fresh thyme plus whole sprigs for garnish",
            "1 6- to 8-ounce block cooked duck foie gras, cut lengthwise into 1/4-inch-thick slices (optional)",
            "*Available at specialty foods stores and online from buonitalia.com."
        ],
        "instructions": [
            "Boil both broths until reduced to scant 1 cup. Set aside.",
            "Bring wine and next 3 ingredients to boil in another saucepan, stirring until sugar dissolves. Reduce heat to medium-low and simmer until reduced to 11/2 cups, about 30 minutes. Using slotted spoon, transfer grapes to small bowl; add cherries to grapes. Add reduced broth to grape syrup. Boil until reduced to 3/4 cup, about 10 minutes. Do ahead Can be made 2 days ahead. Cover fruits and sauce base separately and refrigerate.",
            "For veal: Brush veal with olive oil. Sprinkle chopped herbs all over. Wrap veal in plastic; chill overnight. Position rack just below center of oven; preheat to 425°F. Sprinkle veal with salt and pepper; let stand at room temperature 30 minutes. Heat 2 tablespoons oil in 14-inch ovenproof skillet over medium-high heat. Add veal, fat side down. Sear until brown, about 4 minutes. Turn over; sear until brown, about 4 minutes. Place skillet in oven. Roast veal until thermometer inserted into center registers 135°F to 140°F, about 25 minutes. Transfer to platter. Tent with foil; let stand 10 minutes. Reserve skillet. Meanwhile, separate foie gras slices on plate to bring to room temperature. Tilt reserved skillet; spoon off fat from juices. Add juices to sauce base. Simmer until thick enough to coat spoon, about 3 minutes. Add grapes and cherries; heat 1 minute. Cut veal into 1-inch-thick slices; arrange on plates. Top with foie gras, if using, and sauce. Garnish plates with rosemary and thyme sprigs. Serve, passing remaining sauce separately.",
            "Brush veal with olive oil. Sprinkle chopped herbs all over. Wrap veal in plastic; chill overnight.",
            "Position rack just below center of oven; preheat to 425°F. Sprinkle veal with salt and pepper; let stand at room temperature 30 minutes. Heat 2 tablespoons oil in 14-inch ovenproof skillet over medium-high heat. Add veal, fat side down. Sear until brown, about 4 minutes. Turn over; sear until brown, about 4 minutes. Place skillet in oven. Roast veal until thermometer inserted into center registers 135°F to 140°F, about 25 minutes. Transfer to platter. Tent with foil; let stand 10 minutes. Reserve skillet.",
            "Meanwhile, separate foie gras slices on plate to bring to room temperature.",
            "Tilt reserved skillet; spoon off fat from juices. Add juices to sauce base. Simmer until thick enough to coat spoon, about 3 minutes. Add grapes and cherries; heat 1 minute.",
            "Cut veal into 1-inch-thick slices; arrange on plates. Top with foie gras, if using, and sauce. Garnish plates with rosemary and thyme sprigs. Serve, passing remaining sauce separately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd801f9a84192308a4f4b/6:4/w_274%2Ch_169/236788.jpg"
    }
}