{
    "recipe": {
        "title": "Roast Duck Breasts with Pomegranate-Chile Sauce ",
        "ingredients": [
            "1/3 cup sugar",
            "1/2 cup water",
            "2 cups refrigerated pomegranate juice (such as Pom)",
            "2 cups low-salt chicken broth",
            "4 large dried California chiles,* stemmed, seeded, torn into 1-inch pieces",
            "1 1/2 teaspoons adobo sauce from canned chipotle chiles in adobo**",
            "1 1/2 teaspoons balsamic vinegar",
            "1/8 teaspoon ground cumin (not toasted)",
            "Coarse kosher salt",
            "8 5-to 6-ounce boneless duck breast halves, skin and fat trimmed to size of breast",
            "Coarse kosher salt",
            "Ground coriander",
            "Fresh pomegranate seeds"
        ],
        "instructions": [
            "Stir sugar and 1/2 cup water in heavy large saucepan over medium heat until sugar dissolves. Increase heat; boil until syrup is deep amber color, swirling pan occasionally, about 8 minutes. Add juice, broth, and California chiles. Boil until sauce is reduced to 1 1/2 cups, about 25 minutes. Remove from heat; cool. Puree in tightly covered blender until smooth, about 2 minutes. Transfer to bowl. Whisk in adobo sauce, vinegar, and cumin. Season to taste with generous amount of coarse salt and pepper. DO AHEAD: Can be made 1 week ahead. Cover and chill. Rewarm over low heat before using.",
            "For duck: Preheat oven to 400°F. Score skin of duck (don't cut into flesh) with 5 cuts in 1 direction; repeat in opposite direction, making diamond pattern. Sprinkle duck all over with coarse salt, pepper, and ground coriander. Place 2 large ovenproof skillets over medium-high heat. Add duck, skin side down, to skillets, dividing equally. Cook duck until skin is crisp and deep brown, about 7 minutes. Turn duck over; cook 1 minute. Pour off fat. Transfer skillets to oven. Roast duck until cooked to mediumrare, about 5 minutes. Transfer duck to cutting board. Let rest 5 minutes. Thinly slice each breast crosswise on slight diagonal. Arrange slices on plates. Spoon sauce over. Sprinkle with pomegranate seeds.",
            "Preheat oven to 400°F. Score skin of duck (don't cut into flesh) with 5 cuts in 1 direction; repeat in opposite direction, making diamond pattern. Sprinkle duck all over with coarse salt, pepper, and ground coriander. Place 2 large ovenproof skillets over medium-high heat. Add duck, skin side down, to skillets, dividing equally. Cook duck until skin is crisp and deep brown, about 7 minutes. Turn duck over; cook 1 minute. Pour off fat. Transfer skillets to oven. Roast duck until cooked to mediumrare, about 5 minutes.",
            "Transfer duck to cutting board. Let rest 5 minutes. Thinly slice each breast crosswise on slight diagonal. Arrange slices on plates. Spoon sauce over. Sprinkle with pomegranate seeds.",
            "Available at some supermarkets and at specialty foods stores and Latin markets. ** Dried, smoked jalapeños in a spicy tomato sauce called adobo; available at some supermarkets and at specialty foods stores and Latin markets.",
            "Available at some supermarkets and at specialty foods stores and Latin markets.",
            "Available at some supermarkets and at specialty foods stores and Latin markets.",
            "** Dried, smoked jalapeños in a spicy tomato sauce called adobo; available at some supermarkets and at specialty foods stores and Latin markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a799e0acd286555dbaea/6:4/w_274%2Ch_169/356341_hires.jpg"
    }
}