{
    "recipe": {
        "title": "Roasted Onions with Gruyère Croutons ",
        "ingredients": [
            "12 white pearl onions, peeled",
            "12 red pearl onions, peeled",
            "8 large shallots, peeled, halved through root end",
            "6 large green onions, dark green tops trimmed",
            "2 medium sweet onions (such as Vidalia), peeled, cut into 3/4-to 1-inch wedges through root end",
            "1 large red onion, peeled, cut into 3/4-to 1-inch wedges through root end",
            "1 brown-skinned onion, peeled, cut into 3/4-to 1-inch wedges through root end",
            "3 tablespoons extra-virgin olive oil",
            "1 tablespoon fresh thyme leaves",
            "1 teaspoon coarse kosher salt",
            "1/2 teaspoon freshly ground black pepper",
            "3 cups coarsely torn 1/2-inch pieces rustic bread with crust",
            "1 cup low-salt chicken broth",
            "6 ounces Gruyère cheese, coarsely grated (about 1 1/2 cups packed)",
            "Sea salt flakes or crystals"
        ],
        "instructions": [
            "Preheat oven to 450°F. Combine all onions and shallots in large bowl. Drizzle evenly with olive oil, then sprinkle with thyme, coarse salt, and pepper; toss gently to coat. Spread out in single layer on large rimmed baking sheet.",
            "Roast onions until tender and beginning to brown in spots, 25 to 30 minutes. Scatter bread pieces on another rimmed baking sheet. Bake bread until golden brown, 7 to 8 minutes. Cool bread on baking sheet. Arrange onions in single layer in large casserole dish. DO AHEAD: Onions and croutons can be made up to 1 day ahead. Cover onions and refrigerate.",
            "Store croutons in airtight container at room temperature. Bring onions to room temperature before continuing.",
            "Preheat oven to 400°F. Spoon broth over onions to moisten. Scatter croutons over; sprinkle with cheese. Bake until heated through and cheese is melted, about 20 minutes. Sprinkle with sea salt flakes and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a79662fa7a9917c25b30/6:4/w_274%2Ch_169/356334_hires.jpg",
        "color": 10262702
    }
}