{
    "recipe": {
        "title": "Roast Salmon and Broccoli with Chile-Caper Vinaigrette ",
        "ingredients": [
            "1 bunch broccoli (about 1 1/2 pounds), cut into florets",
            "4 tablespoons olive oil, divided",
            "Kosher salt, freshly ground pepper",
            "4 6-ounce skinless salmon fillets",
            "1 jalapeño, thinly sliced into rings, seeds removed if desired",
            "2 tablespoons unseasoned rice vinegar",
            "2 tablespoons drained capers"
        ],
        "instructions": [
            "Preheat oven to 400°F. Toss broccoli and 2 tablespoons oil on a large rimmed baking sheet; season with salt and pepper. Roast broccoli, tossing occasionally, until crisp-tender, 12–15 minutes. Rub salmon with 1 tablespoon oil; season with salt and pepper. Push broccoli to edges of baking sheet and place salmon in the center. Roast until salmon is opaque throughout and broccoli is tender, 10–15 minutes. Meanwhile, combine jalapeño, vinegar, and a pinch of salt in small bowl and let sit until jalapeño is slightly softened, about 10 minutes. Mix in capers and remaining 1 tablespoon oil; season with salt and pepper. Serve salmon and broccoli drizzled with chile-caper vinaigrette.",
            "Preheat oven to 400°F. Toss broccoli and 2 tablespoons oil on a large rimmed baking sheet; season with salt and pepper. Roast broccoli, tossing occasionally, until crisp-tender, 12–15 minutes.",
            "Rub salmon with 1 tablespoon oil; season with salt and pepper. Push broccoli to edges of baking sheet and place salmon in the center. Roast until salmon is opaque throughout and broccoli is tender, 10–15 minutes.",
            "Meanwhile, combine jalapeño, vinegar, and a pinch of salt in small bowl and let sit until jalapeño is slightly softened, about 10 minutes. Mix in capers and remaining 1 tablespoon oil; season with salt and pepper.",
            "Serve salmon and broccoli drizzled with chile-caper vinaigrette."
        ],
        "picture_link": "https://assets.epicurious.com/photos/570eb702d6921a4f6384cffb/6:4/w_274%2Ch_169/1415-FS-MAIN15.jpg"
    }
}