{
    "recipe": {
        "title": "Roasted Pears with Ricotta and Honey ",
        "ingredients": [
            "1 cup fresh ricotta cheese",
            "5 tablespoons sugar, divided",
            "1/4 teaspoon vanilla extract",
            "1/2 teaspoon finely grated lemon peel",
            "4 tablespoons unsalted butter, softened, divided",
            "1/2 cup whole almonds",
            "1/4 cup Grade B maple syrup",
            "1/2 teaspoon fennel seeds",
            "3 Bartlett pears",
            "2 tablespoons honey"
        ],
        "instructions": [
            "Place ricotta in cheesecloth-lined strainer set over medium bowl. Fold cheesecloth over; drain overnight in refrigerator.",
            "Puree drained ricotta, 1 tablespoon sugar, vanilla, and lemon peel in processor until smooth. Transfer ricotta mixture to small bowl. Cover and chill. DO AHEAD: Can be made 1 day ahead. Keep chilled.",
            "Line rimmed baking sheet with foil. Melt 1 tablespoon butter in small skillet. Add almonds; toss until golden, about 3 minutes. Add maple syrup and sprinkle with salt. Stir until coated and slightly darker brown, about 1 minute. Spoon mixture onto prepared baking sheet. Separate nuts. DO AHEAD: Can be made 4 hours ahead. Let stand at room temperature.",
            "Preheat oven to 400°F. Line another rimmed baking sheet with foil. Grind fennel seeds in mortar or spice grinder. Transfer to small bowl. Stir in remaining 4 tablespoons sugar. Cut pears in half; using melon baller, scoop out core. Transfer pears, cut side up, to prepared baking sheet. Press remaining 3 tablespoons butter onto cut side of pears. Mound fennel sugar over, dividing equally.",
            "Roast pears until tender and juices on baking sheet begin to caramelize, spooning juices over pears every 10 minutes, about 30 minutes total.",
            "Place 1 pear half on each plate and top with scoop of ricotta mixture. Drizzle with honey and sprinkle with caramelized almonds. Serve warm."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d79aaf3a00aeb2f1cb85f/6:4/w_274%2Ch_169/351053_hires.jpg",
        "color": 1805404
    }
}