{
    "recipe": {
        "title": "Roasted Short Ribs With Cauliflower And Celery ",
        "ingredients": [
            "4 cloves garlic",
            "Kosher salt",
            "1 tablespoon chopped rosemary",
            "1 tablespoon olive oil",
            "2 teaspoons soy sauce",
            "1 teaspoon crushed red pepper flakes",
            "4 (4-inch) English-style bone-in beef short ribs (about 3 pounds)",
            "Freshly ground black pepper",
            "1/2 head cauliflower (about 1 pound)",
            "1 tablespoon olive oil",
            "Kosher salt, freshly ground pepper",
            "1/3 cup heavy cream",
            "1/2 cup blanched or skin-on hazelnuts",
            "2 stalks celery, halved lengthwise, thinly sliced on a diagonal; plus 1/4 cup celery leaves",
            "1/4 cup chopped parsley",
            "1 tablespoon hazelnut oil or olive oil",
            "1 tablespoon Sherry vinegar or red wine vinegar",
            "Flaky sea salt, freshly ground pepper"
        ],
        "instructions": [
            "For the short ribs: Place racks in upper and lower thirds of oven and preheat to 275°F. Slice garlic, sprinkle with salt, and mash to a paste on a cutting board using the side of a chef’s knife; place in a small bowl. Mix in rosemary, oil, soy sauce, and red pepper flakes. Season ribs generously with salt and pepper and place in a medium cast-iron skillet. Coat all over with garlic paste and cover skillet tightly with foil. Cook on upper rack in oven, checking for doneness after 1 1/2 hours, until meat is fork-tender and falling off the bone, 2 1/2–3 hours. Remove from oven.",
            "Place racks in upper and lower thirds of oven and preheat to 275°F. Slice garlic, sprinkle with salt, and mash to a paste on a cutting board using the side of a chef’s knife; place in a small bowl. Mix in rosemary, oil, soy sauce, and red pepper flakes.",
            "Season ribs generously with salt and pepper and place in a medium cast-iron skillet. Coat all over with garlic paste and cover skillet tightly with foil. Cook on upper rack in oven, checking for doneness after 1 1/2 hours, until meat is fork-tender and falling off the bone, 2 1/2–3 hours. Remove from oven.",
            "For the cauliflower purée: Meanwhile, place cauliflower in a small baking dish. Rub all over with oil; season with salt and pepper. Cover with foil and place in oven next to ribs. Bake until cauliflower is very easily pierced with a paring knife, 1 1/2–2 1/2 hours. Transfer hot cauliflower to a blender and add cream. Blend until very smooth; season with salt and pepper. Place in a medium saucepan and keep warm over low heat.",
            "Meanwhile, place cauliflower in a small baking dish. Rub all over with oil; season with salt and pepper. Cover with foil and place in oven next to ribs. Bake until cauliflower is very easily pierced with a paring knife, 1 1/2–2 1/2 hours.",
            "Transfer hot cauliflower to a blender and add cream. Blend until very smooth; season with salt and pepper. Place in a medium saucepan and keep warm over low heat.",
            "For the salad and assembly: While the ribs and cauliflower are cooking, scatter hazelnuts on a rimmed baking sheet and toast on bottom rack, tossing once, until golden brown, 30–35 minutes. Let cool, then rub together in a kitchen towel to remove skins, if using skin-on nuts. Coarsely chop and set aside. Increase oven temperature to 450°F. Uncover ribs and return to oven, placing on top rack. Roast, basting with fat from skillet every couple of minutes, until a deep brown crust develops, 12–15 minutes. Toss celery, celery leaves, parsley, and reserved hazelnuts in a medium bowl to combine. Drizzle with oil and vinegar and toss to coat; season celery salad with salt and pepper. Serve short ribs over cauliflower purée with celery salad on top.",
            "While the ribs and cauliflower are cooking, scatter hazelnuts on a rimmed baking sheet and toast on bottom rack, tossing once, until golden brown, 30–35 minutes. Let cool, then rub together in a kitchen towel to remove skins, if using skin-on nuts. Coarsely chop and set aside.",
            "Increase oven temperature to 450°F. Uncover ribs and return to oven, placing on top rack. Roast, basting with fat from skillet every couple of minutes, until a deep brown crust develops, 12–15 minutes.",
            "Toss celery, celery leaves, parsley, and reserved hazelnuts in a medium bowl to combine. Drizzle with oil and vinegar and toss to coat; season celery salad with salt and pepper.",
            "Serve short ribs over cauliflower purée with celery salad on top."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56c798b529e2fc4a359094af/6:4/w_274%2Ch_169/0216-BA-WSUP-04.jpg"
    }
}