{
    "recipe": {
        "title": "Roasted Sweet Potato and Ginger Soup ",
        "ingredients": [
            "2 medium sweet potatoes",
            "2 tablespoons extra-virgin olive oil",
            "1 medium yellow onion, cut into small dice",
            "2 tablespoons minced fresh ginger",
            "1 jalapeño pepper, seeded and minced",
            "2 teaspoons ground coriander",
            "1/2 teaspoon ground nutmeg",
            "4 cups low-sodium chicken stock or water",
            "Salt",
            "2 green onions, root ends removed, finely chopped"
        ],
        "instructions": [
            "Preheat the oven to 450°F. Poke the sweet potatoes with a fork, wrap in aluminum foil, and bake in the oven for 1 hour. Remove from the oven and let cool to room temperature. Cut the sweet potatoes in half and scrape out the flesh. Heat the oil over medium heat in a large Dutch oven or heavy soup pot. Add the onions and ginger, and cook over medium heat, stirring occasionally, for 5 minutes or until the onions are translucent. Add the jalapeño, coriander, and nutmeg and cook for 3 minutes or until fragrant. Add the roasted sweet potato flesh and stock to the pot. Simmer for 10 minutes. Remove from the heat and purée with a handheld immersion blender or food processor until smooth. Season with salt. Divide the soup among 6 serving bowls and sprinkle with the green onions.",
            "Preheat the oven to 450°F. Poke the sweet potatoes with a fork, wrap in aluminum foil, and bake in the oven for 1 hour. Remove from the oven and let cool to room temperature.",
            "Cut the sweet potatoes in half and scrape out the flesh. Heat the oil over medium heat in a large Dutch oven or heavy soup pot.",
            "Add the onions and ginger, and cook over medium heat, stirring occasionally, for 5 minutes or until the onions are translucent.",
            "Add the jalapeño, coriander, and nutmeg and cook for 3 minutes or until fragrant.",
            "Add the roasted sweet potato flesh and stock to the pot. Simmer for 10 minutes. Remove from the heat and purée with a handheld immersion blender or food processor until smooth. Season with salt.",
            "Divide the soup among 6 serving bowls and sprinkle with the green onions."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59fa3d48837b1201f3d09d84/6:4/w_274%2Ch_169/roasted-sweet-potato-ginger-soup-recipe-HC-103017.jpg"
    }
}