{
    "recipe": {
        "title": "Roast Chicken Thighs with Veggies ",
        "ingredients": [
            "3 pounds bone-in, skin-on chicken thighs, patted dry",
            "1 pound Brussels sprouts, trimmed and halved",
            "1 pound carrots, assorted colors, cut into 1/2- to 1-inch pieces",
            "1 pound sweet potatoes, peeled and cut into 1/2- inch cubes",
            "3 shallots, peeled, root end trimmed off, and quartered",
            "3 cloves garlic, minced",
            "2 tablespoons olive oil",
            "1 tablespoon minced fresh rosemary (or 1 teaspoon dried)",
            "2 teaspoons salt"
        ],
        "instructions": [
            "Preheat the oven to 475°F.",
            "Place the chicken thighs on a rimmed baking sheet skin side up. Scatter the vegetables, shallots, and garlic around the chicken.",
            "Drizzle the olive oil over everything, making sure the vegetables are well coated. Sprinkle the rosemary, thyme, and salt over the chicken and vegetables.",
            "Place the pan in the oven and bake for 30 to 40 minutes, stirring the vegetables about halfway through cooking. Chicken should be cooked through (internal temperature of 165°F). If you like your chicken skin extra crispy, put the pan under the broiler set to high for about 5 minutes.",
            "Variations Any heartier vegetables (butternut squash, parsnips, etc.) would work well with this dish, though we happen to love the ones here. You could use faster- cooking ones like broccoli or cauliflower or even summer squash— but wait to add them until the chicken is about halfway cooked. We like our veggies crispy and browned, so keep that in mind. Pork chops would also work fine here— the cooking time may increase somewhat depending on thickness, and unless you choose particularly fatty chops, you won’t have as much drippings to bathe your vegetables in.",
            "Any heartier vegetables (butternut squash, parsnips, etc.) would work well with this dish, though we happen to love the ones here. You could use faster- cooking ones like broccoli or cauliflower or even summer squash— but wait to add them until the chicken is about halfway cooked. We like our veggies crispy and browned, so keep that in mind. Pork chops would also work fine here— the cooking time may increase somewhat depending on thickness, and unless you choose particularly fatty chops, you won’t have as much drippings to bathe your vegetables in."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59a4a163c4cba96206fde797/6:4/w_274%2Ch_169/weeknight-paleo-roast-chicken-thighs-with-veggies-recipe-HC-082817.jpg",
        "color": 13880719
    }
}