{
    "recipe": {
        "title": "Roasted Cauliflower with Parmesan-Panko Crumble ",
        "ingredients": [
            "1 cup panko (Japanese breadcrumbs)",
            "3 1/2 oz. finely grated Parmesan (about 1 cup)",
            "2 1/2 oz. coarsely grated sharp cheddar cheese (about 1 cup)",
            "2 Tbsp. plus 1 cup (2 sticks) unsalted butter, melted",
            "4 large heads of cauliflower, cored, outer leaves removed",
            "4 garlic cloves, finely grated",
            "3 Tbsp. thyme leaves (from about 1 bunch)",
            "20 large shallots, peeled, halved, quartered if very large, divided",
            "8 tsp. kosher salt, divided",
            "2 tsp. freshly ground pepper, divided",
            "1/2 cup chopped parsley",
            "Lemon wedges (for serving)"
        ],
        "instructions": [
            "Arrange racks in upper and lower thirds of oven; preheat to 450°F. Toss panko, Parmesan, cheddar, and 2 Tbsp. butter in a medium bowl until combined. Sprinkle evenly onto a parchment-lined rimmed baking sheet. Bake on lower rack until cheese is melted and bubbling and panko is deep golden brown, 6–8 minutes. Let cool. Crumble into small pieces; set aside until ready to use. Meanwhile, cut cauliflower into 1/2\"-thick steaks (it’s okay if the outside ends break apart). Whisk garlic, thyme, and remaining 1 cup butter in a medium measuring cup. Toss half of cauliflower, half of shallots, 1/2 cup butter mixture, 4 tsp. salt, and 1 tsp. pepper on a rimmed baking sheet until coated. Repeat with remaining cauliflower, shallots, 1/2 cup butter mixture, 4 tsp. salt, and 1 tsp. pepper on another rimmed baking sheet. Roast, tossing veggies and rotating sheets from top to bottom halfway through, until tender and browned, 45–55 minutes. Let cool slightly. Transfer to a platter. Top with reserved crumble and parsley. Serve with lemon wedges for squeezing over. Do Ahead: Uncrumbled panko mixture can be baked 1 day ahead. Wrap baking sheet with plastic and store at room temperature.",
            "Arrange racks in upper and lower thirds of oven; preheat to 450°F. Toss panko, Parmesan, cheddar, and 2 Tbsp. butter in a medium bowl until combined. Sprinkle evenly onto a parchment-lined rimmed baking sheet. Bake on lower rack until cheese is melted and bubbling and panko is deep golden brown, 6–8 minutes. Let cool. Crumble into small pieces; set aside until ready to use.",
            "Meanwhile, cut cauliflower into 1/2\"-thick steaks (it’s okay if the outside ends break apart).",
            "Whisk garlic, thyme, and remaining 1 cup butter in a medium measuring cup.",
            "Toss half of cauliflower, half of shallots, 1/2 cup butter mixture, 4 tsp. salt, and 1 tsp. pepper on a rimmed baking sheet until coated. Repeat with remaining cauliflower, shallots, 1/2 cup butter mixture, 4 tsp. salt, and 1 tsp. pepper on another rimmed baking sheet. Roast, tossing veggies and rotating sheets from top to bottom halfway through, until tender and browned, 45–55 minutes.",
            "Let cool slightly. Transfer to a platter. Top with reserved crumble and parsley. Serve with lemon wedges for squeezing over.",
            "Do Ahead: Uncrumbled panko mixture can be baked 1 day ahead. Wrap baking sheet with plastic and store at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5bd360e588e7b22d548bc8a5/6:4/w_274%2Ch_169/Large-Format-roasted-caluliflower-with-thyme-pank-and-parmesan-11102018.jpg"
    }
}