{
    "recipe": {
        "title": "Roasted Butternut Squash with Spicy Onions ",
        "ingredients": [
            "2 tablespoons olive oil",
            "1 medium red onion, sliced",
            "1 teaspoon crushed red pepper flakes",
            "1 teaspoon finely grated lime zest",
            "1/4 cup fresh lime juice",
            "2 teaspoons honey",
            "1 cup blanched hazelnuts",
            "2 large butternut squash (about 4 pounds), peeled, seeded, sliced 1/4\" thick",
            "1/4 cup plus 2 tablespoons olive oil",
            "Kosher salt, freshly ground pepper",
            "1/2 cup chopped fresh flat-leaf parsley",
            "1/2 cup chopped fresh mint",
            "2 tablespoons chopped fresh marjoram",
            "4 ounces fresh goat cheese, crumbled"
        ],
        "instructions": [
            "For spicy onions: Heat oil in a large skillet over medium-high heat. Cook onion, stirring often, until lightly charred and softened but not falling apart, 5–7 minutes. Add red pepper flakes and toss to combine. Remove pan from heat and mix in lime juice and honey. Let cool, then mix in lime zest. DO AHEAD: Spicy onions can be made 3 days ahead. Cover and chill.",
            "Heat oil in a large skillet over medium-high heat. Cook onion, stirring often, until lightly charred and softened but not falling apart, 5–7 minutes. Add red pepper flakes and toss to combine. Remove pan from heat and mix in lime juice and honey. Let cool, then mix in lime zest.",
            "DO AHEAD: Spicy onions can be made 3 days ahead. Cover and chill.",
            "For assembly: Preheat oven to 350°F. Toast hazelnuts on a small rimmed baking sheet, stirring occasionally, until golden brown, 6–8 minutes. Let cool; coarsely chop. Increase oven temperature to 400°F. Toss squash and 1/4 cup oil in a medium bowl; season with salt and pepper. Divide between 2 rimmed baking sheets; reserve bowl. Roast, undisturbed, until tender, 15–20 minutes. Return squash to bowl; add hazelnuts, parsley, mint, marjoram, and spicy onions, and toss to combine. Transfer squash mixture to a large serving platter, crumble goat cheese over, and drizzle with remaining 2 tablespoons oil.",
            "Preheat oven to 350°F. Toast hazelnuts on a small rimmed baking sheet, stirring occasionally, until golden brown, 6–8 minutes. Let cool; coarsely chop.",
            "Increase oven temperature to 400°F. Toss squash and 1/4 cup oil in a medium bowl; season with salt and pepper. Divide between 2 rimmed baking sheets; reserve bowl. Roast, undisturbed, until tender, 15–20 minutes.",
            "Return squash to bowl; add hazelnuts, parsley, mint, marjoram, and spicy onions, and toss to combine.",
            "Transfer squash mixture to a large serving platter, crumble goat cheese over, and drizzle with remaining 2 tablespoons oil."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3f06121388ef838b0fa83/6:4/w_274%2Ch_169/51215020_roasted-butternut-squash_1x1.jpg"
    }
}