{
    "recipe": {
        "title": "Roasted Cauliflower Larb ",
        "ingredients": [
            "1 large head of cauliflower, cut into large florets with some stalk attached",
            "3 tablespoons olive oil",
            "3 green Thai chiles, finely chopped",
            "1 (3-inch) piece lemongrass, tough outer layers removed, finely chopped",
            "4 kaffir lime leaves, finely chopped",
            "1/4 cup fish sauce",
            "1/4 cup fresh lime juice",
            "1/4 cup glutinous (sticky) rice",
            "5 scallions, thinly sliced",
            "2 cups chopped pea shoots (tendrils)",
            "1 cup chopped cilantro",
            "1 cup chopped mint",
            "Kosher salt",
            "Sliced Persian cucumber and Bibb lettuce leaves (for serving)",
            "A spice mill"
        ],
        "instructions": [
            "Preheat oven to 450°F. Toss cauliflower with oil on a rimmed baking sheet. Roast, tossing occasionally, until tender and well browned, 35–45 minutes. Let cool slightly; chop into pea-size pieces. Transfer to a large bowl. Add chiles, lemongrass, lime leaves, fish sauce, and lime juice; toss well. Meanwhile, place rice in a medium skillet and set over medium heat. Toast, shaking pan constantly to keep rice moving, until evenly browned, 10–15 minutes. Transfer to a plate; let cool. Grind in spice mill to a semifine powder. Toss scallions, pea shoots, cilantro, mint, and 2 tsp. toasted rice powder into cauliflower mixture; season with salt. Serve with cucumber, lettuce, and remaining rice powder to make lettuce cups.",
            "Preheat oven to 450°F. Toss cauliflower with oil on a rimmed baking sheet. Roast, tossing occasionally, until tender and well browned, 35–45 minutes. Let cool slightly; chop into pea-size pieces. Transfer to a large bowl. Add chiles, lemongrass, lime leaves, fish sauce, and lime juice; toss well.",
            "Meanwhile, place rice in a medium skillet and set over medium heat. Toast, shaking pan constantly to keep rice moving, until evenly browned, 10–15 minutes. Transfer to a plate; let cool. Grind in spice mill to a semifine powder.",
            "Toss scallions, pea shoots, cilantro, mint, and 2 tsp. toasted rice powder into cauliflower mixture; season with salt. Serve with cucumber, lettuce, and remaining rice powder to make lettuce cups."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58c6be2b7c80d64acc70ad25/6:4/w_274%2Ch_169/roasted-cauliflower-larb-BA-031317.jpg"
    }
}