{
    "recipe": {
        "title": "Roasted Radicchio with Anchovy Vinaigrette, Preserved Lemon, and Breadcrumbs ",
        "ingredients": [
            "1 lemon, thinly sliced",
            "1/2 cup fresh lemon juice",
            "4 teaspoons coarse sea salt",
            "3 tablespoons finely grated Grana Padano or Parmesan cheese",
            "2 tablespoons fresh lemon juice",
            "1 garlic clove, pressed",
            "1/2 2-ounce tin anchovies, drained, minced, 1 1/2 teaspoons oil from tin reserved",
            "Pinch of sugar",
            "5 tablespoons olive oil",
            "4 tablespoons olive oil, divided",
            "1 garlic clove, pressed",
            "2 cups 1/2-inch cubes crustless country white bread",
            "1/4 teaspoon dried oregano",
            "1/8 teaspoon dried crushed red pepper",
            "2 heads of radicchio (about 1 pound total), each cut into 6 wedges with some core attached to each wedge",
            "Shavings of Grana Padano or Parmesan cheese (for garnish)"
        ],
        "instructions": [
            "For preserved lemon: Mix lemon slices, lemon juice, and coarse sea salt in small skillet. Bring to boil; reduce heat to medium-low, cover, and simmer until almost tender, about 10 minutes. Uncover and cool. Drain lemon slices. Using sharp knife, cut slices in half, then cut pulp away from peel; discard pulp. DO AHEAD: Can be made 1 week ahead. Cover and chill.",
            "Mix lemon slices, lemon juice, and coarse sea salt in small skillet. Bring to boil; reduce heat to medium-low, cover, and simmer until almost tender, about 10 minutes. Uncover and cool. Drain lemon slices. Using sharp knife, cut slices in half, then cut pulp away from peel; discard pulp. DO AHEAD: Can be made 1 week ahead. Cover and chill.",
            "For vinaigrette: Mix cheese, lemon juice, garlic, minced anchovies, and pinch of sugar in medium bowl. Whisk in olive oil and 1 1/2 teaspoons oil from anchovy tin. Season vinaigrette to taste with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover and chill. Bring to room temperature and rewhisk before using.",
            "Mix cheese, lemon juice, garlic, minced anchovies, and pinch of sugar in medium bowl. Whisk in olive oil and 1 1/2 teaspoons oil from anchovy tin. Season vinaigrette to taste with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover and chill. Bring to room temperature and rewhisk before using.",
            "For breadcrumbs and radicchio: Preheat oven to 350°F. Line rimmed baking sheet with foil. Mix 1 tablespoon olive oil and garlic in medium bowl. Add bread cubes, oregano, and crushed red pepper; sprinkle with salt and pepper. Transfer bread cubes to prepared baking sheet. Bake bread cubes until golden brown, tossing occasionally, about 20 minutes. Cool. Transfer to work surface. Cover with paper towels. Using mallet or rolling pin, crush bread cubes into breadcrumbs. Preheat broiler. Line same baking sheet with fresh sheet of foil. Place radicchio wedges in large bowl. Drizzle remaining 3 tablespoons oil over; sprinkle with salt and pepper and toss to coat. Arrange wedges on prepared sheet. Broil until beginning to brown, about 3 minutes. Using tongs, turn radicchio over, fanning leaves out slightly. Broil until radicchio is soft and beginning to brown with some edges beginning to char, watching carefully to prevent burning, about 2 minutes longer. Return radicchio to same large bowl. Drizzle enough dressing over to coat; toss. Arrange wedges on plates. Sprinkle breadcrumbs over. Top with cheese shavings, arrange a few preserved lemon peel strips over, and serve.",
            "Preheat oven to 350°F. Line rimmed baking sheet with foil. Mix 1 tablespoon olive oil and garlic in medium bowl. Add bread cubes, oregano, and crushed red pepper; sprinkle with salt and pepper. Transfer bread cubes to prepared baking sheet.",
            "Bake bread cubes until golden brown, tossing occasionally, about 20 minutes. Cool. Transfer to work surface. Cover with paper towels. Using mallet or rolling pin, crush bread cubes into breadcrumbs.",
            "Preheat broiler. Line same baking sheet with fresh sheet of foil. Place radicchio wedges in large bowl. Drizzle remaining 3 tablespoons oil over; sprinkle with salt and pepper and toss to coat. Arrange wedges on prepared sheet. Broil until beginning to brown, about 3 minutes. Using tongs, turn radicchio over, fanning leaves out slightly. Broil until radicchio is soft and beginning to brown with some edges beginning to char, watching carefully to prevent burning, about 2 minutes longer.",
            "Return radicchio to same large bowl. Drizzle enough dressing over to coat; toss. Arrange wedges on plates. Sprinkle breadcrumbs over. Top with cheese shavings, arrange a few preserved lemon peel strips over, and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3253d460b4423363ee59b/6:4/w_274%2Ch_169/360650_roasted-radicchio-anchovy_1x1.jpg"
    }
}