{
    "recipe": {
        "title": "Roasted Brussels Sprouts ",
        "ingredients": [
            "2 pounds Brussels sprouts, trimmed and halved lengthwise",
            "3 tablespoons canola oil",
            "2 tablespoons unsalted butter",
            "1/4 cup Asian fish sauce (preferably Tiparos brand)",
            "1/4 cup water",
            "1/4 cup sugar",
            "3 tablespoons finely chopped mint",
            "2 tablespoons finely chopped cilantro stems",
            "1 garlic clove, minced",
            "1 (1 1/2-inch) fresh red Thai chile, thinly sliced crosswise, including seeds",
            "1/2 cup crisp rice cereal such as Rice Krispies",
            "1/4 teaspoon canola oil",
            "1/4 teaspoon shichimi togarashi (Japanese seven-spice blend)",
            "Garnish: cilantro sprigs; torn mint leaves; chopped scallions"
        ],
        "instructions": [
            "Roast brussels sprouts: Preheat oven to 450°F with rack in upper third. Toss Brussels sprouts with oil, then arrange, cut sides down, in a 17- by 12-inch shallow baking pan. Roast, without turning, until outer leaves are tender and very dark brown, 40 to 45 minutes. Add butter and toss to coat.",
            "Preheat oven to 450°F with rack in upper third.",
            "Toss Brussels sprouts with oil, then arrange, cut sides down, in a 17- by 12-inch shallow baking pan. Roast, without turning, until outer leaves are tender and very dark brown, 40 to 45 minutes. Add butter and toss to coat.",
            "Make dressing: Stir together all dressing ingredients until sugar has dissolved.",
            "Stir together all dressing ingredients until sugar has dissolved.",
            "Make puffed rice while sprouts roast: Cook cereal, oil, and shichimi togarashi in a small skillet over medium heat, shaking skillet and stirring, until rice is coated and begins to turn golden, about 3 minutes. Transfer to a bowl and cool, stirring occasionally.",
            "Cook cereal, oil, and shichimi togarashi in a small skillet over medium heat, shaking skillet and stirring, until rice is coated and begins to turn golden, about 3 minutes. Transfer to a bowl and cool, stirring occasionally.",
            "Finish dish: Put Brussels sprouts in a serving bowl, then toss with just enough dressing to coat. Sprinkle with puffed rice and serve remaining dressing on the side.",
            "Put Brussels sprouts in a serving bowl, then toss with just enough dressing to coat. Sprinkle with puffed rice and serve remaining dressing on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a427b55306961bf7865/6:4/w_274%2Ch_169/240260_hires.jpg"
    }
}