{
    "recipe": {
        "title": "Roasted Beets with Sesame and Marjoram ",
        "ingredients": [
            "4 bunches of beets with tops or 2 pounds medium beets",
            "1/2 bunch Swiss chard, ribs and stems removed, leaves torn into large pieces",
            "5 tablespoons olive oil, divided",
            "Kosher salt, freshly ground pepper",
            "1/2 bunch marjoram or oregano, plus 2 tablespoons leaves",
            "1/2 cup crème fraîche",
            "1/2 cup plain whole-milk Greek yogurt",
            "1 teaspoon plus 1 tablespoon Sherry vinegar or red wine vinegar",
            "2 tablespoons toasted sesame seeds"
        ],
        "instructions": [
            "Preheat oven to 400°. Trim tops from beets; set aside half of tops (reserve remainder for another use). Scrub beets, pat dry, and slice 1/4\" thick. Toss in a large bowl with 4 tablespoons oil; season with salt and pepper. Scatter marjoram sprigs across a rimmed baking sheet and arrange beets on top in as even a layer as possible (some overlap is okay). Roast, tossing occasionally, until beets are tender, 15–20 minutes. Remove from oven and toss in reserved beet greens; roast just until slightly wilted, about 2 minutes. Let cool.",
            "Scatter marjoram sprigs across a rimmed baking sheet and arrange beets on top in as even a layer as possible (some overlap is okay). Roast, tossing occasionally, until beets are tender, 15–20 minutes. Remove from oven and toss in reserved beet greens; roast just until slightly wilted, about 2 minutes. Let cool.",
            "Meanwhile, whisk crème fraîche, yogurt, and 1 teaspoon vinegar in a small bowl; season with salt; set aside.",
            "Smash sesame seeds, 2 tablespoons marjoram leaves, and a generous pinch of salt in a mortar and pestle to combine. (Alternatively, chop with a knife.) Transfer to a small bowl and mix in remaining 1 tablespoon oil; set sesame salt aside.",
            "Drizzle roasted beets and greens with remaining 1 tablespoon vinegar; season with salt and pepper. Spoon reserved crème fraîche mixture between 2 platters and arrange beets and greens on top; sprinkle with sesame salt.",
            "Do ahead: Beets (without greens) can be roasted 1 day ahead. Let cool; cover and chill. Bring to room temperature before using; sauté greens separately. Sesame salt can be made 2 days ahead; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54aaeecb19925f464b39f98c/6:4/w_274%2Ch_169/51255560_roasted-beets_1x1.jpg"
    }
}