{
    "recipe": {
        "title": "Roasted Turkey with Black-Truffle Butter and Cognac Gravy ",
        "ingredients": [
            "6 ounces black truffle butter, at room temperature",
            "1 large shallot, minced (about 1/2 cup)",
            "4 teaspoons kosher salt",
            "1 1/2 teaspoons freshly ground pepper",
            "1 12- to 14-pound fresh turkey, brought to room temperature (this will take 2 to 2 1/2 hours)",
            "1 garlic head, sliced in half crosswise",
            "2 celery stalks, cut into large pieces",
            "2 onions, unpeeled and cut in wedges",
            "1 1/2 cups low-sodium chicken or turkey broth plus more if needed",
            "1 tablespoon vegetable oil",
            "1 turkey neck plus gizzard and heart, if available",
            "1 celery stalk, roughly chopped",
            "2 carrots, roughly chopped",
            "1 onion, unpeeled, quartered",
            "1/2 teaspoon black peppercorns",
            "1 bay leaf",
            "1/4 cup parsley stems",
            "2 thyme sprigs",
            "1/2 cup cognac",
            "2 tablespoons butter, softened",
            "2 tablespoons all-purpose flour",
            "Kosher salt and freshly ground black pepper"
        ],
        "instructions": [
            "Preheat oven to 400°F. In a medium bowl, combine the truffle butter, shallots, salt, and pepper, mixing with a wooden spoon until smooth. Separate the turkey skin from breast by sliding your hand beneath the skin. Do your best to separate some of the skin around the thigh as well. Smear most of the truffle butter mixture under the skin, onto the meat. Smear remaining butter mixture onto the outside of the bird. Use your hands to massage the bird to even out the butter mixture under the skin.",
            "Place garlic in the cavity and tie the legs together using kitchen twine. In a large roasting pan, scatter the celery and onions. Place a roasting rack on top of the vegetables, and set the turkey on the rack. Pour 1 1/2 cups broth into the pan. Place in the center of the oven and roast until starting to brown, about 30 minutes. Reduce oven temperature to 325°F and continue to roast, basting hourly, until an instant-read thermometer inserted into the thickest part of the thigh reaches 165°F, about 2 1/2 to 3 hours. Add 1/4 cup of broth if the pan looks too dry. You don't want the drippings to burn, but you do want them to brown, so add broth accordingly. Tent with foil if turkey is browning too quickly.",
            "While the turkey is roasting, start the gravy. Heat a large pot over medium-high heat and add 1 tablespoon vegetable oil. Add the turkey neck, giblets, and heart (if using) and cook, turning occasionally, until browned, 5 to 7 minutes. Add celery, carrots, and onion and cook, stirring, until lightly browned, 5 to 7 minutes. Add peppercorns, bay leaf, parsley stems, thyme, and 6 cups water and bring to a simmer. Cook 2 hours. Strain stock into a smaller saucepan and set aside. You should have about 1 3/4 cups. Shred some of the neck meat and set aside.",
            "When turkey is done, carefully remove it from the roasting pan, still on the rack, to a sheet pan. Cover loosely with foil and let rest in a warm place. Pour off or blot the excess fat and discard. Set the roasting pan over 2 burners on the stove. Pour in the cognac (from a cup, not the bottle) into the roasting pan, and turn the burners on to medium heat. Carefully ignite the cognac using a long lighter or match. When the flames die down, use a wooden spoon to scrape all the brown bits from the bottom of the pan. Cook until slightly thickened, 3 to 4 minutes. Strain the contents of the roasting pan into the saucepan with the turkey stock. Simmer to reduce slightly. Add the turkey neck meat.",
            "Knead the butter and flour together using a spoon or your fingers. Bring the stock mixture to a boil, then add the butter mixture by tablespoonfuls to the stock until the desired thickness is reached. Allow the gravy to simmer for a minute before adding additional butter mixture and continue to simmer until reduced to desired consistency. Season to taste and serve in a warm gravy boat alongside the turkey."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b9ca3de231becc7f3d089d/6:4/w_274%2Ch_169/51252870_roasted-turkey_1x1.jpg",
        "color": 4979177
    }
}