{
    "recipe": {
        "title": "Roast Turkey with Pomegranate Gravy ",
        "ingredients": [
            "1 (14- to 16-lb) turkey, any feathers and quills removed with tweezers or needlenose pliers, and neck and giblets (excluding liver) reserved for making stock",
            "1 1/4 sticks unsalted butter, 5 tablespoons softened and 5 tablespoons melted",
            "1 tablespoon salt",
            "1 1/2 teaspoons black pepper",
            "1 onion, quartered",
            "4 large fresh thyme sprigs",
            "1/2 cup sugar",
            "1/2 cup plus 1 tablespoon fresh pomegranate juice (see cooks' note, below)",
            "Pan juices (and roasting pan) from turkey",
            "About 3 cups hot turkey giblet stock",
            "1 cup water",
            "6 1/2 tablespoons all-purpose flour",
            "Garnish: quartered pomegranates",
            "a small metal skewer; kitchen string; a flat rack or V-rack; an instant-read thermometer"
        ],
        "instructions": [
            "Roast turkey: Put oven rack in lower third of oven and preheat oven to 350°F. Rinse turkey inside and out and pat dry. Working from neck (small) cavity, run your fingers between skin and meat to loosen skin from breast, legs, and thighs, being careful not to tear skin. Rub softened butter between skin and flesh, then sprinkle turkey cavities and skin with salt and pepper. Fold neck skin under body and secure with metal skewer and fold wing tips under breast. Stuff large cavity with onion and thyme sprigs and tie drumsticks together with kitchen string. Brush skin all over with some melted butter. Put turkey on rack in a large flameproof roasting pan and roast, basting with some melted butter and/or pan juices every 20 minutes (if turkey is browning too fast, cover loosely with foil), until thermometer inserted into fleshy part of a thigh (do not touch bone) registers 170°F, 2 1/2 to 3 1/2 hours. Carefully tilt turkey so any juices from inside large cavity run into roasting pan, then transfer turkey to a platter (do not clean roasting pan) and let stand, loosely covered, 30 minutes (temperature of thigh meat will rise to 180°F).",
            "Put oven rack in lower third of oven and preheat oven to 350°F.",
            "Rinse turkey inside and out and pat dry. Working from neck (small) cavity, run your fingers between skin and meat to loosen skin from breast, legs, and thighs, being careful not to tear skin. Rub softened butter between skin and flesh, then sprinkle turkey cavities and skin with salt and pepper. Fold neck skin under body and secure with metal skewer and fold wing tips under breast. Stuff large cavity with onion and thyme sprigs and tie drumsticks together with kitchen string. Brush skin all over with some melted butter.",
            "Put turkey on rack in a large flameproof roasting pan and roast, basting with some melted butter and/or pan juices every 20 minutes (if turkey is browning too fast, cover loosely with foil), until thermometer inserted into fleshy part of a thigh (do not touch bone) registers 170°F, 2 1/2 to 3 1/2 hours.",
            "Carefully tilt turkey so any juices from inside large cavity run into roasting pan, then transfer turkey to a platter (do not clean roasting pan) and let stand, loosely covered, 30 minutes (temperature of thigh meat will rise to 180°F).",
            "Make gravy while turkey stands: Cook sugar in a dry 1-quart heavy saucepan over moderate heat, undisturbed, until it begins to melt. Continue to cook, stirring occasionally with a fork, until sugar is melted into a deep golden caramel. Add 1/2 cup pomegranate juice (use caution; mixture will bubble and steam vigorously) and simmer over low heat, stirring occasionally, until caramel is dissolved. Remove syrup from heat. Pour pan juices through a fine-mesh sieve into a 1-quart glass measure or bowl, then skim off fat and reserve 1/4 cup of it. Add enough turkey stock to pan juices to total 3 1/2 cups liquid. Straddle roasting pan across 2 burners, then add water and deglaze pan by boiling over high heat, stirring and scraping up brown bits, 1 minute. Pour through fine-mesh sieve into glass measure with stock. Whisk together reserved fat and flour in a 3-quart heavy saucepan and cook roux over moderately low heat, whisking, until pale golden, 7 to 10 minutes. Add hot stock mixture in a stream, whisking constantly to prevent lumps. Bring to a boil, whisking, and add pomegranate syrup, then reduce heat and simmer, whisking occasionally, until thickened, about 5 minutes. Stir in any turkey juices accumulated on platter and simmer gravy 1 minute. Season with salt and pepper and stir in remaining tablespoon pomegranate juice. Remove string and skewer from turkey and discard onion and thyme from cavity. Serve turkey with gravy on the side.",
            "Cook sugar in a dry 1-quart heavy saucepan over moderate heat, undisturbed, until it begins to melt. Continue to cook, stirring occasionally with a fork, until sugar is melted into a deep golden caramel. Add 1/2 cup pomegranate juice (use caution; mixture will bubble and steam vigorously) and simmer over low heat, stirring occasionally, until caramel is dissolved. Remove syrup from heat.",
            "Pour pan juices through a fine-mesh sieve into a 1-quart glass measure or bowl, then skim off fat and reserve 1/4 cup of it. Add enough turkey stock to pan juices to total 3 1/2 cups liquid. Straddle roasting pan across 2 burners, then add water and deglaze pan by boiling over high heat, stirring and scraping up brown bits, 1 minute. Pour through fine-mesh sieve into glass measure with stock.",
            "Whisk together reserved fat and flour in a 3-quart heavy saucepan and cook roux over moderately low heat, whisking, until pale golden, 7 to 10 minutes. Add hot stock mixture in a stream, whisking constantly to prevent lumps. Bring to a boil, whisking, and add pomegranate syrup, then reduce heat and simmer, whisking occasionally, until thickened, about 5 minutes. Stir in any turkey juices accumulated on platter and simmer gravy 1 minute. Season with salt and pepper and stir in remaining tablespoon pomegranate juice.",
            "Remove string and skewer from turkey and discard onion and thyme from cavity. Serve turkey with gravy on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df2b5f9a84192308a868e/6:4/w_274%2Ch_169/230980.jpg"
    }
}