{
    "recipe": {
        "title": "Roasted Cauliflower with Indian Barbecue Sauce ",
        "ingredients": [
            "1 tablespoon ground cumin",
            "1 2-pound head of cauliflower, cored, cut into 1-inch florets (about 8 cups) 4 tablespoons vegetable oil, divided",
            "1 teaspoon minced peeled fresh ginger",
            "1 garlic clove, pressed",
            "1 1/4 cups ketchup",
            "1/4 cup soy sauce",
            "2 tablespoons sugar"
        ],
        "instructions": [
            "Preheat oven to 400°F. Toast cumin in small skillet over medium heat until darker in color and beginning to smoke, about 11/2 minutes. Set aside. Toss cauliflower and 2 tablespoons oil in large bowl. Transfer to medium rimmed baking sheet. Roast until very tender, stirring occasionally, about 45 minutes. Meanwhile, heat remaining 2 tablespoons oil in small saucepan over medium-low heat. Add ginger and garlic; sauté until very fragrant, about 3 minutes. Add ketchup, soy sauce, sugar, and toasted cumin. Bring to boil, whisking to blend. Reduce heat to very low; simmer barbecue sauce 1 minute to blend flavors, whisking constantly. Remove cauliflower from oven; transfer to large bowl. Toss with enough barbecue sauce to coat; season to taste with salt and pepper.",
            "Preheat oven to 400°F. Toast cumin in small skillet over medium heat until darker in color and beginning to smoke, about 11/2 minutes. Set aside.",
            "Toss cauliflower and 2 tablespoons oil in large bowl. Transfer to medium rimmed baking sheet. Roast until very tender, stirring occasionally, about 45 minutes.",
            "Meanwhile, heat remaining 2 tablespoons oil in small saucepan over medium-low heat. Add ginger and garlic; sauté until very fragrant, about 3 minutes. Add ketchup, soy sauce, sugar, and toasted cumin. Bring to boil, whisking to blend. Reduce heat to very low; simmer barbecue sauce 1 minute to blend flavors, whisking constantly.",
            "Remove cauliflower from oven; transfer to large bowl. Toss with enough barbecue sauce to coat; season to taste with salt and pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a10f3a00aeb2f1cf736/6:4/w_274%2Ch_169/239826.jpg"
    }
}