{
    "recipe": {
        "title": "Roasted Potatoes and Haddock Puttanesca ",
        "ingredients": [
            "3 1/2 tablespoons olive oil, divided",
            "4 garlic cloves, sliced",
            "4 anchovy fillets packed in oil, drained",
            "1/4 teaspoon crushed red pepper flakes",
            "1 28-ounce can whole peeled tomatoes and their juices, coarsely puréed",
            "1/4 cup halved, pitted oil-cured black olives",
            "1/2 teaspoon kosher salt plus more",
            "1/4 teaspoon freshly ground black pepper plus more",
            "1 pound fingerling potatoes, halved",
            "2 large shallots, peeled, leaving root end intact, quartered",
            "8 ounces haddock or halibut fillets, cut into 1 1/2\" cubes",
            "1/4 cup halved caper berries or 1 tablespoon drained capers, rinsed",
            "1 tablespoon chopped flat-leaf parsley"
        ],
        "instructions": [
            "Heat 2 tablespoons oil in a medium pot over low heat. Add garlic and anchovies; cook, stirring frequently to break up anchovies, until garlic is soft but not browned, 3-4 minutes. Add red pepper flakes; cook until fragrant, about 20 seconds. Add tomato purée, increase heat to medium, and cook, stirring occasionally, until sauce thickens, 15-20 minutes. Stir in olives; simmer for 5 minutes. Season with salt and pepper.",
            "Arrange racks in upper and lower thirds of oven; preheat to 425°F. Place a wire rack in a rimmed baking sheet. Toss 1 tablespoon oil, potatoes, shallots, 1/2 teaspoon salt, and 1/4 teaspoon pepper in a large bowl to coat. Spread in a single layer on prepared rack. Roast on top oven rack for 18 minutes. Keep in oven.",
            "Place fish in an 8x8x2\" glass baking dish. Drizzle with remaining 1/2 tablespoon oil and season with salt and pepper. Place on bottom oven rack and roast with potatoes until fish is just opaque in center, potatoes are golden brown and tender, and shallots are crispy, about 7 minutes longer.",
            "Place potatoes, shallots, and fish on a platter in an even layer. Spoon 1 1/2 cups puttanesca over (reserve remaining sauce for another use); garnish with caper berries and parsley."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b40ea42413537c0d459ca7/6:4/w_274%2Ch_169/388715_haddock-and-roasted-potatoes_1x1.jpg"
    }
}