{
    "recipe": {
        "title": "Roasted Vegetables with Garlic-Tarragon Butter ",
        "ingredients": [
            "2 medium-size red onions, cut into 1/2-inch-thick rounds",
            "2 red bell peppers, quartered lengthwise, seeded",
            "4 zucchini or yellow crookneck squash, cut on diagonal into 1/2-inch-thick slices",
            "2 large portobello mushrooms, dark gills scraped away, quartered",
            "1 head radicchio, cut into 6 wedges",
            "6 tablespoons (3/4 stick) butter",
            "6 small garlic cloves, minced",
            "2 teaspoons dried tarragon",
            "3 tablespoons dry white wine",
            "1 tablespoon olive oil",
            "Lemon wedges"
        ],
        "instructions": [
            "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 500°F. Arrange vegetables in single layer on 2 large baking sheets. Stir butter, garlic and tarragon in heavy small saucepan over low heat until butter melts. Whisk in wine and oil. Brush vegetables with all of butter mixture; sprinkle generously with salt and pepper. Roast vegetables 10 minutes. Turn vegetables over, reverse position of baking sheets and roast until vegetables are tender and browned in spots, about 10 minutes longer. Transfer vegetables to large platter. Serve with lemon wedges.",
            "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 500°F. Arrange vegetables in single layer on 2 large baking sheets. Stir butter, garlic and tarragon in heavy small saucepan over low heat until butter melts. Whisk in wine and oil. Brush vegetables with all of butter mixture; sprinkle generously with salt and pepper.",
            "Roast vegetables 10 minutes. Turn vegetables over, reverse position of baking sheets and roast until vegetables are tender and browned in spots, about 10 minutes longer. Transfer vegetables to large platter. Serve with lemon wedges."
        ],
        "picture_link": null
    }
}