{
    "recipe": {
        "title": "Roasted Winter Vegetable Baklava ",
        "ingredients": [
            "1/2 cup walnuts (2 ounces), toasted",
            "1/4 cup fine dry plain bread crumbs",
            "1 pound Yukon Gold potatoes",
            "2 medium fennel bulbs, trimmed, reserving fronds, bulbs halved and sliced lengthwise 1/4 inch thick",
            "3/4 pound parsnips (3 medium), sliced diagonally 1/3 inch thick",
            "1/2 pound carrots (3 medium), sliced diagonally 1/3 inch thick",
            "1 large onion, halved and sliced",
            "3/4 cup olive oil, divided",
            "2/3 cup water",
            "1/3 cup chopped dill",
            "8 (17-by 12-inch) phyllo sheets, thawed if frozen",
            "Equipment: a shallow 3-quart oval or rectangular baking dish"
        ],
        "instructions": [
            "Preheat oven to 425°F with racks in upper and lower thirds.",
            "Pulse walnuts with bread crumbs in a food processor until nuts are finely chopped (not ground).",
            "Peel potatoes and slice 1/4 inch thick. Divide all vegetables between 2 large 4-sided sheet pans and toss each pan of vegetables with 3 tablespoons oil, 1/2 teaspoon salt, and 1/2 teaspoon pepper.",
            "Roast vegetables, stirring and switching position of pans halfway through, until softened and golden brown in spots, 35 to 40 minutes. Leave oven on with 1 rack in middle.",
            "Add 1/3 cup water to each pan of vegetables and stir and scrape up brown bits from bottom. Chop 1/4 cup fennel fronds. Combine all vegetables in 1 pan and toss with fennel fronds and dill.",
            "Brush baking dish with some of remaining olive oil. Cover stack of phyllo sheets with plastic wrap and a damp kitchen towel. Keeping remaining phyllo covered and working quickly, place 1 sheet on a work surface, then gently brush with some oil and sprinkle with 2 rounded tablespoon walnut mixture. Place another phyllo sheet on top and repeat brushing and sprinkling. Top with a third sheet and brush with oil.",
            "Drape phyllo stack into one half of baking dish, gently pressing it into bottom and up side and leaving an overhang. Make another stack with 3 more phyllo sheets, more oil, and remaining walnut mixture. Drape into other half of dish (phyllo will overlap in center of dish).",
            "Spoon vegetables into phyllo shell. Fold overhang toward center over filling (it will not cover vegetables) and brush edge with oil. Brush remaining 2 sheets of phyllo with remaining oil, tear in half, crumple, and arrange on top of filling.",
            "Bake in middle of oven until phyllo is deep golden brown, 20 to 25 minutes. Cool 5 minutes before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a74b5ba9545f62e8822366b/6:4/w_274%2Ch_169/roasted-winter-vegetable-phyllo-pie-recipe-020218.jpg"
    }
}