{
    "recipe": {
        "title": "Roasted Salmon with Salsa Verde ",
        "ingredients": [
            "1 9 1/2-pound whole salmon without head, cleaned, scaled",
            "Nonstick vegetable oil spray",
            "1 lemon, cut into 1/4-inch-thick slices",
            "12 sprigs mixed fresh herbs (such as parsley, thyme and oregano)",
            "3 tablespoons extra-virgin olive oil",
            "Salsa Verde",
            "Dill sprigs",
            "Lemon slices"
        ],
        "instructions": [
            "For salmon: Preheat oven to 350°F. Pat salmon dry inside and out with paper towels. Sprinkle inside and out with salt and pepper. Center 36x18-inch heavy-duty foil sheet over heavy large baking sheet. Spray foil with oil spray. Place salmon diagonally on foil. Stuff with lemon and herb sprigs. Close salmon opening. Drizzle oil over salmon. Spray another sheet of foil with oil spray. Place foil sprayed side down over salmon. Crimp foil sheet edges together to seal salmon completely. Bake salmon until meat thermometer inserted into thickest part of salmon registers 150°F, about 1 1/2 hours. Remove top sheet of foil. Spoon all juices from salmon into small saucepan. Peel off skin from top of salmon. Scrape off any dark salmon meat. Let salmon cool 1 hour at room temperature. Boil reserved salmon juice until reduced to 1/2 cup, about 4 minutes. Cool. Cover salmon and reduced salmon juice separately and refrigerate overnight. Place platter atop salmon. Invert salmon onto platter. Remove foil. Peel off skin. Scrape off any dark meat. Garnish with dill and lemon. Serve with salsa verde.",
            "For salmon: Preheat oven to 350°F. Pat salmon dry inside and out with paper towels. Sprinkle inside and out with salt and pepper. Center 36x18-inch heavy-duty foil sheet over heavy large baking sheet. Spray foil with oil spray. Place salmon diagonally on foil. Stuff with lemon and herb sprigs. Close salmon opening. Drizzle oil over salmon. Spray another sheet of foil with oil spray. Place foil sprayed side down over salmon. Crimp foil sheet edges together to seal salmon completely.",
            "Bake salmon until meat thermometer inserted into thickest part of salmon registers 150°F, about 1 1/2 hours. Remove top sheet of foil. Spoon all juices from salmon into small saucepan. Peel off skin from top of salmon. Scrape off any dark salmon meat. Let salmon cool 1 hour at room temperature. Boil reserved salmon juice until reduced to 1/2 cup, about 4 minutes. Cool. Cover salmon and reduced salmon juice separately and refrigerate overnight.",
            "Place platter atop salmon. Invert salmon onto platter. Remove foil. Peel off skin. Scrape off any dark meat. Garnish with dill and lemon. Serve with salsa verde."
        ],
        "picture_link": null
    }
}