{
    "recipe": {
        "title": "Rocco's How Low Can You Go Low-Fat Marinara Sauce ",
        "ingredients": [
            "1/2 tablespoon extra-virgin olive oil",
            "6 garlic cloves, minced",
            "1 large yellow onion, cut into small dice",
            "Salt",
            "Crushed red pepper",
            "Two 28-ounce cans tomato puree",
            "1/2 cup water",
            "1 small piece of Parmigiano- Reggiano cheese rind",
            "1 large sprig fresh basil"
        ],
        "instructions": [
            "Heat a Dutch oven over medium heat. When the pot is hot, add the olive oil. Add the garlic and onion, and season them with salt and crushed red pepper to taste. Cook, stirring occasionally, until the onion and garlic are translucent, about 4 minutes. Add the tomato puree, water, and Parmigiano-Reggiano rind to the pot. Bring to a simmer. Then cover, reduce the heat to low, and simmer for about 25 minutes. With the back of a knife, bruise the basil and stir the sprig into the sauce. Simmer the sauce, uncovered, for 5 minutes. Season with salt and crushed red pepper to taste, if desired. Serve, or store in a covered container in the refrigerator for up to 5 days.",
            "Heat a Dutch oven over medium heat. When the pot is hot, add the olive oil. Add the garlic and onion, and season them with salt and crushed red pepper to taste. Cook, stirring occasionally, until the onion and garlic are translucent, about 4 minutes.",
            "Add the tomato puree, water, and Parmigiano-Reggiano rind to the pot. Bring to a simmer. Then cover, reduce the heat to low, and simmer for about 25 minutes.",
            "With the back of a knife, bruise the basil and stir the sprig into the sauce. Simmer the sauce, uncovered, for 5 minutes. Season with salt and crushed red pepper to taste, if desired. Serve, or store in a covered container in the refrigerator for up to 5 days."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56098f426a59cdb91b5f793e/6:4/w_274%2Ch_169/363439.jpg"
    }
}