{
    "recipe": {
        "title": "Rocky Road Sundae Pie ",
        "ingredients": [
            "1 9-ounce package chocolate wafer cookies, broken into pieces",
            "6 tablespoons (3/4 stick) unsalted butter, melted",
            "2/3 cup whipping cream",
            "8 ounces imported milk chocolate (such as Lindt), chopped",
            "1/2 teaspoon vanilla extract",
            "4 cups miniature marshmallows (about 7 1/2 ounces)",
            "1/3 cup whipping cream",
            "1 teaspoon vanilla extract",
            "2 quarts chocolate ice cream, slightly softened",
            "1 cup walnuts, toasted, coarsely chopped (about 3 3/4 ounces)"
        ],
        "instructions": [
            "Make crust: Preheat oven to 325°F. Butter 9-inch-diameter springform pan with 2 3/4-inch-high sides. Finely grind chocolate wafer cookies in processor. Add melted butter and process until crumbs are evenly moistened. Press crumb mixture firmly onto bottom and 1 inch up sides of prepared pan. Bake crust until set, about 10 minutes. Cool completely.",
            "Preheat oven to 325°F. Butter 9-inch-diameter springform pan with 2 3/4-inch-high sides. Finely grind chocolate wafer cookies in processor. Add melted butter and process until crumbs are evenly moistened. Press crumb mixture firmly onto bottom and 1 inch up sides of prepared pan. Bake crust until set, about 10 minutes. Cool completely.",
            "Make milk chocolate fudge sauce: Bring cream just to simmer in medium saucepan over medium heat. Remove from heat. Add milk chocolate; let stand 1 minute. Whisk until chocolate is melted and smooth. Whisk in vanilla. Let stand at room temperature until sauce cools and thickens slightly, about 20 minutes.",
            "Bring cream just to simmer in medium saucepan over medium heat. Remove from heat. Add milk chocolate; let stand 1 minute. Whisk until chocolate is melted and smooth. Whisk in vanilla. Let stand at room temperature until sauce cools and thickens slightly, about 20 minutes.",
            "Make marshmallow sauce: Combine marshmallows and cream in large metal bowl. Set bowl over saucepan of barely simmering water (do not allow bottom of bowl to touch water). Stir until marshmallows melt and mixture is smooth, about 3 minutes. Remove bowl from over water; stir in vanilla. Let stand until slightly cooled but still pourable, about 10 minutes.",
            "Combine marshmallows and cream in large metal bowl. Set bowl over saucepan of barely simmering water (do not allow bottom of bowl to touch water). Stir until marshmallows melt and mixture is smooth, about 3 minutes. Remove bowl from over water; stir in vanilla. Let stand until slightly cooled but still pourable, about 10 minutes.",
            "Spread 1 quart ice cream evenly in cooled crust. Drop half of milk chocolate sauce by tablespoonfuls over ice cream, spacing apart. Sprinkle half of walnuts over sauce. Drizzle half of marshmallow sauce over walnuts. Freeze until sauces are set, about 10 minutes. Spread 1 quart ice cream evenly in crust. Drop remaining milk chocolate sauce by tablespoonfuls over ice cream. Drizzle remaining marshmallow sauce over, allowing some chocolate sauce to show through. Sprinkle with remaining walnuts. Freeze until pie is firm, about 4 hours. (Can be made 5 days ahead. Cover tightly with foil. Keep frozen.) Cut around pan sides to loosen. Let pie soften slightly at room temperature, about 10 minutes. Remove pan sides.",
            "Spread 1 quart ice cream evenly in cooled crust. Drop half of milk chocolate sauce by tablespoonfuls over ice cream, spacing apart. Sprinkle half of walnuts over sauce. Drizzle half of marshmallow sauce over walnuts. Freeze until sauces are set, about 10 minutes.",
            "Spread 1 quart ice cream evenly in crust. Drop remaining milk chocolate sauce by tablespoonfuls over ice cream. Drizzle remaining marshmallow sauce over, allowing some chocolate sauce to show through. Sprinkle with remaining walnuts. Freeze until pie is firm, about 4 hours. (Can be made 5 days ahead. Cover tightly with foil. Keep frozen.)",
            "Cut around pan sides to loosen. Let pie soften slightly at room temperature, about 10 minutes. Remove pan sides."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea8547b55306961bff744/6:4/w_274%2Ch_169/105390.jpg"
    }
}