{
    "recipe": {
        "title": "Romaine Salad with Rye Crisps and Lemon-Pecorino Vinaigrette ",
        "ingredients": [
            "4 or 5 slices day-old rye bread, cut into 1/4-inch (6-mm) cubes",
            "1/4 cup (60 ml) extra-virgin olive oil",
            "2 cloves garlic, minced",
            "A few sprigs fresh thyme or rosemary",
            "Pinch kosher salt",
            "2/3 cup (65 g) grated Pecorino-Romano cheese, plus more for serving",
            "1/3 cup (75 ml) Champagne vinegar",
            "1/3 cup (75 ml) fresh lemon juice",
            "1 1/2 tablespoons Dijon mustard",
            "1 clove garlic",
            "2 teaspoons kosher salt",
            "Freshly cracked pepper, plus more for serving",
            "1 1/2 cups (360 ml) extra-virgin olive oil",
            "3 romaine hearts, ends trimmed, leaves separated, washed, and dried",
            "1 large handful fresh mint leaves, roughly torn, some reserved for serving"
        ],
        "instructions": [
            "Preheat the oven to 350°F (175°C).",
            "In a food processor, pulse the bread until coarse crumbs form. Spread the crumbs on a baking sheet and toss them with the oil, garlic, herbs, and a pinch of salt until evenly coated. Roast the crumbs, tossing occasionally, until they’re golden brown, 15 to 20 minutes. Once cooled, the rye crisps can be stored in an airtight container at room temperature for up to 2 weeks.",
            "Make the vinaigrette: In a mini food processor, pulse all of the ingredients together until they’re well combined and the dressing has emulsified. (You can also whisk the dressing by hand.)",
            "In a mini food processor, pulse all of the ingredients together until they’re well combined and the dressing has emulsified. (You can also whisk the dressing by hand.)",
            "Make the salad: Place the lettuce leaves in a large bowl and scatter them with the torn mint. Pour about 3/4 cup (180 ml) of the vinaigrette over the leaves, gently tossing until well coated, adding more dressing if needed. Transfer the salad to a platter and, using a fine grater, grate on additional cheese. Scatter with the rye crisps and remaining mint, and finish with freshly cracked pepper.",
            "Place the lettuce leaves in a large bowl and scatter them with the torn mint. Pour about 3/4 cup (180 ml) of the vinaigrette over the leaves, gently tossing until well coated, adding more dressing if needed. Transfer the salad to a platter and, using a fine grater, grate on additional cheese. Scatter with the rye crisps and remaining mint, and finish with freshly cracked pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a3066ef27dfe52f3100bd1e/6:4/w_274%2Ch_169/romaine-salad-with-rye-crisps-lemon-vinaigrette-recipe-120617.jpg",
        "color": 10632613
    }
}