{
    "recipe": {
        "title": "Rosemary Beef Fillet ",
        "ingredients": [
            "1 (3 1/2-lb) trimmed and tied center-cut beef tenderloin roast at room temperature",
            "4 teaspoons kosher salt",
            "1 teaspoon black pepper",
            "2 garlic cloves, finely chopped",
            "6 (3- to 4-inch) fresh rosemary sprigs",
            "3 tablespoons extra-virgin olive oil",
            "Accompaniment: coarse-grain or Dijon mustard"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 350°F. Pat tenderloin dry, then coat all sides with salt, pepper, and garlic. Tuck rosemary sprigs under strings on all sides of roast, leaving a few inches between each. Heat oil in a flameproof heavy roasting pan over high heat until hot but not smoking, then brown tenderloin on all sides (but not ends), about 10 minutes total. Transfer pan to oven and roast until thermometer inserted diagonally 2 inches into center of meat registers 120°F, 25 to 30 minutes. Transfer beef to a cutting board and let stand 15 minutes. (Temperature of meat will rise to about 130°F.) Discard string and rosemary sprigs before slicing.",
            "Put oven rack in middle position and preheat oven to 350°F.",
            "Pat tenderloin dry, then coat all sides with salt, pepper, and garlic. Tuck rosemary sprigs under strings on all sides of roast, leaving a few inches between each.",
            "Heat oil in a flameproof heavy roasting pan over high heat until hot but not smoking, then brown tenderloin on all sides (but not ends), about 10 minutes total.",
            "Transfer pan to oven and roast until thermometer inserted diagonally 2 inches into center of meat registers 120°F, 25 to 30 minutes. Transfer beef to a cutting board and let stand 15 minutes. (Temperature of meat will rise to about 130°F.) Discard string and rosemary sprigs before slicing."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd6dcf3a00aeb2f1d2626/6:4/w_274%2Ch_169/233246.jpg"
    }
}