{
    "recipe": {
        "title": "Rosemary Martinis ",
        "ingredients": [
            "16 pimento-stuffed olives, in brine",
            "1 tablespoon chopped fresh rosemary",
            "1 (6-inch) sprig fresh rosemary",
            "1 bottle (750 ml) gin",
            "1/4 cup dry vermouth"
        ],
        "instructions": [
            "At least 1 day before serving, combine the olives and chopped rosemary in a small dish and pour over some of the brine from the olive jar to cover. Cover and refrigerate. About 1 hour before serving, rub the sprig of rosemary between the palms of your hands for 10 to 15 seconds and put it in a cocktail pitcher. Pour the gin and vermouth over, stir to mix, and refrigerate. Just before serving, add a generous handful of ice cubes to the pitcher and stir gently for a minute to give it an extra dose of chill. Pour the martini into stemless martini glasses, leaving the ice behind in the pitcher. Very briefly rinse the olives to remove any clinging rosemary and spear 2 each onto cocktail picks or small rosemary sprigs (with lower leaves removed), adding a pick to each glass.",
            "At least 1 day before serving, combine the olives and chopped rosemary in a small dish and pour over some of the brine from the olive jar to cover. Cover and refrigerate.",
            "About 1 hour before serving, rub the sprig of rosemary between the palms of your hands for 10 to 15 seconds and put it in a cocktail pitcher. Pour the gin and vermouth over, stir to mix, and refrigerate.",
            "Just before serving, add a generous handful of ice cubes to the pitcher and stir gently for a minute to give it an extra dose of chill. Pour the martini into stemless martini glasses, leaving the ice behind in the pitcher. Very briefly rinse the olives to remove any clinging rosemary and spear 2 each onto cocktail picks or small rosemary sprigs (with lower leaves removed), adding a pick to each glass."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56098f006a59cdb91b5f7886/6:4/w_274%2Ch_169/360289_hires.jpg"
    }
}