{
    "recipe": {
        "title": "Rose's Downy Yellow Butter Cake ",
        "ingredients": [
            "5 large egg yolks (3.25 oz / 95 g), at room temperature",
            "3/4 cup (6.4 oz / 180 g) whole milk, at room temperature",
            "1 3/4 teaspoons vanilla extract",
            "2 cups (9.3 oz / 260 g) cake flour",
            "1 1/4 cups (8.8 oz / 250 g) sugar",
            "1 tablespoon baking powder",
            "1/2 teaspoon kosher salt",
            "10 tablespoons (5 oz / 140 g) unsalted butter, cut into pieces and at room temperature"
        ],
        "instructions": [
            "Preheat the oven to 350°F. Butter and flour the sides of an 8 by 3-inch round cake pan and line the bottom with a parchment paper round that has been cut to fit.",
            "In a medium bowl, whisk together the egg yolks, 1/2 cup (4.3 oz / 121 g) of the milk, and the vanilla.",
            "Sift the flour, sugar, baking powder, and salt into the bowl of a stand mixer fitted with the paddle attachment, and mix on low speed for 30 seconds. Add the remaining 1/4 cup (2.1 oz / 60 g) of milk and mix on low speed until moistened, about 15 seconds. Add the butter and beat on medium speed for 1 1/2 minutes or until smooth and aerated. Scrape down the sides of the bowl with a rubber spatula. Add the egg mixture in 3 batches, mixing on medium speed for 20 seconds and then scraping down the bowl after each addition.",
            "Transfer the batter to the prepared pan and smooth the surface with an offset spatula. Bake, rotating the pan midway through baking, until the cake springs back when gently pressed in the center, 55 to 60 minutes. You can also test for doneness by listening to the cake: Remove the pan from the oven, set it on a wire rack, lower your ear to the cake, and listen. If you hear the cake snap, crackle, and pop, it needs a few more minutes in the oven. If it's quiet, it's done.",
            "Let the cake cool on a wire rack for 30 minutes, and then run an offset spatula around the inside of the pan. Invert the cake onto the wire rack, lift off the pan, and remove the parchment. When the cake is cool enough to handle, after about 20 minutes, reinvert it so the top is facing up. Let cool completely, wrap tightly in plastic wrap, and refrigerate for at least 3 hours before assembling."
        ],
        "picture_link": null
    }
}