{
    "recipe": {
        "title": "Rotisserie Chicken Salad with Charred Scallion Dressing ",
        "ingredients": [
            "5 ounce country-style bread, crusts removed, torn into 1\" pieces",
            "10 tablespoons olive oil, divided",
            "2 scallions",
            "Kosher salt, freshly ground pepper",
            "2 tablespoons fresh lemon juice",
            "2 tablespoons unseasoned rice vinegar",
            "1 tablespoons Dijon mustard",
            "1 tablespoons mayonnaise, preferably Hellmann’s (Best Foods)",
            "1 small rotisserie chicken, meat pulled from bones and shredded",
            "6 radishes, trimmed, cut into wedges",
            "1 head of Bibb lettuce, leaves separated",
            "1 avocado, sliced, divided"
        ],
        "instructions": [
            "Preheat oven to 450°F. Toss bread and 3 Tbsp. oil on a rimmed baking sheet; season with salt and pepper. Bake until golden and crisp around the edges, 8–12 minutes; let croutons cool.",
            "Meanwhile, separate scallion whites from greens. Finely chop whites; place in a large bowl. Finely chop greens. Heat 1 Tbsp. oil in a small skillet over medium. Cook greens, stirring often, until blackened around edges and crisp, about 3 minutes. Scrape into bowl with whites, then whisk in lemon juice, vinegar, mustard, and mayonnaise; season with salt and pepper. Gradually whisk in remaining 6 Tbsp. oil.",
            "Pour half of dressing into a small bowl; set aside. Add chicken, radishes, and croutons to bowl with remaining dressing and toss to coat.",
            "Arrange lettuce and half of avocado on a platter; season with salt and pepper. Drizzle with 3 Tbsp. reserved dressing; top with chicken salad. Tuck remaining avocado around; season with salt and pepper. Drizzle with remaining dressing."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a05db1747bc8227618ffb1f/6:4/w_274%2Ch_169/rotisserie-chicken-salad-with-charred-scallion-dressing-recipe-BA-111017.jpg"
    }
}