{
    "recipe": {
        "title": "Rustic Herb Stuffing ",
        "ingredients": [
            "1 16-ounce loaf country-style French bread with crust, cut into 1-inch cubes (about 11 cups)",
            "10 tablespoons (1 1/4 sticks) butter",
            "2 bunches green onions, thinly sliced",
            "2 cups finely chopped celery",
            "3/4 cup chopped fresh Italian parsley",
            "1 tablespoon chopped fresh oregano",
            "1 tablespoon chopped fresh sage",
            "1 tablespoon chopped fresh thyme",
            "1 large garlic clove, minced",
            "1 teaspoon coarse kosher salt",
            "1 teaspoon freshly ground black pepper",
            "1 large bunch Swiss chard, stems cut from leaves and discarded, leaves coarsely chopped (about 12 cups)",
            "3 large eggs",
            "3/4 cup (or more) low-salt chicken broth",
            "3 ounces coarsely grated Parmesan cheese (optional)"
        ],
        "instructions": [
            "Preheat oven to 375°F. Spread bread on large rimmed baking sheet. Bake until bread is dry, about 15 minutes. Cool. Melt 10 tablespoons butter in heavy large skillet over medium heat. Add green onions and next 8 ingredients; sauté until celery is tender, 6 to 8 minutes. Add Swiss chard and toss until wilted, about 3 minutes. DO AHEAD: Bread cubes and vegetable mixture can be made 1 day ahead. Store bread cubes airtight at room temperature. Cool vegetable mixture slightly, then transfer to microwave-safe bowl; cover and chill. Rewarm vegetable mixture in microwave before continuing. Preheat oven to 375°F. Generously butter 13x9x2-inch glass baking dish. Place bread cubes in very large bowl. Add warm vegetable mixture; toss to combine. Whisk eggs and 3/4 cup broth in medium bowl. Add egg mixture to stuffing and toss to coat. Mix in Parmesan, if using. Add more broth (about 1/2 to 3/4 cup) to stuffing if dry. Transfer to dish. Cover with buttered foil. Bake 30 minutes. Remove foil; bake until golden, about 30 minutes.",
            "Preheat oven to 375°F. Spread bread on large rimmed baking sheet. Bake until bread is dry, about 15 minutes. Cool.",
            "Melt 10 tablespoons butter in heavy large skillet over medium heat. Add green onions and next 8 ingredients; sauté until celery is tender, 6 to 8 minutes. Add Swiss chard and toss until wilted, about 3 minutes. DO AHEAD: Bread cubes and vegetable mixture can be made 1 day ahead. Store bread cubes airtight at room temperature. Cool vegetable mixture slightly, then transfer to microwave-safe bowl; cover and chill. Rewarm vegetable mixture in microwave before continuing.",
            "Preheat oven to 375°F. Generously butter 13x9x2-inch glass baking dish. Place bread cubes in very large bowl. Add warm vegetable mixture; toss to combine. Whisk eggs and 3/4 cup broth in medium bowl. Add egg mixture to stuffing and toss to coat. Mix in Parmesan, if using.",
            "Add more broth (about 1/2 to 3/4 cup) to stuffing if dry. Transfer to dish. Cover with buttered foil. Bake 30 minutes. Remove foil; bake until golden, about 30 minutes."
        ],
        "picture_link": null
    }
}