{
    "recipe": {
        "title": "Rustic Fig, Serrano Ham & Hazelnut Tartines ",
        "ingredients": [
            "3/4 cup (105 g) superfine brown rice flour, plus more for dusting",
            "1/4 cup (35 g) millet flour",
            "3 tablespoons hazelnut flour",
            "2 tablespoons tapioca starch",
            "2 teaspoons ground chia seeds",
            "1 teaspoon chopped fresh parsley",
            "1 teaspoon fresh thyme leaves",
            "3/4 teaspoon salt",
            "1/4 teaspoon freshly ground black pepper",
            "1 stick (8 tablespoons or 110 g) cold unsalted butter, cut into 1/2-inch cubes",
            "6 to 8 tablespoons ice water",
            "2 tablespoons hazelnuts",
            "4 ounces (110 g) creamy goat cheese",
            "8 ounces (225 g) Black Mission figs, halved",
            "6 thin slices (3 ounces or 90 g) Serrano ham",
            "1 cup (40 g) watercress, tough stems removed",
            "1/4 small red onion, thinly sliced",
            "1 tablespoon olive oil",
            "2 teaspoons balsamic vinegar"
        ],
        "instructions": [
            "Make the crust 1. Combine the first nine ingredients in a food processor. Pulse three times to aerate. Add the cold butter and pulse ten times, until the butter is the size of small peas. Add 6 tablespoons of ice water and pulse. The dough does not need to form a ball. Simply press the dough and see if it comes together. If it seems crumbly, add another tablespoon of ice water. 2. Transfer the dough onto a work surface and knead it a couple of times. Quickly form it into a 6-inch square. Do not handle the dough too much, and don't worry if it isn't a perfect square. Wrap the dough in plastic wrap, flatten it, and refrigerate it for 30 minutes. 3. Preheat the oven to 375°F (190°C). Remove the dough from the refrigerator. It is best to work on a cold surface, such as marble. Dust your surface and your rolling pin with a little bit of superfine brown rice flour. Roll the dough to a rectangle that is approximately 7 by 10 inches and 1/4 inch thick. Again, it doesn't have to be perfect. Work quickly so the dough doesn't become too soft. If it cracks, pinch it back together. 4. Transfer the rolled dough to a baking sheet lined with parchment paper. Trim the edges with a pie cutter if desired. Chill the dough for 20 minutes or until firm. 5. Bake for 20 to 25 minutes, until golden brown. Remove from the oven and let the crust cool while preparing the topping (leave the oven on). I recommend arranging the topping while the crust is slightly warm, as the warmth brings out all the flavors.",
            "1. Combine the first nine ingredients in a food processor. Pulse three times to aerate. Add the cold butter and pulse ten times, until the butter is the size of small peas. Add 6 tablespoons of ice water and pulse. The dough does not need to form a ball. Simply press the dough and see if it comes together. If it seems crumbly, add another tablespoon of ice water.",
            "2. Transfer the dough onto a work surface and knead it a couple of times. Quickly form it into a 6-inch square. Do not handle the dough too much, and don't worry if it isn't a perfect square. Wrap the dough in plastic wrap, flatten it, and refrigerate it for 30 minutes.",
            "3. Preheat the oven to 375°F (190°C). Remove the dough from the refrigerator. It is best to work on a cold surface, such as marble. Dust your surface and your rolling pin with a little bit of superfine brown rice flour. Roll the dough to a rectangle that is approximately 7 by 10 inches and 1/4 inch thick. Again, it doesn't have to be perfect. Work quickly so the dough doesn't become too soft. If it cracks, pinch it back together.",
            "4. Transfer the rolled dough to a baking sheet lined with parchment paper. Trim the edges with a pie cutter if desired. Chill the dough for 20 minutes or until firm.",
            "5. Bake for 20 to 25 minutes, until golden brown. Remove from the oven and let the crust cool while preparing the topping (leave the oven on). I recommend arranging the topping while the crust is slightly warm, as the warmth brings out all the flavors.",
            "Prepare the topping 1. Reduce the oven temperature to 350°F (180°C). Place the hazelnuts on a baking sheet and toast them for 5 to 7 minutes or until golden and the skin begins to loosen. Transfer them to a kitchen towel and rub them together to remove their skins. Let them cool. Coarsely chop them. 2. Place the goat cheese in a bowl and quickly stir it to loosen it. Spread over the warm tart. 3. Arrange the figs, ham, watercress, red onion, and toasted hazelnuts over the goat cheese. Drizzle the olive oil and balsamic vinegar over the top. Cut into squares and serve immediately.",
            "1. Reduce the oven temperature to 350°F (180°C). Place the hazelnuts on a baking sheet and toast them for 5 to 7 minutes or until golden and the skin begins to loosen. Transfer them to a kitchen towel and rub them together to remove their skins. Let them cool. Coarsely chop them.",
            "2. Place the goat cheese in a bowl and quickly stir it to loosen it. Spread over the warm tart.",
            "3. Arrange the figs, ham, watercress, red onion, and toasted hazelnuts over the goat cheese. Drizzle the olive oil and balsamic vinegar over the top. Cut into squares and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b064d8fca98987608b24a9/6:4/w_274%2Ch_169/51126420_ham-tartines_1x1.jpg"
    }
}