{
    "recipe": {
        "title": "Saffron–Rose Water Brittle with Pistachios and Almonds ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "1/8 teaspoon finely ground saffron threads",
            "1 tablespoon rose water",
            "3/4 cup sugar",
            "1/2 cup light corn syrup",
            "3 tablespoons honey",
            "1/4 cup slivered almonds",
            "2 tablespoons unsalted butter",
            "1 teaspoon kosher salt",
            "1 teaspoon baking soda",
            "3 tablespoons chopped pistachios",
            "1 tablespoon coarsely ground dried rose petals",
            "1/2 teaspoon flaky sea salt",
            "A candy thermometer"
        ],
        "instructions": [
            "Line a rimmed baking sheet with parchment paper; lightly coat with nonstick spray. Dissolve saffron in rose water in a small bowl. Bring sugar, corn syrup, honey, and 2 Tbsp. water to a boil in a medium saucepan fitted with candy thermometer over medium heat, stirring to dissolve sugar. Cook, swirling occasionally (do not stir once sugar is dissolved), until thermometer registers 290°F, about 5 minutes. Mix in almonds, butter, and kosher salt and cook, stirring often, until almonds are golden, butter is absorbed, and thermometer registers 300°F, about 2 minutes. Vigorously mix in baking soda, then rose water mixture (caramel will bubble at first but then look smooth and creamy). Immediately pour onto prepared baking sheet and spread out as thin as possible. Sprinkle pistachios, rose petals, and sea salt over brittle. Let cool, then break into bite-size pieces.",
            "Line a rimmed baking sheet with parchment paper; lightly coat with nonstick spray. Dissolve saffron in rose water in a small bowl.",
            "Bring sugar, corn syrup, honey, and 2 Tbsp. water to a boil in a medium saucepan fitted with candy thermometer over medium heat, stirring to dissolve sugar. Cook, swirling occasionally (do not stir once sugar is dissolved), until thermometer registers 290°F, about 5 minutes. Mix in almonds, butter, and kosher salt and cook, stirring often, until almonds are golden, butter is absorbed, and thermometer registers 300°F, about 2 minutes. Vigorously mix in baking soda, then rose water mixture (caramel will bubble at first but then look smooth and creamy). Immediately pour onto prepared baking sheet and spread out as thin as possible. Sprinkle pistachios, rose petals, and sea salt over brittle. Let cool, then break into bite-size pieces.",
            "Do Ahead Brittle can be made 1 week ahead. Store airtight at room temperature.",
            "Brittle can be made 1 week ahead. Store airtight at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58c6be2de6dbe06656045bf0/6:4/w_274%2Ch_169/saffron-rose-water-brittle-with-pistachios-and-almonds-BA-031317.jpg"
    }
}