{
    "recipe": {
        "title": "Sage and Honey Skillet Cornbread ",
        "ingredients": [
            "1 cup cornmeal (preferably whole grain, medium grind)",
            "1 cup unbleached all purpose flour",
            "1 tablespoon baking powder",
            "1 teaspoon salt",
            "2 teaspoons chopped fresh sage plus 12 whole fresh sage leaves",
            "1 cup whole milk",
            "1/2 cup honey",
            "1 large egg",
            "1/2 cup (1 stick) unsalted butter"
        ],
        "instructions": [
            "Preheat oven to 400°F. Heat heavy 10-inch-diameter ovenproof skillet (preferably cast-iron) in oven 10 minutes. Whisk first 4 ingredients and 2 teaspoons chopped sage in large bowl to blend. Whisk milk, honey, and egg in medium bowl to blend. Remove skillet from oven; add 1/2 cup butter. Swirl until butter is melted. Pour all except 2 tablespoons butter into egg mixture. Add whole sage leaves to butter in skillet; toss to coat. Arrange leaves over bottom of skillet, spacing apart. Add egg mixture to cornmeal mixture; stir until just combined (do not overmix; batter will be wet and runny). Pour batter over sage leaves in skillet. Bake until browned around edges and tester inserted into center comes out clean, about 22 minutes. Cool in skillet 10 minutes. Invert onto platter. If necessary, reposition sage leaves atop cornbread.",
            "Preheat oven to 400°F. Heat heavy 10-inch-diameter ovenproof skillet (preferably cast-iron) in oven 10 minutes.",
            "Whisk first 4 ingredients and 2 teaspoons chopped sage in large bowl to blend. Whisk milk, honey, and egg in medium bowl to blend.",
            "Remove skillet from oven; add 1/2 cup butter. Swirl until butter is melted. Pour all except 2 tablespoons butter into egg mixture. Add whole sage leaves to butter in skillet; toss to coat. Arrange leaves over bottom of skillet, spacing apart.",
            "Add egg mixture to cornmeal mixture; stir until just combined (do not overmix; batter will be wet and runny). Pour batter over sage leaves in skillet. Bake until browned around edges and tester inserted into center comes out clean, about 22 minutes. Cool in skillet 10 minutes. Invert onto platter. If necessary, reposition sage leaves atop cornbread."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54e747db4f77a310045d6bb4/6:4/w_274%2Ch_169/240376_sage-and-honey-skillet-cornbread.jpg"
    }
}