{
    "recipe": {
        "title": "Saigon Chicken Salad ",
        "ingredients": [
            "1 cup chopped fresh cilantro (including stems)",
            "5 tablespoons fresh lemon juice",
            "1 4-inch-long bottom portion of large lemongrass stalk, finely chopped (about 2 tablespoons)",
            "3 large kaffir lime leaves, minced (1 generous teaspoon)",
            "1/2 cup olive oil",
            "Coarse kosher salt",
            "1 1/4 pounds skinless boneless chicken breast halves (4 to 5)",
            "5 tablespoons fish sauce (such as nam pla or nuoc nam)",
            "1/4 cup (packed) light palm sugar or golden brown sugar",
            "1/4 cup fresh lime juice",
            "2 teaspoons minced Thai chiles or serrano chiles with seeds",
            "2 large garlic cloves, pressed",
            "3 cups 2-inch pieces trimmed Chinese long beans or green beans (about 10 ounces)",
            "8 ounces plum tomatoes, halved lengthwise, seeds and pulp removed, shells cut into long thin strips",
            "1 cup coarsely grated peeled daikon (Japanese white radish) or trimmed red radishes",
            "1 cup coarsely grated seeded Persian cucumbers (about 3)",
            "1 cup very thinly sliced green cabbage",
            "1 cup coarsely grated carrot",
            "1 cup celery leaves",
            "1 cup fresh cilantro leaves",
            "3 green onions, thinly sliced on diagonal",
            "1/2 cup salted roasted peanuts, split in half",
            "Ingredient info: Lemongrass, fish sauce, palm sugar, and daikon can be found at some supermarkets and at Asian markets. Kaffir lime leaves are sold frozen or sometimes fresh at Asian markets. If unavailable, substitute 1 tables poon fresh lime juice and 1/2 teaspoon grated lime peel for each lime leaf.",
            "Test-kitchen tip: Palm sugar can be very hard, making it difficult to measure. To soften it, microwave the palm sugar (s till in the jar) in 10-second intervals at 50 percent power."
        ],
        "instructions": [
            "For chicken: Whisk cilantro, lemon juice, lemongrass, and kaffir lime leaves in small bowl to blend. Gradually whisk in oil. Season marinade to taste with coarse salt and freshly ground black pepper. Arrange chicken in single layer in 8 x 8 x 2- inch glass baking dish. Pour marinade over; turn chicken to coat evenly. Cover and chill 3 hours. DO AHEAD: Can be made 1 day ahead. Keep chilled. Heat heavy large skillet over medium-high heat. Add chicken (with some marinade still clinging to surface) to skillet. Sauté until cooked through, 5 to 6 minutes per side. Turn off heat; let chicken rest in skillet 15 minutes. Transfer chicken to work surface. Cut chicken in half horizontally, then crosswise into thin strips.",
            "Whisk cilantro, lemon juice, lemongrass, and kaffir lime leaves in small bowl to blend. Gradually whisk in oil. Season marinade to taste with coarse salt and freshly ground black pepper. Arrange chicken in single layer in 8 x 8 x 2- inch glass baking dish. Pour marinade over; turn chicken to coat evenly. Cover and chill 3 hours. DO AHEAD: Can be made 1 day ahead. Keep chilled.",
            "Heat heavy large skillet over medium-high heat. Add chicken (with some marinade still clinging to surface) to skillet. Sauté until cooked through, 5 to 6 minutes per side.",
            "Turn off heat; let chicken rest in skillet 15 minutes. Transfer chicken to work surface. Cut chicken in half horizontally, then crosswise into thin strips.",
            "For dressing: Combine fish sauce, palm sugar, lime juice, chiles, and garlic in small bowl. Whisk until sugar dissolves. Season dressing to taste with salt and pepper. DO AHEAD: Can be made 3 hours ahead. Cover and let stand at room temperature; whisk before using.",
            "Combine fish sauce, palm sugar, lime juice, chiles, and garlic in small bowl. Whisk until sugar dissolves. Season dressing to taste with salt and pepper. DO AHEAD: Can be made 3 hours ahead. Cover and let stand at room temperature; whisk before using.",
            "For vegetables: Cook beans in saucepan of boiling salted water until crisp-tender, about 3 minutes. Drain; cool. Place beans in large bowl. Add tomatoes, daikon, cucumbers, cabbage, carrot, celery leaves, cilantro leaves, green onions, and most of peanuts. Add chicken and dressing; toss to blend. Season to taste with salt and pepper. Mound salad on large rimmed platter. Sprinkle with remaining peanuts and serve.",
            "Cook beans in saucepan of boiling salted water until crisp-tender, about 3 minutes. Drain; cool.",
            "Place beans in large bowl. Add tomatoes, daikon, cucumbers, cabbage, carrot, celery leaves, cilantro leaves, green onions, and most of peanuts. Add chicken and dressing; toss to blend. Season to taste with salt and pepper. Mound salad on large rimmed platter. Sprinkle with remaining peanuts and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b420fbd5e8c3e1070b205b/6:4/w_274%2Ch_169/362939_saigon-chicken-salad_1x1.jpg"
    }
}