{
    "recipe": {
        "title": "Saint Andre and Fingerling Potato Pies ",
        "ingredients": [
            "2 cups all purpose flour",
            "1 teaspoon salt",
            "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
            "1 large egg",
            "2 tablespoons (or more) cold water",
            "1 pound white onions, halved lengthwise, thinly sliced crosswise (about 5 cups)",
            "2 cups dry white wine",
            "1/4 cup red wine vinegar",
            "1/4 cup olive oil",
            "2 tablespoons tomato paste",
            "2 tablespoons sugar",
            "1 large fresh thyme sprig",
            "1 teaspoon salt",
            "1/2 teaspoon ground black pepper",
            "1/2 Turkish bay leaf",
            "8 ounces fingerling or baby Dutch yellow potatoes",
            "2 large egg yolks",
            "2/3 cup whipping cream",
            "1/8 teaspoon salt",
            "Pinch of ground black pepper",
            "Pinch of ground nutmeg",
            "6 ounces Saint André cheese, cut into 6 slices"
        ],
        "instructions": [
            "Blend flour and salt in processor. Add butter; using on/off turns, cut in butter until coarse meal forms. Add egg and 2 tablespoons cold water. Blend until moist clumps form, adding more cold water by teaspoonfuls if dry. Gather dough into ball; flatten into disk. Wrap in plastic and chill 1 hour. (Can be made 1 day ahead. Keep chilled.)",
            "Preheat oven to 375°F. Roll dough out on lightly floured surface to 1/8-inch thickness. Cut out 5-inch rounds, gathering scraps and rerolling dough as needed to make 6 rounds total. Transfer rounds to six 4 1/2-inch-diameter tart pans with 3/4-inch-high sides and removable bottoms. Press dough onto bottom and up sides of each pan, extending 1/8 inch above tart pan edge. Bake crusts until golden brown, pressing down with back of fork if bubbles form, about 22 minutes. Cool.",
            "For filling: Preheat oven to 400°F. Mix first 10 ingredients in 13x9x2-inch metal baking pan. Bake until onions are golden and almost all liquid is absorbed, stirring every 20 minutes, about 2 hours. Cool. Remove thyme sprig and bay leaf. Meanwhile, place potatoes in small saucepan. Add enough water to cover by 1 inch. Boil until potatoes are tender when pierced with knife, about 10 minutes. Drain; cool. Cut potatoes crosswise into 1/4-inch-thick rounds.",
            "Preheat oven to 400°F. Mix first 10 ingredients in 13x9x2-inch metal baking pan. Bake until onions are golden and almost all liquid is absorbed, stirring every 20 minutes, about 2 hours. Cool. Remove thyme sprig and bay leaf.",
            "Meanwhile, place potatoes in small saucepan. Add enough water to cover by 1 inch. Boil until potatoes are tender when pierced with knife, about 10 minutes. Drain; cool. Cut potatoes crosswise into 1/4-inch-thick rounds.",
            "Preheat oven to 325°F. Whisk yolks, cream, salt, pepper, and nutmeg in small bowl to blend. Divide onions among crusts, spreading evenly. Arrange potato slices in single layer over onions. Divide egg mixture among pies. Bake pies until edge of filling is set, about 7 minutes. Top each pie with 1 slice cheese. Bake until cheese melts, about 4 minutes. Cool slightly. Remove sides from tart pans and serve pies warm or at room temperature.",
            "Preheat oven to 325°F. Whisk yolks, cream, salt, pepper, and nutmeg in small bowl to blend. Divide onions among crusts, spreading evenly. Arrange potato slices in single layer over onions. Divide egg mixture among pies.",
            "Bake pies until edge of filling is set, about 7 minutes. Top each pie with 1 slice cheese. Bake until cheese melts, about 4 minutes. Cool slightly. Remove sides from tart pans and serve pies warm or at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df29bf9a84192308a863a/6:4/w_274%2Ch_169/230606.jpg"
    }
}