{
    "recipe": {
        "title": "Salad for Breakfast ",
        "ingredients": [
            "4 large eggs",
            "1 teaspoon kosher salt, plus more",
            "1 tablespoon sugar",
            "1 teaspoon ground turmeric",
            "1/2 cup plus 2 tablespoons unseasoned rice vinegar",
            "2 cups chopped crunchy vegetables (such as cucumbers and radishes)",
            "1/4 sweet onion, very thinly sliced",
            "8 ounces feta, cut into thick slices",
            "1/4 cup extra-virgin olive oil, plus more for drizzling",
            "4 slices sourdough bread, toasted, cooled",
            "8 cups lettuce leaves, torn if large",
            "Ground sumac (for serving)"
        ],
        "instructions": [
            "Gently lower eggs into a medium saucepan of boiling salted water and cook 6 1/2 minutes. Transfer eggs to a bowl of ice water with a slotted spoon and let cool until just warm. Peel and set aside. Meanwhile, whisk sugar, turmeric, 1/2 cup vinegar, 1 tsp. salt, and 1/2 cup water in a medium bowl. Add vegetables and sweet onion and let sit until slightly softened and pickled; ideally you want these to sit at least 1 hour, but if you are short on time, 10 minutes and massaging gently to soften a bit will get the job done. Place feta in a small bowl and drizzle with 1/4 cup oil and remaining 2 Tbsp. vinegar. Let sit at least 5 minutes. Drizzle toast with oil and tear into large pieces. Place in a large bowl with lettuce. Drain pickled vegetables and add to bowl. Drizzle marinating liquid from feta over, season with salt, and toss well. Cut eggs into quarters. Divide salad among plates; top with eggs and marinated feta and sprinkle with sumac.",
            "Gently lower eggs into a medium saucepan of boiling salted water and cook 6 1/2 minutes. Transfer eggs to a bowl of ice water with a slotted spoon and let cool until just warm. Peel and set aside.",
            "Meanwhile, whisk sugar, turmeric, 1/2 cup vinegar, 1 tsp. salt, and 1/2 cup water in a medium bowl. Add vegetables and sweet onion and let sit until slightly softened and pickled; ideally you want these to sit at least 1 hour, but if you are short on time, 10 minutes and massaging gently to soften a bit will get the job done.",
            "Place feta in a small bowl and drizzle with 1/4 cup oil and remaining 2 Tbsp. vinegar. Let sit at least 5 minutes.",
            "Drizzle toast with oil and tear into large pieces. Place in a large bowl with lettuce. Drain pickled vegetables and add to bowl. Drizzle marinating liquid from feta over, season with salt, and toss well.",
            "Cut eggs into quarters. Divide salad among plates; top with eggs and marinated feta and sprinkle with sumac.",
            "Do Ahead Eggs can be made and vegetables can be pickled 4 days ahead; cover and chill. Feta can be marinated 1 week ahead; cover and chill.",
            "Eggs can be made and vegetables can be pickled 4 days ahead; cover and chill. Feta can be marinated 1 week ahead; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a7c84e629a247652ce2bfb6/6:4/w_274%2Ch_169/breakfast-salad-with-eggs-and-feta-BA-020818.jpg"
    }
}