{
    "recipe": {
        "title": "Salmon Mousse with Salmon Roe and Crudites ",
        "ingredients": [
            "fresh coriander leaves for garnish",
            "2 tablespoons cold water plus 1/3 cup boiling water",
            "1 tablespoon fresh lemon juice",
            "1 envelope (about 1 tablespoon) of unflavored gelatin",
            "1/2 pound thinly sliced smoked salmon",
            "a 7 1/4-ounce can salmon, drained and the skin discarded",
            "1 1/2 cups sour cream",
            "1/4 teaspoon Tabasco, or to taste",
            "1/4 cup finely chopped scallion",
            "1 cup heavy cream",
            "1/4 cup salmon roe",
            "celery leaves for garnish",
            "assorted crudités such as cucumber, celery, jícama, daikon, and blanched snow peas"
        ],
        "instructions": [
            "Line the bottom of an oiled 5-cup charlotte mold or soufflé dish with a round of wax paper, oil the paper, and press the coriander leaves face down onto the paper decoratively. in a small bowl combine the cold water and the lemon juice, sprinkle the gelatin over the mixture, and let it soften for 2 minutes. Add the boiling water and stir the mixture until the gelatin is dissolved. In a food processor blend together the smoked salmon, the canned salmon, the sour cream, and the Tabasco until the mixture is smooth, add the gelatin mixture, the scallion, and salt and pepper to taste, and blend the mixture until it is combined well. In a large bowl beat the heavy cream until it holds soft peaks, add it to the salmon mixture, and pulse the motor until the mousse is just combined. Pour the mousse into the prepared mold and chill it, covered, for at least 8 hours or overnight. Dip the mold into a large pan of hot water for 2 seconds and run a thin knife around the edge. Invert a platter over the mold and invert the mousse onto the platter. (If the coriander leaves stick to the wax paper, replace them on top of the mousse.) Spoon the salmon roe around the edges of the mousse, garnish the platter with the celery leaves, and serve the mousse with the crudités.",
            "Line the bottom of an oiled 5-cup charlotte mold or soufflé dish with a round of wax paper, oil the paper, and press the coriander leaves face down onto the paper decoratively. in a small bowl combine the cold water and the lemon juice, sprinkle the gelatin over the mixture, and let it soften for 2 minutes. Add the boiling water and stir the mixture until the gelatin is dissolved. In a food processor blend together the smoked salmon, the canned salmon, the sour cream, and the Tabasco until the mixture is smooth, add the gelatin mixture, the scallion, and salt and pepper to taste, and blend the mixture until it is combined well. In a large bowl beat the heavy cream until it holds soft peaks, add it to the salmon mixture, and pulse the motor until the mousse is just combined. Pour the mousse into the prepared mold and chill it, covered, for at least 8 hours or overnight.",
            "Dip the mold into a large pan of hot water for 2 seconds and run a thin knife around the edge. Invert a platter over the mold and invert the mousse onto the platter. (If the coriander leaves stick to the wax paper, replace them on top of the mousse.) Spoon the salmon roe around the edges of the mousse, garnish the platter with the celery leaves, and serve the mousse with the crudités."
        ],
        "picture_link": null
    }
}