{
    "recipe": {
        "title": "Salmon and Bok Choy Green Coconut Curry ",
        "ingredients": [
            "4 (6–8-oz.) skinless salmon fillets",
            "2 tsp. kosher salt, divided",
            "1 (14-oz.) can full-fat coconut milk",
            "1/4 cup green curry paste",
            "2 tsp. finely grated peeled ginger (from one 2\" piece)",
            "1 garlic clove, finely grated",
            "1 head of bok choy (about 1 1/2 lb.)",
            "2 Tbsp. fresh lime juice",
            "4 scallions, thinly sliced",
            "1/2 cup cilantro leaves with tender stems",
            "1/4 cup roasted salted cashews",
            "1 serrano chile, thinly sliced (optional)",
            "Steamed rice (for serving; optional)"
        ],
        "instructions": [
            "Season salmon on all sides with 1 tsp. salt. Let sit until ready to use. Cook coconut milk, curry paste, ginger, garlic, and remaining 1 tsp. salt in a large high-sided skillet over medium heat, stirring occasionally, until simmering, 5–6 minutes. Meanwhile, cut bok choy stems into 1/2\"-thick slices and leaves into 2\" pieces. Rinse well and drain. Add to coconut milk mixture and stir to coat. Nestle salmon fillets into bok choy in an even layer. Cover pan and cook over medium-low heat until salmon is just cooked through and flesh is opaque, 6–8 minutes. Remove from heat and pour lime juice over salmon. Scatter scallions, cilantro, cashews, and chile (if using) over salmon and bok choy. Serve with rice alongside (if using).",
            "Season salmon on all sides with 1 tsp. salt. Let sit until ready to use.",
            "Cook coconut milk, curry paste, ginger, garlic, and remaining 1 tsp. salt in a large high-sided skillet over medium heat, stirring occasionally, until simmering, 5–6 minutes.",
            "Meanwhile, cut bok choy stems into 1/2\"-thick slices and leaves into 2\" pieces. Rinse well and drain. Add to coconut milk mixture and stir to coat. Nestle salmon fillets into bok choy in an even layer. Cover pan and cook over medium-low heat until salmon is just cooked through and flesh is opaque, 6–8 minutes. Remove from heat and pour lime juice over salmon.",
            "Scatter scallions, cilantro, cashews, and chile (if using) over salmon and bok choy. Serve with rice alongside (if using)."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c127eaf98d3bb47fd44bb37/6:4/w_274%2Ch_169/DECEMBER-COOK-THIS-NOW-1--Salmon-Curry-05122018.jpg"
    }
}