{
    "recipe": {
        "title": "Salmon Niçoise ",
        "ingredients": [
            "8 ounces small purple potatoes",
            "Kosher salt",
            "4 ounces haricots verts, trimmed",
            "6 large eggs, room temperature",
            "2 tablespoons plus 1/4 cup olive oil",
            "1/4 cup drained capers, patted dry",
            "1 pound skin-on salmon fillet",
            "Freshly ground black pepper",
            "4 anchovy fillets packed in oil",
            "1 tablespoon whole grain Dijon mustard",
            "1/2 teaspoon sugar",
            "1 lemon",
            "1/2 medium shallot, finely chopped",
            "4 cups frisée or mâche",
            "1/4 cup niçoise olives, pitted"
        ],
        "instructions": [
            "Place potatoes in a medium saucepan and add cold water to cover by 1\". Bring to a boil, season with salt, and cook until fork-tender, 15–20 minutes. Transfer potatoes to a plate with a slotted spoon. Return water to a boil and cook haricots verts in same saucepan until crisp-tender, about 2 minutes. Using a slotted spoon, transfer to a bowl of ice water. Chill until cold, about 3 minutes. Transfer to paper towels and pat dry. Return water in pot to a boil and cook eggs 8 minutes. Transfer eggs to bowl of ice water and chill until cold, about 5 minutes. Peel; set aside. Meanwhile, heat 2 tablespoons oil in a small saucepan over medium-high. Add capers and cook, swirling pan occasionally, until capers burst and are crisp, about 5 minutes. Transfer capers with a slotted spoon to paper towels to drain. Let oil cool; set aside. Preheat oven to 425°. Rub salmon all over with reserved caper oil and place on a rimmed baking sheet; season with salt and pepper. Roast until medium-rare (fish will be slightly translucent in the center), 10–12 minutes. Let cool. Meanwhile, mash anchovies, mustard, and sugar in a large bowl to form a coarse paste. Remove peel and white pith from lemon. Working over bowl, cut between membranes of lemon to release segments. Squeeze remaining juice from membranes into bowl; discard membranes. Whisk in shallot, then slowly whisk in remaining 1/4 cup oil. Season vinaigrette with salt and pepper. Using a fork, break salmon into large flakes; discard skin. Halve reserved potatoes and eggs crosswise. Arrange frisée on a platter; season with salt and pepper. Drizzle with half of dressing. Top in separate piles with potatoes, haricots verts, hard-boiled eggs, olives, and salmon. Drizzle salad with remaining dressing and top with fried capers.",
            "Place potatoes in a medium saucepan and add cold water to cover by 1\". Bring to a boil, season with salt, and cook until fork-tender, 15–20 minutes. Transfer potatoes to a plate with a slotted spoon.",
            "Return water to a boil and cook haricots verts in same saucepan until crisp-tender, about 2 minutes. Using a slotted spoon, transfer to a bowl of ice water. Chill until cold, about 3 minutes. Transfer to paper towels and pat dry.",
            "Return water in pot to a boil and cook eggs 8 minutes. Transfer eggs to bowl of ice water and chill until cold, about 5 minutes. Peel; set aside.",
            "Meanwhile, heat 2 tablespoons oil in a small saucepan over medium-high. Add capers and cook, swirling pan occasionally, until capers burst and are crisp, about 5 minutes. Transfer capers with a slotted spoon to paper towels to drain. Let oil cool; set aside.",
            "Preheat oven to 425°. Rub salmon all over with reserved caper oil and place on a rimmed baking sheet; season with salt and pepper. Roast until medium-rare (fish will be slightly translucent in the center), 10–12 minutes. Let cool.",
            "Meanwhile, mash anchovies, mustard, and sugar in a large bowl to form a coarse paste. Remove peel and white pith from lemon. Working over bowl, cut between membranes of lemon to release segments. Squeeze remaining juice from membranes into bowl; discard membranes. Whisk in shallot, then slowly whisk in remaining 1/4 cup oil. Season vinaigrette with salt and pepper.",
            "Using a fork, break salmon into large flakes; discard skin. Halve reserved potatoes and eggs crosswise.",
            "Arrange frisée on a platter; season with salt and pepper. Drizzle with half of dressing. Top in separate piles with potatoes, haricots verts, hard-boiled eggs, olives, and salmon. Drizzle salad with remaining dressing and top with fried capers."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5537e48067c3a7e837c3f0bb/6:4/w_274%2Ch_169/56389407_salmon-nicoise_1x1.jpg"
    }
}