{
    "recipe": {
        "title": "Salmon and Corn Chowder ",
        "ingredients": [
            "3 tablespoons olive oil",
            "2 stalks celery, cut into 1/2-inch slices",
            "8 ounces unpeeled small red potatoes, cut into 1-inch cubes",
            "1 teaspoon kosher salt",
            "1 1/4 teaspoons freshly ground white pepper",
            "1 bunch green onions, coarsely chopped, including half of greens",
            "1 1/2 cups corn kernels (about 2 ears)",
            "4 cups fish or chicken stock",
            "1 cup heavy cream",
            "2 pounds salmon fillets, skin and pin bones removed, cut into 2-inch pieces",
            "Grated zest and juice of 1 lemon",
            "1/4 cup minced fresh dill"
        ],
        "instructions": [
            "Prepare a campfire or wood-fired grill for cooking with indirect heat. Heat the olive oil in a large, heavy saucepan or Dutch oven over medium heat and sauté the celery for 3 minutes. Add the potatoes, salt, and pepper and cook, stirring occasionally, for 5 minutes. Stir in the green onions and corn and add 2 cups of the stock. Bring to a boil, then reduce the heat, cover, and simmer until the potatoes are almost tender, about 15 minutes. Add the cream and simmer, uncovered, until the potatoes are tender, 5 to 7 minutes. Stir in the salmon and lemon zest and simmer gently until the salmon is just cooked through, 3 to 4 minutes. Add more stock as needed and lemon juice to taste. Taste and adjust the seasoning. Serve in bowls, topped with the dill.",
            "Prepare a campfire or wood-fired grill for cooking with indirect heat.",
            "Heat the olive oil in a large, heavy saucepan or Dutch oven over medium heat and sauté the celery for 3 minutes. Add the potatoes, salt, and pepper and cook, stirring occasionally, for 5 minutes. Stir in the green onions and corn and add 2 cups of the stock. Bring to a boil, then reduce the heat, cover, and simmer until the potatoes are almost tender, about 15 minutes.",
            "Add the cream and simmer, uncovered, until the potatoes are tender, 5 to 7 minutes. Stir in the salmon and lemon zest and simmer gently until the salmon is just cooked through, 3 to 4 minutes. Add more stock as needed and lemon juice to taste. Taste and adjust the seasoning.",
            "Serve in bowls, topped with the dill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a57262fa7a9917c258c8/6:4/w_274%2Ch_169/352990.jpg"
    }
}