{
    "recipe": {
        "title": "Salsa Borracha ",
        "ingredients": [
            "8 ancho chiles",
            "1/2 cup fresh orange juice",
            "1/2 cup golden tequila",
            "1 garlic clove, minced",
            "4 tablespoons olive oil",
            "Salt and freshly ground black pepper",
            "1/4 cup crumbled añejo or feta cheese"
        ],
        "instructions": [
            "Cook the chiles in a dry sauté pan over high heat, turning them constantly, for 2 minutes, or until slightly toasted. Halve and seed the chiles. Tear them into small pieces and transfer the pieces to a blender. Add the orange juice, tequila, garlic, and 2 tablespoons of the olive oil to the blender. Puree until the salsa is nearly smooth. Heat the remaining 2 tablespoons olive oil in a sauté pan over high heat. Add the salsa and cook for 5 minutes, or until slightly thickened. Season the salsa with salt and pepper. Let it cool completely. (The salsa can be made 1 day ahead. Cover the sauce and keep it in the fridge.) Serve the salsa topped with the crumbled añejo cheese.",
            "Cook the chiles in a dry sauté pan over high heat, turning them constantly, for 2 minutes, or until slightly toasted. Halve and seed the chiles. Tear them into small pieces and transfer the pieces to a blender.",
            "Add the orange juice, tequila, garlic, and 2 tablespoons of the olive oil to the blender. Puree until the salsa is nearly smooth.",
            "Heat the remaining 2 tablespoons olive oil in a sauté pan over high heat. Add the salsa and cook for 5 minutes, or until slightly thickened. Season the salsa with salt and pepper. Let it cool completely. (The salsa can be made 1 day ahead. Cover the sauce and keep it in the fridge.)",
            "Serve the salsa topped with the crumbled añejo cheese."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b1928f9a93d64c380ac638/6:4/w_274%2Ch_169/394910_salsa-borracha_1x1.jpg"
    }
}