{
    "recipe": {
        "title": "Salt-Baked Salmon with Citrus and Herbs ",
        "ingredients": [
            "1 5–6 pound head-and tail-on salmon or arctic char, cleaned",
            "10 cups kosher salt (from about one 48-ounce box), plus more",
            "1 grapefruit, thinly sliced",
            "2 lemons, thinly sliced",
            "1/2 bunch dill",
            "1/2 bunch tarragon",
            "1 small shallot, finely chopped",
            "1/2 cup dry white wine",
            "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into pieces",
            "2 tablespoons crème fraîche",
            "1 teaspoon finely grated grapefruit zest",
            "1 teaspoon fresh grapefruit juice",
            "1 teaspoon finely grated lemon zest",
            "3 teaspoons fresh lemon juice, divided",
            "Kosher salt",
            "1 cup fresh parsley leaves with tender stems",
            "1/3 cup fresh dill leaves",
            "1/3 cup fresh tarragon leaves",
            "2 tablespoons chopped capers",
            "2 teaspoons caraway seeds",
            "Salmon will be closer to 5 pounds; arctic char closer to 6 pounds. Not all shops will have whole fish this large on hand; call ahead so they can order it."
        ],
        "instructions": [
            "Place a rack in the center of oven and preheat to 400°. Season inside of salmon with salt. Stuff with one-third of grapefruit slices, lemon slices, dill sprigs, and tarragon sprigs.",
            "Mix 10 cups salt and 1 1/2 cups water in a large bowl, adding more water as needed, until mixture is the texture of wet sand. Spread a thin layer of salt mixture on a rimmed baking sheet roughly the same shape and size as fish.",
            "Top salt mixture with another third of grapefruit and lemon slices and dill and tarragon sprigs; set salmon on salt bed and top with remaining citrus and herbs. Pack remaining salt mixture over fish, leaving head and tail peeking out.",
            "Roast salmon until just cooked through (poke a paring knife or metal skewer though the salt and into the flesh; it should feel warm to the touch when removed), 40–50 minutes.",
            "Beurre Blanc and assembly: While salmon is cooking, simmer shallot and wine in a small saucepan until only 2 tablespoons liquid remains, 8–10 minutes. Whisking constantly, add butter a piece at a time, incorporating completely before adding the next piece, to make a glossy, emulsified sauce. Whisk crème fraîche, grapefruit zest, grapefruit juice, lemon zest, and 1 teaspoon lemon juice into sauce; season with salt. Reduce heat to low and keep sauce warm while you finish the dish. Remove salmon from oven and using a knife or the edge of a fish spatula, crack salt crust and remove (it should come off in large pieces); let salmon sit 5 minutes before serving. Meanwhile, toss parsley, dill, tarragon, capers, caraway seeds, and remaining 2 teaspoons lemon juice in a medium bowl; season herb salad with salt. Serve salmon with beurre blanc and herb salad.",
            "While salmon is cooking, simmer shallot and wine in a small saucepan until only 2 tablespoons liquid remains, 8–10 minutes. Whisking constantly, add butter a piece at a time, incorporating completely before adding the next piece, to make a glossy, emulsified sauce.",
            "Whisk crème fraîche, grapefruit zest, grapefruit juice, lemon zest, and 1 teaspoon lemon juice into sauce; season with salt. Reduce heat to low and keep sauce warm while you finish the dish.",
            "Remove salmon from oven and using a knife or the edge of a fish spatula, crack salt crust and remove (it should come off in large pieces); let salmon sit 5 minutes before serving.",
            "Meanwhile, toss parsley, dill, tarragon, capers, caraway seeds, and remaining 2 teaspoons lemon juice in a medium bowl; season herb salad with salt. Serve salmon with beurre blanc and herb salad."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54aade2a19925f464b39e464/6:4/w_274%2Ch_169/51259460_salt-baked-salmon_1x1.jpg",
        "color": 15389958
    }
}