{
    "recipe": {
        "title": "Salted Butter Caramel–Chocolate Mousse ",
        "ingredients": [
            "1/2 cup (100g) granulated sugar",
            "3 tablespoons salted butter, cubed",
            "3/4 cup (180ml) heavy cream",
            "6 ounces (170g) bittersweet or semisweet chocolate, chopped",
            "4 large eggs, separated",
            "Rounded 1/4 teaspoon flaky sea salt, preferably fleur de sel"
        ],
        "instructions": [
            "1. Spread the sugar evenly over the bottom of a wide saucepan. Heat the sugar over medium heat. As it begins to liquefy at the edges, use a heatproof spatula to very gently drag the liquefied sugar toward the center. Watch carefully, as once the edges start to darken, the sugar is in danger of burning. Continue to cook, stirring very gently, until all the sugar is melted and begins to caramelize. 2. When the caramel is a deep amber color and starts to smoke, wait for a moment for it to smell just slightly burnt, then remove it from the heat and quickly whisk the butter, stirring until melted. Gradually whisk in the cream and stir until the little bits of caramel are completely melted. (A few can be stubborn, so be patient. You can strain the mixture if they simply refuse to budge.) 3. Once smooth, add the chocolate, stirring gently until it's melted and smooth. Scrape the mixture into a large bowl and let it cool to room temperature. Once it's no longer warm, whisk in the egg yolks. 4. In a separate bowl, whip the egg whites until stiff. Fold one-third of the whipped whites into the chocolate mixture, sprinkling in the flaky salt. Fold in the remaining beaten egg whites just until no streaks of white remain. Divide the mousse into serving glasses, or transfer it to a decorative serving bowl, and chill for at least 8 hours. While it might be tempting to serve this with whipped cream, I prefer to serve it pure, straight up with just a spoon.",
            "1. Spread the sugar evenly over the bottom of a wide saucepan. Heat the sugar over medium heat. As it begins to liquefy at the edges, use a heatproof spatula to very gently drag the liquefied sugar toward the center. Watch carefully, as once the edges start to darken, the sugar is in danger of burning. Continue to cook, stirring very gently, until all the sugar is melted and begins to caramelize.",
            "2. When the caramel is a deep amber color and starts to smoke, wait for a moment for it to smell just slightly burnt, then remove it from the heat and quickly whisk the butter, stirring until melted. Gradually whisk in the cream and stir until the little bits of caramel are completely melted. (A few can be stubborn, so be patient. You can strain the mixture if they simply refuse to budge.)",
            "3. Once smooth, add the chocolate, stirring gently until it's melted and smooth. Scrape the mixture into a large bowl and let it cool to room temperature. Once it's no longer warm, whisk in the egg yolks.",
            "4. In a separate bowl, whip the egg whites until stiff. Fold one-third of the whipped whites into the chocolate mixture, sprinkling in the flaky salt. Fold in the remaining beaten egg whites just until no streaks of white remain. Divide the mousse into serving glasses, or transfer it to a decorative serving bowl, and chill for at least 8 hours. While it might be tempting to serve this with whipped cream, I prefer to serve it pure, straight up with just a spoon."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac8ae619925f464b3ab88f/6:4/w_274%2Ch_169/51232820_chocolate-mousse_1x1.jpg"
    }
}