{
    "recipe": {
        "title": "Salt and Pepper Shrimp ",
        "ingredients": [
            "1 1/2 pounds medium shrimp in shell",
            "3 quarts corn oil",
            "3 tablespoon plus 1 teaspoon kosher salt, divided",
            "2 large egg whites, at room temperature 30 minutes",
            "1 cup cornstarch",
            "3 tablespoons plus 1 teaspoon freshly ground black pepper (not fine)",
            "2 cups sliced (1/8 inch thick) fresh jalapeño (about 8 chiles)",
            "3 cups cilantro sprigs (from 2 bunches)",
            "2 teaspoons flaky sea salt, such as Maldon, or to taste",
            "Equipment: a deep-fat thermometer"
        ],
        "instructions": [
            "Cut shell along back of each shrimp with small kitchen shears (do not peel) and devein, then snip off legs.",
            "Heat oil to 400°F in an 8-to10-quart heavy pot.",
            "Toss shrimp with 1 tablespoon kosher salt and let stand 5 minutes. Rinse with cold water, then drain and pat dry.",
            "Meanwhile, pulse egg whites in a blender until watery, then put in a bowl.",
            "Stir together cornstarch, 3 tablespoons pepper, and 2 tablespoons kosher salt in another bowl.",
            "Toss half of shrimp with 1/2 teaspoon each of kosher salt and pepper in a third bowl; dip in egg white, letting excess drip off, then lightly dredge in cornstarch mixture, shaking off excess. (Coating should be as light as possible.) Fry until crisp and cooked through, 1 1/2 to 2 minutes. Transfer with a slotted spoon to paper towels to drain.",
            "Season, coat, and fry remaining shrimp.",
            "Reduce oil temperature to 375°F.",
            "Fry half of chiles with half of cilantro until cilantro just starts to turn dark green and chiles are wilted (do not brown chiles), about 30 seconds. Transfer with a slotted spoon to paper towels to drain. (Cilantro will crisp as it cools.)",
            "Repeat with remaining chiles and cilantro.",
            "Serve shrimp topped with fried chiles and cilantro and sprinkled with sea salt. Serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d791c7b55306961bf3585/6:4/w_274%2Ch_169/350204_hires.jpg",
        "color": 10212361
    }
}