{
    "recipe": {
        "title": "Salt-Crusted Beets with Horseradish Crème Fraîche ",
        "ingredients": [
            "1 cup crème fraîche (8 ounces)",
            "1 tablespoon prepared horseradish",
            "1 tablespoon chopped fresh chives",
            "2 teaspoons Sherry wine vinegar",
            "2 cups coarse kosher salt",
            "5 tablespoons prepared horseradish",
            "2 tablespoons chopped fresh thyme",
            "1 tablespoon finely grated orange peel",
            "3 large unpeeled beets (each about 8 ounces), trimmed, scrubbed"
        ],
        "instructions": [
            "Whisk crème fraîche, horseradish, chopped chives, and Sherry wine vinegar in small bowl to blend. Season to taste with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
            "For beets: Preheat oven to 375°F. Mix coarse salt, horseradish, thyme, and orange peel in medium bowl. Place three 3-tablespoon mounds of salt mixture on small rimmed baking sheet, spacing apart. Top each salt mound with 1 beet, then cover all beets with remaining salt mixture, pressing very firmly with hands and forming crust around each beet, covering completely. Roast beets 1 3/4 hours. Remove from oven; crack salt crusts open and remove beets. Peel beets; cut into 1/4-inch-thick slices. Arrange beet slices on platter. Serve with horseradish crème fraîche.",
            "Preheat oven to 375°F. Mix coarse salt, horseradish, thyme, and orange peel in medium bowl. Place three 3-tablespoon mounds of salt mixture on small rimmed baking sheet, spacing apart. Top each salt mound with 1 beet, then cover all beets with remaining salt mixture, pressing very firmly with hands and forming crust around each beet, covering completely.",
            "Roast beets 1 3/4 hours. Remove from oven; crack salt crusts open and remove beets. Peel beets; cut into 1/4-inch-thick slices. Arrange beet slices on platter. Serve with horseradish crème fraîche."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9afa7b55306961bf79fd/6:4/w_274%2Ch_169/241354_hires.jpg",
        "color": 1335340
    }
}