{
    "recipe": {
        "title": "Salted Caramel–Chocolate Tart ",
        "ingredients": [
            "1/3 cup unsweetened cocoa powder",
            "2 Tbsp. sugar",
            "1/2 tsp. Diamond Crystal kosher salt",
            "1 2/3 cups all-purpose flour, plus more for surface",
            "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into pieces",
            "1 large egg yolk",
            "3 Tbsp. chilled milk or water",
            "1 1/2 cups sugar",
            "1/8 tsp. cream of tartar",
            "6 Tbsp. chilled unsalted butter, cut into pieces",
            "1/3 cup heavy cream",
            "1 tsp. Diamond Crystal kosher salt",
            "4 oz. semisweet chocolate (do not go above 70% cacao), finely chopped",
            "1/2 cup heavy cream",
            "2 Tbsp. unsalted butter, cut into small pieces",
            "Flaky sea salt",
            "A 9\" or 10\" tart pan with removable bottom"
        ],
        "instructions": [
            "Whisk cocoa, sugar, salt, and 1 2/3 cups flour in a medium bowl. Add butter and toss to coat. Using your fingers, smash butter into dry ingredients until it nearly disappears (you shouldn’t see any large bits) and mixture holds together when squeezed—you’re working it more than you would pie dough. Make a well in the center and add yolk and milk. Using a fork, gradually incorporate flour mixture until you’ve got a shaggy dough. Knead a couple of times in bowl until no dry spots remain and dough is smooth. Flatten into a 3/4\"-thick disk, wrap tightly in plastic, and chill until firm, about 2 hours. (You can make the caramel filling during this time.)",
            "Preheat oven to 350°F. Let dough sit 5 minutes to soften slightly. Roll out on a lightly floured surface to a 14\" round about 1/8\" thick, dusting with more flour as needed to prevent sticking. Lift dough on one edge and throw a pinch of flour on surface. Slide bottom of tart pan under dough, positioning it roughly in the center. Fold in edges of dough so it’s resting fully on insert; place inside tart ring and unfold edges so they gently slump against sides of pan and excess dough is hanging over the edges. Press dough firmly into bottom of pan with floured hands, then use a straight-sided measuring cup to firmly press sides of dough into grooves and up sides of pan. Roll pin over top edge of pan to shear off excess dough flush with pan. Reserve dough scraps for patching any potential cracks later. Prick bottom of dough all over with a fork and chill in freezer until very firm, 10–15 minutes.",
            "Place tart pan on a rimmed baking sheet and line with a sheet of parchment paper or foil. Fill with pie weights or dried beans and bake until edges of crust are set and starting to look dry, 12–15 minutes. Carefully lift parchment with weights. Patch any visible cracks with reserved dough. Return crust to oven and bake until firm and dry all over, 18–22 minutes. Transfer to a wire rack and let cool.",
            "Filling: Bring sugar, cream of tartar, and 1/3 cup water to a boil in a large saucepan over medium-low, stirring with a heatproof spatula until dissolved. Cook, swirling pot often but not stirring, until mixture turns deep amber and wisps of smoke rise from the surface, 8–10 minutes. Remove caramel from heat and immediately stir in butter a piece at a time until smooth (be careful; mixture will sputter). Gradually stir in cream, then add salt. Transfer caramel to a heatproof measuring glass (you should have about 1 1/2 cups). Let cool until warm. Pour caramel into cooled tart shell. Chill until caramel is set, at least 1 hour.",
            "Bring sugar, cream of tartar, and 1/3 cup water to a boil in a large saucepan over medium-low, stirring with a heatproof spatula until dissolved. Cook, swirling pot often but not stirring, until mixture turns deep amber and wisps of smoke rise from the surface, 8–10 minutes. Remove caramel from heat and immediately stir in butter a piece at a time until smooth (be careful; mixture will sputter). Gradually stir in cream, then add salt. Transfer caramel to a heatproof measuring glass (you should have about 1 1/2 cups). Let cool until warm.",
            "Pour caramel into cooled tart shell. Chill until caramel is set, at least 1 hour.",
            "Ganache: Place chocolate, cream, and butter in a heatproof bowl set over a saucepan of simmering water (bowl should not touch water). Stir with a heatproof spatula until ganache is smooth, about 5 minutes. Let cool until thickened enough to hold an indentation from a spoon. Remove tart from refrigerator and scrape ganache over caramel. Using a spoon, gently work ganache over surface, creating decorative swooshes and swirls. Sprinkle with sea salt; let sit until ganache has lost its sheen, 10–15 minutes.",
            "Place chocolate, cream, and butter in a heatproof bowl set over a saucepan of simmering water (bowl should not touch water). Stir with a heatproof spatula until ganache is smooth, about 5 minutes. Let cool until thickened enough to hold an indentation from a spoon.",
            "Remove tart from refrigerator and scrape ganache over caramel. Using a spoon, gently work ganache over surface, creating decorative swooshes and swirls. Sprinkle with sea salt; let sit until ganache has lost its sheen, 10–15 minutes.",
            "Do Ahead Dough can be made 2 days ahead; keep chilled. Crust can be baked 1 day ahead. Store tightly wrapped at room temperature. Caramel filling can be made 3 days ahead; cover and chill. Microwave in 20-second intervals, stirring in between, just until pourable. Caramel-filled tart can be made 1 day ahead; once it’s set, cover and keep chilled. Tart can be assembled 1 day ahead. Chill until ganache is set, then cover loosely. Let sit at room temperature 15 minutes before slicing.",
            "Dough can be made 2 days ahead; keep chilled. Crust can be baked 1 day ahead. Store tightly wrapped at room temperature. Caramel filling can be made 3 days ahead; cover and chill. Microwave in 20-second intervals, stirring in between, just until pourable. Caramel-filled tart can be made 1 day ahead; once it’s set, cover and keep chilled. Tart can be assembled 1 day ahead. Chill until ganache is set, then cover loosely. Let sit at room temperature 15 minutes before slicing."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aa012445d9a6873cf20d4ae/6:4/w_274%2Ch_169/salted-caramel-chocolate-tart-recipe-BA-030718.jpg"
    }
}