{
    "recipe": {
        "title": "Sambal Shrimp Lettuce Wraps ",
        "ingredients": [
            "1/2 cup hot chili paste (such as sambal oelek)",
            "1/4 cup honey",
            "1/4 cup unseasoned rice vinegar",
            "4 tsp. toasted sesame oil, divided",
            "1 1/2 lb. large shrimp",
            "Kosher salt",
            "1–2 Tbsp. vegetable oil",
            "2 Persian cucumbers, thinly sliced into rounds",
            "Flaky sea salt",
            "2 heads of Bibb lettuce, leaves separated, covered, chilled",
            "1/2 cup mint sprigs",
            "1/2 cup crushed salted, dry-roasted peanuts"
        ],
        "instructions": [
            "Whisk hot chili paste, honey, vinegar, and 2 tsp. sesame oil in a small bowl to combine. Season shrimp lightly with kosher salt and place in a resealable plastic bag. Pour in half of marinade and seal bag. Transfer remaining marinade to a small bowl and set aside for serving. Let shrimp sit at room temperature, turning the bag occasionally to ensure even coating, 10–15 minutes.",
            "Remove shrimp from marinade, allowing excess to drip back into bag, and transfer to paper towels to drain. Heat 1 Tbsp. vegetable oil in a large cast-iron skillet over medium-high until shimmering. Working in batches and adding another 1 Tbsp. oil along the way if the skillet is looking dry, arrange shrimp in skillet in a single layer and cook undisturbed 2 minutes (the marinade will have darkened in color and some of the sugars in it will have started to caramelize). Turn shrimp over and cook 30 seconds. Transfer to a platter.",
            "Arrange cucumbers on platter next to shrimp; season with sea salt and drizzle with remaining 2 tsp. sesame oil. Arrange lettuce leaves and mint sprigs on platter so that each component is visible and easily accessible. Place crushed peanuts in a small bowl and set out next to platter along with reserved marinade (for spooning into wraps)."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b61e364233c0c0c182a2039/6:4/w_274%2Ch_169/bibb-lettuce-wraps-with-sambal-shrimp-recipe-BA-080118.jpg",
        "color": 1535788
    }
}