{
    "recipe": {
        "title": "Sam's Spring Fattoush Salad ",
        "ingredients": [
            "2 pieces lavash bread",
            "1/4 cup plus 3 tablespoons extra-virgin olive oil",
            "Kosher salt",
            "Aleppo pepper (optional)",
            "1/4 cup lemon juice",
            "1 clove garlic, peeled and minced",
            "5 Persian, Armenian, or Japanese cucumbers, thinly sliced",
            "5 radishes, thinly sliced",
            "3 green onions, thinly sliced",
            "1 cup dill fronds",
            "1 cup mint leaves",
            "1/2 cup feta, preferably sheep’s milk"
        ],
        "instructions": [
            "Preheat the oven to 350°F. Brush the lavash on both sides with 3 tablespoons of the olive oil. Arrange on a baking sheet and sprinkle with salt and Aleppo pepper, if using. Transfer to the oven and bake until golden and crisp, 8 to 10 minutes. Remove from the oven and let cool. In a small bowl, whisk together the lemon juice, garlic, and a generous pinch of salt. Whisk in the remaining 1/4 cup olive oil until combined. In a large salad bowl, combine the cucumbers, radishes, green onions, dill, and mint. Drizzle half of the dressing over it and toss with your hands to coat. Break the lavash into bite-size pieces and add to the bowl along with the feta. Drizzle over the remaining dressing and gently mix with your hands to combine. Season to taste with additional salt and Aleppo pepper and serve immediately.",
            "Preheat the oven to 350°F. Brush the lavash on both sides with 3 tablespoons of the olive oil. Arrange on a baking sheet and sprinkle with salt and Aleppo pepper, if using. Transfer to the oven and bake until golden and crisp, 8 to 10 minutes. Remove from the oven and let cool.",
            "In a small bowl, whisk together the lemon juice, garlic, and a generous pinch of salt. Whisk in the remaining 1/4 cup olive oil until combined.",
            "In a large salad bowl, combine the cucumbers, radishes, green onions, dill, and mint. Drizzle half of the dressing over it and toss with your hands to coat. Break the lavash into bite-size pieces and add to the bowl along with the feta. Drizzle over the remaining dressing and gently mix with your hands to combine. Season to taste with additional salt and Aleppo pepper and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5af0bd1421186107ff66549b/6:4/w_274%2Ch_169/fattoush-salad-recipe-050718.jpg"
    }
}