{
    "recipe": {
        "title": "Saucy Country-Style Oven Ribs ",
        "ingredients": [
            "4 lb boneless country-style pork ribs",
            "1 large onion, finely chopped (2 cups)",
            "4 garlic cloves, minced (2 tablespoons)",
            "2 tablespoons vegetable oil",
            "1 1/2 cups ketchup (12 oz)",
            "2/3 cup honey",
            "1/2 cup cider vinegar",
            "1/2 cup Worcestershire sauce",
            "6 tablespoons fresh lemon juice (from 2 lemons)",
            "2 tablespoons plus 1 teaspoon dry mustard",
            "2 teaspoons drained bottled horseradish",
            "1 teaspoon black pepper"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 350°F. Put ribs in a 6- to 8-quart pot and cover with water by two inches. Bring to a boil, reduce heat and simmer, uncovered, skimming froth, 30 minutes. Meanwhile, cook onion and garlic in oil in a 3- to 4-quart heavy saucepan over moderate heat, stirring occasionally, until onion is tender, about 15 minutes. Stir in remaining ingredients and simmer, stirring occasionally, 15 minutes. Drain pork in a colander and pat dry, then arrange in 1 layer using tongs in a 13- by 9-inch baking dish. Pour sauce over pork to coat evenly, then cover dish tightly with foil. Bake 1 hour, then remove foil and carefully turn pork over with tongs and cook, uncovered, until very tender, about 30 minutes. Skim fat from sauce if desired.",
            "Put oven rack in middle position and preheat oven to 350°F.",
            "Put ribs in a 6- to 8-quart pot and cover with water by two inches. Bring to a boil, reduce heat and simmer, uncovered, skimming froth, 30 minutes.",
            "Meanwhile, cook onion and garlic in oil in a 3- to 4-quart heavy saucepan over moderate heat, stirring occasionally, until onion is tender, about 15 minutes. Stir in remaining ingredients and simmer, stirring occasionally, 15 minutes.",
            "Drain pork in a colander and pat dry, then arrange in 1 layer using tongs in a 13- by 9-inch baking dish. Pour sauce over pork to coat evenly, then cover dish tightly with foil. Bake 1 hour, then remove foil and carefully turn pork over with tongs and cook, uncovered, until very tender, about 30 minutes. Skim fat from sauce if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57a228fe437fcffe02f7236d/6:4/w_274%2Ch_169/country-ribs-03082016.jpg"
    }
}