{
    "recipe": {
        "title": "Sausage and Mushroom Penne Gratin ",
        "ingredients": [
            "1 pound dried penne",
            "1 pound bulk sweet Italian sausage",
            "2 tablespoons olive oil, divided",
            "1 pound packaged sliced mushrooms",
            "1 garlic clove, forced through a garlic press",
            "1 cup heavy cream",
            "1/2 cup grated Parmigiano-Reggiano",
            "8 ounces shredded whole-milk mozzarella, divided"
        ],
        "instructions": [
            "Cook penne in a pasta pot of boiling salted water (2 tablespoons salt for 6 quarts water) until al dente. Reserve 1/2 cup pasta-cooking water, then drain pasta and transfer to a flameproof 3-quart baking dish. Preheat broiler. Meanwhile, cook sausage in 1 tablespoon oil in a 12-inch nonstick skillet over high heat, stirring occasionally and breaking up any large pieces, until no longer pink. Transfer with a slotted spoon to a bowl, leaving fat in skillet. Add remaining tablespoon oil to skillet along with mushrooms and garlic, then cook over high heat, stirring occasionally, until mushrooms are golden, about 3 minutes. Return sausage to skillet along with cream, reserved 1/2 cup cooking water, a rounded 1/4 teaspoon salt, and 1/4 teaspoon pepper and boil over high heat, stirring once or twice, until thickened, about 4 minutes. Pour over pasta, then stir in Parmigiano-Reggiano, 1/2 cup mozzarella, and salt to taste. Spread evenly in baking dish and top with remaining mozzarella. Broil 3 to 4 inches from heat until golden brown in spots, about 5 minutes.",
            "Cook penne in a pasta pot of boiling salted water (2 tablespoons salt for 6 quarts water) until al dente. Reserve 1/2 cup pasta-cooking water, then drain pasta and transfer to a flameproof 3-quart baking dish.",
            "Preheat broiler.",
            "Meanwhile, cook sausage in 1 tablespoon oil in a 12-inch nonstick skillet over high heat, stirring occasionally and breaking up any large pieces, until no longer pink. Transfer with a slotted spoon to a bowl, leaving fat in skillet.",
            "Add remaining tablespoon oil to skillet along with mushrooms and garlic, then cook over high heat, stirring occasionally, until mushrooms are golden, about 3 minutes.",
            "Return sausage to skillet along with cream, reserved 1/2 cup cooking water, a rounded 1/4 teaspoon salt, and 1/4 teaspoon pepper and boil over high heat, stirring once or twice, until thickened, about 4 minutes. Pour over pasta, then stir in Parmigiano-Reggiano, 1/2 cup mozzarella, and salt to taste. Spread evenly in baking dish and top with remaining mozzarella.",
            "Broil 3 to 4 inches from heat until golden brown in spots, about 5 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54becba32a4b69f8647ef2a7/6:4/w_274%2Ch_169/sausage-mushroom-penne-gratin-6x4.jpg"
    }
}