{
    "recipe": {
        "title": "Sausage, Roasted Red Pepper, and Spinach Torta Rustica ",
        "ingredients": [
            "16 1/4-inch-thick baguette slices, cut on slight diagonal",
            "1 tablespoon butter",
            "12 ounces fresh baby spinach leaves",
            "1 pound sweet Italian sausage, casing removed",
            "1 1/2 cups grated Fontina cheese, divided",
            "3/4 cup diced drained roasted red peppers (from 12-ounce jar)",
            "6 large eggs",
            "1 cup heavy whipping cream",
            "1 cup whole milk",
            "1 teaspoon coarse kosher salt",
            "1/4 teaspoon ground black pepper"
        ],
        "instructions": [
            "Preheat oven to 350°F. Butter 8x8x2-inch baking dish. Place 8 baguette slices in bottom of dish; press 2 baguette slices onto each side. Melt 1 tablespoon butter in large pot over medium-high heat. Add spinach; toss until just wilted, about 3 minutes. Transfer spinach to strainer; cool. Squeeze spinach dry. Transfer to medium bowl. Heat same pot over medium-high heat. Add sausage. Sauté until cooked through, breaking up, about 7 minutes. Mix into spinach; mix in 1 cup cheese and peppers. Spread atop baguette slices in bottom of dish. Whisk eggs in medium bowl to blend. Whisk in last 4 ingredients. Pour over spinach mixture and stir lightly with fork to distribute evenly. Sprinkle remaining 1/2 cup cheese over. Bake torta until puffed and golden and center is set, about 55 minutes. Remove from oven and let rest 15 minutes before serving.",
            "Preheat oven to 350°F. Butter 8x8x2-inch baking dish. Place 8 baguette slices in bottom of dish; press 2 baguette slices onto each side. Melt 1 tablespoon butter in large pot over medium-high heat. Add spinach; toss until just wilted, about 3 minutes. Transfer spinach to strainer; cool. Squeeze spinach dry. Transfer to medium bowl.",
            "Heat same pot over medium-high heat. Add sausage. Sauté until cooked through, breaking up, about 7 minutes. Mix into spinach; mix in 1 cup cheese and peppers. Spread atop baguette slices in bottom of dish. Whisk eggs in medium bowl to blend.",
            "Whisk in last 4 ingredients. Pour over spinach mixture and stir lightly with fork to distribute evenly. Sprinkle remaining 1/2 cup cheese over. Bake torta until puffed and golden and center is set, about 55 minutes. Remove from oven and let rest 15 minutes before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d7966f3a00aeb2f1cb7c1/6:4/w_274%2Ch_169/350774_hires.jpg"
    }
}