{
    "recipe": {
        "title": "Sautéed Fillet of Skate with Caramelized Apples and Chicken Liver ",
        "ingredients": [
            "4 1/2 tablespoons butter",
            "1 onion, finely diced",
            "3 tablespoons brandy",
            "3/4 cup chicken stock",
            "1/2 teaspoon salt",
            "Black pepper to taste",
            "2 1/2 tablespoons neutral-flavored vegetable oil",
            "1 1/2 tablespoons butter",
            "1 1/2 cup finely diced Granny Smith apples",
            "2 1/2 tablespoons sugar",
            "Pinch of salt",
            "4 tablespoons neutral-flavored vegetable oil",
            "1 tablespoon butter",
            "6 ounces chicken livers, finely diced",
            "4 (5 1/2-ounce) fillets skate",
            "Salt and black pepper to taste",
            "Wondra flour",
            "1 lemon, halved",
            "1 tablespoon chopped fresh chives"
        ],
        "instructions": [
            "Make the sauce: Heat a saucepan over high heat. Add 3 tablespoons of the butter and swirl. Add the onion and lower the heat to medium. Cook, stirring occasionally, until golden brown. Add the brandy, then the stock, and bring to a boil. Cook until reduced by one third, then swirl in the remaining 1 1/2 tablespoons butter. Season with the salt and pepper and keep warm.",
            "Heat a saucepan over high heat. Add 3 tablespoons of the butter and swirl. Add the onion and lower the heat to medium. Cook, stirring occasionally, until golden brown. Add the brandy, then the stock, and bring to a boil. Cook until reduced by one third, then swirl in the remaining 1 1/2 tablespoons butter. Season with the salt and pepper and keep warm.",
            "Make the apples: Heat a sauté pan over high heat and add the oil. When just smoking, add the butter and apples and sauté for about a minute. Add the sugar and salt and cook until caramelized. Remove to a warm plate.",
            "Heat a sauté pan over high heat and add the oil. When just smoking, add the butter and apples and sauté for about a minute. Add the sugar and salt and cook until caramelized. Remove to a warm plate.",
            "Make the chicken livers and skate: Heat two large sauté pans over high heat. Add 1 tablespoon oil and the butter to one pan and 3 tablespoons oil to the other. On a plate, season the livers and skate with salt and pepper and dust lightly with Wondra. When the oil in the pans is smoking, add the livers to the pan with the butter and the skate, whitest side down, to the other pan. Lower the heat to medium-high and cook until golden brown. Turn the skate and finish cooking on the other side. Squeeze lemon juice over the fish.",
            "Heat two large sauté pans over high heat. Add 1 tablespoon oil and the butter to one pan and 3 tablespoons oil to the other. On a plate, season the livers and skate with salt and pepper and dust lightly with Wondra. When the oil in the pans is smoking, add the livers to the pan with the butter and the skate, whitest side down, to the other pan. Lower the heat to medium-high and cook until golden brown. Turn the skate and finish cooking on the other side. Squeeze lemon juice over the fish.",
            "To serve: Pour some sauce in the center of a serving plate, followed by the skate. Top with the chicken livers, apples, and chives.",
            "Pour some sauce in the center of a serving plate, followed by the skate. Top with the chicken livers, apples, and chives."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b27ecca801766f773f74bc/6:4/w_274%2Ch_169/368810_skate-_1x1.jpg"
    }
}