{
    "recipe": {
        "title": "Sautéed Cod With Lentils ",
        "ingredients": [
            "1 cup (7 ounces) dried lentils (preferably French green lentils often called lentilles du Puy)",
            "2 tablespoons unsalted butter",
            "1 cup finely chopped onion (1 large)",
            "2 large garlic cloves, chopped",
            "3/4 teaspoon salt",
            "3 tablespoons chopped fresh flat-leaf parsley",
            "1 tablespoon fresh lemon juice",
            "1/4 teaspoon black pepper",
            "1 tablespoon extra-virgin olive oil plus additional (optional) for drizzling",
            "4 (5- to 6-ounces) pieces cod fillet (3/4 to 1 inch thick)",
            "1/2 teaspoon salt",
            "1/8 teaspoon black pepper",
            "1 tablespoon unsalted butter",
            "1 tablespoon olive oil",
            "Garnish: lemon wedges; chopped fresh flat-leaf parsley"
        ],
        "instructions": [
            "Cover lentils with cold water by 1 1/2 inches in a 2-quart saucepan and bring to a boil. Simmer, uncovered, until lentils are just tender, 12 to 25 minutes. Drain in a sieve set over a bowl and reserve 1/2 cup cooking liquid.",
            "While lentils are simmering, melt butter in a 2- to 3-quart heavy saucepan over moderately low heat, then stir in onion, garlic, and salt and cook, covered, stirring occasionally, until pale golden, about 10 minutes. Remove lid and cook, uncovered, stirring occasionally, until golden, 5 to 10 minutes more.",
            "Stir in lentils and enough reserved cooking liquid to moisten (1/4 to 1/2 cup) and cook until heated through.",
            "Just before serving, stir in parsley, lemon juice, pepper, and 1 tablespoon oil.",
            "Cook fish while onion finishes cooking: Pat fish dry and sprinkle with salt and pepper. Heat butter and oil in a 10- to 12-inch nonstick skillet over moderately high heat until foam subsides, then sauté fish, turning over once, until browned and just cooked through, 6 to 8 minutes total. Serve fish with lentils and drizzle with additional extra-virgin olive oil if desired.",
            "Pat fish dry and sprinkle with salt and pepper.",
            "Heat butter and oil in a 10- to 12-inch nonstick skillet over moderately high heat until foam subsides, then sauté fish, turning over once, until browned and just cooked through, 6 to 8 minutes total.",
            "Serve fish with lentils and drizzle with additional extra-virgin olive oil if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/575082d4d598caa51ac24cb0/6:4/w_274%2Ch_169/1004-GT-GE03-01.jpg"
    }
}