{
    "recipe": {
        "title": "Sauteed Radicchio, Orange, Bacon, and Pecan Salad ",
        "ingredients": [
            "1 cup pecans",
            "4 navel oranges",
            "2 heads radicchio (about 3/4 pound)",
            "4 thick bacon slices",
            "3 tablespoons extra-virgin olive oil",
            "1/4 cup Sherry vinegar or balsamic vinegar",
            "freshly ground black pepper to taste"
        ],
        "instructions": [
            "Preheat oven to 350° F. In a baking pan toast pecans in one layer in middle of oven until golden and fragrant, about 10 minutes. With a sharp knife cut peel and pith from oranges and cut orange sections free from membranes. Discard outer leaves from radicchio and halve lengthwise. Cut radicchio crosswise into 1/8-inch-thick slices. Cut bacon into 1/2-inch pieces and in a 12-inch heavy skillet cook over moderate heat, stirring, until just golden. With a slotted spoon transfer bacon to a large bowl. Pour off fat from skillet and in skillet heat oil over moderately high heat until hot but not smoking. Saut radicchio, stirring, until wilted, about 5 minutes. Reduce heat to moderate and stir in vinegar. Cook radicchio, stirring, 1 minute more. Transfer radicchio to bowl and toss with bacon, nuts, and pepper. Season salad with salt.",
            "Preheat oven to 350° F.",
            "In a baking pan toast pecans in one layer in middle of oven until golden and fragrant, about 10 minutes. With a sharp knife cut peel and pith from oranges and cut orange sections free from membranes. Discard outer leaves from radicchio and halve lengthwise. Cut radicchio crosswise into 1/8-inch-thick slices.",
            "Cut bacon into 1/2-inch pieces and in a 12-inch heavy skillet cook over moderate heat, stirring, until just golden. With a slotted spoon transfer bacon to a large bowl. Pour off fat from skillet and in skillet heat oil over moderately high heat until hot but not smoking. Saut radicchio, stirring, until wilted, about 5 minutes. Reduce heat to moderate and stir in vinegar. Cook radicchio, stirring, 1 minute more. Transfer radicchio to bowl and toss with bacon, nuts, and pepper. Season salad with salt.",
            "Serve salad topped with orange sections.",
            "Serve salad topped with orange sections."
        ],
        "picture_link": null
    }
}