{
    "recipe": {
        "title": "Savory Pumpkin Pie Soup with Cinnamon Marshmallows, Pepita Streusel, and Whipped Crème Fraîche ",
        "ingredients": [
            "10 whole cloves",
            "2 whole star anise",
            "1 stick cinnamon",
            "2 whole allspice berries",
            "5 whole black peppercorns",
            "1 (1 1/2-inch) piece fresh ginger, cut into 4 pieces",
            "4 tablespoons (1/2 stick) unsalted butter",
            "1 medium onion, diced",
            "5 cloves garlic, thinly sliced",
            "2 stalks celery, diced",
            "1 medium leek (white and pale green parts only), thoroughly washed and diced",
            "3 (15-ounce) cans solid-pack pumpkin (not pie filling)",
            "1/2 teaspoon freshly ground nutmeg",
            "1/2 cup mini marshmallows",
            "1/4 teaspoon ground cinnamon",
            "3/4 cup all-purpose flour",
            "1/2 cup packed light brown sugar",
            "1 teaspoon kosher salt",
            "8 tablespoons (1 stick) cold unsalted butter, cut into 1/2-inch pieces",
            "1/2 cup untoasted, unsalted pepitas (pumpkin seeds), coarsely chopped",
            "1/2 cup heavy cream",
            "1 cup crème fraîche",
            "2 (8-inch) squares cheesecloth; kitchen string; blender; 1 large baking sheet; parchment paper"
        ],
        "instructions": [
            "Wrap the cloves, star anise, cinnamon stick, allspice berries, peppercorns, and fresh ginger in cheesecloth and secure with kitchen string.",
            "In a large heavy pot over moderate heat, melt the butter. Add the onions, garlic, celery, and leeks and sauté until translucent, 5 to 6 minutes. Add the pumpkin, 2 quarts water, and the spice package and bring to a boil. Reduce the heat to moderately low and simmer uncovered until the vegetables are tender, about 30 minutes.",
            "Remove and discard the spice package. Working in small batches, ladle the soup into a blender and purée until smooth. Transfer to a clean large pot then sprinkle with nutmeg and season with salt and pepper. Cover and keep warm until ready to serve. DO AHEAD: Soup can be made in advance and refrigerated, in an airtight container, up to 3 days. Reheat in a large pot over moderate heat, stirring occasionally.",
            "Make the cinnamon marshmallows: In a large bowl or resealable plastic bag, combine marshmallows and cinnamon and gently toss to coat the marshmallows in cinnamon. DO AHEAD: Marshmallows can be prepared in advance and stored, in a resealable plastic bag or an airtight container at room temperature, up to 3 days.",
            "In a large bowl or resealable plastic bag, combine marshmallows and cinnamon and gently toss to coat the marshmallows in cinnamon. DO AHEAD: Marshmallows can be prepared in advance and stored, in a resealable plastic bag or an airtight container at room temperature, up to 3 days.",
            "Make the pepita streusel: Arrange a rack in the middle of the oven and preheat to 350°F. Line a large baking sheet with parchment paper. In a large bowl, whisk together the flour, brown sugar, and salt. Add the butter and, using your hands, rub the ingredients together until the texture resembles coarse cornmeal. Add the pepitas and toss to combine. Spread the mixture on the prepared baking sheet and bake until golden brown, 10 to 12 minutes. Transfer the streusel to a rack to cool, then break it into roughly 1-inch pieces. DO AHEAD: Streusel can be made in advance and stored, in an airtight container at room temperature, up to 3 days.",
            "Arrange a rack in the middle of the oven and preheat to 350°F. Line a large baking sheet with parchment paper.",
            "In a large bowl, whisk together the flour, brown sugar, and salt. Add the butter and, using your hands, rub the ingredients together until the texture resembles coarse cornmeal. Add the pepitas and toss to combine. Spread the mixture on the prepared baking sheet and bake until golden brown, 10 to 12 minutes. Transfer the streusel to a rack to cool, then break it into roughly 1-inch pieces. DO AHEAD: Streusel can be made in advance and stored, in an airtight container at room temperature, up to 3 days.",
            "Make the whipped crème fraîche: In a medium bowl, combine the heavy cream and crème fraîche. Whisk until light and fluffy. Season with salt and pepper. DO AHEAD: Whipped crème fraîche can be made in advance and refrigerated, in an airtight container, up to 2 hours.",
            "In a medium bowl, combine the heavy cream and crème fraîche. Whisk until light and fluffy. Season with salt and pepper. DO AHEAD: Whipped crème fraîche can be made in advance and refrigerated, in an airtight container, up to 2 hours.",
            "To serve: Ladle the warm soup into bowls and garnish with the streusel, marshmallows, and dollops of whipped crème fraîche.",
            "Ladle the warm soup into bowls and garnish with the streusel, marshmallows, and dollops of whipped crème fraîche."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b284d49a93d64c380b1106/6:4/w_274%2Ch_169/368718_pumpkin-pie-soup_1x1.jpg",
        "color": 3334215
    }
}