{
    "recipe": {
        "title": "Scandinavian Seafood Salad ",
        "ingredients": [
            "6 fingerling potatoes or 2 Yukon Gold potatoes",
            "2 cups (about 10 ounces) cooked and peeled small shrimp",
            "1 1/2 cups finely chopped smoked salmon (10 ounces)",
            "1 1/2 cups (about 10 ounces) crabmeat, picked through for shells and cartilage",
            "4 hard-cooked eggs, finely chopped",
            "2 shallots, finely chopped",
            "2 anchovy fillets, finely chopped",
            "1 tablespoon finely chopped fresh cilantro",
            "1 tablespoon finely chopped fresh chives",
            "1/2 cup freshly squeezed lime juice",
            "3 tablespoons mayonnaise",
            "2 tablespoons sour cream",
            "Kosher salt and freshly ground black pepper",
            "2 small heads iceberg lettuce, cored, separated into leaves, washed, and patted dry"
        ],
        "instructions": [
            "1. Preheat the oven to 400°F. 2. Roast the potatoes for 30 to 40 minutes, until fork tender. Let cool until you can handle them, then peel and cut into 1/2-inch dice. 3. Combine the potatoes, shrimp, smoked salmon, crabmeat, eggs, shallots, anchovies, cilantro, and chives in a large bowl. In a small bowl, combine the lime juice, mayonnaise, and sour cream, stirring to blend well. Gently fold into the salad and season with salt and pepper to taste. 4. Arrange the lettuce leaves on a platter and serve alongside the salad. Instruct your guests to roll up 2 tablespoons or so of salad in a lettuce leaf, like a spring roll, and eat.",
            "1. Preheat the oven to 400°F.",
            "2. Roast the potatoes for 30 to 40 minutes, until fork tender. Let cool until you can handle them, then peel and cut into 1/2-inch dice.",
            "3. Combine the potatoes, shrimp, smoked salmon, crabmeat, eggs, shallots, anchovies, cilantro, and chives in a large bowl. In a small bowl, combine the lime juice, mayonnaise, and sour cream, stirring to blend well. Gently fold into the salad and season with salt and pepper to taste.",
            "4. Arrange the lettuce leaves on a platter and serve alongside the salad. Instruct your guests to roll up 2 tablespoons or so of salad in a lettuce leaf, like a spring roll, and eat."
        ],
        "picture_link": null
    }
}