{
    "recipe": {
        "title": "Scandinavian Ceviche ",
        "ingredients": [
            "1 grapefruit",
            "1/2 avocado",
            "4 ounces pre sliced gravlax (or smoked salmon)",
            "2 tbsp finely diced red onion"
        ],
        "instructions": [
            "1. Fillet the grapefruit by first cutting off the peel so that the citrus flesh is exposed. Then cut out the fillets by angling the knife and cutting by the natural partings. The fillets come out in half moon shapes. Cut the fillets into 1/2 inch pieces.",
            "2. Peel and chop the red onion coarsely. Peel the avocado and cut into 1/2 inch cubes. Do the same with the salmon slices.",
            "3. Mix all the ingredients in a plastic bowl or plastic bag. Let the mixture soak for at least an hour in the fridge.",
            "Serving tip! Serve the ceviche in shot glasses with a teaspoon. Ceviche tastes best cool, so serve the shot glasses on a deep tray filled with ice.",
            "Serve the ceviche in shot glasses with a teaspoon. Ceviche tastes best cool, so serve the shot glasses on a deep tray filled with ice.",
            "Simplify: This dish keeps well in the refrigerator and can be prepared up to twenty-four hours beforehand; the citrus juice ensures the avocado doesn't turn brown and dull.",
            "This dish keeps well in the refrigerator and can be prepared up to twenty-four hours beforehand; the citrus juice ensures the avocado doesn't turn brown and dull.",
            "For a challenge: Make a more traditional ceviche by using raw fish, shrimp, or scallops. Use lime juice instead of grapefruit, and add chopped tomatoes and cilantro. Use white fish, such as cod or snapper. Always freeze the fish for at least 3 days before you use it to kill any possible parasites.",
            "Make a more traditional ceviche by using raw fish, shrimp, or scallops. Use lime juice instead of grapefruit, and add chopped tomatoes and cilantro. Use white fish, such as cod or snapper. Always freeze the fish for at least 3 days before you use it to kill any possible parasites."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d786e7b55306961bf33d0/6:4/w_274%2Ch_169/242389.jpg",
        "color": 4550780
    }
}