{
    "recipe": {
        "title": "Scotch Egg ",
        "ingredients": [
            "6 large eggs",
            "1 cup all-purpose flour",
            "1 cup finely crushed corn flakes",
            "7 ounces (3/4 cup) fresh breakfast sausage, casings removed (if necessary)",
            "Vegetable oil (for frying)",
            "Kosher salt, freshly ground pepper",
            "Mustard",
            "A deep-fry thermometer"
        ],
        "instructions": [
            "Place 4 eggs in a small saucepan; add cold water to cover. Bring to a boil; remove from heat, cover, and let stand for 3 minutes. Carefully drain, then fill pan with ice water to cool eggs. Gently crack shells and carefully peel under cold running water. Place eggs in a bowl of cold water; cover and chill until cold. DO AHEAD: Can be made 1 day ahead. Keep chilled.",
            "Place flour in a wide shallow bowl and crushed corn flakes in another wide shallow bowl. Divide sausage into 4 equal portions. Pat 1 portion of sausage into a thin patty over the length of your palm. Lay 1 soft-boiled egg on top of sausage and wrap sausage around egg, sealing to completely enclose. Repeat with remaining sausage and eggs.",
            "Whisk remaining 2 eggs in a medium bowl to blend. Working gently with 1 sausage wrapped egg at a time, dip eggs into flour, shaking off excess, then coat in egg wash. Roll in corn flakes to coat. DO AHEAD: Can be made 1 day ahead. Keep refrigerated, uncovered.",
            "Attach a deep-fry thermometer to side of a large heavy pot. Pour in oil to a depth of 2\" and heat over medium heat to 375°F. Fry eggs, turning occasionally and maintaining oil temperature of 350°F, until sausage is cooked through and breading is golden brown and crisp, 5-6 minutes. Use a slotted spoon to transfer eggs to paper towels to drain. Season lightly with salt and pepper. Serve warm with mustard."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56043ac67c9cb37c518d5d1b/6:4/w_274%2Ch_169/380611_hires.jpg",
        "color": 14126665
    }
}