{
    "recipe": {
        "title": "Sea Urchin Mousse with Ginger Vinaigrette ",
        "ingredients": [
            "1/2 teaspoon unflavored gelatin (from 1 envelope)",
            "1/2 cup cooled vegetable broth",
            "1 (4-oz) tray uni (sea urchin roe)",
            "1 large egg yolk",
            "1/4 teaspoon salt",
            "1/2 teaspoon fresh lemon juice",
            "Pinch of cayenne",
            "1/3 cup chilled heavy cream",
            "2 teaspoons finely grated (with a rasp) peeled fresh ginger",
            "2 teaspoons fresh lemon juice",
            "1/8 teaspoon salt",
            "3 tablespoons mild extra-virgin olive oil (preferably French)",
            "Garnish: chopped chives and thinly sliced cucumber",
            "an instant-read thermometer"
        ],
        "instructions": [
            "Sprinkle gelatin over broth in a small saucepan and let stand 1 minute to soften, then cook over moderate heat, stirring, until dissolved, 1 to 2 minutes.",
            "Force uni through a fine-mesh sieve into a bowl, scraping bottom of sieve occasionally.",
            "Whisk in yolk, salt, lemon juice, and cayenne, then add broth mixture, whisking. Return to saucepan and cook over moderately low heat, stirring constantly, until it registers 170°F on thermometer, 2 to 3 minutes. (Do not let simmer or egg will curdle.) Transfer mixture to a bowl set in a larger bowl of ice and cold water. Let stand, stirring occasionally, until mixture is cold and the consistency of raw egg whites, about 10 minutes.",
            "Beat cream with an electric mixer until it just holds soft peaks, then fold cream into uni mixture gently but thoroughly. Chill, covered, until set, about 1 hour.",
            "Make vinaigrette while mousse chills: Press hard on ginger in a small fine-mesh sieve set over a small bowl to extract 1 teaspoon juice (discard solids), then whisk in lemon juice and salt. Add oil in a slow stream, whisking until emulsified.",
            "Press hard on ginger in a small fine-mesh sieve set over a small bowl to extract 1 teaspoon juice (discard solids), then whisk in lemon juice and salt. Add oil in a slow stream, whisking until emulsified.",
            "To serve: Spoon 1/4 cup mousse onto each of 6 plates, then drizzle with some vinaigrette.",
            "Spoon 1/4 cup mousse onto each of 6 plates, then drizzle with some vinaigrette."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de5c1f9a84192308a7c7d/6:4/w_274%2Ch_169/232779.jpg"
    }
}