{
    "recipe": {
        "title": "Seared Whitefish with Sweet Corn, Kohlrabi, and Tomato Compote ",
        "ingredients": [
            "2 tablespoons plus 1 teaspoon extra-virgin olive oil",
            "4 shallots, sliced",
            "4 garlic cloves, sliced",
            "8 plum tomatoes, seeded and diced",
            "Kosher salt and freshly ground black pepper",
            "Sugar to taste",
            "1/4 cup chopped fresh basil leaves",
            "2 tablespoons chopped fresh thyme leaves",
            "4 small kohlrabi, leaves removed",
            "4 (6- to 8-ounce) boneless and skinless whitefish fillets",
            "2 tablespoons grapeseed oil",
            "2 ears white or yellow corn, kernels cut from the cob (about 1 cup), cobs reserved"
        ],
        "instructions": [
            "In a medium saucepan, heat 2 tablespoons of the olive oil over medium heat and add the shallots and garlic. Cover and cook the mixture until it is soft. Add the tomatoes, reduce the heat, and continue cooking uncovered until thickened. Season to taste with salt, pepper, and sugar. Stir in the chopped basil and thyme. The compote will be thick, like tomato jam.",
            "Bring a medium saucepan of salted water to a boil. Meanwhile, with a vegetable peeler, peel off the skin of the kohlrabi and discard; cut each kohlrabi into 1/2-inch wedges. Cook in the boiling water until the tip of a knife pierces through easily, about 10 minutes. Drain and set aside. Preheat the oven to 350°F. Pat the whitefish fillets dry and season generously with salt and pepper. In a large ovenproof skillet, heat the grapeseed oil over medium-high until almost smoking. Add the fish and cook on both sides until nicely browned, about 4 minutes per side. If necessary to finish cooking the fish, transfer the skillet to the oven for about 5 minutes, or until the fish is slightly firm to the touch. While the fish is cooking, heat the remaining teaspoon of olive oil in a sauté pan and cook the kohlrabi and corn to heat through, seasoning to taste with salt and pepper. Place the vegetables in the middle of warmed serving plates. Transfer the whitefish from the oven to the center of each plate, spoon a little compote over each fillet, and serve.",
            "Bring a medium saucepan of salted water to a boil. Meanwhile, with a vegetable peeler, peel off the skin of the kohlrabi and discard; cut each kohlrabi into 1/2-inch wedges. Cook in the boiling water until the tip of a knife pierces through easily, about 10 minutes. Drain and set aside.",
            "Preheat the oven to 350°F.",
            "Pat the whitefish fillets dry and season generously with salt and pepper. In a large ovenproof skillet, heat the grapeseed oil over medium-high until almost smoking. Add the fish and cook on both sides until nicely browned, about 4 minutes per side. If necessary to finish cooking the fish, transfer the skillet to the oven for about 5 minutes, or until the fish is slightly firm to the touch.",
            "While the fish is cooking, heat the remaining teaspoon of olive oil in a sauté pan and cook the kohlrabi and corn to heat through, seasoning to taste with salt and pepper.",
            "Place the vegetables in the middle of warmed serving plates. Transfer the whitefish from the oven to the center of each plate, spoon a little compote over each fillet, and serve."
        ],
        "picture_link": null
    }
}