{
    "recipe": {
        "title": "Seared Halloumi with Peanut Dukkah and Honey ",
        "ingredients": [
            "1/4 cup skinless raw peanuts",
            "2 Tbsp. toasted white sesame seeds",
            "1 Tbsp. black sesame seeds",
            "1 tsp. coriander seeds",
            "1 tsp. cumin seeds",
            "1/2 tsp. finely ground black pepper",
            "2 (8-oz.) packages Halloumi cheese",
            "1/4 cup (or more) extra-virgin olive oil",
            "1/4 cup honey, warmed",
            "A spice mill or mortar and pestle"
        ],
        "instructions": [
            "Preheat oven to 350°F. Toast peanuts on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes. Let cool. Crush with a mortar and pestle or finely chop. Transfer to a medium bowl, add both sesame seeds, and toss well. Toast coriander seeds and cumin seeds in a dry small skillet over medium heat, tossing often, until fragrant, about 2 minutes; let cool. Coarsely grind in spice mill or with mortar and pestle and add to peanut mixture along with pepper; mix dukkah well. Cut each piece of Halloumi in half on a diagonal. Working with 1 piece at time, place Halloumi cut side down on a cutting board and slice lengthwise into triangular planks. (You should have 12 total.) Pat dry with paper towels. Heat oil in a large heavy skillet, preferably cast iron, over medium-high. Working in batches and adding more oil as needed, cook Halloumi until golden brown, about 2 minutes per side. Transfer to fresh paper towels to drain. Arrange on a platter; drizzle with honey and sprinkle with some dukkah.",
            "Preheat oven to 350°F. Toast peanuts on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes. Let cool. Crush with a mortar and pestle or finely chop. Transfer to a medium bowl, add both sesame seeds, and toss well.",
            "Toast coriander seeds and cumin seeds in a dry small skillet over medium heat, tossing often, until fragrant, about 2 minutes; let cool. Coarsely grind in spice mill or with mortar and pestle and add to peanut mixture along with pepper; mix dukkah well.",
            "Cut each piece of Halloumi in half on a diagonal. Working with 1 piece at time, place Halloumi cut side down on a cutting board and slice lengthwise into triangular planks. (You should have 12 total.) Pat dry with paper towels.",
            "Heat oil in a large heavy skillet, preferably cast iron, over medium-high. Working in batches and adding more oil as needed, cook Halloumi until golden brown, about 2 minutes per side. Transfer to fresh paper towels to drain.",
            "Arrange on a platter; drizzle with honey and sprinkle with some dukkah.",
            "Do Ahead Dukkah can be made 2 weeks ahead. Store airtight at room temperature.",
            "Dukkah can be made 2 weeks ahead. Store airtight at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ba00b23fe44ba5462642045/6:4/w_274%2Ch_169/seared-halloumi-with-peanut-dukkah-and-honey-recipe-BA-091718.jpg"
    }
}