{
    "recipe": {
        "title": "Seared Bluefish with Charred Corn, Warm Tomato Salad ",
        "ingredients": [
            "4 6-ounce skin-on bluefish fillets, scaled",
            "1 1/4 teaspoon kosher salt, divided",
            "1 teaspoon freshly ground black pepper, divided",
            "4 tablespoons canola oil, divided",
            "1 tablespoon butter",
            "3 ears corn, shucked",
            "1 leek white, split, washed, thinly sliced",
            "1 teaspoon minced garlic",
            "1 cup sweet 100 cherry tomatoes, cut in half",
            "2 tablespoon extra virgin olive oil",
            "12 basil leaves, torn",
            "1 tablespoon sherry vinegar",
            "2 thinly sliced radishes",
            "1 lemon, halved",
            "Grill or grill pan"
        ],
        "instructions": [
            "Cook the bluefish: Preheat oven to 350°F. Season the bluefish with 1/2 teaspoon each salt and pepper. In a large, oven-safe skillet over medium-high heat, warm 2 tablespoons canola oil until hot and shimmering. Place the bluefish fillets skin side down in oil and do not move once in skillet. Allow the skin to become crispy, this should take about 90 seconds. Without moving the fillets, place the pan in the preheated oven for 5 to 7 minutes, until cooked through. Remove the skillet from the oven and drop the butter into the pan. As the butter begins to melt, baste the bluefish fillets. Remove from fillets from pan and set aside.",
            "Preheat oven to 350°F. Season the bluefish with 1/2 teaspoon each salt and pepper. In a large, oven-safe skillet over medium-high heat, warm 2 tablespoons canola oil until hot and shimmering. Place the bluefish fillets skin side down in oil and do not move once in skillet. Allow the skin to become crispy, this should take about 90 seconds. Without moving the fillets, place the pan in the preheated oven for 5 to 7 minutes, until cooked through. Remove the skillet from the oven and drop the butter into the pan. As the butter begins to melt, baste the bluefish fillets. Remove from fillets from pan and set aside.",
            "Make the charred corn: Preheat a grill or grill pan over high heat. Brush the corn with 1 tablespoon canola oil and season with 1/2 teaspoon each salt and pepper. Grill corn, giving a quarter turn about every 20 seconds, allowing the kernels to become slightly charred. Once charred, remove from heat. When cool enough to handle, slice the kernels off the cob. In a medium pan over medium-high heat, warm the remaining 1 tablespoon canola oil. Add the leek and garlic to the pan, cook until the leek begins to become transparent, about 45 seconds. Add the corn to the pan and heat through. Remove from heat and season with 1/4 teaspoon salt and 1/8 teaspoon pepper.",
            "Preheat a grill or grill pan over high heat. Brush the corn with 1 tablespoon canola oil and season with 1/2 teaspoon each salt and pepper. Grill corn, giving a quarter turn about every 20 seconds, allowing the kernels to become slightly charred. Once charred, remove from heat. When cool enough to handle, slice the kernels off the cob.",
            "In a medium pan over medium-high heat, warm the remaining 1 tablespoon canola oil. Add the leek and garlic to the pan, cook until the leek begins to become transparent, about 45 seconds. Add the corn to the pan and heat through. Remove from heat and season with 1/4 teaspoon salt and 1/8 teaspoon pepper.",
            "For the warm tomato salad: In a medium pan over medium-low heat, warm the tomatoes in the olive oil just until they begin to release their juices. Remove from heat. Fold in the torn basil, season with sherry vinegar, 1/4 teaspoon salt, and 1/8 teaspoon pepper. Just before serving fold in the sliced radishes.",
            "In a medium pan over medium-low heat, warm the tomatoes in the olive oil just until they begin to release their juices. Remove from heat. Fold in the torn basil, season with sherry vinegar, 1/4 teaspoon salt, and 1/8 teaspoon pepper. Just before serving fold in the sliced radishes.",
            "To serve: Place 3/4 cup of charred corn in the center of a plate. Top with seared bluefish and a generous squeeze of lemon juice over each fillet. Finish with a swoop of tomato salad around the plate.",
            "Place 3/4 cup of charred corn in the center of a plate. Top with seared bluefish and a generous squeeze of lemon juice over each fillet. Finish with a swoop of tomato salad around the plate."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b8768b4bf78b800d899fb3/6:4/w_274%2Ch_169/51243430_seared-bluefish-1_1x1.jpg"
    }
}