{
    "recipe": {
        "title": "Seared Mahi-Mahi with Green Gazpacho Sauce ",
        "ingredients": [
            "1 1/2 cups coarsely chopped English hothouse cucumber (about 1/2 large)",
            "3/4 cup coarsely chopped green onions",
            "1/2 cup coarsely chopped fresh cilantro",
            "5 1/2 tablespoons olive oil, divided",
            "1 1/2 tablespoons (or more) white balsamic vinegar",
            "2 1/2 teaspoons chopped seeded serrano chiles",
            "4 7-to 8-ounce mahi-mahi fillets",
            "1 1/2 teaspoons ground cumin",
            "6 ounces small red and yellow cherry, pear, or grape tomatoes, halved"
        ],
        "instructions": [
            "Combine cucumber, onions, cilantro, 4 1/2 tablespoons oil, 1 1/2 tablespoons vinegar, and chiles in processor. Using on/off turns, blend mixture until finely chopped. Transfer to bowl. Season with more vinegar, if desired, and salt and black pepper. Sprinkle fish fillets on both sides with salt, pepper, and cumin. Heat remaining 1 tablespoon oil in large nonstick skillet over medium-high heat. Add fish and cook 5 minutes. Turn over, cover, and cook until fish is just opaque in center, 4 to 5 minutes. Divide gazpacho sauce among 4 plates. Top each with 1 fish fillet. Scatter tomatoes atop and around fish and serve.",
            "Combine cucumber, onions, cilantro, 4 1/2 tablespoons oil, 1 1/2 tablespoons vinegar, and chiles in processor. Using on/off turns, blend mixture until finely chopped. Transfer to bowl. Season with more vinegar, if desired, and salt and black pepper.",
            "Sprinkle fish fillets on both sides with salt, pepper, and cumin. Heat remaining 1 tablespoon oil in large nonstick skillet over medium-high heat. Add fish and cook 5 minutes. Turn over, cover, and cook until fish is just opaque in center, 4 to 5 minutes.",
            "Divide gazpacho sauce among 4 plates. Top each with 1 fish fillet. Scatter tomatoes atop and around fish and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3e0a821388ef838b0c6cf/6:4/w_274%2Ch_169/354849_seared-mahi-mahi_1x1.jpg"
    }
}