{
    "recipe": {
        "title": "Seasoned Lentil Stew ",
        "ingredients": [
            "1/2 cup thoor dal (yellow pigeon peas) or dried yellow split peas, rinsed and drained",
            "3 1/2 cups water, divided",
            "1/8 teaspoon ground turmeric",
            "1/2 teaspoon tamarind concentrate (preferably Tamicon brand)",
            "2 tablespoons hot water",
            "1 tablespoon vegetable oil",
            "1/8 teaspoon fenugreek seeds",
            "1/8 teaspoon ground asafetida",
            "1 medium boiling potato, cut into 3/4-inch pieces",
            "1 small tomato, chopped",
            "1 small onion, chopped",
            "1/4 pound okra or green beans, trimmed and cut into thirds",
            "1 small fresh green chile, such as serrano, Thai, or jalapeño, slit lengthwise with stem end intact",
            "1/4 cup chopped cilantro",
            "4 teaspoons sambar powder (see Cooks' Notes)",
            "Salt",
            "Fresh lemon juice to taste"
        ],
        "instructions": [
            "Bring dal, 1 1/2 cups water, and turmeric to a boil in a small saucepan. Reduce heat to very low and cook, covered (check occasionally, and if mixture appears dried out, add up to about 1/4 cup water), until peas are soft and break when pressed with a spoon, about 30 minutes (45 minutes if using split peas).",
            "Meanwhile, dissolve tamarind concentrate in 2 tablespoons hot water, breaking it up with your fingers.",
            "Heat oil in a 4-quart heavy saucepan over medium-high heat until it shimmers, then cook fenugreek seeds and asafetida, stirring, until fenugreek seeds begin to brown, about 30 seconds. Stir in remaining 2 cups water, potato, vegetables, chile, cilantro, sambar powder, tamarind mixture, and 1 1/2 teaspoons salt. Bring to a boil, then simmer, uncovered, until all vegetables are tender, about 20 minutes.",
            "Mash dal in saucepan with a potato masher or back of a spoon to form a coarse paste, then stir into vegetable mixture. Simmer 10 minutes, stirring in water as necessary to thin (consistency should be thinner than pea soup). Season with salt and lemon juice."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b41332d5e8c3e1070b1350/6:4/w_274%2Ch_169/394649_lentil-stew_1x1.jpg",
        "color": 14520064
    }
}