{
    "recipe": {
        "title": "Semolina–Lemon Syrup Cakes ",
        "ingredients": [
            "1 1/2 cups almond flour or almond meal",
            "1/2 cup semolina flour",
            "3/4 teaspoon baking powder",
            "1/2 teaspoon kosher salt",
            "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
            "1 cup plus 2 tablespoons sugar",
            "1 teaspoon finely grated lemon zest",
            "3 large eggs, beaten to blend",
            "2 tablespoons fresh lemon juice",
            "1 teaspoon finely grated lemon zest",
            "6 tablespoons fresh lemon juice",
            "1/3 cup sugar"
        ],
        "instructions": [
            "Preheat oven to 350°F. Line the cups of a standard 12-cup muffin pan with paper liners. Whisk almond flour, semolina flour, baking powder, and salt in a medium bowl to combine.",
            "Using an electric mixer on high speed, beat butter, sugar, and lemon zest until very light and fluffy, about 5 minutes. With motor running, gradually add eggs and beat until glossy, about 1 minute. Add dry ingredients and lemon juice and beat to combine, about 1 minute.",
            "Divide batter among muffin cups and bake until cakes are golden brown and a tester inserted into the center comes out clean, 25–35 minutes.",
            "Make the syrup: Make the syrup while the cakes are baking. Bring lemon zest, lemon juice, and sugar to a boil in a small saucepan over medium heat, stirring to dissolve sugar; reduce heat and simmer 3 minutes. Remove from heat. As soon as cakes come out of the oven, brush or spoon syrup liberally over top (you may not need all of it). Transfer pan to a wire rack and let cakes cool completely before turning out.",
            "Make the syrup while the cakes are baking. Bring lemon zest, lemon juice, and sugar to a boil in a small saucepan over medium heat, stirring to dissolve sugar; reduce heat and simmer 3 minutes. Remove from heat.",
            "As soon as cakes come out of the oven, brush or spoon syrup liberally over top (you may not need all of it). Transfer pan to a wire rack and let cakes cool completely before turning out.",
            "Do Ahead Cakes can be made 2 days ahead. Store airtight at room temperature.",
            "Cakes can be made 2 days ahead. Store airtight at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57053dd607eafc8038cf2447/6:4/w_274%2Ch_169/0416-BA-MOTT-01.jpg"
    }
}