{
    "recipe": {
        "title": "Sesame Arctic Char Donabe ",
        "ingredients": [
            "2 (5x4\") pieces kombu",
            "6 oz. dried soba noodles",
            "2 tsp. toasted sesame oil, plus more for drizzling",
            "1 oz. bonito flakes (about 4 cups)",
            "1 bunch scallions",
            "1/3 cup mirin (sweet Japanese rice wine)",
            "2 Tbsp. soy sauce",
            "Kosher salt",
            "1 (1-lb.) skinless arctic char fillet",
            "2 small turnips, trimmed, scrubbed, thinly sliced",
            "1 small daikon, peeled, thinly sliced",
            "6 oz. enoki mushrooms, trimmed",
            "Toasted sesame seeds (for serving)"
        ],
        "instructions": [
            "Combine kombu and 4 1/2 cups cold water in a medium saucepan. Let sit until kombu is pliable, 25–30 minutes.",
            "Meanwhile, cook noodles according to package directions. Drain and rinse under cold water. Shake off excess water and toss noodles in a medium bowl with 2 tsp. oil. Divide among serving bowls and set aside.",
            "Bring kombu mixture to a boil over medium heat, then immediately remove pan from heat. Lift out kombu from broth with tongs and discard. Add bonito flakes to broth and stir once to moisten. Bring mixture to a simmer over medium, then reduce heat and simmer very gently 5 minutes. Let sit off heat 15 minutes. Strain dashi through a fine-mesh sieve into a large heatproof measuring glass or a medium bowl; discard solids. (You should have about 4 cups.)",
            "While the dashi is infusing, remove the dark green tops of the scallions from the white bulbs. Thinly slice tops and set aside for serving. Slice bulbs on a diagonal into 1/2\" pieces; set aside.",
            "Pour dashi into a large donabe or skillet and add mirin and soy sauce; season with salt. Place fish in the center of the skillet and arrange turnips, daikon, mushrooms, and reserved scallion bulbs around fish. Heat over low until liquid is steaming but not bubbling (simmering will make the liquid cloudy; reduce the heat if needed). Cook until fish looks opaque all across the surface, 10–15 minutes. Remove donabe from heat and let rest 5 minutes.",
            "To serve, sprinkle sesame seeds and reserved scallion tops over fish and vegetables and drizzle with more oil. Break fish into smaller pieces and divide among reserved noodle bowls. Ladle vegetables and dashi over.",
            "Do Ahead Dashi can be made 1 day ahead. Cover and chill.",
            "Dashi can be made 1 day ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aa2cd7b2133066cf9403e75/6:4/w_274%2Ch_169/sesame-arctic-char-donabe-recipe-BA-030918.jpg"
    }
}