{
    "recipe": {
        "title": "Sesame Pork Burgers with Sweet and Spicy Slaw ",
        "ingredients": [
            "1/2 cup mayonnaise",
            "1 Tbsp. rice or white vinegar",
            "1 Tbsp. Sriracha, hot chili paste (sambal oelek), or sweet Thai chili sauce (optional)",
            "2 tsp. sugar",
            "1 1/2 tsp. kosher salt, divided",
            "4 cups shredded cabbage",
            "4 scallions, thinly sliced",
            "1 lb. ground pork",
            "1 garlic clove, finely grated",
            "1 tsp. Sriracha, hot chili paste (sambal oelek), or sweet Thai chili sauce (optional)",
            "1 tsp. toasted sesame oil",
            "1/2 tsp. fish sauce",
            "1/4 cup cilantro leaves, finely chopped, plus more for serving",
            "1/2 tsp. kosher salt, plus more",
            "1 Tbsp. extra-virgin olive oil",
            "4 English muffins, toasted",
            "Freshly ground black pepper",
            "Bread-and-butter pickles or quick-pickled carrots (for serving; optional)"
        ],
        "instructions": [
            "Make the Slaw: Whisk mayonnaise, vinegar, Sriracha, sugar, and 1 tsp. salt in a large bowl. Transfer about 1/4 cup dressing to a small bowl; set aside. Add cabbage and scallions to remaining dressing and toss to evenly coat. Season with remaining 1/2 tsp. salt. Cover and chill both the salad and dressing until ready to serve. Do Ahead: Dressing and slaw can be made 8 hours ahead. Keep chilled.",
            "Whisk mayonnaise, vinegar, Sriracha, sugar, and 1 tsp. salt in a large bowl. Transfer about 1/4 cup dressing to a small bowl; set aside.",
            "Add cabbage and scallions to remaining dressing and toss to evenly coat. Season with remaining 1/2 tsp. salt. Cover and chill both the salad and dressing until ready to serve.",
            "Do Ahead: Dressing and slaw can be made 8 hours ahead. Keep chilled.",
            "Make the Burgers: Using your hands or a wooden spoon, mix pork, garlic, Sriracha (if using), sesame oil, fish sauce, 1/4 cup cilantro, and 1/2 tsp. salt in a large bowl until well combined. Shape pork mixture into 4 patties, slightly larger in diameter than English muffins (about 4\"). Heat olive oil in a large skillet over medium. Working in batches if necessary, fry patties until browned on both sides and cooked through, 6–8 minutes. Spread reserved dressing on muffins. Place a patty on bottom halves. Season with salt and pepper. Pile on some slaw, pickles, and cilantro, then close muffins. Serve with remaining slaw alongside. Do Ahead: Patties can be made 1 day ahead. Separate with parchment if stacking. Cover and chill, or freeze up to 1 month.",
            "Using your hands or a wooden spoon, mix pork, garlic, Sriracha (if using), sesame oil, fish sauce, 1/4 cup cilantro, and 1/2 tsp. salt in a large bowl until well combined.",
            "Shape pork mixture into 4 patties, slightly larger in diameter than English muffins (about 4\").",
            "Heat olive oil in a large skillet over medium. Working in batches if necessary, fry patties until browned on both sides and cooked through, 6–8 minutes.",
            "Spread reserved dressing on muffins. Place a patty on bottom halves. Season with salt and pepper. Pile on some slaw, pickles, and cilantro, then close muffins. Serve with remaining slaw alongside.",
            "Do Ahead: Patties can be made 1 day ahead. Separate with parchment if stacking. Cover and chill, or freeze up to 1 month."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5cb6041c3572782e652ccd3b/6:4/w_274%2Ch_169/Pork-Burgers-with-Crunchy-Quick-Pickled-Veg-recipe-100419.jpg"
    }
}