{
    "recipe": {
        "title": "Sesame-Citrus Crackers ",
        "ingredients": [
            "1 large egg",
            "1 tablespoon orange juice",
            "1/2 tablespoon fresh lemon juice",
            "1 1/2 cups all purpose flour",
            "1/2 cup sugar",
            "1/2 teaspoon salt",
            "1/2 teaspoon baking powder",
            "1/2 cup (1 stick) chilled unsalted butter, diced",
            "2 teaspoons sesame seeds",
            "1 teaspoon (packed) finely grated orange peel",
            "1/2 teaspoon (packed) finely grated lemon peel",
            "Whipping cream"
        ],
        "instructions": [
            "Preheat oven to 350°F. Line 2 rimmed baking sheets with parchment paper. Whisk egg, orange juice, and lemon juice in small bowl to blend. Whisk flour, sugar, salt, and baking powder in large bowl to blend; add butter. Rub in with fingertips until coarse meal forms. Mix in sesame seeds, orange peel, and lemon peel. Add egg mixture and toss until moist clumps form, adding cream by tablespoonfuls if dough is dry. Turn dough out onto floured work surface. Knead gently for several turns until dough comes together. Roll dough out on floured surface to 1/4-inch thickness. Using 2-inch round cutter, cut dough rounds. Gather dough scraps and reroll, cutting out more rounds. Arrange on prepared sheets. Bake until firm to touch and cooked through but pale, about 15 minutes.",
            "Preheat oven to 350°F. Line 2 rimmed baking sheets with parchment paper. Whisk egg, orange juice, and lemon juice in small bowl to blend. Whisk flour, sugar, salt, and baking powder in large bowl to blend; add butter. Rub in with fingertips until coarse meal forms. Mix in sesame seeds, orange peel, and lemon peel. Add egg mixture and toss until moist clumps form, adding cream by tablespoonfuls if dough is dry. Turn dough out onto floured work surface. Knead gently for several turns until dough comes together.",
            "Roll dough out on floured surface to 1/4-inch thickness. Using 2-inch round cutter, cut dough rounds. Gather dough scraps and reroll, cutting out more rounds. Arrange on prepared sheets. Bake until firm to touch and cooked through but pale, about 15 minutes."
        ],
        "picture_link": null
    }
}