{
    "recipe": {
        "title": "Set-It-and-Forget-It Roast Pork Shoulder ",
        "ingredients": [
            "1/4 cup black peppercorns",
            "3 tablespoons juniper berries",
            "1 tablespoons coriander seeds",
            "1/2 cup Diamond Crystal or 1/4 cup plus 1 1/2 tsp. Morton kosher salt",
            "3 tablespoons sugar",
            "1 (8–10-pound) skin-on, bone-in pork shoulder (Boston butt)",
            "5 sprigs rosemary",
            "10 garlic cloves, unpeeled, lightly crushed",
            "2 cups dry white wine",
            "Cranberry sauce, cornichons, and whole grain mustard (for serving)",
            "A spice mill or mortar and pestle"
        ],
        "instructions": [
            "Finely grind peppercorns, juniper berries, and coriander seeds in spice mill or with mortar and pestle; transfer to a small bowl and mix in salt and sugar.",
            "Set blade on a box cutter to about 1/3\" (or use a very sharp paring knife or X-Acto knife) and cut long parallel lines into the skin of pork shoulder, spacing about 3/4\" apart. You want to cut completely through the fat, getting as close to the meat as possible without slicing into it. Then, using a pair of kitchen shears, snip between rows to create a diamond-shape pattern, spacing about 3/4\" apart. Cutting a crosshatch design into the fat will help it cook out and allow the salt and spices to penetrate the meat.",
            "Rub entire shoulder with spice mixture, covering any exposed meat and pushing into cuts in fat. Try to get the spices into the fatty layer and not on the surface of the skin, where they may burn as the shoulder roasts. Make sure to use all of the spices, even though it may seem like a lot. Wrap shoulder tightly with plastic and chill at least 3 hours and up to 3 days.",
            "Place a rack in lower third of oven; preheat to 225°F. Line a rimmed baking sheet with 2 layers of heavy-duty foil (be generous with the foil unless you really enjoy scrubbing pots and pans after Thanksgiving dinner). Place rosemary sprigs and garlic in the center of baking sheet and set a wire rack on top. Set pork shoulder on rack and transfer to oven. Pour wine and 2 cups water into baking sheet and roast shoulder until meat is pulling away from the bone and skin is very dark, 9–10 hours (overnight is great).",
            "Let pork shoulder sit uncovered at room temperature until ready to serve (at least 30 minutes and up to 5 hours).",
            "Just before serving, reheat roast in a 350°F–400°F oven to soften fat and warm the surface of the roast (but don’t let it take on any more color), 5–10 minutes.",
            "Serve warm with cranberry sauce, cornichons, and mustard."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a05db0d0d874930000cee75/6:4/w_274%2Ch_169/set-it-and-forget-it-roast-pork-shoulder-recipe-BA-111017.jpg",
        "color": 13305737
    }
}