{
    "recipe": {
        "title": "Shabbat Mandarin Marble Loaf ",
        "ingredients": [
            "4 tablespoons unsweetened cocoa powder",
            "3 tablespoons warm vegetable oil",
            "1 cup vegetable oil",
            "2 1/4 cups granulated sugar",
            "5 eggs",
            "4 teaspoons vanilla extract",
            "1/4 cup water",
            "1 cup undiluted frozenange juice, defrosted",
            "zest of 1 orange, finely minced",
            "3 1/4 cups all-purpose flour",
            "1/2 teaspoon baking soda",
            "3 1/2 teaspoons baking powder",
            "1/2 teaspoon salt",
            "1/2 cup finely grated semi-sweet chocolate or miniature chocolate chips(optional)",
            "1 cup confectioners' sugar",
            "4-6 tablespoons orange juice",
            "Long shreds of orange zest (optional)"
        ],
        "instructions": [
            "Preheat the oven to 350°F. Generously grease a 10 inch tube or angel cake pan, a 12-cup bundt pan, or two 9 by 5-inch loaf pans. Line the bottom of the pan(s) with parchment paper. Prepare the chocolate paste by placing the cocoa and oil in a small bowl and blending well. Add a drop or more of oil if the mixture appears too stiff or thick to stir or blend easily. For the cake, in a large bowl, blend the oil with the sugar until light and fluffy, scraping the bowl often. Blend in the eggs and stir in the vanilla, water, orange juice, and zest. In a separate bowl, whisk together the flour, baking soda, baking powder, and salt. Add to the wet ingredients. Remove one third of the batter to a smaller bowl. Stir the chocolate paste into this to make a chocolate batter and add to this the grated chocolate or miniature chocolate chips. Spoon alternating portions of white and chocolate batter into the prepared pan. You can do this with a spatula or a soup spoon. It doesn't really matter how you place the batter in the pan — it works out in the baking. Bake the large cake for 55 to 60 minutes, smaller cakes for 35 to 40 minutes. The cake should be lightly browned on top, perhaps slightly cracked, and spring back when lightly pressed. Cool in the pan for 15 to 20 minutes before inverting onto a wire rack. Then either dust with confectioners' sugar or glaze. For the glaze, stir together the confectioners' sugar and orange juice to make a thick but pourable sauce. Drizzle this over the top of the cooled cake. Garnish with long shreds of orange zest, if desired.",
            "Preheat the oven to 350°F. Generously grease a 10 inch tube or angel cake pan, a 12-cup bundt pan, or two 9 by 5-inch loaf pans. Line the bottom of the pan(s) with parchment paper.",
            "Prepare the chocolate paste by placing the cocoa and oil in a small bowl and blending well. Add a drop or more of oil if the mixture appears too stiff or thick to stir or blend easily.",
            "For the cake, in a large bowl, blend the oil with the sugar until light and fluffy, scraping the bowl often. Blend in the eggs and stir in the vanilla, water, orange juice, and zest.",
            "In a separate bowl, whisk together the flour, baking soda, baking powder, and salt. Add to the wet ingredients.",
            "Remove one third of the batter to a smaller bowl. Stir the chocolate paste into this to make a chocolate batter and add to this the grated chocolate or miniature chocolate chips. Spoon alternating portions of white and chocolate batter into the prepared pan. You can do this with a spatula or a soup spoon. It doesn't really matter how you place the batter in the pan — it works out in the baking.",
            "Bake the large cake for 55 to 60 minutes, smaller cakes for 35 to 40 minutes. The cake should be lightly browned on top, perhaps slightly cracked, and spring back when lightly pressed. Cool in the pan for 15 to 20 minutes before inverting onto a wire rack. Then either dust with confectioners' sugar or glaze.",
            "For the glaze, stir together the confectioners' sugar and orange juice to make a thick but pourable sauce. Drizzle this over the top of the cooled cake. Garnish with long shreds of orange zest, if desired."
        ],
        "picture_link": null
    }
}