{
    "recipe": {
        "title": "Shaved Carrots with Charred Dates ",
        "ingredients": [
            "1 1/2 lb. purple or orange carrots, trimmed, scrubbed, shaved on a mandoline or very thinly sliced into rounds",
            "Kosher salt",
            "3 large blood oranges or 2 small grapefruits",
            "1/4 cup extra-virgin olive oil",
            "2 Tbsp. fresh lime juice",
            "2 Tbsp. unseasoned rice vinegar",
            "10 Medjool dates",
            "Tarragon leaves (for serving)"
        ],
        "instructions": [
            "Place carrots in a large bowl, season generously with salt, and toss to coat. Let sit at least 10 minutes and up to 1 hour to soften slightly. Pour off any liquid that collects in bowl.",
            "Meanwhile, cut peel and white pith from oranges. Working your way around, cut citrus flesh off cores in lobes. Cut each lobe into large pieces and place in a medium bowl. Squeeze cores over a small bowl to extract any juice (you want 2 Tbsp.; discard or drink any extra). Discard cores. Whisk oil, lime juice, and vinegar into orange juice; season with salt.",
            "Pour half of dressing over carrots and let sit, tossing occasionally, until ready to serve. Set remaining dressing aside.",
            "Heat a small skillet, preferably cast iron, over medium-high. Cook dates, turning occasionally, until blackened in spots, about 3 minutes. Let cool; remove pits.",
            "Just before serving, pour off excess liquid from carrots and discard (carrots will have softened by now). Drizzle reserved dressing over carrots and toss to coat. Tear dates into bite-size pieces and toss into carrots. Taste and season with more salt if needed. Top with tarragon.",
            "Do Ahead Carrots can be tossed with dressing 1 day ahead. Cover and chill carrots and remaining dressing separately.",
            "Carrots can be tossed with dressing 1 day ahead. Cover and chill carrots and remaining dressing separately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5be07fc27debaa2d33864705/6:4/w_274%2Ch_169/shaved-carrots-with-charred-dates-recipe-BA-110518.jpg",
        "color": 15242570
    }
}