{
    "recipe": {
        "title": "Sheet-Pan Curry Pork Chops and Sweet Potatoes ",
        "ingredients": [
            "4 tsp. mild curry powder",
            "1 tsp. freshly ground black pepper",
            "1 tsp. light brown sugar",
            "2 1/2 tsp. kosher salt, divided",
            "1 Tbsp. extra-virgin olive oil",
            "4 (1\"-thick) small bone-in pork chops (about 2 lb. total)",
            "8 small sweet potatoes (about 1 1/2 lb.), scrubbed, sliced in half lengthwise",
            "1 cup plain whole-milk Greek yogurt",
            "3 Tbsp. fresh lemon juice",
            "4 small radishes, thinly sliced",
            "1 cup pomegranate arils"
        ],
        "instructions": [
            "Arrange a rack in top third of oven; preheat to 450°F. Stir curry, pepper, brown sugar, and 2 tsp. salt in a small bowl.",
            "Rub an 18x13\" rimmed baking sheet with oil. Sprinkle pork chops and potatoes with spice mixture on prepared pan to evenly coat, then arrange in an even layer with potatoes cut side down.",
            "Roast until pork is golden brown and cooked through and potatoes are deeply browned on cut sides and fork-tender, about 20 minutes. (The pork might finish cooking before the potatoes do; if so, transfer pork to a cutting board and let rest, then continue roasting the potatoes until done.)",
            "Meanwhile, whisk yogurt, lemon juice, and remaining 1/2 tsp. salt in a medium bowl.",
            "Arrange pork and potatoes on a platter. Top with yogurt sauce, radishes, and pomegranate arils.",
            "Do Ahead: Yogurt sauce can be made 1 day ahead. Cover and chill.",
            "Cooks' Note Small sweet potatoes work best for cooking at the same rate as the pork chops and fitting on one sheet pan since you can tuck them between the chops. If you can’t find small sweet potatoes, use larger ones, cut them into wedges, and turn them halfway through roasting.",
            "Small sweet potatoes work best for cooking at the same rate as the pork chops and fitting on one sheet pan since you can tuck them between the chops. If you can’t find small sweet potatoes, use larger ones, cut them into wedges, and turn them halfway through roasting."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ba0117a48738b66252f2d2e/6:4/w_274%2Ch_169/Sheet-Pan-Curry-Pork-Chops-and-Sweet-Potatoes-13092018.jpg"
    }
}