{
    "recipe": {
        "title": "Sheet-Pan Brownie Thins ",
        "ingredients": [
            "1/2 cup (1 stick) unsalted butter, plus more for pan",
            "1 1/4 cups sugar",
            "3/4 cup unsweetened cocoa powder",
            "3/4 teaspoon vanilla extract",
            "1/4 teaspoon kosher salt",
            "2 cold large eggs",
            "1/2 cup all-purpose flour",
            "1 cup finely chopped walnuts, pecans, or mini chocolate chips"
        ],
        "instructions": [
            "Position a rack in center of oven; preheat to 325°F. Very generously butter an 18x13\" rimmed baking sheet (do not line with parchment). Melt remaining 1/2 cup butter in a small heatproof bowl in the microwave or set over a pot of barely simmering water. Mix sugar, cocoa powder, vanilla, and salt in a medium bowl. Pour butter over and stir until smooth. Add eggs one at a time, stirring vigorously with a wooden spoon or rubber spatula after each addition, until batter is thick, shiny, and smooth. Stir in flour until well incorporated, then beat vigorously for 30–40 strokes. Stir in nuts or chocolate chips. Using a spatula, spread batter into a thin, even layer to edges and into corners of prepared sheet (batter will seem scant but brownies will rise to about 1/4\" thick). Bake brownies until firm to the touch and a tester inserted into the center comes out with moist crumbs (not runny batter) attached, 15–18 minutes. Transfer to a wire rack and let cool completely. Cut into 36 pieces and serve.",
            "Position a rack in center of oven; preheat to 325°F. Very generously butter an 18x13\" rimmed baking sheet (do not line with parchment).",
            "Melt remaining 1/2 cup butter in a small heatproof bowl in the microwave or set over a pot of barely simmering water. Mix sugar, cocoa powder, vanilla, and salt in a medium bowl. Pour butter over and stir until smooth. Add eggs one at a time, stirring vigorously with a wooden spoon or rubber spatula after each addition, until batter is thick, shiny, and smooth. Stir in flour until well incorporated, then beat vigorously for 30–40 strokes. Stir in nuts or chocolate chips.",
            "Using a spatula, spread batter into a thin, even layer to edges and into corners of prepared sheet (batter will seem scant but brownies will rise to about 1/4\" thick).",
            "Bake brownies until firm to the touch and a tester inserted into the center comes out with moist crumbs (not runny batter) attached, 15–18 minutes.",
            "Transfer to a wire rack and let cool completely. Cut into 36 pieces and serve.",
            "Do Ahead Brownies can be made 5 days ahead. Store in an airtight container at room temperature, or freeze up to 6 months.",
            "Brownies can be made 5 days ahead. Store in an airtight container at room temperature, or freeze up to 6 months."
        ],
        "picture_link": "https://assets.epicurious.com/photos/590b95360143f0435eca7ab1/6:4/w_274%2Ch_169/Crispy-Brownie-Thins-03052017.jpg"
    }
}