{
    "recipe": {
        "title": "Sheet-Pan Cider-Ricotta Pancakes with Pear Compote ",
        "ingredients": [
            "4 Bartlett pears (about 2 lb.), coarsely chopped",
            "1/4 cup unsweetened apple cider",
            "3 Tbsp. fresh lemon juice",
            "3 Tbsp. honey",
            "3/4 tsp. ground cinnamon",
            "1/4 tsp. kosher salt",
            "Butter or nonstick vegetable oil spray (for pan)",
            "1 cup old-fashioned oats",
            "1 1/2 cups unsweetened apple cider",
            "2 1/2 cups all-purpose flour",
            "3 tsp. baking powder",
            "1 tsp. baking soda",
            "1 tsp. kosher salt",
            "4 large eggs",
            "2 1/2 cups whole-milk ricotta",
            "1/4 cup honey",
            "1 Tbsp. finely grated lemon zest",
            "Powdered sugar (optional, for serving)"
        ],
        "instructions": [
            "Combine pears, cider, lemon juice, honey, cinnamon, and salt in a medium saucepan. Cover and heat over medium-high. When mixture starts to boil (about 5 minutes), stir and reduce heat to medium-low. Cover again and simmer, uncovering and stirring occasionally, until pears are softened, about 15 minutes.",
            "Using a potato masher, mash until pears are a chunky purée. Continue to cook, uncovered, stirring occasionally, until liquid is mostly evaporated and compote is the consistency of chunky applesauce, 25–30 minutes. Let cool.",
            "Do Ahead: Compote can be made 5 days ahead. Transfer to an airtight container and chill.",
            "For the pancakes: Preheat oven to 350°F. Butter an 18x13\" rimmed sheet pan. Line with parchment, then butter parchment. Mix oats and cider in a medium bowl. Whisk flour, baking powder, baking soda, and salt in another medium bowl to combine. Whisk eggs, ricotta, honey, and lemon zest in a large bowl to combine, making sure eggs are fully incorporated. Add one-third of dry ingredients to egg mixture and whisk to combine. Add half of cider mixture to egg mixture and whisk again. Add half of remaining dry ingredients and whisk to combine. Add remaining cider mixture and whisk to combine yet again. Using a rubber scraper, fold remaining dry ingredients into batter just until combined. Pour batter into prepared pan and spread evenly into corners with a spatula. Dollop tablespoonfuls of pear compote across top of batter. Stick a butter knife or skewer straight down into batter and drag through compote in a figure-eight motion to create a swirling pattern. Bake pancake until top is golden brown and center springs back when pressed with a finger, 35–40 minutes. Let pancake cool at least 10 minutes. Dust with powdered sugar, if using, then cut into 16 pieces. Do Ahead: Pancakes can be made 5 days ahead. Transfer to an airtight container and chill, or freeze up to 3 months. To reheat, heat sliced pancake in a toaster oven until warmed through, about 8 minutes (10 minutes if frozen); or wrap in a damp paper towel and microwave about 30 seconds (60 seconds if frozen).",
            "Preheat oven to 350°F. Butter an 18x13\" rimmed sheet pan. Line with parchment, then butter parchment.",
            "Mix oats and cider in a medium bowl.",
            "Whisk flour, baking powder, baking soda, and salt in another medium bowl to combine.",
            "Whisk eggs, ricotta, honey, and lemon zest in a large bowl to combine, making sure eggs are fully incorporated. Add one-third of dry ingredients to egg mixture and whisk to combine. Add half of cider mixture to egg mixture and whisk again. Add half of remaining dry ingredients and whisk to combine. Add remaining cider mixture and whisk to combine yet again. Using a rubber scraper, fold remaining dry ingredients into batter just until combined.",
            "Pour batter into prepared pan and spread evenly into corners with a spatula.",
            "Dollop tablespoonfuls of pear compote across top of batter. Stick a butter knife or skewer straight down into batter and drag through compote in a figure-eight motion to create a swirling pattern.",
            "Bake pancake until top is golden brown and center springs back when pressed with a finger, 35–40 minutes.",
            "Let pancake cool at least 10 minutes. Dust with powdered sugar, if using, then cut into 16 pieces.",
            "Do Ahead: Pancakes can be made 5 days ahead. Transfer to an airtight container and chill, or freeze up to 3 months. To reheat, heat sliced pancake in a toaster oven until warmed through, about 8 minutes (10 minutes if frozen); or wrap in a damp paper towel and microwave about 30 seconds (60 seconds if frozen)."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5be311e2df6e992d81eced70/6:4/w_274%2Ch_169/Healthy-Sheet-Pan-Pancakes-01112018.jpg",
        "color": 5346546
    }
}