{
    "recipe": {
        "title": "Sheet-Pan Chicken Meatballs and Charred Broccoli ",
        "ingredients": [
            "2/3 cup ketchup",
            "1/4 cup Worcestershire sauce",
            "2 Tbsp. rice cooking wine or water",
            "2 Tbsp. honey",
            "4 tsp. soy sauce",
            "1 1/2\" piece ginger, peeled, finely grated",
            "1/2 tsp. freshly ground black pepper",
            "2 heads of broccoli (about 1 1/2 lb.)",
            "2 Tbsp. vegetable oil, divided",
            "2 1/2 tsp. kosher salt, divided",
            "Crushed red pepper flakes (optional)",
            "1 lb. ground chicken",
            "1 large egg, beaten to blend",
            "4 scallions, thinly sliced",
            "2 garlic cloves, finely grated",
            "1 (2\") piece ginger, peeled, finely grated",
            "1/3 cup panko (Japanese breadcrumbs)",
            "1 Tbsp. toasted sesame oil",
            "1/4 tsp. freshly ground black pepper",
            "Cooked rice and sesame seeds (for serving)"
        ],
        "instructions": [
            "Mix ketchup, Worcestershire sauce, wine (if using), honey, soy sauce, ginger, and pepper in a small saucepan. Measure out 1/4 cup mixture into a small bowl; set aside for glazing meatballs later. Bring remaining mixture to a simmer over medium-high heat, stirring occasionally and reducing heat if needed, until sauce thickens, about 5 minutes. Transfer sauce to a small bowl.",
            "Meatballs and assembly Place a rack in upper third of oven; preheat to 450°F. Line a rimmed baking sheet with foil. Trim broccoli stems and remove from crown. Peel off tough outer skin; slice crosswise into 1/2\" pieces. Cut florets into 2\" pieces. Toss on prepared baking sheet with 1 Tbsp. vegetable oil, 1 tsp. salt, and a few pinches of red pepper flakes (if using). Push to the edges of baking sheet to create a space for meatballs. Brush space with remaining 1 Tbsp. vegetable oil. Mix chicken, egg, scallions, garlic, ginger, panko, sesame oil, pepper, remaining 1 1/2 tsp. salt, and 1/4 cup water in a medium bowl. Using wet hands, form into twelve 1 1/2\"-diameter meatballs. Arrange on baking sheet; brush with some of the reserved glazing mixture. Bake until meatballs are cooked through, 14–18 minutes. Remove from oven; heat broiler. Brush meatballs with remaining glazing mixture; broil until broccoli is charred and meatballs are browned in spots, about 5 minutes. Spoon meatballs and broccoli over rice in bowl. Drizzle with sauce and sprinkle with sesame seeds.",
            "Place a rack in upper third of oven; preheat to 450°F. Line a rimmed baking sheet with foil. Trim broccoli stems and remove from crown. Peel off tough outer skin; slice crosswise into 1/2\" pieces. Cut florets into 2\" pieces. Toss on prepared baking sheet with 1 Tbsp. vegetable oil, 1 tsp. salt, and a few pinches of red pepper flakes (if using). Push to the edges of baking sheet to create a space for meatballs. Brush space with remaining 1 Tbsp. vegetable oil.",
            "Mix chicken, egg, scallions, garlic, ginger, panko, sesame oil, pepper, remaining 1 1/2 tsp. salt, and 1/4 cup water in a medium bowl. Using wet hands, form into twelve 1 1/2\"-diameter meatballs. Arrange on baking sheet; brush with some of the reserved glazing mixture. Bake until meatballs are cooked through, 14–18 minutes. Remove from oven; heat broiler. Brush meatballs with remaining glazing mixture; broil until broccoli is charred and meatballs are browned in spots, about 5 minutes.",
            "Spoon meatballs and broccoli over rice in bowl. Drizzle with sauce and sprinkle with sesame seeds."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c892997b8df0b1a61bf751f/6:4/w_274%2Ch_169/sheet-pan-chicken-meatballs-and-broccoli-recipe-BA-030419.jpg",
        "color": 6687394
    }
}