{
    "recipe": {
        "title": "Sheet-Pan Spaghetti Squash Puttanesca ",
        "ingredients": [
            "1 large spaghetti squash (3 1/2–4 pounds)",
            "Kosher salt, freshly ground black pepper",
            "Nonstick vegetable cooking spray",
            "1 oil-packed anchovy fillet, drained, finely chopped (optional)",
            "1 garlic clove, finely chopped",
            "12 ounces cherry tomatoes (about 2 cups)",
            "1 pint shiitake mushrooms, stemmed, quartered (about 1 1/2 cups)",
            "1/4 cup pitted oil-cured black olives, chopped",
            "1 tablespoon drained capers",
            "1/2 teaspoon crushed red pepper flakes",
            "3 tablespoons olive oil, divided",
            "1/4 cup pine nuts",
            "1/4 cup coarsely chopped fresh basil, divided",
            "1/4 cup coarsely chopped fresh parsley, divided",
            "1/2 cup ricotta",
            "An 18x13\" rimmed baking sheet"
        ],
        "instructions": [
            "Position rack in center of oven and preheat to 375°F. Halve squash lengthwise and scoop out seeds. Season inside of squash with salt and pepper. Coat baking sheet with cooking spray; lay halves cut side down on sheet and bake 30 minutes. Meanwhile, combine anchovy (if using), garlic, tomatoes, mushrooms, olives, capers, red pepper flakes, and 2 Tbsp. oil in a large bowl. Remove baking sheet from oven and transfer tomato mixture to sheet alongside squash. Return to oven and cook until squash is tender and shell is easily pierced, about 15 minutes more. Meanwhile, toast pine nuts in a dry small skillet over medium-low heat, tossing often, until golden brown, about 4 minutes. Immediately transfer to a plate; set aside. Remove sheet from oven. Scrape squash crosswise to pull strands from shells into a medium bowl; discard shells. Using the back of a fork or spoon, gently push down on tomatoes on sheet to break them up and release their juices. Scrape tomato mixture and any accumulated juices into bowl with squash. Add remaining 1 Tbsp. oil, then toss with half of basil, parsley, and reserved pine nuts. Divide among bowls and dollop with ricotta. Garnish with remaining basil, parsley, and pine nuts.",
            "Position rack in center of oven and preheat to 375°F. Halve squash lengthwise and scoop out seeds. Season inside of squash with salt and pepper. Coat baking sheet with cooking spray; lay halves cut side down on sheet and bake 30 minutes.",
            "Meanwhile, combine anchovy (if using), garlic, tomatoes, mushrooms, olives, capers, red pepper flakes, and 2 Tbsp. oil in a large bowl. Remove baking sheet from oven and transfer tomato mixture to sheet alongside squash. Return to oven and cook until squash is tender and shell is easily pierced, about 15 minutes more.",
            "Meanwhile, toast pine nuts in a dry small skillet over medium-low heat, tossing often, until golden brown, about 4 minutes. Immediately transfer to a plate; set aside.",
            "Remove sheet from oven. Scrape squash crosswise to pull strands from shells into a medium bowl; discard shells. Using the back of a fork or spoon, gently push down on tomatoes on sheet to break them up and release their juices. Scrape tomato mixture and any accumulated juices into bowl with squash. Add remaining 1 Tbsp. oil, then toss with half of basil, parsley, and reserved pine nuts. Divide among bowls and dollop with ricotta. Garnish with remaining basil, parsley, and pine nuts."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55d623b0d2acf5b8473aed5c/6:4/w_274%2Ch_169/EP_08182015_-sheetpandinners_speghettisquash.jpg"
    }
}