{
    "recipe": {
        "title": "Sheet-Pan Skirt Steak With Balsamic Vinaigrette, Broccolini, and White Beans ",
        "ingredients": [
            "4 garlic cloves, divided",
            "1/2 cup balsamic vinegar",
            "3 tablespoons Dijon mustard",
            "1/2 cup plus 2 tablespoons extra-virgin olive oil, divided",
            "2 tablespoons chopped fresh oregano leaves, divided",
            "1 1/2 teaspoons kosher salt, divided",
            "3/4 teaspoon freshly ground black pepper, divided",
            "1 (1 1/2-pound) skirt steak, cut crosswise into 2 equal pieces",
            "1 bunch broccolini (about 10 ounces), trimmed, halved lengthwise (quartered lengthwise if large)",
            "1 (15-ounce) can white beans, rinsed, drained",
            "An ovenproof wire rack that fits inside an 18x13\" rimmed baking sheet"
        ],
        "instructions": [
            "Finely chop 2 garlic cloves. Place in a large bowl or shallow baking dish, then whisk in vinegar, Dijon, 1/2 cup oil, 1 Tbsp. oregano, 1 tsp. salt, and 1/2 tsp. pepper. Reserve 1/4 cup vinaigrette for serving; add steak to remaining vinaigrette and turn to coat. Let marinate at least 15 minutes or up to 1 hour. Meanwhile, preheat broiler and thinly slice remaining 2 garlic cloves. Toss broccolini, remaining 2 Tbsp. oil, 1 Tbsp. oregano, 1/2 tsp. salt, and 1/4 tsp. pepper on rimmed baking sheet. Broil 5 minutes, then remove from oven. Add beans and garlic and toss to combine. Set wire rack on top of broccolini mixture. Place steak on rack; discard vinaigrette. Broil steak, turning halfway through, until cooked to desired doneness, about 3 minutes per side for medium-rare. Let steak rest 5 minutes. Meanwhile, transfer broccolini mixture to a medium bowl and toss with 1 Tbsp. reserved vinaigrette, then divide among 4 plates. Thinly slice steak against the grain and serve with broccolini mixture and remaining vinaigrette alongside.",
            "Finely chop 2 garlic cloves. Place in a large bowl or shallow baking dish, then whisk in vinegar, Dijon, 1/2 cup oil, 1 Tbsp. oregano, 1 tsp. salt, and 1/2 tsp. pepper. Reserve 1/4 cup vinaigrette for serving; add steak to remaining vinaigrette and turn to coat. Let marinate at least 15 minutes or up to 1 hour.",
            "Meanwhile, preheat broiler and thinly slice remaining 2 garlic cloves. Toss broccolini, remaining 2 Tbsp. oil, 1 Tbsp. oregano, 1/2 tsp. salt, and 1/4 tsp. pepper on rimmed baking sheet. Broil 5 minutes, then remove from oven. Add beans and garlic and toss to combine. Set wire rack on top of broccolini mixture. Place steak on rack; discard vinaigrette.",
            "Broil steak, turning halfway through, until cooked to desired doneness, about 3 minutes per side for medium-rare. Let steak rest 5 minutes. Meanwhile, transfer broccolini mixture to a medium bowl and toss with 1 Tbsp. reserved vinaigrette, then divide among 4 plates. Thinly slice steak against the grain and serve with broccolini mixture and remaining vinaigrette alongside.",
            "Do Ahead Vinaigrette can be made up to 3 days ahead.",
            "Vinaigrette can be made up to 3 days ahead."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55d623b8edfa3b0053969ee1/6:4/w_274%2Ch_169/EP_08182015_sheetpandinners_steak.jpg"
    }
}