{
    "recipe": {
        "title": "Sherried Winter Squash Bisque ",
        "ingredients": [
            "2 tablespoons olive oil",
            "1 medium onion, chopped",
            "1 2-pound butternut squash, peeled, cubed (about 6 cups)",
            "1 14 1/2-ounce can diced tomatoes, drained",
            "2 tablespoons dry Sherry",
            "2 1/2 cups (or more) canned vegetable broth",
            "2/3 cup nonfat milk",
            "2 tablespoons chopped fresh thyme or 2 teaspoons dried",
            "Nonfat plain yogurt",
            "Fresh thyme sprigs"
        ],
        "instructions": [
            "Heat olive oil in heavy large saucepan over medium-high heat. Add chopped onion and sauté until translucent, about 5 minutes. Add butternut squash and sauté until beginning to brown, about 10 minutes. Add tomatoes and Sherry. Boil until almost all liquid evaporates, about 30 seconds. Stir in 2 1/2 cups vegetable broth. Bring to boil. Reduce heat, cover and simmer until squash it very tender, stirring occasionally, about 30 minutes. Puree soup in blender in batches until smooth. Return soup to same saucepan. Stir in milk and chopped thyme. Bring to simmer. Season soup to taste with salt and pepper. (Can be prepared 1 day ahead. Cover tightly and refrigerate. Bring soup to simmer before serving, thinning with more broth, if desired.)",
            "Heat olive oil in heavy large saucepan over medium-high heat. Add chopped onion and sauté until translucent, about 5 minutes. Add butternut squash and sauté until beginning to brown, about 10 minutes. Add tomatoes and Sherry. Boil until almost all liquid evaporates, about 30 seconds. Stir in 2 1/2 cups vegetable broth. Bring to boil. Reduce heat, cover and simmer until squash it very tender, stirring occasionally, about 30 minutes.",
            "Puree soup in blender in batches until smooth. Return soup to same saucepan. Stir in milk and chopped thyme. Bring to simmer. Season soup to taste with salt and pepper. (Can be prepared 1 day ahead. Cover tightly and refrigerate. Bring soup to simmer before serving, thinning with more broth, if desired.)",
            "Ladle soup into bowls. Top with dollop of yogurt. Garnish with thyme sprigs.",
            "Ladle soup into bowls. Top with dollop of yogurt. Garnish with thyme sprigs."
        ],
        "picture_link": null
    }
}