{
    "recipe": {
        "title": "Short Ribs Slow-Roasted in Coconut Milk ",
        "ingredients": [
            "1/3 cup unsweetened coconut flakes",
            "3 lb. (1 1/2–2\"-thick) cross-cut beef short ribs (flanken style; well-marbled works best)",
            "Kosher salt",
            "2 lemongrass stalks",
            "1 shallot, chopped",
            "4 garlic cloves",
            "2 red Fresno chiles or jalapeños, seeds removed",
            "1 (1\") piece ginger, peeled, finely grated",
            "1 (13.5-oz.) can unsweetened coconut milk",
            "1 Tbsp. curry powder",
            "1 cup cilantro leaves with tender stems",
            "2 Tbsp. fresh lime juice",
            "Steamed white rice (for serving)"
        ],
        "instructions": [
            "Place a rack in middle of the oven; preheat to 250°F. Spread out coconut flakes on a rimmed baking sheet and toast until golden, 10–15 minutes. Let cool.",
            "Meanwhile, season beef generously with salt and set aside. Trim top three-quarters from lemongrass stalks and place top portions in a large cast-iron skillet or heavy roasting pan. Peel outer layers from root end and finely grate into a blender. Add shallot, garlic, chiles, ginger, coconut milk, and curry powder; purée until smooth.",
            "Arrange short ribs, bone side up, in skillet; pour purée over. Roast until meat is halfway to tender and liquid is reduced by two-thirds (it will look slightly oily and broken, and this is exactly what you want), 3–3 1/2 hours. Turn ribs onto their sides and continue to roast, adding water by 1/4-cupfuls if liquid in skillet looks in danger of burning or getting very dark, until meat is fork-tender and liquid is a jammy glaze, 2–2 1/2 hours longer.",
            "Toss coconut, cilantro, lime juice, and a pinch of salt in a small bowl. Top short ribs with gremolata and serve with rice."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aa0123f8a0b867cab500b0f/6:4/w_274%2Ch_169/short-ribs-slow-roasted-in-coconut-milk-recipe-BA-030718.jpg",
        "color": 1924052
    }
}