{
    "recipe": {
        "title": "Shrimp and Coconut Rolls ",
        "ingredients": [
            "10 ounces peeled cooked shrimp, cut into 1/4- to 1/3-inch pieces",
            "2 1/2 cups thinly sliced iceberg lettuce (about 1/4 large head)",
            "1 1/4 cups finely grated peeled fresh coconut",
            "1/2 unpeeled English hothouse cucumber, seeded, cut into 1/4-inch cubes (1 cup)",
            "1 tablespoon plus 1/2 cup fresh lime juice",
            "6 teaspoons fish sauce (such as nam pla or nuoc nam),* divided",
            "4 1/2 teaspoons sugar, divided",
            "3 teaspoons minced seeded red or green serrano chiles, divided",
            "2 tablespoons finely chopped green onion",
            "2 teaspoons chopped fresh mint leaves",
            "15 8- to 9-inch-diameter rice paper rounds (spring roll wrappers)**"
        ],
        "instructions": [
            "Combine shrimp, lettuce, coconut, cucumber, 1 tablespoon lime juice, 4 teaspoons fish sauce, 1/2 teaspoon sugar, 2 teaspoons chiles, green onion, and mint in large bowl.",
            "Moisten kitchen towel. Squeeze out excess moisture and lay towel flat on work surface. Fill large bowl with warm water. Submerge 1 wrapper in water until beginning to soften, about 20 seconds. Place on damp towel. Place 1/4 cup shrimp mixture in 3-inch long strip down center of wrapper. Fold in sides of wrapper over filling, then roll up tightly, enclosing filling. Repeat with remaining wrappers and filling. DO AHEAD: Can be made 8 hours ahead. Place on baking sheet lined with parchment paper, cover with damp paper towels, and refrigerate. Let rolls stand at room temperature 10 to 15 minutes before serving.",
            "Mix 1/2 cup lime juice, 2 teaspoons fish sauce, 4 teaspoons sugar, and 1 teaspoon chiles in small bowl. Serve rolls with dipping sauce.",
            "* Available in the Asian foods section of most supermarkets, at some specialty foods stores, and at Asian markets.",
            "* Available in the Asian foods section of most supermarkets, at some specialty foods stores, and at Asian markets.",
            "** Thin Thai or Vietnamese wrappers (known as banh trang) made from rice flour; available at Asian markets.",
            "** Thin Thai or Vietnamese wrappers (known as banh trang) made from rice flour; available at Asian markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d784df3a00aeb2f1cb510/6:4/w_274%2Ch_169/242117_hires.jpg"
    }
}