{
    "recipe": {
        "title": "Shrimp and Andouille Pot Pies ",
        "ingredients": [
            "1 sheet frozen puff pastry (half of 16-ounce packag e all-butter puff pastry or half of 17.3-ounce package regular puff pastry), thawed",
            "1/2 cup heavy whipping cream",
            "2 tablespoons all purpose flour",
            "1 tablespoon butter",
            "3 1/2 cups sliced leeks (white and pale green parts only; from 3 large)",
            "1/2 pound andouille sausage, cut into scant 1/2-inch cubes",
            "2 large garlic cloves, minced",
            "1/3 cup dry vermouth or dry white wine",
            "1 1.5-ounce package concentrated classic seafood stock (such as Glace de Fruits de Mer Gold) mixed with 2 cups water; or 2 cups bottled clam juice",
            "1/4 teaspoon dried thyme",
            "1 8-ounce red-skinned potato, peeled, cut into 1/2-inch cubes",
            "1 1/2 pounds deveined peeled uncooked jumbo shrimp, cut into 1-inch pieces"
        ],
        "instructions": [
            "Preheat oven to 400°F. Roll out pastry on floured surface to 12-inch square. Cut out four 5 1/2-inch rounds. Place on parchment-lined baking sheet; bake until golden, about 15 minutes. Cool on sheet. DO AHEAD: Can be made 1 day ahead. Wrap airtight and store at room temperature.",
            "Preheat oven to 400°F. Whisk cream and flour in small bowl. Melt butter in large skillet over medium heat. Add leeks and sauté until tender, about 10 minutes. Add andouille and garlic and sauté 4 minutes. Add vermouth; simmer until liquid evaporates, about 3 minutes. Add seafood stock mixture and thyme. Bring to simmer. Add potato and cook uncovered until tender, about 6 minutes.",
            "Add cream mixture to skillet; stir. Simmer until sauce thickens and boils, about 3 minutes. Reduce heat. Add shrimp; simmer until just opaque in center, about 3 minutes. Season with salt and pepper.",
            "Divide hot filling among four 1 1/4-cup baking dishes. Top each with pastry round. Bake until filling bubbles, about 5 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a4f262fa7a9917c25788/6:4/w_274%2Ch_169/351529_hires.jpg",
        "color": 13724866
    }
}