{
    "recipe": {
        "title": "Shrimp and Daikon Salad with Ume-Shiso Dressing ",
        "ingredients": [
            "1 (10-ounce) piece daikon radish, peeled",
            "3/4 pound medium shrimp, peeled",
            "1 tablespoon vegetable oil",
            "3 tablespoons mirin (Japanese sweet rice wine)",
            "1 1/2 tablespoons rice vinegar (not seasoned)",
            "2 1/4 teaspoons umeboshi plum vinegar",
            "2 tablespoons umeboshi plum paste",
            "1 1/2 teaspoons reduced-sodium soy sauce",
            "3/4 teaspoon packed light brown sugar",
            "4 1/2 tablespoons vegetable oil",
            "3 tablespoons finely chopped green shiso leaves (about 9)",
            "an adjustable-blade slicer; a large (2-burner) ridged grill pan (preferably cast-iron)"
        ],
        "instructions": [
            "Prepare daikon and shrimp for Salad: Using slicer, cut daikon lengthwise into very thin slices (see cooks' note, below). Soak in a bowl of lightly salted cold water, chilled, 30 minutes. While daikon soaks, toss shrimp with oil and 1/8 teaspoon pepper. Heat grill pan over medium-high heat until hot, then cook shrimp, turning once, until just cooked through, 2 to 4 minutes total. Transfer to a plate.",
            "Using slicer, cut daikon lengthwise into very thin slices (see cooks' note, below). Soak in a bowl of lightly salted cold water, chilled, 30 minutes.",
            "While daikon soaks, toss shrimp with oil and 1/8 teaspoon pepper. Heat grill pan over medium-high heat until hot, then cook shrimp, turning once, until just cooked through, 2 to 4 minutes total. Transfer to a plate.",
            "Make dressing: Whisk together mirin, vinegars, plum paste, soy sauce, and brown sugar in a medium bowl. Add oil in a slow stream, whisking. Stir in shiso leaves.",
            "Whisk together mirin, vinegars, plum paste, soy sauce, and brown sugar in a medium bowl. Add oil in a slow stream, whisking. Stir in shiso leaves.",
            "Assemble salad: Stir shrimp into dressing. Drain daikon well. Rinse and pat dry, then divide among 6 plates. Using a slotted spoon, top with shrimp. Serve drizzled with some of remaining dressing.",
            "Stir shrimp into dressing. Drain daikon well. Rinse and pat dry, then divide among 6 plates. Using a slotted spoon, top with shrimp. Serve drizzled with some of remaining dressing."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d785d7b55306961bf33a8/6:4/w_274%2Ch_169/242291_hires.jpg"
    }
}