{
    "recipe": {
        "title": "Shrimp and Hearts of Palm Rémoulade ",
        "ingredients": [
            "1/2 cup loosely packed flat-leaf parsley leaves",
            "1 celery stalk, coarsely chopped",
            "1 small shallot, coarsely chopped",
            "1 garlic clove, peeled",
            "1 cup mayonnaise",
            "2 tablespoons whole grain mustard",
            "1 tablespoon prepared horseradish",
            "1 tablespoon fresh lemon juice",
            "1/2 teaspoon paprika",
            "1/2 teaspoon Worcestershire sauce",
            "1 onion, quartered",
            "4 sprigs thyme",
            "2 bay leaves",
            "1 tablespoon kosher salt plus more",
            "1 teaspoon yellow mustard seeds",
            "1 teaspoon whole black peppercorns plus freshly ground black pepper",
            "2 celery stalks, 1 coarsely chopped, 1 thinly sliced on the diagonal",
            "2 pounds uncooked unpeeled large shrimp",
            "1 14-ounce can hearts of palm, drained, sliced on the diagonal",
            "Butter lettuce leaves",
            "Lemon wedges"
        ],
        "instructions": [
            "Pulse the first four ingredients in a food processor until finely chopped. Add mayonnaise, mustard, horseradish, lemon juice, paprika, and Worcestershire sauce; process until smooth. DO AHEAD: Can be made 3 days ahead. Cover and chill.",
            "For shrimp: Combine the first 5 ingredients, peppercorns, chopped celery stalk, and 4 quarts (16 cups) water in a large heavy pot. Bring to a boil. Add shrimp and simmer for 3 minutes. Remove pot from heat and steep shrimp until just cooked through, about 5 minutes. Transfer shrimp to a rimmed baking sheet; let cool. Peel and devein shrimp. DO AHEAD: Can be made 1 day ahead. Cover; chill. Toss shrimp and rémoulade in a large bowl to coat. Cover and chill at least 2 hours. Fold hearts of palm and sliced celery into shrimp. Season with salt and pepper. Serve on lettuce leaves with lemon wedges.",
            "Combine the first 5 ingredients, peppercorns, chopped celery stalk, and 4 quarts (16 cups) water in a large heavy pot. Bring to a boil. Add shrimp and simmer for 3 minutes. Remove pot from heat and steep shrimp until just cooked through, about 5 minutes. Transfer shrimp to a rimmed baking sheet; let cool. Peel and devein shrimp. DO AHEAD: Can be made 1 day ahead. Cover; chill.",
            "Toss shrimp and rémoulade in a large bowl to coat. Cover and chill at least 2 hours.",
            "Fold hearts of palm and sliced celery into shrimp. Season with salt and pepper. Serve on lettuce leaves with lemon wedges."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b40bc52413537c0d45969d/6:4/w_274%2Ch_169/380638_shrimp-remoulade_1x1.jpg"
    }
}