{
    "recipe": {
        "title": "Shrimp in Spiced Phyllo with Tomato Chutney ",
        "ingredients": [
            "1/2 stick (1/4 cup) unsalted butter",
            "2 teaspoons minced peeled fresh ginger",
            "2 teaspoons minced shallot",
            "1/2 teaspoon minced garlic",
            "2 tablespoons sugar",
            "1 cup peeled, seeded, and chopped tomatoes",
            "2 teaspoons tomato paste",
            "2 teaspoons fresh lime juice",
            "1/2 cup chopped fresh cilantro",
            "1/3 cup hazelnuts, toasted and finely chopped",
            "2 tablespoons curry powder",
            "6 (17- by 12-inch) phyllo sheets",
            "1 stick (1/2 cup) unsalted butter, melted",
            "30 large shrimp, shelled and deveined"
        ],
        "instructions": [
            "Preheat oven to 375°F.",
            "Make chutney: Heat butter in a 10-inch skillet over moderately high heat, then sauté ginger, shallot, and garlic, stirring, 1 minute. Add remaining chutney ingredients and cook over moderate heat, stirring, 4 minutes.",
            "Heat butter in a 10-inch skillet over moderately high heat, then sauté ginger, shallot, and garlic, stirring, 1 minute. Add remaining chutney ingredients and cook over moderate heat, stirring, 4 minutes.",
            "Make shrimp rolls: Stir together nuts and curry powder. Cover stack of phyllo with 2 overlapping sheets of plastic wrap, then a damp kitchen towel. Remove 1 phyllo sheet, place on a work surface and brush well with butter. Sprinkle with one sixth spice mixture. Stack 2 more phyllo sheets on top, buttering each and sprinkling each with spice mixture. Cut spiced phyllo stack lengthwise into 5 strips, then cut each crosswise in thirds to make 15 (5 1/2- by 2 1/4-inch) rectangles. Place 1 shrimp lengthwise on short end of 1 strip and roll up, leaving head and tail exposed; then roll up 14 more shrimp. Arrange, seams down, 1/2-inch apart, on a buttered baking sheet. Make 15 more hors d'oeuvres with remaining (unused) phyllo sheets, butter, spice mixture, and shrimp and arrange on baking sheet. Brush tops of rolls with some of remaining butter and bake in middle of oven until phyllo is golden and shrimp are cooked, about 12 minutes. Serve shrimp rolls with chutney.",
            "Stir together nuts and curry powder.",
            "Cover stack of phyllo with 2 overlapping sheets of plastic wrap, then a damp kitchen towel.",
            "Remove 1 phyllo sheet, place on a work surface and brush well with butter. Sprinkle with one sixth spice mixture.",
            "Stack 2 more phyllo sheets on top, buttering each and sprinkling each with spice mixture.",
            "Cut spiced phyllo stack lengthwise into 5 strips, then cut each crosswise in thirds to make 15 (5 1/2- by 2 1/4-inch) rectangles.",
            "Place 1 shrimp lengthwise on short end of 1 strip and roll up, leaving head and tail exposed; then roll up 14 more shrimp. Arrange, seams down, 1/2-inch apart, on a buttered baking sheet.",
            "Make 15 more hors d'oeuvres with remaining (unused) phyllo sheets, butter, spice mixture, and shrimp and arrange on baking sheet.",
            "Brush tops of rolls with some of remaining butter and bake in middle of oven until phyllo is golden and shrimp are cooked, about 12 minutes.",
            "Serve shrimp rolls with chutney."
        ],
        "picture_link": null
    }
}