{
    "recipe": {
        "title": "Shrimp Enchiladas with Roasted Sweet Potatoes and Parsnips ",
        "ingredients": [
            "1/2 teaspoon cumin seeds",
            "1 pound parsnips, peeled, cut into 1/2-inch cubes",
            "12 ounces red-skinned sweet potatoes (yams; about 2 small), peeled, cut into 1/2-inch cubes",
            "1/2 red onion, sliced (about 1 1/2 cups)",
            "5 tablespoons vegetable oil, divided",
            "1 teaspoon chili powder",
            "1/2 teaspoon dried oregano (preferably Mexican)",
            "1 teaspoon coarse kosher salt",
            "1 large garlic clove, peeled",
            "1 small jalapeño chile, halved, seeded",
            "2 cups coarsely chopped fresh cilantro",
            "1 cup chopped green onions (about 6)",
            "1 4-ounce can diced green chiles (preferably fire-roasted), drained",
            "2 cups purchased salsa verde or mild tomatillo salsa",
            "1/2 cup crema mexicana, crème fraîche, or sour cream, divided",
            "8 ounces cooked peeled deveined shrimp, coarsely chopped",
            "12 5 1/2- to 6-inch-diameter corn tortillas",
            "8 ounces crumbled queso fresco or feta cheese (about 2 cups)"
        ],
        "instructions": [
            "Preheat oven to 400°F. Line rimmed baking sheet with parchment paper. Toast cumin seeds in small skillet over medium heat until beginning to brown, about 2 minutes. Cool. Transfer to spice mill; process until finely ground. Combine parsnips, sweet potatoes, and red onion in large bowl. Add ground cumin, 2 tablespoons vegetable oil, chili powder, oregano, and 1 teaspoon coarse salt; toss to coat. Transfer to prepared baking sheet. Roast vegetables until soft and browned in spots, turning occasionally, 35 to 40 minutes. Cool. DO AHEAD: Can be prepared 4 hours ahead. Let stand at room temperature.",
            "Preheat oven to 375°F. With machine running, add garlic and jalapeño through feed tube of processor and process until finely chopped. Add cilantro, green onions, and drained green chiles. Using on/off turns, process until coarse puree forms. Add salsa; process to blend. Transfer salsa mixture to large deep skillet. Add 1/4 cup crema and stir over medium-low heat just until warm (do not allow to boil). Remove from heat. Season salsa mixture to taste with salt and pepper. Cover and keep warm.",
            "Measure 1 cup roasted vegetables; set aside. Transfer remaining vegetables to processor. Using on/off turns, process until coarsely chopped. Transfer to large bowl. Add shrimp and toss to incorporate evenly. Season filling to taste with salt and pepper.",
            "Heat remaining 3 tablespoons oil in medium skillet over medium-high heat. Working with 1 tortilla at a time, cook until just softened, about 15 seconds per side (do not allow to brown). Transfer tortillas to paper towels to drain.",
            "Spread 1/2 cup salsa mixture over bottom of 15 x 10 x 2-inch glass baking dish. Place 1 tortilla on work surface; sprinkle generous 2 teaspoons crumbled cheese down center. Top with generous 1/4 cup roasted vegetable filling, arranging down center atop cheese. Roll up tortilla and place, seam side down, in prepared dish. Repeat with remaining tortillas, cheese, and filling. Scatter reserved 1 cup roasted vegetables over enchiladas. Spoon remaining salsa mixture over. Sprinkle with any remaining cheese; drizzle with remaining 1/4 cup crema (whisking if necessary to loosen enough to drizzle). Bake enchiladas until heated through, about 20 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3249e460b4423363ee263/6:4/w_274%2Ch_169/361253_shrimp-enchiladas_1x1.jpg",
        "color": 5217984
    }
}