{
    "recipe": {
        "title": "Shrimp with Fresh Corn Grits ",
        "ingredients": [
            "3 ears of corn, husked",
            "2 cups low-sodium chicken broth",
            "1 cup whole milk",
            "3/4 cup grits (not instant)",
            "2 tablespoons unsalted butter",
            "Kosher salt",
            "Freshly ground pepper",
            "1/4 cup olive oil",
            "2 garlic cloves, thinly sliced",
            "1/2 teaspoon dried oregano",
            "1/2 teaspoon hot smoked Spanish paprika or 1/2 teaspoon smoked paprika and a pinch of cayenne pepper",
            "1 1/2 pounds large shrimp, peeled, deveined, tails left intact",
            "Chopped fresh chives (for serving)"
        ],
        "instructions": [
            "Grate 2 ears of corn on the large holes of a box grater over a medium bowl, catching as much juice as possible; set aside. Cut kernels from remaining ear of corn into another medium bowl; set aside. Bring broth, milk, and 1 1/2 cups water to a boil in a medium saucepan. Reduce heat so liquid is at a simmer and gradually whisk in grits. Simmer, whisking often, until grits are very tender, 20-25 minutes. Mix in butter and reserved grated corn; season with salt and pepper. Fifteen minutes after you have added grits to saucepan, heat oil in a large skillet over medium-high heat. Cook garlic, oregano, and paprika, stirring, until fragrant, about 30 seconds. Add reserved kernels and cook,stirring occasionally, until golden brown and beginning to pop, about 3 minutes. Add shrimp and cook, tossing occasionally, until cooked through, about 4 minutes. Serve shrimp and corn over grits topped with chives.",
            "Grate 2 ears of corn on the large holes of a box grater over a medium bowl, catching as much juice as possible; set aside. Cut kernels from remaining ear of corn into another medium bowl; set aside.",
            "Bring broth, milk, and 1 1/2 cups water to a boil in a medium saucepan. Reduce heat so liquid is at a simmer and gradually whisk in grits. Simmer, whisking often, until grits are very tender, 20-25 minutes. Mix in butter and reserved grated corn; season with salt and pepper.",
            "Fifteen minutes after you have added grits to saucepan, heat oil in a large skillet over medium-high heat. Cook garlic, oregano, and paprika, stirring, until fragrant, about 30 seconds. Add reserved kernels and cook,stirring occasionally, until golden brown and beginning to pop, about 3 minutes. Add shrimp and cook, tossing occasionally, until cooked through, about 4 minutes.",
            "Serve shrimp and corn over grits topped with chives."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac0d3819925f464b3a6e5a/6:4/w_274%2Ch_169/51238350_shrimp-corn-grits_1x1.jpg"
    }
}