{
    "recipe": {
        "title": "Shrimp and Chorizo Mixed Grill ",
        "ingredients": [
            "1 1/4 cups sour cream",
            "1 cup cilantro leaves with tender stems",
            "1/4 cup mayonnaise",
            "1 small jalapeño, sliced",
            "2 Tbsp. fresh lime juice",
            "1 1/4 tsp. kosher salt",
            "5 Tbsp. extra-virgin olive oil",
            "1/4 cup fresh lime juice",
            "1 garlic clove, finely grated",
            "2 Tbsp. finely chopped cilantro",
            "1 tsp. honey",
            "1 tsp. kosher salt",
            "1 1/2 lb. jumbo or large shrimp, peeled, deveined",
            "1/2 tsp. chili powder",
            "1 1/4 tsp. kosher salt, divided",
            "1 head of green cabbage, cut into 4 wedges",
            "6 links fresh chorizo sausage (about 1 1/2 lb.)",
            "Canola oil (for grill)",
            "2 bunches medium or large asparagus, tough ends trimmed",
            "Lime wedges (for serving)"
        ],
        "instructions": [
            "Prepare a grill for 2-zone heat (for a charcoal grill, bank two-thirds of coals on two-thirds of grill and scatter remaining coals over remaining area; for a gas grill, set one burner to medium-low heat and the remaining burners to medium-high heat).",
            "Prepare a grill for 2-zone heat (for a charcoal grill, bank two-thirds of coals on two-thirds of grill and scatter remaining coals over remaining area; for a gas grill, set one burner to medium-low heat and the remaining burners to medium-high heat).",
            "Make the Sour Cream Sauce Purée sour cream, cilantro, mayonnaise, jalapeño, lime juice, and salt in a blender until smooth; chill until ready to use. Do Ahead: Sour cream sauce can be made 1 day ahead. Keep chilled.",
            "Purée sour cream, cilantro, mayonnaise, jalapeño, lime juice, and salt in a blender until smooth; chill until ready to use.",
            "Do Ahead: Sour cream sauce can be made 1 day ahead. Keep chilled.",
            "Make the Dressing Whisk oil, lime juice, garlic, cilantro, honey, and salt in a large bowl.",
            "Whisk oil, lime juice, garlic, cilantro, honey, and salt in a large bowl.",
            "Grill and Assemble Toss shrimp, chili powder, and 1 tsp. salt in a medium bowl. Grill cabbage wedges over direct heat, turning occasionally, until deeply charred on cut surfaces and crisp-tender, about 20 minutes. Transfer to a cutting board and let cool slightly. Meanwhile, grill sausages over indirect heat, turning often, until nicely charred and cooked through, 10–15 minutes. Transfer to a platter and cover with a kitchen towel to keep warm. Lightly oil grill grate. Place asparagus onto grill, orienting them perpendicular to grate so they don’t fall through the gaps. Grill, turning often, until lightly charred and crisp-tender, 5–7 minutes. Transfer to bowl with dressing and toss to coat. Transfer to platter alongside sausages, leaving remaining dressing in bowl. Oil grate again if needed, then grill shrimp over direct heat, turning often, until lightly charred and cooked through, 5–7 minutes. Transfer to platter with sausage. Slice charred cabbage wedges lengthwise into 1/4\"-thick strips, then toss with remaining dressing; season with remaining 1/4 tsp. salt. Add to platter. Serve with lime wedges and sour cream sauce alongside.",
            "Toss shrimp, chili powder, and 1 tsp. salt in a medium bowl.",
            "Grill cabbage wedges over direct heat, turning occasionally, until deeply charred on cut surfaces and crisp-tender, about 20 minutes. Transfer to a cutting board and let cool slightly.",
            "Meanwhile, grill sausages over indirect heat, turning often, until nicely charred and cooked through, 10–15 minutes. Transfer to a platter and cover with a kitchen towel to keep warm.",
            "Lightly oil grill grate. Place asparagus onto grill, orienting them perpendicular to grate so they don’t fall through the gaps. Grill, turning often, until lightly charred and crisp-tender, 5–7 minutes. Transfer to bowl with dressing and toss to coat. Transfer to platter alongside sausages, leaving remaining dressing in bowl.",
            "Oil grate again if needed, then grill shrimp over direct heat, turning often, until lightly charred and cooked through, 5–7 minutes. Transfer to platter with sausage.",
            "Slice charred cabbage wedges lengthwise into 1/4\"-thick strips, then toss with remaining dressing; season with remaining 1/4 tsp. salt. Add to platter.",
            "Serve with lime wedges and sour cream sauce alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5af1bcc51ee6877a0dd4ee53/6:4/w_274%2Ch_169/Shrimp-and-Chorizo-Mixed-Grill-03052018.jpg"
    }
}