{
    "recipe": {
        "title": "Shrimp And Fava Beans ",
        "ingredients": [
            "1 cup kosher salt, plus more for seasoning",
            "3 pounds whole fava pods, about 1 1/2 cups beans after shelling",
            "4 tablespoons (1/2 stick) unsalted butter, cut into small pieces",
            "1 1/2 pounds medium shrimp, peeled and deveined",
            "Freshly ground black pepper",
            "Juice of 1 lemon",
            "1/2 cup fruity white wine",
            "1 or 2 radishes, thinly sliced",
            "Flat-leaf parsley leaves for garnish"
        ],
        "instructions": [
            "Set a large pot on the stove. Put in 1 gallon water and 1 cup kosher salt. Bring to a boil. Ready a large bowl of ice water.",
            "Tear open the fava pods and remove the beans, discarding the outer pods. Place the beans in the boiling water for 1 to 2 minutes, then remove with a slotted spoon and transfer to a bowl of ice water to stop the cooking. When cooled, remove the outer hull of each bean and place the shelled beans in a bowl, discarding the hulls. Set aside.",
            "Place the butter and the shrimp in a wide skillet and set on the stove. Turn the heat to the lowest setting and stir as the butter melts and the shrimp begin to cook. Season with salt and pepper and add lemon juice and white wine. As the temperature rises, keep a close eye on the shrimp, stirring frequently. Remove with a slotted spoon when the shrimp are pink and slightly curled. Set aside.",
            "Add the peeled favas to the pan and increase the heat to medium-high. Cook until the favas are heated all the way through, then taste for seasoning and adjust. Be sure to taste both the beans and the liquid. Add the radishes to the pan and turn off the heat. Return the shrimp to the pan and toss to combine. Divide the shrimp and fava mixture with the juice among 4 bowls, and garnish with parsley. Serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5548e02fc4e7df4e331602f9/6:4/w_274%2Ch_169/56389505_shrimp-fava-beans_1x1.jpg"
    }
}