{
    "recipe": {
        "title": "Simple Strawberry Dulce de Leche Shortbread Tart ",
        "ingredients": [
            "1 cup all-purpose flour",
            "1/3 cup cornstarch",
            "1/4 teaspoon baking powder",
            "1/4 teaspoon salt",
            "3/4 stick (6 tablespoons) unsalted butter, softened",
            "1/3 cup granulated sugar",
            "2 large egg yolks",
            "1 teaspoon vanilla",
            "1 cup chilled heavy cream",
            "1/2 cup sour cream",
            "3 tablespoons sugar",
            "1 teaspoon vanilla",
            "1/2 cup homemade dulce de leche (or store-bought)",
            "1 pound strawberries, hulled and sliced"
        ],
        "instructions": [
            "Heat oven to 350°F with rack in middle. Lightly butter a large baking sheet.",
            "Whisk together flour, cornstarch, baking powder, and salt in a small bowl.",
            "Beat together butter and sugar in a large bowl with an electric mixer on medium-high speed until light and fluffy, then beat in egg yolks and vanilla. Reduce speed to low and mix in flour mixture until combined.",
            "Form dough into a disk and roll out between 2 large sheets of parchment paper into an 11-inch round (about 1/8 inch thick). Peel off and discard top piece of parchment. Slide round (still on bottom piece of parchment) onto baking sheet. (Butter on sheet will help keep parchment in place.)",
            "Bake until round is firm to the touch and pale golden around edges, 12 to 16 minutes. Slide round on parchment onto a rack to cool completely.",
            "Make cream: Beat cream with sour cream, sugar, and vanilla using an electric mixer until soft peaks form.",
            "Beat cream with sour cream, sugar, and vanilla using an electric mixer until soft peaks form.",
            "Assemble tart: Carefully slide cool tart from parchment onto a flat platter or cutting board. Gently spread dulce de leche onto crust (an offset spatula is helpful for this), taking care not to break crust. Spoon cream on top of dulce de leche and top with strawberries. Serve immediately.",
            "Carefully slide cool tart from parchment onto a flat platter or cutting board. Gently spread dulce de leche onto crust (an offset spatula is helpful for this), taking care not to break crust. Spoon cream on top of dulce de leche and top with strawberries.",
            "Serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b18b43c6a78d1a4a60d542/6:4/w_274%2Ch_169/395010_strawberry-dulce-de-leche-_1x1.jpg"
    }
}