{
    "recipe": {
        "title": "Simply Blueberry Sorbet ",
        "ingredients": [
            "1 cup sugar",
            "1/2 cup water, preferably spring water",
            "1/2 teaspoon salt",
            "3 pints (about 2 pounds or 6 cups) fresh-picked blueberries, preferably organic, rinsed and patted dry",
            "1/4 cup freshly squeezed lemon juice",
            "1 large egg white, preferably farm-fresh (optional)"
        ],
        "instructions": [
            "In a medium saucepan over medium heat, combine the sugar, water, and salt. Cook, stirring, until the sugar and salt have dissolved, about 3 minutes. Let cool for 15 minutes. In a blender, purée the blueberries with the syrup and lemon juice until very smooth (you may need to divide this into several batches if your blender is not extra-large). If desired, strain through a fine-mesh sieve for a smoother texture. Cover and refrigerate until chilled, at least 4 hours or overnight. Churn in an ice cream maker according to the manufacturer's directions. Add the egg white, if using, during the last 2 to 3 minutes of churning. If making the ice cream cake , immediately pack into the pan. Or store, tightly covered, in the freezer.",
            "In a medium saucepan over medium heat, combine the sugar, water, and salt. Cook, stirring, until the sugar and salt have dissolved, about 3 minutes. Let cool for 15 minutes.",
            "In a blender, purée the blueberries with the syrup and lemon juice until very smooth (you may need to divide this into several batches if your blender is not extra-large). If desired, strain through a fine-mesh sieve for a smoother texture. Cover and refrigerate until chilled, at least 4 hours or overnight.",
            "Churn in an ice cream maker according to the manufacturer's directions. Add the egg white, if using, during the last 2 to 3 minutes of churning. If making the ice cream cake , immediately pack into the pan. Or store, tightly covered, in the freezer.",
            "Variation: Blueberry-pomegranate sorbet: Replace 1/4 cup of the water with pure pomegranate juice (we recommend either Pom Wonderful or Knudsen's 100% Pomegranate Juice).",
            "Replace 1/4 cup of the water with pure pomegranate juice (we recommend either Pom Wonderful or Knudsen's 100% Pomegranate Juice)."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de58ef3a00aeb2f1d5464/6:4/w_274%2Ch_169/232350.jpg"
    }
}