{
    "recipe": {
        "title": "Sister Pie Crust ",
        "ingredients": [
            "1/2 teaspoon kosher salt",
            "1/2 teaspoon sugar",
            "1 1/4 cups all-purpose flour, plus more for surface",
            "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
            "1 tablespoon apple cider vinegar",
            "Nonstick vegetable oil spray"
        ],
        "instructions": [
            "Pulse salt, sugar, and 1 1/4 cups flour in a food processor to combine. Add butter and pulse until largest pieces are pea-size. Transfer to a medium bowl and freeze about 5 minutes. Combine vinegar and 3 Tbsp. ice water in a small bowl and sprinkle over flour mixture; toss with a fork to incorporate. Knead until dough comes together with just a few dry spots remaining. Flatten into a disk and wrap tightly in plastic. Chill at least 2 hours. Let dough sit at room temperature 5 minutes to soften. Roll out on a lightly floured surface, rotating often and dusting with more flour as needed to prevent sticking, to a 12\" round. Fold dough in half and transfer to a glass 9\" pie dish. Lift up edges and allow dough to slump down into dish. You should have about a 1\" overhang. Fold edges under and crimp. Place pie dish on a foil-lined rimmed baking sheet and freeze 15 minutes. Meanwhile, preheat oven to 425°F. Lightly coat a sheet of foil with nonstick spray and place in pie crust, coated side down, pressing into bottom and sides. Fill with pie weights and bake until edge is pale golden, 15–20 minutes. Carefully remove foil and pie weights and bake crust until bottom is light golden for a fruit pie, 7–12 minutes, or golden for a custard pie, 12–18 minutes. Transfer to a wire rack and let cool.",
            "Pulse salt, sugar, and 1 1/4 cups flour in a food processor to combine. Add butter and pulse until largest pieces are pea-size. Transfer to a medium bowl and freeze about 5 minutes.",
            "Combine vinegar and 3 Tbsp. ice water in a small bowl and sprinkle over flour mixture; toss with a fork to incorporate. Knead until dough comes together with just a few dry spots remaining. Flatten into a disk and wrap tightly in plastic. Chill at least 2 hours.",
            "Let dough sit at room temperature 5 minutes to soften. Roll out on a lightly floured surface, rotating often and dusting with more flour as needed to prevent sticking, to a 12\" round. Fold dough in half and transfer to a glass 9\" pie dish. Lift up edges and allow dough to slump down into dish. You should have about a 1\" overhang. Fold edges under and crimp. Place pie dish on a foil-lined rimmed baking sheet and freeze 15 minutes.",
            "Meanwhile, preheat oven to 425°F. Lightly coat a sheet of foil with nonstick spray and place in pie crust, coated side down, pressing into bottom and sides. Fill with pie weights and bake until edge is pale golden, 15–20 minutes. Carefully remove foil and pie weights and bake crust until bottom is light golden for a fruit pie, 7–12 minutes, or golden for a custard pie, 12–18 minutes. Transfer to a wire rack and let cool.",
            "Do Ahead Dough can be made 3 days ahead, or freeze up to 1 month. Crust can be baked 1 day ahead. Store tightly wrapped at room temperature.",
            "Dough can be made 3 days ahead, or freeze up to 1 month. Crust can be baked 1 day ahead. Store tightly wrapped at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/572ba0e2bb9206136debbbec/6:4/w_274%2Ch_169/Sister-Pie-Crust.jpg"
    }
}