{
    "recipe": {
        "title": "Skibo Castle Ginger Crunch ",
        "ingredients": [
            "1 1/4 cups all-purpose flour",
            "3 tablespoons granulated sugar",
            "1 teaspoon baking powder",
            "1 teaspoon ground ginger",
            "1/4 teaspoon salt",
            "1 stick cold unsalted butter, cut into pieces",
            "3/4 stick unsalted butter",
            "1 tablespoon Lyle's Golden Syrup (British cane sugar syrup)",
            "1 cup confectioners sugar",
            "1/2 teaspoon ground ginger",
            "1/2 teaspoon vanilla"
        ],
        "instructions": [
            "Preheat oven to 350°F and grease a 13- by 9-inch metal baking pan.",
            "Make shortbread base: Sift together dry ingredients and blend in butter with your fingertips until mixture resembles coarse meal. Press evenly into bottom of pan (base will be thin). Bake in middle of oven until golden and crisp, 20 to 25 minutes.",
            "Sift together dry ingredients and blend in butter with your fingertips until mixture resembles coarse meal. Press evenly into bottom of pan (base will be thin). Bake in middle of oven until golden and crisp, 20 to 25 minutes.",
            "Make topping just before shortbread is done: Melt butter in a small saucepan and whisk in remaining ingredients until smooth. Bring to a boil and simmer, stirring, 30 seconds.",
            "Melt butter in a small saucepan and whisk in remaining ingredients until smooth. Bring to a boil and simmer, stirring, 30 seconds.",
            "Pour topping: Remove shortbread from oven and pour topping over, tilting pan to cover shortbread evenly. Cool in pan on a rack, then cut into small rectangles (8 rows lengthwise and 8 crosswise).",
            "Remove shortbread from oven and pour topping over, tilting pan to cover shortbread evenly. Cool in pan on a rack, then cut into small rectangles (8 rows lengthwise and 8 crosswise)."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5612e667f35fab51707e7f7e/6:4/w_274%2Ch_169/102754.jpg",
        "color": 10773526
    }
}