{
    "recipe": {
        "title": "Skillet Dressing with Cornbread and Biscuits ",
        "ingredients": [
            "1 1/2 cups fine-grind white cornmeal",
            "1/2 cup all-purpose flour",
            "1 Tbsp. sugar",
            "1 tsp. baking powder",
            "1 tsp. baking soda",
            "1 tsp. kosher salt",
            "1/2 tsp. freshly ground black pepper",
            "1 large egg",
            "2 cups buttermilk",
            "1/4 cup grapeseed, vegetable, or other neutral oil",
            "2 Tbsp. unsalted butter",
            "2 Tbsp. unsalted butter, plus more for pan",
            "1 large onion, finely chopped",
            "3 large celery stalks, finely chopped",
            "2 1/4 tsp. kosher salt, divided",
            "4 biscuits (about 12 oz. total), such as Fluffy Cathead Biscuits",
            "2 Tbsp. ground dried sage",
            "1 tsp. freshly ground black pepper",
            "3 large eggs",
            "3 1/2 cups turkey stock or low-sodium chicken or vegetable broth",
            "1/4 cup apple cider vinegar"
        ],
        "instructions": [
            "For the cornbread: Place a large cast-iron skillet in oven; preheat to 425°F. Whisk cornmeal, flour, sugar, baking powder, baking soda, salt, and pepper in a large bowl to combine. Whisk egg, buttermilk, and oil in a medium bowl to combine. Create a well in dry ingredients. Pour buttermilk mixture into well and whisk until no dry spots remain. Remove cast-iron skillet from oven (be careful; pan will be very hot). Add butter to pan and swirl to coat. Pour batter into pan and spread evenly. Bake cornbread until edges are golden brown and top is golden, 20–25 minutes. Immediately turn cornbread out onto a wire rack so bottom stays crisp. Let cool slightly, then invert onto another wire rack and let cool completely. Do Ahead: Cornbread can be baked 5 days ahead. Store tightly wrapped at room temperature, or freeze up to 3 months.",
            "Place a large cast-iron skillet in oven; preheat to 425°F. Whisk cornmeal, flour, sugar, baking powder, baking soda, salt, and pepper in a large bowl to combine. Whisk egg, buttermilk, and oil in a medium bowl to combine. Create a well in dry ingredients. Pour buttermilk mixture into well and whisk until no dry spots remain.",
            "Remove cast-iron skillet from oven (be careful; pan will be very hot). Add butter to pan and swirl to coat. Pour batter into pan and spread evenly. Bake cornbread until edges are golden brown and top is golden, 20–25 minutes.",
            "Immediately turn cornbread out onto a wire rack so bottom stays crisp. Let cool slightly, then invert onto another wire rack and let cool completely.",
            "Do Ahead: Cornbread can be baked 5 days ahead. Store tightly wrapped at room temperature, or freeze up to 3 months.",
            "For the dressing: Preheat oven to 375°F. Butter a large cast-iron skillet; set aside. Melt remaining 2 Tbsp. butter in a large skillet over medium heat. Add onion, celery, and a pinch of salt and cook, stirring occasionally, until vegetables are softened and just starting to take on some color, about 10 minutes. Meanwhile, tear cornbread into roughly 1\" pieces and transfer to a large bowl. Tear biscuits into slightly smaller pieces and add to same bowl. Scrape vegetable mixture into bowl with bread and add sage, pepper, and remaining 2 tsp. salt. Gently toss to combine. Whisk eggs, stock, and vinegar in a medium bowl to combine. Drizzle over cornbread mixture and gently toss again to incorporate. Spoon dressing into prepared pan and bake until set and browned and crisp across the top, 45–55 minutes. Do Ahead: Dressing can be baked 1 day ahead. Let cool, then cover with foil and chill. Reheat in a 350°F oven, covered, until warmed through, 25–30 minutes, before serving.",
            "Preheat oven to 375°F. Butter a large cast-iron skillet; set aside. Melt remaining 2 Tbsp. butter in a large skillet over medium heat. Add onion, celery, and a pinch of salt and cook, stirring occasionally, until vegetables are softened and just starting to take on some color, about 10 minutes.",
            "Meanwhile, tear cornbread into roughly 1\" pieces and transfer to a large bowl. Tear biscuits into slightly smaller pieces and add to same bowl.",
            "Scrape vegetable mixture into bowl with bread and add sage, pepper, and remaining 2 tsp. salt. Gently toss to combine. Whisk eggs, stock, and vinegar in a medium bowl to combine. Drizzle over cornbread mixture and gently toss again to incorporate. Spoon dressing into prepared pan and bake until set and browned and crisp across the top, 45–55 minutes.",
            "Do Ahead: Dressing can be baked 1 day ahead. Let cool, then cover with foil and chill. Reheat in a 350°F oven, covered, until warmed through, 25–30 minutes, before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5be083bf531ddb2da6158754/6:4/w_274%2Ch_169/cornbread-biscuit-stuffing-23102018.jpg"
    }
}