{
    "recipe": {
        "title": "Skillet Mac and Cheese ",
        "ingredients": [
            "2 cups 1-inch-wide cauliflower florets",
            "1 1/4 cups Light-and-Crisp Whole-Wheat Bread Crumbs",
            "3 tablespoons freshly grated Parmesan cheese",
            "2 teaspoons olive oil",
            "3 cups cold low-fat (1%) milk",
            "3 tablespoons all-purpose flour",
            "1 1/4 cups shredded extra-sharp cheddar cheese (5 ounces)",
            "1/4 cup shredded Gruyère cheese (1 ounce)",
            "2 teaspoons mustard powder",
            "3/4 teaspoon paprika",
            "1/2 teaspoon salt",
            "1/2 teaspoon freshly ground black pepper",
            "1/4 teaspoon cayenne pepper",
            "6 ounces (1 1/2 cups) wholegrain elbow macaroni, cooked for 3 minutes less than the package directions (about 3 cups cooked)",
            "Nonstick cooking spray"
        ],
        "instructions": [
            "Preheat the oven to 375°F.",
            "Place the cauliflower into a steamer basket fitted over the pot, cover, and steam until just tender, about 5 minutes. Finely chop the steamed cauliflower.",
            "In a small bowl, combine the bread crumbs, Parmesan, and oil.",
            "In a large saucepan, whisk together the milk and flour until the flour is dissolved. Whisking constantly, bring the mixture to a gentle boil over medium heat. Reduce the heat to medium low and simmer until the mixture thickens slightly, 2 to 3 minutes. Stir in the cheddar, Gruyère, mustard powder, paprika, salt, black pepper, and cayenne pepper. Whisk until the cheeses are melted and the mixture is smooth, 1 to 2 minutes. Add the chopped cauliflower and macaroni and stir until well coated.",
            "Spray an ovenproof 10-inch high-sided skillet with cooking spray. Pour the mixture into the prepared skillet. Sprinkle with the bread crumb mixture, place on a baking sheet, and bake until the top is browned and the cheese is bubbly, 35 to 40 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54af39524074bdfd06836f9f/6:4/w_274%2Ch_169/51182830_mac-and-cheese_1x1.jpg"
    }
}