{
    "recipe": {
        "title": "Skirt Steak with Spicy Coconut Dressing ",
        "ingredients": [
            "1/2 red jalapeno, Fresno or serrano chile, finely grated",
            "1 garlic clove, finely grated",
            "1-inch piece fresh ginger, peeled and finely grated",
            "4 tablespoons coconut cream from 1 small can unsweetened full-fat coconut milk",
            "1/4 cup fresh lime juice, plus wedges for serving",
            "Kosher salt",
            "2 tablespoons unsweetened shredded coconut",
            "1 pound skirt steak, cut into two or three pieces",
            "2 tablespoons extra-virgin olive oil",
            "1/2 head iceberg lettuce, leaves torn into palm-size pieces",
            "Handful of cilantro leaves and tender stems, torn",
            "1 avocado, cut into 1/2-inch pieces"
        ],
        "instructions": [
            "In a large bowl, combine chile, garlic, ginger, coconut cream, and lime juice. Season with salt and stir to combine. Stir in coconut and taste dressing: It should be fairly tangy, spicy, and salty to balance the mild iceberg. Dressing may seize up and seem very thick, but it will loosen up when tossed with the salad. Season steak on both sides with salt. Place a 10- or 12-inch skillet, preferably cast-iron, over medium-high heat. Add oil and when it shimmers, place steaks carefully into pan and cook, undisturbed, until browned on underside, 2–3 minutes. Turn and cook until browned on second side and medium-rare, about 2 minutes longer. Transfer steaks to a platter and let rest 5–10 minutes before cutting against the grain into 1/4-inch slices. Add lettuce and cilantro to bowl with dressing and toss to coat. Taste the lettuce and add more salt and/or lime juice if needed. Add avocado and toss gently to distribute. Serve steak and salad with lime wedges for squeezing over.",
            "In a large bowl, combine chile, garlic, ginger, coconut cream, and lime juice. Season with salt and stir to combine. Stir in coconut and taste dressing: It should be fairly tangy, spicy, and salty to balance the mild iceberg. Dressing may seize up and seem very thick, but it will loosen up when tossed with the salad.",
            "Season steak on both sides with salt.",
            "Place a 10- or 12-inch skillet, preferably cast-iron, over medium-high heat. Add oil and when it shimmers, place steaks carefully into pan and cook, undisturbed, until browned on underside, 2–3 minutes. Turn and cook until browned on second side and medium-rare, about 2 minutes longer. Transfer steaks to a platter and let rest 5–10 minutes before cutting against the grain into 1/4-inch slices.",
            "Add lettuce and cilantro to bowl with dressing and toss to coat. Taste the lettuce and add more salt and/or lime juice if needed. Add avocado and toss gently to distribute. Serve steak and salad with lime wedges for squeezing over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5cb8bc8644c02b6322815d7e/6:4/w_274%2Ch_169/Carla's-Steak-with-Coconut-Salad-recipe-100419.jpg"
    }
}