{
    "recipe": {
        "title": "Slow-Roast Spiced Lamb Shoulder with Sumac Onions ",
        "ingredients": [
            "1 (6–7-lb.) bone-in lamb shoulder",
            "2 Tbsp. black peppercorns",
            "2 Tbsp. coriander seeds",
            "2 Tbsp. paprika",
            "2 tsp. ground cinnamon",
            "1 tsp. ground cardamom",
            "1 tsp. ground cloves",
            "1 tsp. freshly grated nutmeg",
            "1 large red onion, thinly sliced",
            "3 Tbsp. fresh lemon juice",
            "2 tsp. sumac",
            "1/2 cup mint leaves",
            "1/2 cup parsley leaves with tender stems",
            "Kosher salt, freshly ground pepper",
            "A spice mill or mortar and pestle"
        ],
        "instructions": [
            "Season lamb very generously with salt and pepper; place on a wire rack set inside a rimmed baking sheet.",
            "Toast peppercorns and coriander seeds in a dry small skillet over medium heat, tossing often, until fragrant, about 3 minutes; let cool. Finely grind in spice mill or with mortar and pestle; transfer to a small bowl. Mix in paprika, cinnamon, cardamom, cloves, and nutmeg, then rub all over lamb. Chill uncovered at least 4 hours and up to 1 day.",
            "Let lamb sit out on counter at room temperature 1 hour before roasting.",
            "Place a rack in middle of oven; preheat to 275°F. Transfer lamb to a roasting pan and pour in 3 cups water. Cover tightly with foil and cook, turning lamb over and rotating pan halfway through, until meat is almost falling off the bone, 3–3 1/2 hours. Remove lamb from oven and turn up heat to broil (or to highest heat if you have a drawer-style broiler). Discard foil, transfer lamb to a cutting board, and pour off liquid in pan. Return lamb to pan; roast, uncovered, until nicely browned, about 5 minutes.",
            "Meanwhile, toss onion, lemon juice, and sumac in a small bowl with your hands, squeezing onion a bit to soften.",
            "Just before serving, toss mint, parsley, and a pinch of salt into onion mixture. Serve lamb topped with onion salad."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ba00b27158f19588770e1b7/6:4/w_274%2Ch_169/slow-roast-spiced-lamb-shoulder-with-sumac-onions-recipe-BA-091718.jpg"
    }
}