{
    "recipe": {
        "title": "Slow-Cooker Star Anise–Black Pepper Hot Toddy ",
        "ingredients": [
            "5 whole star anise",
            "2 tablespoons whole black peppercorns",
            "8 black tea bags",
            "3/4 cup honey, plus more to taste",
            "2 cinnamon sticks",
            "3/4 cup freshly squeezed lemon juice, plus more to taste",
            "2 cups rye whiskey",
            "Lemon zest twists or lemon wheels, for serving",
            "4- to 6-quart slow cooker and cheesecloth"
        ],
        "instructions": [
            "Put the star anise and peppercorns on a piece of cheesecloth and tie it into a bundle using kitchen twine or a thin strip of cheesecloth. (This makes it easier to serve without getting black peppercorns in your cup, but if you don’t have cheesecloth, don’t worry—just put the spices into the slow cooker.) Put the bundle into a 4- to 6-quart slow cooker. Add 10 cups water, the tea bags, honey, and cinnamon sticks. Cover and cook until the mixture tastes like good tea, about 2 hours on HIGH. Reduce the heat to WARM. Pull out the tea bags, squeeze them over the pot to extract their liquid, and discard. Stir in the lemon juice and whiskey. Taste and add more honey or lemon juice if you feel it needs it. Serve from the slow cooker, still set on WARM, in mugs garnished with lemon zest twists or lemon wheels. Holds well on warm",
            "Put the star anise and peppercorns on a piece of cheesecloth and tie it into a bundle using kitchen twine or a thin strip of cheesecloth. (This makes it easier to serve without getting black peppercorns in your cup, but if you don’t have cheesecloth, don’t worry—just put the spices into the slow cooker.) Put the bundle into a 4- to 6-quart slow cooker. Add 10 cups water, the tea bags, honey, and cinnamon sticks. Cover and cook until the mixture tastes like good tea, about 2 hours on HIGH.",
            "Reduce the heat to WARM. Pull out the tea bags, squeeze them over the pot to extract their liquid, and discard. Stir in the lemon juice and whiskey. Taste and add more honey or lemon juice if you feel it needs it. Serve from the slow cooker, still set on WARM, in mugs garnished with lemon zest twists or lemon wheels.",
            "Holds well on warm"
        ],
        "picture_link": "https://assets.epicurious.com/photos/59f9f1373f5eac086ce31747/6:4/w_274%2Ch_169/star-anise-black-pepper-hot-toddy-HC-recipe-103017.jpg"
    }
}