{
    "recipe": {
        "title": "Slow-Cooked Squid with Olives and Herbs ",
        "ingredients": [
            "1 1/2 lb. cleaned squid",
            "1 1/2 oz. smoked Spanish chorizo, thinly sliced (about 1/2 cup)",
            "1 shallot, thinly sliced",
            "4 garlic cloves, thinly sliced",
            "4 oil-packed anchovies",
            "1 red Fresno chile or jalapeño, thinly sliced",
            "4 Tbsp. extra-virgin olive oil, divided, plus more for drizzling",
            "1 (28-oz.) can whole peeled tomatoes",
            "Kosher salt, freshly ground pepper",
            "4 thick slices sourdough bread",
            "1 cup parsley leaves with tender stems",
            "1/2 cup mixed pitted green olives, torn if large",
            "2 Tbsp. fresh lemon juice"
        ],
        "instructions": [
            "Preheat oven to 250°F. Separate squid bodies from tentacles. Cut bodies into 3/4\"-thick rings and cut tentacles in half crosswise. Rinse well in a bowl with several changes of cold water. Drain squid and pat dry. Cook chorizo, shallot, garlic, anchovies, chile, and 2 Tbsp. oil in a medium Dutch oven or other heavy pot over medium heat, stirring often, until chorizo is softened but not yet beginning to crisp and shallot is softened but not yet browned, about 5 minutes. Add tomatoes, finely crushing with your hands as you go, and their juices and squid and bring to a simmer; season lightly with salt and pepper. Cover pot and transfer to oven. Cook until squid is very tender and sauce tastes concentrated, 2–2 1/2 hours. (Uncover the pot for the last 20–30 minutes to allow sauce to evaporate and thicken if needed.) Taste and season with more salt and pepper if needed. Toast bread until very crisp; drizzle with oil. Place in bowls and top with squid and sauce. Toss parsley, olives, lemon juice, and remaining 2 Tbsp. oil in a small bowl; season lightly with salt. Spoon over squid.",
            "Preheat oven to 250°F. Separate squid bodies from tentacles. Cut bodies into 3/4\"-thick rings and cut tentacles in half crosswise. Rinse well in a bowl with several changes of cold water. Drain squid and pat dry.",
            "Cook chorizo, shallot, garlic, anchovies, chile, and 2 Tbsp. oil in a medium Dutch oven or other heavy pot over medium heat, stirring often, until chorizo is softened but not yet beginning to crisp and shallot is softened but not yet browned, about 5 minutes. Add tomatoes, finely crushing with your hands as you go, and their juices and squid and bring to a simmer; season lightly with salt and pepper. Cover pot and transfer to oven. Cook until squid is very tender and sauce tastes concentrated, 2–2 1/2 hours. (Uncover the pot for the last 20–30 minutes to allow sauce to evaporate and thicken if needed.) Taste and season with more salt and pepper if needed.",
            "Toast bread until very crisp; drizzle with oil. Place in bowls and top with squid and sauce. Toss parsley, olives, lemon juice, and remaining 2 Tbsp. oil in a small bowl; season lightly with salt. Spoon over squid.",
            "Do Ahead Squid can be cooked 1 day ahead. Let cool; cover and chill.",
            "Squid can be cooked 1 day ahead. Let cool; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aa0123b30871567f357d730/6:4/w_274%2Ch_169/slow-cooked-squid-with-olives-and-herbs-recipe-BA-030718.jpg"
    }
}