{
    "recipe": {
        "title": "Slow-Roasted Chicken with Honey-Glazed Carrots and Ginger ",
        "ingredients": [
            "1 (3 1/2–4-lb.) chicken",
            "Kosher salt",
            "1 head of garlic, halved crosswise, plus 4 cloves, thinly sliced",
            "1 1/2 lb. carrots, scrubbed, cut in half",
            "8 small shallots, peeled",
            "1 (2\") piece ginger, unpeeled, thinly sliced",
            "2 Tbsp. unsalted butter",
            "1 Tbsp. honey",
            "2 Tbsp. extra-virgin olive oil",
            "1 tsp. crushed red pepper flakes",
            "1/4 cup fresh lime juice"
        ],
        "instructions": [
            "Preheat oven to 250°F. Season chicken generously with salt inside and out. Place head of garlic inside cavity; tie legs together if desired. Let sit at least 5 minutes or chill, uncovered, up to 2 days.",
            "Combine carrots, shallots, ginger, butter, and honey in a large Dutch oven or other heavy pot; season lightly with salt. Place chicken on top, nestling into vegetables so lid will sit tight. Cover; bake until an instant-read thermometer inserted into the thickest part of breast registers 155°F, about 2 hours. Uncover and let rest 30 minutes.",
            "Meanwhile, cook oil and sliced garlic in a small saucepan over medium until garlic is lightly browned, 6–8 minutes. Add red pepper flakes and let cool. Stir in lime juice; season dressing with salt.",
            "Increase oven temperature to 450°F. Place chicken on a rimmed baking sheet and roast until skin is browned and crisp, 10–14 minutes.",
            "Meanwhile, place pot over medium-high heat; bring juices to a simmer. Cook, reducing heat as needed, until vegetables are glazed, 10–12 minutes. Keep warm over low heat until chicken is done.",
            "Serve chicken on top of vegetables with dressing drizzled over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aa0124330871567f357d732/6:4/w_274%2Ch_169/slow-roasted-chicken-with-honey-glazed-carrots-and-ginger-recipe-BA-030718.jpg",
        "color": 11250945
    }
}