{
    "recipe": {
        "title": "Slow-Cooked Pork with Chickpeas ",
        "ingredients": [
            "1 Tbsp. crushed red pepper flakes",
            "1 Tbsp. whole black peppercorns",
            "1 Tbsp. fennel seeds",
            "4 lb. boneless pork shoulder, fat cap trimmed to 1/4\"",
            "2 Tbsp. kosher salt",
            "4 Tbsp. extra-virgin oil, divided",
            "1 medium onion, sliced into 1/2\"-thick rounds",
            "1 head of garlic, halved crosswise",
            "4 fresh bay leaves",
            "2 cups dry white wine",
            "2 (15.5-oz.) canned chickpeas, rinsed",
            "1/2 lemon",
            "3 Tbsp. finely chopped parsley",
            "A spice mill or mortar and pestle"
        ],
        "instructions": [
            "Coarsely grind red pepper flakes, peppercorns, and fennel seeds in spice mill or with mortar and pestle. Generously season pork with salt, sprinkling more heavily on meat than layer of fat. Sprinkle with spice mixture, massaging into all spots so it adheres to pork. Roll pork as tightly as you can, then tie individual lengths of kitchen twine around roast every 1\" or so. Wrap tightly with plastic wrap and let sit at room temperature at least 1 hour, or chill overnight. Preheat oven to 325°F. Heat 2 Tbsp. oil in a large Dutch oven. Cook pork, turning occasionally, until browned on all sides, 10–12 minutes total. Transfer pork to a plate. Remove pot from heat and dump out fat. Add remaining 2 Tbsp. oil and heat over medium. Cook onion and garlic, stirring occasionally, until exposed flesh turns golden brown, about 2 minutes. Stir in bay leaves and return pork to pot. Pour in wine and 2 cups water. Cover pot and transfer to oven. Bake, turning pork every 45 minutes or so, until pork is tender and pulls apart easily, 2 1/2–3 hours. Transfer pork to a plate and let cool slightly before tearing into big chunks. Return pot with braising liquid to low heat and add chickpeas and pork. Cover and cook until chickpeas and pork are warmed through, 12–15 minutes. Transfer chickpeas, pork, and braising liquid to a platter. Finely zest lemon over and top with parsley.",
            "Coarsely grind red pepper flakes, peppercorns, and fennel seeds in spice mill or with mortar and pestle.",
            "Generously season pork with salt, sprinkling more heavily on meat than layer of fat. Sprinkle with spice mixture, massaging into all spots so it adheres to pork.",
            "Roll pork as tightly as you can, then tie individual lengths of kitchen twine around roast every 1\" or so. Wrap tightly with plastic wrap and let sit at room temperature at least 1 hour, or chill overnight.",
            "Preheat oven to 325°F. Heat 2 Tbsp. oil in a large Dutch oven. Cook pork, turning occasionally, until browned on all sides, 10–12 minutes total. Transfer pork to a plate.",
            "Remove pot from heat and dump out fat. Add remaining 2 Tbsp. oil and heat over medium. Cook onion and garlic, stirring occasionally, until exposed flesh turns golden brown, about 2 minutes. Stir in bay leaves and return pork to pot. Pour in wine and 2 cups water. Cover pot and transfer to oven. Bake, turning pork every 45 minutes or so, until pork is tender and pulls apart easily, 2 1/2–3 hours. Transfer pork to a plate and let cool slightly before tearing into big chunks.",
            "Return pot with braising liquid to low heat and add chickpeas and pork. Cover and cook until chickpeas and pork are warmed through, 12–15 minutes.",
            "Transfer chickpeas, pork, and braising liquid to a platter. Finely zest lemon over and top with parsley.",
            "Do Ahead Stew (without lemon zest and parsley) can be made 3 days ahead. Let cool; cover and chill. Add lemon zest and parsley just before serving.",
            "Stew (without lemon zest and parsley) can be made 3 days ahead. Let cool; cover and chill. Add lemon zest and parsley just before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a78b5919cd78604a583e712/6:4/w_274%2Ch_169/SUNDAY-SUPPEr-braised-pork-and-chickpeas-31012018.jpg"
    }
}