{
    "recipe": {
        "title": "Slow Roast Beef ",
        "ingredients": [
            "1 (4-lb.) New York strip roast, preferably prime, untied",
            "Kosher salt, freshly ground pepper",
            "6 garlic cloves, finely grated",
            "3 Tbsp. finely chopped rosemary",
            "5 Tbsp. extra-virgin olive oil, divided",
            "1/2 cup plain whole-milk Greek yogurt",
            "1/2 cup sour cream",
            "2 Tbsp. prepared horseradish",
            "1/2 tsp. finely grated lemon zest",
            "Warm rolls and cornichons (for serving)"
        ],
        "instructions": [
            "Lightly score fat cap of roast, spacing cuts about 3/4\" apart, with a sharp knife, being careful not to slice into the flesh. Season roast generously on all sides with salt and pepper. Mix garlic, rosemary, and 3 Tbsp. oil in a small bowl and rub all over roast. Loosely cover with plastic wrap and chill at least 12 hours and up to 2 days. Preheat oven to 200°F. Place roast on a wire rack set inside a large rimmed baking sheet. Roast until an instant-read thermometer inserted into the thickest part of meat registers 118°F–120°F for medium-rare, about 2 1/2 hours. Let rest 1 hour (internal temperature will continue to climb to 125°F–130°F). Mix together yogurt, sour cream, horseradish, and lemon zest in a small bowl; season sauce with salt. Heat remaining 2 Tbsp. oil in a large skillet over medium. Cook roast just until browned, about 2 minutes per side. Transfer to a cutting board and thinly slice. Serve with horseradish sauce, rolls, and cornichons.",
            "Lightly score fat cap of roast, spacing cuts about 3/4\" apart, with a sharp knife, being careful not to slice into the flesh. Season roast generously on all sides with salt and pepper. Mix garlic, rosemary, and 3 Tbsp. oil in a small bowl and rub all over roast. Loosely cover with plastic wrap and chill at least 12 hours and up to 2 days.",
            "Preheat oven to 200°F. Place roast on a wire rack set inside a large rimmed baking sheet. Roast until an instant-read thermometer inserted into the thickest part of meat registers 118°F–120°F for medium-rare, about 2 1/2 hours. Let rest 1 hour (internal temperature will continue to climb to 125°F–130°F).",
            "Mix together yogurt, sour cream, horseradish, and lemon zest in a small bowl; season sauce with salt.",
            "Heat remaining 2 Tbsp. oil in a large skillet over medium. Cook roast just until browned, about 2 minutes per side. Transfer to a cutting board and thinly slice. Serve with horseradish sauce, rolls, and cornichons.",
            "Do Ahead Beef can be roasted and browned 3 days ahead. Cover and chill. Let sit at room temperature 1–2 hours before serving.",
            "Beef can be roasted and browned 3 days ahead. Cover and chill. Let sit at room temperature 1–2 hours before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c1146134396ac58c94acce7/6:4/w_274%2Ch_169/slow-roast-beef-recipe-BA-121218.jpg"
    }
}