{
    "recipe": {
        "title": "Slow-Cooked Halibut with Garlic Cream and Fennel ",
        "ingredients": [
            "2 small fennel bulbs, fronds reserved, bulbs cut into 1/2\"-thick wedges",
            "8 garlic cloves, thinly sliced",
            "4 cups heavy cream",
            "1 Tbsp. plus 3 tsp. kosher salt, divided; plus more",
            "1 1/2 lb. skin-on halibut fillet, patted dry",
            "1 small lemon",
            "1/2 cup extra-virgin olive oil",
            "Freshly ground black pepper"
        ],
        "instructions": [
            "Preheat oven to 250°F. Place fennel in a large saucepan wide enough to fit fish comfortably. Add garlic, cream, and 1 Tbsp. plus 2 tsp. salt. Place over low heat and cook, stirring occasionally, until fennel is just tender, 12–15 minutes (do not let cream come to a boil). Remove from heat.",
            "Season fish with remaining 1 tsp. salt. Using tongs, carefully slip fish into pan (it should be mostly covered). Transfer to oven and cook fish, uncovered, until flesh easily flakes with a fork, 18–22 minutes.",
            "While the fish is cooking, finely chop reserved fennel fronds and place in a small bowl (you should have about 1/2 cup). Cut ends off lemon; discard. Place lemon upright on one end and cut lemon into four lobes, working around the center as you would an apple and leaving core and seeds behind. Finely chop lobes (peel and all) and transfer to bowl with fennel fronds. (You should have about 1/3 cup.) Squeeze juice from core over fennel fronds; discard core. Drizzle in oil and toss mixture to combine. Season fennel oil with salt and lots of pepper.",
            "Break fish into large pieces and divide among shallow bowls. Divide garlic and fennel among bowls and ladle some garlic cream on top; spoon fennel oil over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5bc4da2e0fe41a2d538debde/6:4/w_274%2Ch_169/slow-cooked-halibut-with-garlic-cream-and-fennel-recipe-BA-101518.jpg",
        "color": 6339814
    }
}