{
    "recipe": {
        "title": "Slow-Cooked Chicken Stew with Kale ",
        "ingredients": [
            "8 pieces chicken thigh skin (reserved from stew; see below)",
            "1 small garlic clove, finely grated",
            "2 Tbsp. finely chopped parsley",
            "1 tsp. finely grated lemon zest",
            "Kosher salt, freshly ground pepper",
            "1 small lemon, preferably organic and unwaxed, very thinly sliced into rounds, rounds cut into quarters",
            "1/3 cup extra-virgin olive oil",
            "Pinch of sugar",
            "Kosher salt, freshly ground pepper",
            "4 lb. skin-on, bone-in chicken thighs (about 8), patted dry",
            "Kosher salt, freshly ground pepper",
            "6 oz. bacon (about 6 slices), chopped",
            "4 large shallots, quartered lengthwise",
            "2 heads of garlic, halved crosswise",
            "1/2 cup dry white wine",
            "1 bunch parsley, stems tied together with kitchen twine",
            "2 bay leaves",
            "8 cups torn curly kale leaves",
            "Thinly sliced radishes and/or thinly sliced red onion (for serving; optional)"
        ],
        "instructions": [
            "Chicken Skin Gremolata: Preheat oven to 350°F. Arrange chicken skin in a single layer on a rimmed baking sheet and bake until dark golden brown and crisp all the way through, 12–18 minutes. Let cool, then coarsely chop. Combine chicken skin, garlic, parsley, and lemon zest in a small bowl; season with salt and pepper and toss to combine.",
            "Preheat oven to 350°F. Arrange chicken skin in a single layer on a rimmed baking sheet and bake until dark golden brown and crisp all the way through, 12–18 minutes. Let cool, then coarsely chop.",
            "Combine chicken skin, garlic, parsley, and lemon zest in a small bowl; season with salt and pepper and toss to combine.",
            "Lemon Oil: Combine lemon, olive oil, and sugar in a small bowl. Season with salt and pepper and let sit at least 10 minutes, mixing once or twice.",
            "Combine lemon, olive oil, and sugar in a small bowl. Season with salt and pepper and let sit at least 10 minutes, mixing once or twice.",
            "Stew and assembly: Season chicken thighs all over with salt and pepper. Cook bacon in a large Dutch oven or other heavy pot over medium-low heat, stirring often, until brown and crisp, 7–10 minutes. Using a slotted spoon, transfer bacon to a small bowl. Increase heat to medium-high. Working in 2 batches if needed, cook chicken thighs, skin side down, in the same pot until skin is golden brown, 7–10 minutes. Transfer to a large plate and turn skin side up. Remove pot from heat. Let chicken cool slightly, then pull skin from meat and transfer to a shallow bowl; cover and chill (save for making the gremolata). Return pot to medium heat and cook shallots and garlic, cut side down, in the same pot, tossing shallots occasionally, until shallots are browned in spots and garlic is golden brown, about 5 minutes. Add wine, stirring to release any bits stuck on the bottom of pot, and cook until reduced by two-thirds, about 2 minutes. Add parsley, bay leaves, reserved bacon, and 8 cups water, season generously with salt and pepper, and bring to a simmer. Return chicken thighs to pot and bring stew back up to a simmer. Cover with a lid, leaving slightly askew so steam can escape, and cook, adjusting heat to maintain a very gentle simmer and skimming foam from surface as needed, until meat is tender and easily pulls away from bones, 1–1 1/2 hours. Transfer thighs to a cutting board and let cool 10–15 minutes; keep liquid at a simmer. Pull meat from bones and tear into bite-size pieces. Add bones back to pot as you go. Transfer meat to a medium bowl and cover with plastic wrap. Add kale and simmer until kale is tender and liquid is very flavorful, 25–30 minutes. Remove stew from heat, add meat back to pot, and let cool uncovered (bones and all) until no longer steaming. Cover pot and chill stew at least 12 hours (you can skip this step, but it will dramatically improve the flavor). Uncover stew and spoon off half to three-quarters of fat on the surface; discard. Gently reheat stew until barely simmering. Pluck out and discard bones, parsley, and bay leaves. Taste and season with more salt and pepper if needed. Ladle stew into bowls and top as desired.",
            "Season chicken thighs all over with salt and pepper. Cook bacon in a large Dutch oven or other heavy pot over medium-low heat, stirring often, until brown and crisp, 7–10 minutes. Using a slotted spoon, transfer bacon to a small bowl.",
            "Increase heat to medium-high. Working in 2 batches if needed, cook chicken thighs, skin side down, in the same pot until skin is golden brown, 7–10 minutes. Transfer to a large plate and turn skin side up. Remove pot from heat. Let chicken cool slightly, then pull skin from meat and transfer to a shallow bowl; cover and chill (save for making the gremolata).",
            "Return pot to medium heat and cook shallots and garlic, cut side down, in the same pot, tossing shallots occasionally, until shallots are browned in spots and garlic is golden brown, about 5 minutes. Add wine, stirring to release any bits stuck on the bottom of pot, and cook until reduced by two-thirds, about 2 minutes. Add parsley, bay leaves, reserved bacon, and 8 cups water, season generously with salt and pepper, and bring to a simmer. Return chicken thighs to pot and bring stew back up to a simmer. Cover with a lid, leaving slightly askew so steam can escape, and cook, adjusting heat to maintain a very gentle simmer and skimming foam from surface as needed, until meat is tender and easily pulls away from bones, 1–1 1/2 hours.",
            "Transfer thighs to a cutting board and let cool 10–15 minutes; keep liquid at a simmer. Pull meat from bones and tear into bite-size pieces. Add bones back to pot as you go. Transfer meat to a medium bowl and cover with plastic wrap. Add kale and simmer until kale is tender and liquid is very flavorful, 25–30 minutes.",
            "Remove stew from heat, add meat back to pot, and let cool uncovered (bones and all) until no longer steaming. Cover pot and chill stew at least 12 hours (you can skip this step, but it will dramatically improve the flavor).",
            "Uncover stew and spoon off half to three-quarters of fat on the surface; discard. Gently reheat stew until barely simmering. Pluck out and discard bones, parsley, and bay leaves. Taste and season with more salt and pepper if needed. Ladle stew into bowls and top as desired.",
            "Do Ahead Lemon oil can be made 2 days ahead. Cover and chill. Bring to room temperature before using. Stew can be made 3 days ahead. Keep chilled.",
            "Lemon oil can be made 2 days ahead. Cover and chill. Bring to room temperature before using. Stew can be made 3 days ahead. Keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5bc4da2dc031cd2d7e932cd9/6:4/w_274%2Ch_169/slow-cooked-chicken-stew-with-kale-bowl-recipe-BA-101518.jpg"
    }
}