{
    "recipe": {
        "title": "Slow-Roasted Cod with Bell Peppers and Capers ",
        "ingredients": [
            "6 medium red, orange, and/or yellow bell peppers",
            "6 Tbsp. extra-virgin olive oil, divided",
            "Kosher salt, freshly ground black pepper",
            "4 garlic cloves, smashed",
            "2 Tbsp. sherry vinegar or red wine vinegar",
            "1 tsp. crushed red pepper flakes",
            "1 (1 1/2-lb.) skinless cod, halibut, or striped bass fillet",
            "1/2 small red onion, thinly sliced",
            "1/4 cup coarsely chopped parsley",
            "2 Tbsp. drained capers",
            "Country-style bread (for serving)"
        ],
        "instructions": [
            "Place racks in center and top-most positions of oven; heat broiler. Cut bell peppers in half lengthwise and remove stems, ribs, and seeds; discard. Place bell peppers on a rimmed baking sheet and drizzle with 3 Tbsp. oil; season with salt and black pepper. Toss to coat, then turn cut side down and broil bell peppers on top rack, turning baking sheet front to back halfway through, until skins are blackened all over, 15–20 minutes.",
            "Transfer bell peppers along with oil and juices on baking sheet to a large bowl and cover tightly with plastic wrap. Let bell peppers sit 10 minutes to steam, which will loosen their skins. Reduce oven temperature to 300°F.",
            "Uncover bell peppers and peel away charred skin from flesh (don’t worry about getting every last bit); discard. Tear flesh into 1/2\" strips and place in a shallow 3-qt. baking dish along with all the accumulated juices in the bowl. Add garlic, vinegar, and red pepper flakes and toss well to combine. Taste and season with more salt.",
            "Nestle cod into bell pepper mixture, drizzle with 2 Tbsp. oil, and season with salt and black pepper. Roast on center rack until flesh is opaque throughout and flakes easily when pressed, 25–30 minutes. Let rest 10 minutes.",
            "Meanwhile, toss onion, parsley, capers, and remaining 1 Tbsp. oil in a small bowl; season with salt.",
            "Top fish with onion mixture and serve with bread.",
            "Do Ahead Bell peppers can be roasted 1 day ahead. Peel and let cool; cover and chill.",
            "Bell peppers can be roasted 1 day ahead. Peel and let cool; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aa0123a0165770628983f41/6:4/w_274%2Ch_169/slow-roasted-cod-with-bell-peppers-and-capers-recipe-BA-030718.jpg",
        "color": 16323259
    }
}