{
    "recipe": {
        "title": "Slow Cooker Ricotta-Spinach Polenta with Tomato Salad ",
        "ingredients": [
            "1 1/2 cups polenta (not instant or quick-cooking)",
            "2 tablespoons unsalted butter, cut into bits",
            "Kosher salt",
            "5 ounces baby spinach (about 5 loosely packed cups)",
            "1 pint cherry tomatoes, halved",
            "2 teaspoons extra-virgin olive oil, plus more for the eggs",
            "2 teaspoons balsamic vinegar",
            "Freshly ground black pepper",
            "4 large eggs (optional)",
            "1 cup grated Parmesan",
            "1 cup whole or part-skim milk ricotta",
            "5- to 7-quart slow cooker"
        ],
        "instructions": [
            "Combine the polenta with 6 1/2 cups water in a 5- to 7-quart slow cooker. Add the butter and 2 teaspoons salt. Cover and cook on LOW until the polenta is thick and tender, about 6 hours. With the slow cooker on LOW, stir the polenta well and then stir the spinach into the polenta in 2 batches, covering the cooker and letting the first batch wilt before adding the second, about 5 minutes per batch. Meanwhile, in a medium bowl, toss together the tomatoes, oil, and vinegar. Season the tomato salad with salt and pepper. Optional: Pour a thin layer of oil into a large skillet over medium-high heat and crack 4 eggs into the pan. Season the eggs with salt and pepper and cook until the whites are golden brown, lacy on the edges, and just set in the middle, and the yolks are still a little jiggly, about 3 minutes. Fold the Parmesan and ricotta into the polenta. Taste and season the polenta with salt if necessary. Stir in warm water by the tablespoon if the polenta is looking too thick for your taste—keep in mind it will continue to thicken as it cools. Top bowls of the polenta with the tomato salad and, if you like, the fried eggs.",
            "Combine the polenta with 6 1/2 cups water in a 5- to 7-quart slow cooker. Add the butter and 2 teaspoons salt. Cover and cook on LOW until the polenta is thick and tender, about 6 hours.",
            "With the slow cooker on LOW, stir the polenta well and then stir the spinach into the polenta in 2 batches, covering the cooker and letting the first batch wilt before adding the second, about 5 minutes per batch.",
            "Meanwhile, in a medium bowl, toss together the tomatoes, oil, and vinegar. Season the tomato salad with salt and pepper.",
            "Optional: Pour a thin layer of oil into a large skillet over medium-high heat and crack 4 eggs into the pan. Season the eggs with salt and pepper and cook until the whites are golden brown, lacy on the edges, and just set in the middle, and the yolks are still a little jiggly, about 3 minutes.",
            "Fold the Parmesan and ricotta into the polenta. Taste and season the polenta with salt if necessary. Stir in warm water by the tablespoon if the polenta is looking too thick for your taste—keep in mind it will continue to thicken as it cools. Top bowls of the polenta with the tomato salad and, if you like, the fried eggs."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aa012275d9a6873cf20d4ac/6:4/w_274%2Ch_169/ricotta-spinach-polenta-with-tomato-slow-cooker-recipe-030818.jpg"
    }
}