{
    "recipe": {
        "title": "Smashed Twice-Cooked Potatoes with Leeks and Green Garlic ",
        "ingredients": [
            "2 1/2 pounds medium Yukon Gold potatoes",
            "1/3 cup olive oil, plus more for serving",
            "Kosher salt, freshly ground pepper",
            "2 leeks, dark-green parts discarded, cut into 1\" pieces",
            "4 green garlic bulbs, white and pale-green parts only, or 2 garlic cloves, thinly sliced",
            "1 teaspoon finely grated lemon zest",
            "1 tablespoon fresh lemon juice"
        ],
        "instructions": [
            "Steam potatoes in a steamer basket in a covered pot filled with 2\" water until tender, 15-20 minutes. Transfer potatoes to a plate; let cool. Press with your hand to flatten until skins split and some flesh is exposed (a few may fall apart). Heat half of 1/3 cup oil in a large skillet over medium-high. Add half of potatoes; season with salt and pepper. Cook, tossing occasionally, until potatoes start to brown, 8-10 minutes. Add half of leeks and garlic; cook, tossing, until potatoes are brown and crisp and leeks are golden and soft, about 4 minutes. Transfer to a large bowl. Repeat with remaining oil, potatoes, leeks, and garlic. Add lemon zest and juice to potatoes and toss well; season with salt and pepper. Serve drizzled with more oil.",
            "Steam potatoes in a steamer basket in a covered pot filled with 2\" water until tender, 15-20 minutes. Transfer potatoes to a plate; let cool. Press with your hand to flatten until skins split and some flesh is exposed (a few may fall apart).",
            "Heat half of 1/3 cup oil in a large skillet over medium-high. Add half of potatoes; season with salt and pepper. Cook, tossing occasionally, until potatoes start to brown, 8-10 minutes. Add half of leeks and garlic; cook, tossing, until potatoes are brown and crisp and leeks are golden and soft, about 4 minutes. Transfer to a large bowl. Repeat with remaining oil, potatoes, leeks, and garlic.",
            "Add lemon zest and juice to potatoes and toss well; season with salt and pepper. Serve drizzled with more oil."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5537e269a628db523848a5ef/6:4/w_274%2Ch_169/56389376_smashed-twice-cooked-potatoes_1x1.jpg"
    }
}