{
    "recipe": {
        "title": "Smoke-Roasted Rustic Root Vegetables ",
        "ingredients": [
            "2 large carrots, cut into 2-inch chunks",
            "2 medium-size unpeeled russet potatoes, cut into 2-inch chunks",
            "2 medium-size unpeeled sweet potatoes, cut into 2-inch chunks",
            "1/4 cup extra-virgin olive oil, plus more for drizzling",
            "Fine sea salt and freshly ground black pepper",
            "2 tablespoons chopped fresh flat-leaf parsley, for garnish"
        ],
        "instructions": [
            "1. Toss the vegetables with the olive oil and season with salt and pepper to taste. Place the mixture on an 8 x 12-inch piece of heavy-duty aluminum foil or in a disposable aluminum pan. 2. Fill your charcoal chimney with briquets, set the chimney on the bottom grill grate, and light, or prepare a fire in your smoker. For a gas grill, turn half the burners to medium. 3. When the coals are ready, dump them into the bottom of your grill, and spread them evenly across half. Scatter the wood chips on the hot coals or place them in a metal container as close as possible to a burner on a gas grill. Place the vegetables on the indirect-heat side. Close the lid. 4. Smoke at 350°F for 45 to 60 minutes or until the potatoes are tender and the vegetables have a good, smoky aroma. Transfer the vegetables to a platter, drizzle with a little more olive oil if desired, and garnish with the chopped parsley.",
            "1. Toss the vegetables with the olive oil and season with salt and pepper to taste. Place the mixture on an 8 x 12-inch piece of heavy-duty aluminum foil or in a disposable aluminum pan.",
            "2. Fill your charcoal chimney with briquets, set the chimney on the bottom grill grate, and light, or prepare a fire in your smoker. For a gas grill, turn half the burners to medium.",
            "3. When the coals are ready, dump them into the bottom of your grill, and spread them evenly across half. Scatter the wood chips on the hot coals or place them in a metal container as close as possible to a burner on a gas grill. Place the vegetables on the indirect-heat side. Close the lid.",
            "4. Smoke at 350°F for 45 to 60 minutes or until the potatoes are tender and the vegetables have a good, smoky aroma. Transfer the vegetables to a platter, drizzle with a little more olive oil if desired, and garnish with the chopped parsley."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a56de0acd286555db806/6:4/w_274%2Ch_169/352953_hires.jpg"
    }
}