{
    "recipe": {
        "title": "Smoky Spanish Tomato Soup ",
        "ingredients": [
            "4 1/2 pounds tomatoes",
            "1 medium onion, chopped",
            "1 red bell pepper, chopped",
            "1 green bell pepper, chopped",
            "1/4 cup extra-virgin olive oil",
            "1 teaspoon sweet pimentón (smoked paprika)",
            "3 garlic cloves, peeled",
            "1 teaspoon cumin seeds",
            "1/2 cup coarse bread crumbs (from a day-old baguette)",
            "2 cups fresh figs or seedless green grapes, halved"
        ],
        "instructions": [
            "Cut a shallow X in bottom of each tomato. Blanch in batches in a pot of boiling water 15 to 30 seconds, then transfer to an ice bath. Peel and seed tomatoes, then coarsely chop. Cook onion and bell peppers in oil with 1/2 teaspoon salt in a wide 5-quart heavy pot over medium heat, stirring occasionally, until soft, about 15 minutes. Stir in tomatoes, pimentón, and 1/2 teaspoon salt and cook, uncovered, stirring occasionally, until tomatoes are tender and falling apart, about 20 minutes. Meanwhile, crush garlic to a paste with cumin using a mortar and pestle (or crush cumin with side of a heavy knife, mince and mash garlic, and stir together). Stir garlic-cumin paste and bread crumbs into tomato mixture. Purée soup in batches in a blender until smooth (use caution when blending hot liquids) and return to cleaned pot. Thin to desired consistency with water and season with salt and pepper. Serve soup topped with figs or grapes, depending on the season.",
            "Cut a shallow X in bottom of each tomato. Blanch in batches in a pot of boiling water 15 to 30 seconds, then transfer to an ice bath. Peel and seed tomatoes, then coarsely chop.",
            "Cook onion and bell peppers in oil with 1/2 teaspoon salt in a wide 5-quart heavy pot over medium heat, stirring occasionally, until soft, about 15 minutes. Stir in tomatoes, pimentón, and 1/2 teaspoon salt and cook, uncovered, stirring occasionally, until tomatoes are tender and falling apart, about 20 minutes.",
            "Meanwhile, crush garlic to a paste with cumin using a mortar and pestle (or crush cumin with side of a heavy knife, mince and mash garlic, and stir together).",
            "Stir garlic-cumin paste and bread crumbs into tomato mixture. Purée soup in batches in a blender until smooth (use caution when blending hot liquids) and return to cleaned pot. Thin to desired consistency with water and season with salt and pepper.",
            "Serve soup topped with figs or grapes, depending on the season."
        ],
        "picture_link": null
    }
}