{
    "recipe": {
        "title": "Smoky Black Bean Dip ",
        "ingredients": [
            "4 bacon slices",
            "1 medium onion, chopped",
            "1 small red bell pepper, seeded, chopped",
            "1/2 teaspoon ground cumin",
            "1/2 teaspoon dried oregano",
            "2 15-ounce cans black beans, undrained",
            "1 teaspoon chopped seeded canned chipotle chilies*",
            "1/2 cup sour cream",
            "2 tablespoons chopped fresh cilantro"
        ],
        "instructions": [
            "Cook bacon in heavy large skillet over medium heat until crisp, about 6 minutes. Drain on paper towels. Coarsely chop bacon. Pour off all but 1 tablespoon drippings from skillet. Add onion and bell pepper; sauté until onion is soft, about 6 minutes. Add cumin and oregano; sauté 1 minute. Add beans with their liquid and chipotles. Simmer over medium-low heat until slightly thickened, stirring occasionally, about 5 minutes. Transfer 1 cup bean mixture to processor. Blend until smooth. Stir blended mixture into remaining bean mixture. Season with salt and pepper. Transfer to bowl. Cover and refrigerate 2 hours. (Can be made 2 days ahead. Chill dip and bacon separately.)Stir half of bacon into dip. Top with sour cream. Sprinkle with cilantro and remaining bacon. Serve dip chilled or at room temperature.",
            "Cook bacon in heavy large skillet over medium heat until crisp, about 6 minutes. Drain on paper towels. Coarsely chop bacon. Pour off all but 1 tablespoon drippings from skillet. Add onion and bell pepper; sauté until onion is soft, about 6 minutes. Add cumin and oregano; sauté 1 minute. Add beans with their liquid and chipotles. Simmer over medium-low heat until slightly thickened, stirring occasionally, about 5 minutes.",
            "Transfer 1 cup bean mixture to processor. Blend until smooth. Stir blended mixture into remaining bean mixture. Season with salt and pepper. Transfer to bowl. Cover and refrigerate 2 hours. (Can be made 2 days ahead. Chill dip and bacon separately.)Stir half of bacon into dip. Top with sour cream. Sprinkle with cilantro and remaining bacon. Serve dip chilled or at room temperature.",
            "*Chipotle chilies canned in a spicy tomato sauce, sometimes called adobo, are available at Latin American markets, specialty foods stores and some supermarkets.",
            "*Chipotle chilies canned in a spicy tomato sauce, sometimes called adobo, are available at Latin American markets, specialty foods stores and some supermarkets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea7e3f9a84192308a9abf/6:4/w_274%2Ch_169/104800.jpg"
    }
}