{
    "recipe": {
        "title": "Smoky Turkey Corn Chowder with Bacon ",
        "ingredients": [
            "6 slices bacon (4 ounces)",
            "1 medium yellow onion, chopped",
            "1 medium carrot, sliced into 1/4-inch thick rounds (halved lengthwise if large)",
            "1 teaspoon kosher salt",
            "1/2 teaspoon freshly ground black pepper",
            "1 red bell pepper, seeded and chopped",
            "1/2 medium jalapeño, finely chopped, plus more to taste",
            "1 teaspoon ground cumin",
            "6 cups (48 ounces) homemade or store-bought low-sodium chicken or turkey broth",
            "1 medium sweet potato (about 1 pound), peeled and cut into 1/2-inch cubes",
            "Two 4-ounce cans mild diced green chiles, drained",
            "2 teaspoons dried oregano",
            "2 dried bay leaves",
            "4 cups shredded turkey or rotisserie chicken",
            "10 ounces frozen corn, thawed",
            "3/4 cup half-and-half, plus more to taste",
            "Sliced scallions, for serving",
            "Chopped parsley, for serving"
        ],
        "instructions": [
            "In a large pot over medium heat, cook bacon until crisp, 8 to 10 minutes. Drain on a paper towel and crumble into small pieces and set aside, reserving the fat in the pot.",
            "Pour off all but 1 tablespoon fat, return the pot to medium heat, and add onion, carrot, 1/2 teaspoon salt, and 1/4 teaspoon pepper. Cook, stirring occasionally, until softened, about 5 minutes. Add bell pepper and cook, stirring occasionally, for 3 minutes more. Add jalapeño and cumin and cook, stirring, 1 minute more.",
            "Add broth, sweet potato, chiles, oregano, and bay leaves and bring to a simmer. Cook until sweet potato is tender, about 10 minutes. Stir in the turkey or chicken and corn and cook until warmed through, 3 to 5 minutes. Add 1/2 teaspoon salt, 1/4 teaspoon pepper, and half-and-half. Continue to cook until just warmed through. Taste and adjust seasoning, thinning the chowder with another 1/4 cup half-and-half, if desired.",
            "Serve chowder topped with crumbled bacon, scallions, and parsley."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b873f57cbba01c0db7d72a/6:4/w_274%2Ch_169/51255640_chicken-corn-chowder_1x1.jpg",
        "color": 10177067
    }
}