{
    "recipe": {
        "title": "Smoked Turkey-Pesto Pizza ",
        "ingredients": [
            "6 unpeeled garlic cloves",
            "3 tablespoons olive oil",
            "Cornmeal",
            "Pizza Dough",
            "6 tablespoons purchased pesto",
            "1 cup grated mozzarella cheese",
            "1/4 cup grated provolone cheese",
            "1 cup 2 x 1/4 x 1/4-inch strips smoked turkey (about 4 ounces)",
            "1 6 1/2-ounce jar marinated artichoke hearts, drained, sliced",
            "6 1/4-inch-thick slices fresh mozzarella cheese, each cut into quarters",
            "1 plum tomato, seeded, chopped"
        ],
        "instructions": [
            "Preheat oven to 350°F. Place garlic in small dish. Drizzle 2 tablespoons oil over. Bake until garlic is very tender and golden brown, about 20 minutes. Remove garlic from oven and cool. Peel garlic cloves; chop. Set garlic aside. Increase oven temperature to 475°F. Dust 2 large baking sheets with cornmeal. Roll and stretch each Pizza Dough ball on lightly floured surface to 9- to 10-inch circle. Place crusts on prepared baking sheets. Brush edges of crusts with 1 tablespoon olive oil. Spread 3 tablespoons pesto over each crust, leaving 1/2-inch border. Divide grated mozzarella and provolone, then turkey, artichoke hearts, garlic and sliced mozzarella between crusts. Bake pizzas until cheese melts and bottom of crusts is golden, about 15 minutes. Remove pizzas from oven. Sprinkle chopped tomato over.",
            "Preheat oven to 350°F. Place garlic in small dish. Drizzle 2 tablespoons oil over. Bake until garlic is very tender and golden brown, about 20 minutes. Remove garlic from oven and cool. Peel garlic cloves; chop. Set garlic aside. Increase oven temperature to 475°F.",
            "Dust 2 large baking sheets with cornmeal. Roll and stretch each Pizza Dough ball on lightly floured surface to 9- to 10-inch circle. Place crusts on prepared baking sheets. Brush edges of crusts with 1 tablespoon olive oil. Spread 3 tablespoons pesto over each crust, leaving 1/2-inch border. Divide grated mozzarella and provolone, then turkey, artichoke hearts, garlic and sliced mozzarella between crusts.",
            "Bake pizzas until cheese melts and bottom of crusts is golden, about 15 minutes. Remove pizzas from oven. Sprinkle chopped tomato over."
        ],
        "picture_link": null
    }
}