{
    "recipe": {
        "title": "S'mores Crêpes ",
        "ingredients": [
            "1 cup whole milk",
            "3 large eggs",
            "1 cup whole-wheat pastry flour or spelt flour",
            "3 tablespoons unsalted butter, melted, plus additional for brushing pan",
            "1 teaspoon sugar",
            "1/4 teaspoon salt",
            "6 ounces 60% bittersweet chocolate, broken into small pieces or chopped",
            "6 tablespoons heavy cream",
            "1 1/2 cups marshmallow spread (homemade or store-bought)",
            "1 to 2 teaspoons warm water",
            "1 tablespoon unsalted butter, melted",
            "2 teaspoons confectioners' sugar",
            "6 ounces raspberries (1 1/4 cups; optional)",
            "10-inch nonstick skillet (ideally with an 8-inch bottom)"
        ],
        "instructions": [
            "In a blender, combine all crêpe ingredients and purée on low speed until smooth (scrape down sides of blender, if necessary, and blend again until smooth; do not overblend). Transfer to an airtight container and refrigerate, covered, at least 1 hour.",
            "Make chocolate filling while batter is chilling: In a small heavy saucepan over medium-low heat, melt chocolate and cream, stirring, until smooth. Transfer to a small bowl and set aside.",
            "In a small heavy saucepan over medium-low heat, melt chocolate and cream, stirring, until smooth. Transfer to a small bowl and set aside.",
            "Make marshmallow filling while batter is chilling: In a bowl, whisk together marshmallow spread and water (start with 1 teaspoon water) until it is easily spreadable. Keep covered at room temperature.",
            "In a bowl, whisk together marshmallow spread and water (start with 1 teaspoon water) until it is easily spreadable. Keep covered at room temperature.",
            "Cook crêpes: Whisk batter. Brush skillet lightly with additional melted butter and heat over medium heat until hot. Fill a 1/4-cup measure three-quarters full with batter, then lift skillet from heat and pour in batter, tilting and rotating skillet to coat bottom in a thin, even layer. (If batter sets before skillet is coated, reduce heat slightly. Next crêpe will be better. If batter is too thick to make a thin crêepe, stir in 1 to 2 tablespoons of water.) Cook crêpe until golden around edges and dry in center, about 45 seconds. Loosen crêpe from skillet with a heat-proof plastic spatula; with fingertips or spatula, flip crêpe over. Cook until underside is golden, about 15 seconds, then slide crêpe onto a kitchen towel and fold towel over it. Make more crêpes, brushing pan with additional melted butter occasionally (it's not necessary to brush every time) and stacking them on top of each other in the towel. (You should have about 12 to 14 crêpes.)",
            "Whisk batter. Brush skillet lightly with additional melted butter and heat over medium heat until hot. Fill a 1/4-cup measure three-quarters full with batter, then lift skillet from heat and pour in batter, tilting and rotating skillet to coat bottom in a thin, even layer. (If batter sets before skillet is coated, reduce heat slightly. Next crêpe will be better. If batter is too thick to make a thin crêepe, stir in 1 to 2 tablespoons of water.)",
            "Cook crêpe until golden around edges and dry in center, about 45 seconds. Loosen crêpe from skillet with a heat-proof plastic spatula; with fingertips or spatula, flip crêpe over. Cook until underside is golden, about 15 seconds, then slide crêpe onto a kitchen towel and fold towel over it.",
            "Make more crêpes, brushing pan with additional melted butter occasionally (it's not necessary to brush every time) and stacking them on top of each other in the towel. (You should have about 12 to 14 crêpes.)",
            "Assemble crêpes: Preheat broiler. Put a crêpe on a work surface. Spread 1 tablespoon of chocolate filling evenly over crêpe. Top with 1 tablespoon marshmallow and spread it evenly. Fold crêpe in half, then fold into thirds to form a wedge shape. Fill and fold remaining crêpes and arrange on a buttered, large, rimmed sheet pan. Brush crêpes lightly with melted butter, then sift confectioners' sugar over them. Broil crêpes about 6 to 7 inches from heat until golden brown, about 1 to 2 minutes. Transfer to plates and serve with raspberries if you like.",
            "Preheat broiler.",
            "Put a crêpe on a work surface. Spread 1 tablespoon of chocolate filling evenly over crêpe. Top with 1 tablespoon marshmallow and spread it evenly. Fold crêpe in half, then fold into thirds to form a wedge shape. Fill and fold remaining crêpes and arrange on a buttered, large, rimmed sheet pan.",
            "Brush crêpes lightly with melted butter, then sift confectioners' sugar over them. Broil crêpes about 6 to 7 inches from heat until golden brown, about 1 to 2 minutes.",
            "Transfer to plates and serve with raspberries if you like."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b2e10211c5d6af478b2f4c/6:4/w_274%2Ch_169/365549_s'mores-cr%25EApes_1x1.jpg"
    }
}