{
    "recipe": {
        "title": "Snapper with Blistered Bean Salad and Chile Vinegar ",
        "ingredients": [
            "1 habanero chile, seeds removed, finely chopped",
            "1 small garlic clove, finely chopped",
            "1/2 cup unseasoned rice vinegar",
            "4 1/2 teaspoons light brown sugar",
            "Kosher salt",
            "2 small red onions, cut through root ends into 8 wedges",
            "2 cups sugar snap peas, strings removed",
            "2 tablespoons olive oil, divided, plus more for drizzling",
            "1 pound green beans, trimmed",
            "4 (6-ounce) snapper fillets",
            "1 cup torn basil leaves",
            "1/4 cup crushed salted, dry-roasted peanuts"
        ],
        "instructions": [
            "Prepare a grill for medium-high heat. Put a large cast-iron skillet on grill to heat.",
            "Meanwhile, stir chile, garlic, vinegar, and brown sugar in a small bowl until sugar is dissolved; season chile vinegar with salt. Set aside. Toss onions, sugar snap peas, and 1 1/2 tsp. oil in a large bowl; season with salt.",
            "As soon as skillet is hot, add vegetables and cook, stirring occasionally, until blistered and crisp-tender, 6–8 minutes for onions and about 4 minutes for sugar snap peas. Transfer to a platter.",
            "Toss green beans and 1 1/2 tsp. oil in another large bowl and cook directly on grill grate on one side until blistered, lightly charred, and crisp-tender, about 3 minutes. Transfer to platter with onions and sugar snap peas and toss to coat; drizzle reserved chile vinegar over.",
            "Wipe out skillet with paper towels. Add 1 Tbsp. oil and set back on grill. Season snapper all over with salt and cook, skin side down, in skillet until skin is golden brown and crisp, about 4 minutes. Turn and cook just until cooked through, about 2 minutes.",
            "Set snapper on top of bean salad and top with basil and peanuts."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5949578f214b311c5ab9e3d4/6:4/w_274%2Ch_169/pan-seared-snapper-with-blistered-green-bean-salad-recipe-BA-062017.jpg"
    }
}