{
    "recipe": {
        "title": "Soft Gingerbread Tiles with Rum Butter Glaze ",
        "ingredients": [
            "6 tbsp (85 g) unsalted butter, at room temperature",
            "1/3 packed cup plus 2 tbsp (90 g) dark brown sugar",
            "1/4 cup (100 g) blackstrap molasses",
            "1 large egg yolk",
            "1 3/4 cups plus 2 tbsp (235 g) all-purpose flour, plus extra for pressing",
            "1 tbsp Dutch-processed cocoa powder",
            "1/2 tsp baking soda",
            "1 tsp ground ginger",
            "1/2 tsp ground cinnamon",
            "1/8 tsp ground cloves",
            "1/4 tsp salt",
            "1/4 tsp freshly ground black pepper",
            "2/3 cup (80 g) confectioners' sugar",
            "1/8 tsp ground cinnamon",
            "1 tbsp (15 g) unsalted butter, melted and warm",
            "1 tbsp dark rum (or lemon juice)",
            "1 tsp warm water"
        ],
        "instructions": [
            "Place the butter, sugar and molasses in the bowl of an electric mixer with the paddle attachment in place. Beat on medium speed until smooth and incorporated. Add the egg yolk and continue to beat until fully combined.",
            "Sift the flour, cocoa powder, baking soda, ginger, cinnamon, cloves, salt and pepper into a bowl. Turn the speed of the mixer to low, and add the dry ingredients to the butter and molasses. Once the mix comes together, tip the dough onto a lightly floured work surface and knead gently. Roll out the dough so that it is about 1/4 inch/ 0.5 cm thick. If the dough is very soft, you will need to chill it.",
            "Preheat the oven to 375°F/190°C. Line two baking sheets with parchment paper and set aside.",
            "Dip the cookie stamps in a small bowl of flour, shake off any excess and then press them firmly into the dough, one at a time, to create a deep imprint. How far you need to press to get an imprint will depend on your stamp; the patterns on some are more deeply cut than others. Bear in mind that the cookies rise a little when cooked, so any soft imprints will disappear. Using a round cookie cutter that is slightly larger than the pattern, cut out the pieces of imprinted gingerbread. Transfer the cookies to the lined baking sheets, spaced about 3/4 inch/2 cm apart. Reroll the dough and continue to stamp and cut cookies until all the dough is used up.",
            "Bake for 9–10 minutes, rotating the sheets halfway through, until firm to the touch. They will continue to firm up as they cool, so don’t be tempted to bake them for any longer.",
            "To make the rum butter glaze while the gingerbreads are in the oven, as the glaze needs to be brushed onto the cookies while they are still warm, sift the confectioners’ sugar and cinnamon into a small bowl. Add the melted butter, rum (or lemon juice) and water and mix with a spoon until smooth. The glaze will thicken slightly if it sits around, so stir through a little more warm water if you need to—it should be the consistency of runny honey.",
            "Remove the cookies from the oven, leave them to cool for 5 minutes, then brush or dab the glaze all over with a pastry brush. Transfer to a wire rack to cool completely.",
            "Make-Ahead Once the dough is made, it can be covered in plastic wrap and kept in the fridge for up to 2 days before baking.",
            "Once the dough is made, it can be covered in plastic wrap and kept in the fridge for up to 2 days before baking.",
            "Storage These will keep for up to 5 days in an airtight container. The glaze will discolor and crack a little, but this will not affect how they taste.",
            "These will keep for up to 5 days in an airtight container. The glaze will discolor and crack a little, but this will not affect how they taste."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a25f00dae15b063aabffcf5/6:4/w_274%2Ch_169/soft-gingerbread-tile-cookie-recipe-yotam-ottolenghi-120417.jpg",
        "color": 16524465
    }
}