{
    "recipe": {
        "title": "Sole en Papillote with Tomatoes and Olives ",
        "ingredients": [
            "Parchment paper",
            "4 sole fillets (6 ounces each)",
            "1 tablespoon plus 4 teaspoons olive oil, divided",
            "3 cloves garlic, 2 thinly sliced, 1 halved",
            "1/8 teaspoon red pepper flakes",
            "1 cup grape tomatoes, halved",
            "2 tablespoons capers, drained",
            "8 large, pitted kalamata olives, quartered",
            "1/2 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "8 teaspoons dry white wine",
            "4 teaspoons unsalted butter",
            "8 fresh thyme sprigs",
            "4 slices (1/2-inch thick) ciabatta bread"
        ],
        "instructions": [
            "Heat oven to 450°F. Fold four 15-inch-square pieces of parchment in half. Starting at fold of each piece, draw half a large heart shape. Cut along lines; open. Place 1 fish fillet next to crease on each piece of parchment. In a small skillet, warm 1 tbsp oil over medium heat. Sauté sliced garlic and pepper flakes until garlic turns golden, 1 minute. Remove skillet from heat; stir in tomatoes, capers and olives. Sprinkle fish with salt and pepper. Divide tomato mixture among fish. Top each fillet with 2 teaspoon wine, 1 teaspoon butter and 2 thyme sprigs. Fold other half of parchment over fish. Starting at top of each parchment half-heart, make small, tight, overlapping folds along outside edge to seal packet; twist tail ends tightly to seal completely. Place packets on a large rimmed baking sheet; roast 8 minutes. Broil or toast ciabatta until golden; rub with garlic clove halves and brush with remaining 4 teaspoon oil. Transfer packets to plates. Slit tops with a knife; gently open. Serve 1 slice ciabatta with each packet."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5604010208929a1609a1e61a/6:4/w_274%2Ch_169/51101600.jpg"
    }
}