{
    "recipe": {
        "title": "Souffléed Cheesecake ",
        "ingredients": [
            "1 3/4 cups (7 ounces) graham cracker crumbs (store-bought, or make Whole Wheat Graham Crackers)",
            "2 tablespoons (1 ounce) unsalted butter, melted",
            "1/8 teaspoon Diamond Crystal kosher salt (half as much if iodized)",
            "2 pounds cream cheese (four 8-ounce packages), softened—about 70°F",
            "1 cup (8 ounces) fresh goat cheese (not precrumbled), softened—about 70°F",
            "1 tablespoon freshly squeezed lemon juice",
            "1 tablespoon vanilla extract",
            "1/4 teaspoon Diamond Crystal kosher salt (half as much if iodized)",
            "1/4 teaspoon orange flower water",
            "2 cups (14 ounces) sugar",
            "6 large eggs, straight from the fridge",
            "3/4 cup (6 ounces) heavy cream"
        ],
        "instructions": [
            "Adjust oven rack to lower-middle position and preheat to 450°F. This recipe requires an 8-by-3 3/4-inch round pan, whether springform, non-latching with a removable bottom, or a traditional cake pan. With a two-piece pan, wrap the bottom in foil before attaching the sides. With a solid pan, line the bottom with parchment paper. In either case, lightly grease the pan.",
            "Add the crumbs, butter, and salt to the prepared pan, stir with a fork until well combined, and then compress into an even layer.",
            "Make the cheesecake filling: Combine cream cheese, goat cheese, lemon juice, vanilla extract, salt, and orange flower water in the bowl of a stand mixer fitted with a paddle attachment. Mix on low speed until roughly combined, then increase to medium and beat until smooth, about 5 minutes; halfway through, pause to scrape the bowl and beater with a flexible spatula. Reduce speed to medium-low, add sugar all at once, and mix until well combined. Set a fine-mesh sieve over the bowl, crack in the eggs, and whisk until they pass through; discard any clots that remain. Resume mixing on low until well combined, then scrape the bowl and beater once more. In a 1-quart stainless steel saucepan, bring the cream to a full boil. Add to batter while mixing on low; this helps release any air pockets introduced in mixing. Use immediately, or refrigerate until needed—up to 1 week (bring to room temperature before baking). Pour into the prepared pan and place on a baking sheet. Bake until the cheesecake puffs 1/2 inch over the rim of the pan and is golden on top, about 20 minutes. If necessary, rotate the baking sheet halfway through baking to ensure even browning. Turn off the oven and open the door to vent for 10 minutes. Close the door, set oven to 250°F, and continue baking until the outer edges of the cheesecake feel firm and the center registers 145°F on a digital thermometer, about 35 minutes. Cool cheesecake for 15 minutes, then run a thin knife around the sides to loosen (this helps the cake settle evenly as it cools). Cool for an hour more, then cover and refrigerate until cold, at least 12 hours.",
            "Combine cream cheese, goat cheese, lemon juice, vanilla extract, salt, and orange flower water in the bowl of a stand mixer fitted with a paddle attachment. Mix on low speed until roughly combined, then increase to medium and beat until smooth, about 5 minutes; halfway through, pause to scrape the bowl and beater with a flexible spatula.",
            "Reduce speed to medium-low, add sugar all at once, and mix until well combined. Set a fine-mesh sieve over the bowl, crack in the eggs, and whisk until they pass through; discard any clots that remain. Resume mixing on low until well combined, then scrape the bowl and beater once more.",
            "In a 1-quart stainless steel saucepan, bring the cream to a full boil. Add to batter while mixing on low; this helps release any air pockets introduced in mixing. Use immediately, or refrigerate until needed—up to 1 week (bring to room temperature before baking).",
            "Pour into the prepared pan and place on a baking sheet. Bake until the cheesecake puffs 1/2 inch over the rim of the pan and is golden on top, about 20 minutes. If necessary, rotate the baking sheet halfway through baking to ensure even browning.",
            "Turn off the oven and open the door to vent for 10 minutes. Close the door, set oven to 250°F, and continue baking until the outer edges of the cheesecake feel firm and the center registers 145°F on a digital thermometer, about 35 minutes.",
            "Cool cheesecake for 15 minutes, then run a thin knife around the sides to loosen (this helps the cake settle evenly as it cools). Cool for an hour more, then cover and refrigerate until cold, at least 12 hours.",
            "Unmold the cheesecake: Loosen the sides of the cheesecake with a thin knife. For a springform pan, simply pop the latch and remove the sides. For a non-latching pan, set on a large can of tomatoes or similarly sized object and use both hands to carefully drop the outer ring. For a solid cake pan, let stand in a few inches of scalding water until the pan feels warm. Drape the cake with plastic wrap and invert onto a large flat plate. Remove the pan or the bottom of a two-piece pan, peel off the parchment, and invert onto a serving plate. Cut with a long thin knife, pausing to clean the blade under hot running water between slices. Tightly wrapped in plastic, leftovers will keep for up to 10 days in the fridge. Cut with a long thin knife, pausing to clean the blade under hot running water between slices. Tightly wrapped in plastic, leftovers will keep for up to 10 days in the fridge.",
            "Loosen the sides of the cheesecake with a thin knife. For a springform pan, simply pop the latch and remove the sides. For a non-latching pan, set on a large can of tomatoes or similarly sized object and use both hands to carefully drop the outer ring. For a solid cake pan, let stand in a few inches of scalding water until the pan feels warm. Drape the cake with plastic wrap and invert onto a large flat plate. Remove the pan or the bottom of a two-piece pan, peel off the parchment, and invert onto a serving plate.",
            "Cut with a long thin knife, pausing to clean the blade under hot running water between slices. Tightly wrapped in plastic, leftovers will keep for up to 10 days in the fridge.",
            "Cut with a long thin knife, pausing to clean the blade under hot running water between slices. Tightly wrapped in plastic, leftovers will keep for up to 10 days in the fridge.",
            "Mix it up! Cookie Crumb Cheesecake: Replace the Graham Cracker crumbs with an equal amount of Oreo crumbs or Nutter Butter crumbs. Fromage: For a truly cheesy cake, reduce the cream cheese to 24 ounces, omit the goat cheese, and divide the remaining 16 ounces between two or more of your favorite soft, rich cheeses. Some of my favorites include Fromage d’Affinois, Saint-Marcellin, Bûcheron, mascarpone, and even Saint Agur (a particularly creamy blue). Their flavor will shine through clearly, so choose something you know and love. Green Tea Cheesecake: The herbal, mossy flavor of Japanese green tea provides a lovely counterpoint to the tangy richness of cream cheese. Simply whisk 2 tablespoons matcha (not bagged or loose green tea) into the sugar and proceed as directed. Pumpkin Cheesecake: Reduce cream cheese to 1 1/2 pounds (3 cups), replace lemon juice with ½ ounce (1 tablespoon) dark rum, and increase kosher salt to 1/2 teaspoon. Along with sugar, add 2 teaspoons ground cinnamon, 1½ teaspoons ground ginger, and 1/2 teaspoon ground cloves. Omit heavy cream, and replace with 15 ounces (1 2/3 cups) pumpkin puree. If you like, serve with butterscotch sauce and a sprinkling of toasted hazelnut pieces. Gluten-Free: Prepare crust with the Gluten-Free variation of my Crispy Whole Wheat Graham Crackers (TK LINK TO RECIPE); thanks to the roasted soybean flour in the dough, they bake up with a nutty richness much like classic whole wheat.",
            "Cookie Crumb Cheesecake: Replace the Graham Cracker crumbs with an equal amount of Oreo crumbs or Nutter Butter crumbs.",
            "Fromage: For a truly cheesy cake, reduce the cream cheese to 24 ounces, omit the goat cheese, and divide the remaining 16 ounces between two or more of your favorite soft, rich cheeses. Some of my favorites include Fromage d’Affinois, Saint-Marcellin, Bûcheron, mascarpone, and even Saint Agur (a particularly creamy blue). Their flavor will shine through clearly, so choose something you know and love.",
            "Green Tea Cheesecake: The herbal, mossy flavor of Japanese green tea provides a lovely counterpoint to the tangy richness of cream cheese. Simply whisk 2 tablespoons matcha (not bagged or loose green tea) into the sugar and proceed as directed.",
            "Pumpkin Cheesecake: Reduce cream cheese to 1 1/2 pounds (3 cups), replace lemon juice with ½ ounce (1 tablespoon) dark rum, and increase kosher salt to 1/2 teaspoon. Along with sugar, add 2 teaspoons ground cinnamon, 1½ teaspoons ground ginger, and 1/2 teaspoon ground cloves. Omit heavy cream, and replace with 15 ounces (1 2/3 cups) pumpkin puree. If you like, serve with butterscotch sauce and a sprinkling of toasted hazelnut pieces.",
            "Gluten-Free: Prepare crust with the Gluten-Free variation of my Crispy Whole Wheat Graham Crackers (TK LINK TO RECIPE); thanks to the roasted soybean flour in the dough, they bake up with a nutty richness much like classic whole wheat."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a14b3218ae55b4da7565773/6:4/w_274%2Ch_169/souffleed-cheesecake-bravetart-recipe-112117.jpg",
        "color": 3733405
    }
}