{
    "recipe": {
        "title": "Sour Cherry Pie ",
        "ingredients": [
            "1/3 cup almond flour",
            "1/4 cup granulated sugar",
            "1 teaspoon kosher salt",
            "2 1/4 cups all-purpose flour, plus more for surface",
            "1 cup (2 sticks) chilled unsalted butter, cut into pieces",
            "2 large egg yolks",
            "All-purpose flour for surface",
            "1 cup granulated sugar",
            "1 tablespoon finely grated lime zest",
            "3 tablespoons cornstarch",
            "Pinch of kosher salt",
            "3 pounds fresh sour cherries, pitted, or 6 cups frozen sour cherries",
            "1 large egg, beaten to blend",
            "Demerara sugar or granulated sugar (for sprinkling)"
        ],
        "instructions": [
            "Pulse almond flour, granulated sugar, salt, and 2 1/2 cups all-purpose flour in a food processor. Add butter and pulse until mixture resembles coarse cornmeal.",
            "Whisk egg yolks and 1/4 cup ice water in a small bowl and drizzle over flour mixture. Pulse, drizzling in more ice water as needed, until dough just comes together (a few dry spots are okay).",
            "Gently knead dough on a lightly floured surface until no dry spots remain, about 1 minute. Divide dough in half and pat each piece into a disk; wrap in plastic. Chill at least 2 hours.",
            "Do ahead: Dough can be made 3 days ahead. Keep chilled.",
            "Filling and assembly: Preheat oven to 425°F. Let dough sit at room temperature to soften slightly, about 5 minutes. Roll out 1 disk of dough on a lightly floured surface to a 12\" round. Transfer to a parchment-lined baking sheet and chill. Repeat with remaining disk of dough. Combine granulated sugar and lime zest in a large bowl, rubbing together with your fingertips to release oils in zest. Whisk in cornstarch and salt until there are no lumps in cornstarch. Add cherries and toss to coat. Carefully transfer 1 crust to a 9\" pie dish. Lift up edges and allow dough to slump down into dish. Trim edges to even out crust if needed. Scrape in cherry filling. Using a 3/4\"-diameter pastry tip or cookie cutter, punch out holes in remaining crust, covering an area just smaller than the diameter of pie dish. Place over filling. Fold edge of top crust underneath edge of bottom crust and press together to seal. Crimp as desired. (Alternatively, assemble pie, then cut X's or slits into crust.) Brush crust with egg and sprinkle with demerara sugar. Chill pie until crust is firm, 20-30 minutes. Place pie on a parchment-or foil-lined baking sheet. Bake until crust is golden, about 30 minutes. Reduce oven temperature to 350°F and bake, tenting with foil if crust is browning too quickly, until juices are bubbling and crust is deep golden brown, 50-60 minutes longer. Transfer to a wire rack and let cool at least 4 hours before slicing. Do ahead: Pie can be baked 1 day ahead. Store tightly wrapped at room temperature.",
            "Preheat oven to 425°F. Let dough sit at room temperature to soften slightly, about 5 minutes. Roll out 1 disk of dough on a lightly floured surface to a 12\" round.",
            "Transfer to a parchment-lined baking sheet and chill. Repeat with remaining disk of dough.",
            "Combine granulated sugar and lime zest in a large bowl, rubbing together with your fingertips to release oils in zest. Whisk in cornstarch and salt until there are no lumps in cornstarch. Add cherries and toss to coat.",
            "Carefully transfer 1 crust to a 9\" pie dish. Lift up edges and allow dough to slump down into dish. Trim edges to even out crust if needed. Scrape in cherry filling.",
            "Using a 3/4\"-diameter pastry tip or cookie cutter, punch out holes in remaining crust, covering an area just smaller than the diameter of pie dish. Place over filling. Fold edge of top crust underneath edge of bottom crust and press together to seal. Crimp as desired. (Alternatively, assemble pie, then cut X's or slits into crust.)",
            "Brush crust with egg and sprinkle with demerara sugar. Chill pie until crust is firm, 20-30 minutes.",
            "Place pie on a parchment-or foil-lined baking sheet. Bake until crust is golden, about 30 minutes. Reduce oven temperature to 350°F and bake, tenting with foil if crust is browning too quickly, until juices are bubbling and crust is deep golden brown, 50-60 minutes longer. Transfer to a wire rack and let cool at least 4 hours before slicing.",
            "Do ahead: Pie can be baked 1 day ahead. Store tightly wrapped at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac25206529d92b2c038847/6:4/w_274%2Ch_169/51236300_sour-cherry-pie_1x1.jpg"
    }
}