{
    "recipe": {
        "title": "Southwestern-Style Baby Back Ribs ",
        "ingredients": [
            "1 tablespoon dried thyme",
            "1 tablespoon granulated garlic",
            "1 tablespoon onion powder",
            "1 tablespoon brown sugar",
            "1 tablespoon paprika",
            "1 tablespoon chili powder",
            "1 teaspoon dried rosemary",
            "1 teaspoon salt",
            "1 teaspoon ground black pepper",
            "3 racks baby back ribs, about 5 pounds",
            "3 cups barbecue sauce"
        ],
        "instructions": [
            "In a small bowl, mix together the thyme, garlic, onion powder, brown sugar, paprika, chili powder, rosemary, salt, and black pepper. Rub the spice mixture over both sides of the ribs. Wrap in plastic and refrigerate overnight or up to 24 hours.",
            "Preheat the oven to 325°F. Unwrap the ribs and place them on a baking sheet. Cover completely with foil. Bake for 1 hour and 10 minutes. Remove the foil and let the ribs cool. Refrigerate them, wrapped in plastic, until you are ready to pack, up to 24 hours.",
            "Just before leaving, cut the racks into individual ribs and place them in a large, sealable plastic container. Add 1 cup of the barbecue sauce and stir so all the ribs are coated.",
            "At the tailgate Prepare coals for a medium fire. When the coals are hot, grill the ribs for 10 minutes, until they are lightly charred and heated through, turning them several times and applying several more moppings of sauce.",
            "Prepare coals for a medium fire. When the coals are hot, grill the ribs for 10 minutes, until they are lightly charred and heated through, turning them several times and applying several more moppings of sauce.",
            "Serve the ribs hot, accompanied by more sauce.",
            "Serve the ribs hot, accompanied by more sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5748af020a1dff6d6f8fa09c/6:4/w_274%2Ch_169/shutterstock_138510020.jpg"
    }
}