{
    "recipe": {
        "title": "Spaghetti and Meatballs ",
        "ingredients": [
            "2 28-ounce cans whole peeled tomatoes in juice, drained, juice reserved, tomatoes finely chopped",
            "1/2 cup (1 stick) unsalted butter",
            "2 medium onions, peeled, halved through root end",
            "1/2 teaspoon (or more) salt",
            "1 cup fresh breadcrumbs made from crustless French or country-style bread",
            "1/3 cup whole milk",
            "8 ounces ground beef (15% fat)",
            "8 ounces ground pork",
            "1 cup finely ground (not grated) Parmesan cheese",
            "1/3 cup finely chopped Italian parsley",
            "1 teaspoon salt",
            "1/4 teaspoon freshly ground black pepper",
            "2 large eggs",
            "2 large garlic cloves, pressed",
            "1 pound spaghetti",
            "Freshly grated Parmesan cheese (for serving)"
        ],
        "instructions": [
            "For sauce: Combine tomatoes with juice, butter, onions, and salt in large wide pot. Bring to simmer over medium heat. Reduce heat; simmer uncovered 45 minutes, stirring occasionally. Discard onions. Using immersion blender, process sauce briefly to break up any large pieces of tomato (texture should be even but not completely smooth). Season sauce with more salt and freshly ground black pepper. Remove from heat.",
            "Combine tomatoes with juice, butter, onions, and salt in large wide pot. Bring to simmer over medium heat. Reduce heat; simmer uncovered 45 minutes, stirring occasionally. Discard onions. Using immersion blender, process sauce briefly to break up any large pieces of tomato (texture should be even but not completely smooth). Season sauce with more salt and freshly ground black pepper. Remove from heat.",
            "For meatballs: Combine breadcrumbs and milk in small bowl; stir until breadcrumbs are evenly moistened. Let stand 10 minutes. Place beef and pork in large bowl and break up into small chunks. Add 1 cup ground Parmesan, parsley, salt, and pepper. Whisk eggs to blend in small bowl; whisk in garlic. Add to meat mixture. Using hands, squeeze milk from breadcrumbs, reserving milk. Add breadcrumbs to meat mixture. Using hands, quickly and gently mix meat mixture just until all ingredients are evenly combined (do not overmix). Chill mixture at least 15 minutes and up to 1 hour. Moisten hands with some of reserved milk from breadcrumbs, then roll meat mixture between palms into golf-ball-size balls, occasionally moistening hands with milk as needed and arranging meatballs in single layer in sauce in pot. Bring to simmer. Reduce heat to medium-low, cover, and simmer until meatballs are cooked through, 15 to 20 minutes. DO AHEAD: Can be made 2 days ahead. Cool slightly. Chill uncovered until cold, then cover and keep chilled. Rewarm before continuing. Cook spaghetti in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain. Using slotted spoon, transfer meatballs to platter. Add pasta to sauce in pot and toss to coat. Divide pasta among 6 plates. Top each serving with meatballs. Sprinkle meatballs with freshly grated Parmesan cheese and serve.",
            "Combine breadcrumbs and milk in small bowl; stir until breadcrumbs are evenly moistened. Let stand 10 minutes.",
            "Place beef and pork in large bowl and break up into small chunks. Add 1 cup ground Parmesan, parsley, salt, and pepper.",
            "Whisk eggs to blend in small bowl; whisk in garlic. Add to meat mixture.",
            "Using hands, squeeze milk from breadcrumbs, reserving milk. Add breadcrumbs to meat mixture. Using hands, quickly and gently mix meat mixture just until all ingredients are evenly combined (do not overmix). Chill mixture at least 15 minutes and up to 1 hour.",
            "Moisten hands with some of reserved milk from breadcrumbs, then roll meat mixture between palms into golf-ball-size balls, occasionally moistening hands with milk as needed and arranging meatballs in single layer in sauce in pot. Bring to simmer.",
            "Reduce heat to medium-low, cover, and simmer until meatballs are cooked through, 15 to 20 minutes. DO AHEAD: Can be made 2 days ahead. Cool slightly. Chill uncovered until cold, then cover and keep chilled. Rewarm before continuing.",
            "Cook spaghetti in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain.",
            "Using slotted spoon, transfer meatballs to platter. Add pasta to sauce in pot and toss to coat. Divide pasta among 6 plates. Top each serving with meatballs. Sprinkle meatballs with freshly grated Parmesan cheese and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b33c9f21388ef838b07afc/6:4/w_274%2Ch_169/361349_spaghetti-meatballs_1x1.jpg"
    }
}