{
    "recipe": {
        "title": "Spaghetti with Spicy Tomato Sauce ",
        "ingredients": [
            "1/2 pound spaghetti",
            "4 large garlic cloves",
            "1 1/2 pounds cherry tomatoes",
            "4 fresh basil sprigs",
            "3 fresh oregano sprigs",
            "5 tablespoons olive oil",
            "3 small dried red chiles (each about 2 inhes) or 1 large dried chile such as New Mexico, cut into 3 pieces",
            "Garnish: fresh basil leaves"
        ],
        "instructions": [
            "Fill a 6-quart pasta pot three fourths full with salted water and bring to a boil for spaghetti. Mince garlic and halve tomatoes. In a 12-inch skillet heat 4 tablespoons oil over moderately high heat until hot but not smoking and sauté garlic and chiles, stirring, until garlic is golden. Add tomatoes and herb sprigs and cook over moderate heat, stirring occasionally, until tomatoes just begin to lose their shape, about 10 minutes. Season sauce with salt and pepper. While sauce is cooking, cook pasta in boiling water until al dente. Drain pasta in a colander and in a bowl toss with remaining tablespoon oil. Remove herb sprigs and chiles from sauce and pour sauce over pasta. Garnish pasta with basil.",
            "Fill a 6-quart pasta pot three fourths full with salted water and bring to a boil for spaghetti. Mince garlic and halve tomatoes. In a 12-inch skillet heat 4 tablespoons oil over moderately high heat until hot but not smoking and sauté garlic and chiles, stirring, until garlic is golden. Add tomatoes and herb sprigs and cook over moderate heat, stirring occasionally, until tomatoes just begin to lose their shape, about 10 minutes. Season sauce with salt and pepper.",
            "While sauce is cooking, cook pasta in boiling water until al dente. Drain pasta in a colander and in a bowl toss with remaining tablespoon oil. Remove herb sprigs and chiles from sauce and pour sauce over pasta.",
            "Garnish pasta with basil."
        ],
        "picture_link": null
    }
}