{
    "recipe": {
        "title": "Spaghetti with Lobster Pomodoro ",
        "ingredients": [
            "Kosher salt",
            "2 (1 1/4-lb.) live lobsters",
            "2 Tbsp. extra-virgin olive oil",
            "2 Tbsp. ghee or unsalted butter",
            "1/4 small red onion, thinly sliced",
            "3 garlic cloves, thinly sliced",
            "2 sprigs basil",
            "1 (14-oz.) can whole peeled San Marzano tomatoes",
            "12 oz. spaghetti",
            "4 oz. nduja, broken into small pieces",
            "Tarragon and parsley leaves (for serving)"
        ],
        "instructions": [
            "Bring a large pot of salted water to a rolling boil. Working one at a time, cook lobsters 3 minutes, then transfer to a large bowl of ice water. Let cool just until you can comfortably handle them, about 1 minute, then twist off claws where the knuckles meet the body and return them to pot of boiling water. Cook 2 minutes (leave bodies in ice water). Add claws back to ice water and let both claws and bodies cool completely. (The lobsters are intentionally undercooked at this point but will finish cooking in the sauce.) Remove bodies and claws from ice water. Twist tails off bodies with your hands; discard heads (you won’t get enough meat to make it worth your time). Working with 1 tail at a time, place on a cutting board and, using a chef’s knife or cleaver, cut lengthwise all the way through tail in one motion. You should now have 2 even halves. Remove any tomalley or eggs from tails and discard. Remove meat from shells; discard shells. Using the back of a cleaver or a lobster cracker, crack claws on all sides and pick out meat; discard shells. Cut tail and claw meat into bite-size pieces. Place in an airtight container; cover and chill until ready to use. Heat oil and ghee in a large skillet over medium. As soon as ghee is melted, add onion and a pinch of salt and cook, stirring occasionally, until softened, about 5 minutes. Add garlic and cook, stirring occasionally, until garlic is very soft, about 5 minutes. Add basil and as soon as it is wilted, add the tomatoes, crushing well with your hands as you go. Bring to a gentle simmer and cook sauce until thick and flavors have melded, 20–25 minutes. Season sauce with salt and pluck out basil. Meanwhile, cook pasta in another large pot of boiling salted water, stirring occasionally, until very al dente (about 1 minute less than package directions). Using tongs, transfer pasta to skillet with sauce, then add nduja and a splash of pasta cooking liquid and reduce heat to medium-low (high heat can cause the sauce to break). Cook, tossing gently and adding splashes of pasta cooking liquid as needed to get sauce to cling tightly to pasta, until sauce and nduja are combined, about 1 minute. Taste and season pasta with salt if needed. Add chilled lobster meat to pasta and cook, tossing gently, just until lobster meat is warmed all the way through, about 2 minutes. Divide pasta among bowls and top with tarragon and parsley leaves.",
            "Bring a large pot of salted water to a rolling boil. Working one at a time, cook lobsters 3 minutes, then transfer to a large bowl of ice water. Let cool just until you can comfortably handle them, about 1 minute, then twist off claws where the knuckles meet the body and return them to pot of boiling water. Cook 2 minutes (leave bodies in ice water). Add claws back to ice water and let both claws and bodies cool completely. (The lobsters are intentionally undercooked at this point but will finish cooking in the sauce.)",
            "Remove bodies and claws from ice water. Twist tails off bodies with your hands; discard heads (you won’t get enough meat to make it worth your time). Working with 1 tail at a time, place on a cutting board and, using a chef’s knife or cleaver, cut lengthwise all the way through tail in one motion. You should now have 2 even halves. Remove any tomalley or eggs from tails and discard. Remove meat from shells; discard shells. Using the back of a cleaver or a lobster cracker, crack claws on all sides and pick out meat; discard shells. Cut tail and claw meat into bite-size pieces. Place in an airtight container; cover and chill until ready to use.",
            "Heat oil and ghee in a large skillet over medium. As soon as ghee is melted, add onion and a pinch of salt and cook, stirring occasionally, until softened, about 5 minutes. Add garlic and cook, stirring occasionally, until garlic is very soft, about 5 minutes. Add basil and as soon as it is wilted, add the tomatoes, crushing well with your hands as you go. Bring to a gentle simmer and cook sauce until thick and flavors have melded, 20–25 minutes. Season sauce with salt and pluck out basil.",
            "Meanwhile, cook pasta in another large pot of boiling salted water, stirring occasionally, until very al dente (about 1 minute less than package directions).",
            "Using tongs, transfer pasta to skillet with sauce, then add nduja and a splash of pasta cooking liquid and reduce heat to medium-low (high heat can cause the sauce to break). Cook, tossing gently and adding splashes of pasta cooking liquid as needed to get sauce to cling tightly to pasta, until sauce and nduja are combined, about 1 minute. Taste and season pasta with salt if needed.",
            "Add chilled lobster meat to pasta and cook, tossing gently, just until lobster meat is warmed all the way through, about 2 minutes.",
            "Divide pasta among bowls and top with tarragon and parsley leaves.",
            "Do Ahead Lobster can be cooked 1 day ahead; keep chilled. Tomato sauce can be made 3 days ahead. Let cool; cover and chill. Reheat over medium before using.",
            "Lobster can be cooked 1 day ahead; keep chilled. Tomato sauce can be made 3 days ahead. Let cool; cover and chill. Reheat over medium before using."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ba10f4548738b66252f2d35/6:4/w_274%2Ch_169/spaghetti-with-lobster-pomodoro-recipe-BA-091818.jpg"
    }
}