{
    "recipe": {
        "title": "Spanish Grilled Cheese Sandwiches with Manchego and Jamón Serrano ",
        "ingredients": [
            "3 tablespoons butter, room temperature",
            "4 slices firm white sandwich bread",
            "6 ounces Manchego cheese, thinly sliced",
            "4 ounces thinly sliced jamón Serrano or prosciutto",
            "4 Medjool dates, pitted, chopped"
        ],
        "instructions": [
            "Line baking sheet with waxed paper. Spread butter on bread slices, dividing equally. Place 2 bread slices on prepared baking sheet, buttered side down. Top bread slices with half of sliced cheese (1 1/2 ounces each); top cheese with ham, dividing equally. Sprinkle dates over. Top with remaining cheese, then remaining 2 bread slices, buttered side up. Refrigerate 30 minutes. DO AHEAD: Can be made 8 hours ahead. Cover with plastic wrap and keep chilled. Peel plastic from sandwiches before continuing. Heat panini press and cook sandwiches according to manufacturer's instructions. (Alternatively, heat heavy large skillet over medium-high heat. Reduce heat to mediumlow. Place sandwiches in skillet. Place another large skillet atop sandwiches; place weight, such as large can of tomatoes, atop skillet. Cook sandwiches until golden brown and cheese melts, about 4 minutes per side.)",
            "Line baking sheet with waxed paper. Spread butter on bread slices, dividing equally. Place 2 bread slices on prepared baking sheet, buttered side down. Top bread slices with half of sliced cheese (1 1/2 ounces each); top cheese with ham, dividing equally. Sprinkle dates over. Top with remaining cheese, then remaining 2 bread slices, buttered side up. Refrigerate 30 minutes. DO AHEAD: Can be made 8 hours ahead. Cover with plastic wrap and keep chilled. Peel plastic from sandwiches before continuing.",
            "Heat panini press and cook sandwiches according to manufacturer's instructions. (Alternatively, heat heavy large skillet over medium-high heat. Reduce heat to mediumlow. Place sandwiches in skillet. Place another large skillet atop sandwiches; place weight, such as large can of tomatoes, atop skillet. Cook sandwiches until golden brown and cheese melts, about 4 minutes per side.)"
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a4f9e0acd286555db6fa/6:4/w_274%2Ch_169/351554_hires.jpg"
    }
}