{
    "recipe": {
        "title": "Spice-Rubbed Chicken with Kumquat-Lemongrass Dressing ",
        "ingredients": [
            "1 1/2 cups sliced lemongrass* (6 stalks)",
            "1/2 cup fresh lime juice",
            "1/4 cup unseasoned rice vinegar",
            "1/4 cup sugar",
            "1 tablespoon finely chopped kaffir lime leaves* or 1 tablespoon finely grated lime peel",
            "2 tablespoons vegetable oil",
            "1/2 cup chopped shallots (2 to 3 large)",
            "1/2 cup chopped peeled fresh ginger",
            "1 1/2 cups thinly sliced kumquats, seeded",
            "1 red Thai chile, sliced into thin rounds",
            "2 tablespoons sugar",
            "4 teaspoons turmeric",
            "1 teaspoon cayenne pepper",
            "3 boned chicken halves (from 3 1/3-pound chickens) or 3 boneless chicken breast halves with skin and 6 boneless chicken thighs with skin",
            "Chopped fresh cilantro"
        ],
        "instructions": [
            "Bring first 5 ingredients to boil in medium saucepan over high heat, stirring until sugar dissolves. Cool lemongrass syrup; strain into small bowl.",
            "Heat oil in large saucepan over medium heat. Add shallots and ginger; sauté 5 minutes. Add kumquats and lemongrass syrup; simmer 1 minute. Remove from heat. Mix in chile; cool. Season to taste with salt and pepper.",
            "For chicken: Place large rack on large rimmed baking sheet. Mix sugar, turmeric, and cayenne in small bowl. Sprinkle chicken on both sides with salt and generous amount of spice mixture. Arrange chicken, skin side down, on rack. Let stand at room temperature 2 hours or cover and chill overnight. Preheat broiler. Broil chicken halves on rack on baking sheet until beginning to brown, about 5 minutes. Turn chicken over and broil until skin is charred, about 5 minutes, or broil chicken parts 1 minute, then turn and broil until skin is charred, about 5 minutes. Remove from broiler. Set oven temperature at 450°F. Roast chicken on rack on same sheet until cooked through, about 25 minutes for halves and 14 minutes for parts. Transfer chicken halves to board. Cut each into 4 pieces, or cut each chicken breast in half and leave thighs intact. Arrange chicken on platter. Spoon dressing over; sprinkle with cilantro.",
            "Place large rack on large rimmed baking sheet. Mix sugar, turmeric, and cayenne in small bowl. Sprinkle chicken on both sides with salt and generous amount of spice mixture. Arrange chicken, skin side down, on rack. Let stand at room temperature 2 hours or cover and chill overnight.",
            "Preheat broiler. Broil chicken halves on rack on baking sheet until beginning to brown, about 5 minutes. Turn chicken over and broil until skin is charred, about 5 minutes, or broil chicken parts 1 minute, then turn and broil until skin is charred, about 5 minutes. Remove from broiler.",
            "Set oven temperature at 450°F. Roast chicken on rack on same sheet until cooked through, about 25 minutes for halves and 14 minutes for parts.",
            "Transfer chicken halves to board. Cut each into 4 pieces, or cut each chicken breast in half and leave thighs intact. Arrange chicken on platter. Spoon dressing over; sprinkle with cilantro.",
            "*Available in the produce section of some supermarkets and Asian markets.",
            "*Available in the produce section of some supermarkets and Asian markets."
        ],
        "picture_link": null
    }
}