{
    "recipe": {
        "title": "Spicy Beans with Wilted Greens ",
        "ingredients": [
            "1/4 cup plus 1 tablespoon olive oil, plus more for drizzling",
            "4 anchovy fillets packed in oil, drained (optional)",
            "4 chiles de árbol or 1 teaspoon crushed red pepper flakes",
            "4 garlic cloves, thinly sliced",
            "1 large onion, thinly sliced",
            "4 celery stalks, finely chopped",
            "1 sprig rosemary",
            "Kosher salt, freshly ground pepper",
            "1 Parmesan rind (optional), plus shaved Parmesan for serving",
            "1 pound dried white beans or chickpeas, soaked overnight, drained",
            "1 bunch kale or mustard greens, ribs and stems removed, leaves coarsely chopped",
            "1 large bunch flat-leaf spinach, trimmed, coarsely chopped",
            "4 cups trimmed arugula or watercress, divided",
            "2 teaspoons fresh lemon juice"
        ],
        "instructions": [
            "Heat 1/4 cup oil in a large Dutch oven over medium heat. Cook anchovies, if using, chiles, and garlic, stirring occasionally, until garlic is soft and anchovies are dissolved, about 4 minutes. Add onion, celery, and rosemary; season with salt and pepper. Increase heat to medium-high and cook, stirring occasionally, until onion is very soft and golden brown, 8–10 minutes.",
            "Add Parmesan rind, if using, beans, and 10 cups water. Bring to a boil, reduce heat, and simmer, stirring occasionally and adding more water as needed, until beans are beginning to fall apart, 3–4 hours.",
            "Lightly crush some beans to give stew a creamy consistency. Mix in kale, spinach, and half of arugula; season with salt and pepper. Cook until greens are wilted, 5–8 minutes.",
            "Toss remaining arugula with lemon juice and 1 tablespoon oil; season with salt and pepper. Divide stew among bowls; top with arugula, shaved Parmesan, and a drizzle of oil.",
            "DO AHEAD: Stew can be made 3 days ahead. Let cool; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3f6db460b4423363f9013/6:4/w_274%2Ch_169/51214650_beans-wilted-greens_1x1.jpg"
    }
}