{
    "recipe": {
        "title": "Spicy Red Pork and Bean Chili ",
        "ingredients": [
            "1/2 pound sliced bacon",
            "4 pounds boneless pork shoulder, cut into 1-inch cubes",
            "2 tablespoons vegetable oil",
            "1 large white onion, chopped",
            "1 to 2 fresh jalapeño chiles, seeded and chopped",
            "4 large garlic cloves, minced",
            "2 teaspoons dried oregano, crumbled",
            "1/3 cup chili powder",
            "1 tablespoon ground cumin",
            "1/4 teaspoon cayenne",
            "14 1/2-ounce can beef broth",
            "1 cup brewed coffee",
            "1 cup water",
            "28- to 32-ounce can crushed tomatoes with purée",
            "2 (19-ounce) cans small red beans or kidney beans, rinsed and drained",
            "Accompaniments: toasted salted pumpkin seeds , chopped red onion, torn fresh cilantro sprigs, diced avocado, lime wedges, sour cream, and warmed corn chips or tortilla chips"
        ],
        "instructions": [
            "Cook bacon in a 6- to 8-quart heavy pot over moderate heat, turning, until crisp. Transfer with tongs to paper towels to drain and pour off all but 2 tablespoons fat from pot. Crumble bacon. Pat pork dry and season with salt and pepper. Add oil to pot and heat over moderately high heat until hot but not smoking. Brown pork in about 6 batches without crowding and transfer with a slotted spoon to a plate. Add onion and jalapeños and cook over moderate heat, stirring, until softened. Add garlic, oregano, chili powder, cumin, and cayenne, then cook, stirring, 1 minute. Return pork to pot with any juices accumulated on plate and add broth, coffee, water, and tomatoes with purée.",
            "Simmer chili, uncovered, stirring occasionally, until pork is very tender, about 2 hours. Stir in beans and bring to a simmer, stirring.",
            "Serve chili with bacon and accompaniments."
        ],
        "picture_link": "https://assets.epicurious.com/photos/561025a77b55306961bffe47/6:4/w_274%2Ch_169/102938.jpg"
    }
}