{
    "recipe": {
        "title": "Spice-Crusted Carrots with Harissa Yogurt ",
        "ingredients": [
            "2 pounds small carrots, scrubbed, tops trimmed to 1/2\"",
            "Kosher salt",
            "1 tablespoon sugar",
            "1 teaspoon English mustard powder",
            "1 teaspoon hot smoked Spanish paprika",
            "1 teaspoon ground cumin",
            "1/2 teaspoon ground coriander or fennel",
            "4 tablespoons vegetable oil, divided",
            "Freshly ground black pepper",
            "1/2 cup plain Greek yogurt",
            "1 tablespoon harissa paste",
            "2 teaspoons chopped fresh thyme, plus more",
            "1/2 teaspoon finely grated lemon zest, plus more",
            "Lemon wedges (for serving)"
        ],
        "instructions": [
            "Cook carrots in a large pot of boiling salted water until crisp-tender and skins easily rub off, about 5 minutes; drain. Transfer to a bowl of ice water. Using paper towels, gently rub carrots to remove skins and pat dry.",
            "Mix sugar, mustard powder, paprika, cumin, and coriander in a small bowl. Toss carrots with 1 tablespoon oil in a medium bowl. Add spice mixture; season with salt and pepper and toss to coat.",
            "Heat remaining 3 tablespoons oil in a large skillet, preferably cast iron. Working in 2 batches, cook carrots, turning occasionally, until deep brown all over, 6–8 minutes; season with salt and pepper.",
            "Meanwhile, place yogurt in a small bowl; season with salt and pepper. Add harissa paste, 2 teaspoons thyme, and 1/2 teaspoon lemon zest and gently swirl ingredients, stopping before yogurt turns pink.",
            "Spoon harissa yogurt onto plates and top with carrots, more thyme, and more lemon zest. Serve with lemon wedges.",
            "DO AHEAD: Carrots can be cooked in boiling water and peeled 6 hours ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56c5014af43c4a4d07731ad0/6:4/w_274%2Ch_169/51223940_spice-crusted-carrots_1x1.jpg"
    }
}