{
    "recipe": {
        "title": "Spiced Turkey Empanada ",
        "ingredients": [
            "1/2 pound white-meat ground turkey",
            "1/2 teaspoon salt",
            "1/4 teaspoon pepper",
            "1/4 teaspoon cumin",
            "1/4 teaspoon sweet chili powder",
            "1 tablespoon olive oil",
            "1 can (15 ounce) diced tomatoes, drained",
            "1 cup green or black olives, chopped",
            "2 tablespoon chopped pickled jalapeños (optional)",
            "Vegetable oil cooking spray",
            "1 pound raw frozen pizza dough, defrosted in the microwave or overnight in the fridge"
        ],
        "instructions": [
            "Heat oven to 400°F. Sprinkle turkey with salt, pepper, cumin and chili powder. Heat oil in a large skillet over high heat. Cook turkey, breaking up with a spoon, until brown, 3 to 4 minutes. Stir in tomatoes, olives and jalapeños. Cover; reduce heat to low. Simmer until turkey is cooked through and tomatoes are soft, 3 to 4 minutes. Coat a large cookie sheet with cooking spray. Cut dough into 4 equal portions. Pull dough into 4 flat disks, each 8 inches in diameter. Top each round with 1/2 cup turkey filling. Fold dough in half and fold bottom edge over top. Press closed. Transfer to cookie sheet and coat empanadas with cooking spray. Bake until dough is firm and golden brown, 10 to 15 minutes. Transfer to a wire rack to cool. Serve with 1/2 cup baby carrots. Store empanadas in an airtight container in the fridge for up to 3 days.",
            "Heat oven to 400°F. Sprinkle turkey with salt, pepper, cumin and chili powder. Heat oil in a large skillet over high heat. Cook turkey, breaking up with a spoon, until brown, 3 to 4 minutes. Stir in tomatoes, olives and jalapeños. Cover; reduce heat to low. Simmer until turkey is cooked through and tomatoes are soft, 3 to 4 minutes.",
            "Coat a large cookie sheet with cooking spray. Cut dough into 4 equal portions. Pull dough into 4 flat disks, each 8 inches in diameter. Top each round with 1/2 cup turkey filling. Fold dough in half and fold bottom edge over top. Press closed. Transfer to cookie sheet and coat empanadas with cooking spray. Bake until dough is firm and golden brown, 10 to 15 minutes. Transfer to a wire rack to cool. Serve with 1/2 cup baby carrots. Store empanadas in an airtight container in the fridge for up to 3 days."
        ],
        "picture_link": null
    }
}