{
    "recipe": {
        "title": "Spiced Prune-Almond 'Coffee' Cake ",
        "ingredients": [
            "3/4 cup whole unblanched almonds, toasted, finely chopped",
            "1 cup buttermilk",
            "2 1/2 tablespoons instant coffee granules",
            "1 teaspoon vanilla extract",
            "1/4 teaspoon almond extract",
            "2 1/2 cups unbleached all purpose flour",
            "2 teaspoons baking powder",
            "1 teaspoon baking soda",
            "1 teaspoon ground cinnamon",
            "1 teaspoon salt",
            "1/4 teaspoon ground cloves",
            "1 cup (2 sticks) unsalted butter, room temperature",
            "1 cup sugar",
            "3 extra-large eggs, room temperature",
            "1 cup (about 6 ounces) pitted prunes, coarsely chopped",
            "1 tablespoon grated orange peel",
            "1/2 cup firmly packed dark brown sugar",
            "1/4 cup (1/2 stick) unsalted butter",
            "1/4 cup whipping cream",
            "1 teaspoon instant coffee granules",
            "Orange slices (optional)",
            "Cinnamon stick (optional)"
        ],
        "instructions": [
            "Position rack in center of oven and preheat to 350°F. Generously butter 10-inch (12-cup) tube pan. Sprinkle half of almonds into pan. Tilt to coat bottom and halfway up sides with nuts (do not tap out excess). Combine buttermilk, instant coffee, vanilla and almond extracts in small bowl. Stir until coffee dissolves. Sift flour, baking powder, baking soda, cinnamon, salt and ground cloves into medium bowl.",
            "Using electric mixer, cream butter and sugar in large bowl until light and fluffy. Add eggs 1 at a time, beating well after each addition. Slowly mix in dry ingredients alternately with buttermilk mixture, beginning and ending with dry ingredients. Mix in prunes and orange peel. Pour batter into prepared pan. Sprinkle with remaining almonds. Bake until tester inserted into center of cake comes out clean, about 50 minutes. Cool 30 minutes in pan on rack. Turn cake out onto rack. Quickly turn upright onto platter and cool until just warm.",
            "For glaze: Combine brown sugar, butter and cream in heavy small saucepan. Stir over medium-high heat until butter melts. Boil 2 minutes. Mix in instant coffee granules. Cool slightly. Drizzle glaze over cake.",
            "Combine brown sugar, butter and cream in heavy small saucepan. Stir over medium-high heat until butter melts. Boil 2 minutes. Mix in instant coffee granules. Cool slightly. Drizzle glaze over cake.",
            "Garnish cake with orange slices and cinnamon stick if desired and serve warm or at room temperature.",
            "Garnish cake with orange slices and cinnamon stick if desired and serve warm or at room temperature."
        ],
        "picture_link": null
    }
}