{
    "recipe": {
        "title": "Spicy Cornbread Stuffing with Chorizo and Sweet Potatoes ",
        "ingredients": [
            "3 lb. cornbread, cut into 1\" cubes (about 20 cups)",
            "2 lb. sweet potatoes, peeled, cut into 1/2\" pieces (about 6 cups)",
            "2 Tbsp. kosher salt, divided, plus more",
            "3 Tbsp. extra-virgin olive oil, divided",
            "2 lb. fresh chorizo, torn into small pieces",
            "2 large onions, chopped",
            "2 celery stalks, chopped",
            "2 Fresno chiles or jalapeños, chopped (optional)",
            "6 garlic cloves, thinly sliced",
            "2 tsp. paprika",
            "3 tsp. freshly ground black pepper, divided",
            "2 bunches Tuscan kale, stemmed, torn into 2\" pieces (about 12 cups)",
            "1 cup hard cider or dry white wine",
            "1/4 cup chopped sage",
            "6 large eggs, beaten to blend",
            "2 quarts homemade chicken stock or low-sodium chicken broth",
            "1/4 cup apple cider vinegar",
            "3/4 cup unsalted butter, melted, divided",
            "A large roasting pan or large disposable aluminum roasting pan"
        ],
        "instructions": [
            "Place racks in upper and lower thirds of oven; preheat to 350°F. Divide cornbread between 2 large rimmed baking sheets. Bake, tossing occasionally and rotating pans top to bottom halfway through, until beginning to brown in spots and dry out, 35–40 minutes. (Drying out the stuffing will help it absorb the eggs and stock without becoming mushy.) Let cool.",
            "Meanwhile, cook sweet potatoes in a large pot of boiling salted water until just beginning to soften but not fully cooked through, 7–9 minutes. Drain; transfer potatoes to a large bowl.",
            "Heat 2 Tbsp. oil in a large skillet over medium-high. Cook chorizo, breaking up with a wooden spoon, until lightly browned and slightly undercooked, about 5 minutes. Using a slotted spoon, transfer to bowl with sweet potatoes.",
            "Heat remaining 1 Tbsp. oil in same skillet over medium. Add onions, celery, chiles (if using), garlic, paprika, 1 Tbsp. salt, and 1 tsp. pepper and cook, stirring often, until vegetables are tender, about 15 minutes. Add kale in batches as it wilts, then cider and sage and cook, stirring occasionally, until liquid is almost completely evaporated, about 5 minutes. Transfer to sweet potato mixture and toss to combine.",
            "Whisk eggs, stock, and vinegar in a large bowl or pitcher; season with remaining 1 Tbsp. salt and 2 tsp. pepper.",
            "Brush large roasting pan with an even layer of melted butter. Spread one-third of cornbread pieces in pan. Top with half of sweet potato mixture and spread to evenly distribute. Drizzle one-third of egg mixture over. Repeat with another third of the cornbread, remaining sweet potato mixture, then another third of egg mixture. There will be a lot of liquid in the pan—don’t worry, it will become absorbed as the stuffing bakes. Top with remaining cornbread, then drizzle remaining egg mixture over. Brush top with remaining butter. Cover pan with foil and bake stuffing until heated through, about 45 minutes. Uncover and bake until surface is golden and crisp, 20–30 minutes longer.",
            "Do Ahead: Cornbread can be toasted 1 day ahead; store tightly wrapped at room temperature. Sweet potato, chorizo, and kale mixture can be cooked 1 day ahead; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5bd36156168d1937716070e0/6:4/w_274%2Ch_169/Large-Format-Savory-Sweet-Potato-Cornbread-Stuffing-11102018.jpg",
        "color": 8468423
    }
}