{
    "recipe": {
        "title": "Spiced Sweet Potato Sandwich with Feta ",
        "ingredients": [
            "1 large sweet potato (about 12 oz.), peeled, sliced lengthwise into 1/4\"–1/2\"-thick planks",
            "1 tsp. ancho chile powder",
            "1/2 tsp. ground cumin",
            "3 Tbsp. extra-virgin olive oil, plus more for drizzling",
            "1 medium beet, peeled, cut into thin matchsticks or grated on the large holes of a box grater",
            "1/2 small red onion, thinly sliced",
            "3 Tbsp. seasoned rice vinegar",
            "1/2 cup mayonnaise",
            "1 large garlic clove, finely grated",
            "1 Tbsp. plus 1 tsp. fresh lemon juice",
            "2 sesame kaiser rolls, split",
            "1 1/2 cups parsley, mint, and/or cilantro leaves",
            "5 oz. block feta, thinly sliced into planks, divided",
            "Kosher salt, freshly ground pepper"
        ],
        "instructions": [
            "Preheat oven to 400°F. Combine sweet potato, ancho chile powder, cumin, and 3 Tbsp. oil in a medium bowl; season generously with salt and pepper and toss until sweet potato is evenly coated. Heat a dry large skillet, preferably cast iron, over medium. Arrange sweet potato in a single layer without overlapping (you will most likely be able to fit them all at once, but work in 2 batches if needed). Cook, undisturbed, until blackened in spots, about 4 minutes. Turn slices over and transfer skillet to oven. Roast until tender, 10–15 minutes. Remove from oven. Meanwhile, combine beet, onion, and vinegar in a medium bowl; season generously with salt and pepper and toss well. Let sit to allow beet to soften. Mix mayonnaise, garlic, and 1 Tbsp. lemon juice in a small bowl; season generously with salt and pepper. Heat broiler. Toast rolls, cut side up, on a rimmed baking sheet until golden brown, 30–60 seconds. Remove rolls from oven. Toss herbs with remaining 1 tsp. lemon juice in a medium bowl to coat. Drizzle with oil, season with salt and pepper, and toss again to combine. To build sandwiches, pour off any accumulated liquid from beet mixture. Spread seasoned mayonnaise over cut sides of reserved rolls, dividing evenly (yes, it’s a lot, but you don’t want to skimp here). Arrange feta slices over bottom halves of rolls. Top with sweet potato slices and pile some beet mixture on top. Mound herbs over beets; close up sandwiches with top halves of rolls and cut in half.",
            "Preheat oven to 400°F. Combine sweet potato, ancho chile powder, cumin, and 3 Tbsp. oil in a medium bowl; season generously with salt and pepper and toss until sweet potato is evenly coated. Heat a dry large skillet, preferably cast iron, over medium. Arrange sweet potato in a single layer without overlapping (you will most likely be able to fit them all at once, but work in 2 batches if needed). Cook, undisturbed, until blackened in spots, about 4 minutes. Turn slices over and transfer skillet to oven. Roast until tender, 10–15 minutes. Remove from oven.",
            "Meanwhile, combine beet, onion, and vinegar in a medium bowl; season generously with salt and pepper and toss well. Let sit to allow beet to soften. Mix mayonnaise, garlic, and 1 Tbsp. lemon juice in a small bowl; season generously with salt and pepper.",
            "Heat broiler. Toast rolls, cut side up, on a rimmed baking sheet until golden brown, 30–60 seconds. Remove rolls from oven.",
            "Toss herbs with remaining 1 tsp. lemon juice in a medium bowl to coat. Drizzle with oil, season with salt and pepper, and toss again to combine.",
            "To build sandwiches, pour off any accumulated liquid from beet mixture. Spread seasoned mayonnaise over cut sides of reserved rolls, dividing evenly (yes, it’s a lot, but you don’t want to skimp here). Arrange feta slices over bottom halves of rolls. Top with sweet potato slices and pile some beet mixture on top. Mound herbs over beets; close up sandwiches with top halves of rolls and cut in half.",
            "Do Ahead Sweet potato, beet mixture, and seasoned mayonnaise can all be made 2 hours ahead. Store sweet potato and beet mixture separately, tightly covered, at room temperature. Cover and chill mayonnaise.",
            "Sweet potato, beet mixture, and seasoned mayonnaise can all be made 2 hours ahead. Store sweet potato and beet mixture separately, tightly covered, at room temperature. Cover and chill mayonnaise."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aa012420165770628983f43/6:4/w_274%2Ch_169/spiced-sweet-potato-sandwich-with-feta-recipe-BA-030718.jpg"
    }
}