{
    "recipe": {
        "title": "Spicy Lamb Meatballs with Raisin Pesto ",
        "ingredients": [
            "1 large egg",
            "1/2 cup panko (Japanese breadcrumbs)",
            "1/2 tsp. ground cumin",
            "1/4 tsp. crushed red pepper flakes",
            "1/4 tsp. ground turmeric",
            "1/4 cup finely chopped parsley, plus 1 cup parsley leaves with tender stems",
            "2 Tbsp. plus 1/2 cup extra-virgin olive oil",
            "1 1/2 tsp. kosher salt, plus more",
            "2 garlic cloves, divided",
            "1 lb. ground lamb",
            "2 cups mint leaves",
            "3 Tbsp. golden raisins",
            "Plain whole-milk Greek yogurt (for serving)"
        ],
        "instructions": [
            "Place a rack in upper third of oven; preheat to 425°F. Combine egg, panko, cumin, red pepper flakes, turmeric, finely chopped parsley, 2 Tbsp. oil, and 1 1/2 tsp. salt in a large bowl. Finely grate 1 garlic clove into bowl. Add lamb and mix with your hands until evenly distributed.",
            "Gently roll lamb mixture into 1 1/2\"-diameter balls (about the size of a golf ball; you should have about 20). Place on a rimmed baking sheet, spacing evenly apart. Bake meatballs until browned and cooked through, 8–10 minutes.",
            "Meanwhile, purée mint, raisins, parsley leaves with tender stems, remaining garlic clove, remaining 1/2 cup oil, and a big pinch of salt in a blender until smooth. Taste pesto; season with more salt if needed.",
            "Spread yogurt over plates and divide pesto and meatballs on top.",
            "Do Ahead Pesto can be made 2 days ahead; cover and chill. Meatballs can be formed 2 months ahead; freeze on baking sheet until firm, about 2 hours, then transfer to a freezer bag and keep frozen.",
            "Pesto can be made 2 days ahead; cover and chill. Meatballs can be formed 2 months ahead; freeze on baking sheet until firm, about 2 hours, then transfer to a freezer bag and keep frozen."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ac52db0a0f0d86fa2879d16/6:4/w_274%2Ch_169/spicy-lamb-meatballs-with-raisin-pesto-recipe-BA-032918.jpg",
        "color": 16453061
    }
}