{
    "recipe": {
        "title": "Spiced and Grilled Steaks With Citrus Chutney ",
        "ingredients": [
            "1/2 grapefruit, thinly sliced, seeds removed",
            "8 ounces kumquats, sliced, seeds removed",
            "1 shallot, finely chopped",
            "2/3 cup sugar",
            "Pinch of kosher salt",
            "1 tablespoon Champagne vinegar or white wine vinegar",
            "2 tablespoons coriander seeds",
            "2 tablespoons ground coffee",
            "2 tablespoons kosher salt",
            "4 teaspoons light brown sugar",
            "4 teaspoons unsweetened cocoa powder",
            "1 tablespoon freshly ground black pepper",
            "Vegetable oil (for grilling)",
            "2 hanger steaks, center membrane removed, each cut into 4 pieces",
            "A spice mill or a mortar and pestle"
        ],
        "instructions": [
            "Bring grapefruit, kumquats, shallot, sugar, salt, and 1/4 cup water to a simmer in a small saucepan over medium-low heat, stirring occasionally and lowering heat if needed, until citrus is soft and liquid is syrupy, 45–60 minutes. Stir in vinegar and let cool. Cover and chill.",
            "For the steak and assembly: Toast coriander seeds in a small skillet over medium heat, tossing occasionally, until fragrant, about 2 minutes. Let cool, then finely grind in spice mill or mortar and pestle. Mix ground coriander, coffee, salt, brown sugar, cocoa powder, and pepper in a small bowl. Prepare a grill for medium-high heat; lightly oil grate. Season steaks generously with rub (you’ll have some left over). Grill steaks, turning occasionally, until lightly charred and cooked to desired doneness, 8–10 minutes for medium-rare. Transfer to a cutting board and let rest 10 minutes, then slice against the grain. Serve with citrus chutney.",
            "Toast coriander seeds in a small skillet over medium heat, tossing occasionally, until fragrant, about 2 minutes. Let cool, then finely grind in spice mill or mortar and pestle. Mix ground coriander, coffee, salt, brown sugar, cocoa powder, and pepper in a small bowl.",
            "Prepare a grill for medium-high heat; lightly oil grate. Season steaks generously with rub (you’ll have some left over). Grill steaks, turning occasionally, until lightly charred and cooked to desired doneness, 8–10 minutes for medium-rare. Transfer to a cutting board and let rest 10 minutes, then slice against the grain. Serve with citrus chutney.",
            "Do Ahead Chutney can be made 1 week ahead. Keep chilled. Rub can be made 1 day ahead. Store airtight at room temperature.",
            "Chutney can be made 1 week ahead. Keep chilled. Rub can be made 1 day ahead. Store airtight at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57053de4f2e39cee31a5047d/6:4/w_274%2Ch_169/0416-BA-WOUT-09.jpg",
        "color": 9679222
    }
}