{
    "recipe": {
        "title": "Spicy Chipotle Chicken Tostadas ",
        "ingredients": [
            "1/4 cup kosher salt, plus more to taste",
            "2 pounds skinless, bone-in chicken thighs",
            "1 (28-ounce) can whole tomatoes, drained",
            "3 canned chipotle chiles in adobo, plus 2 tablespoons adobo sauce",
            "1/2 teaspoon freshly ground black pepper",
            "1/4 teaspoon ground cinnamon",
            "Pinch of ground cloves",
            "1 medium white onion, diced",
            "4 garlic cloves, crushed",
            "4 ounces fresh Mexican chorizo (about 1/2 cup), casings removed, crumbled, fried until almost crisp (optional)",
            "16 small corn tortillas or store-bought crispy tostada shells",
            "Vegetable oil (for frying; if needed)",
            "Kosher salt (if needed)",
            "1 1/2 cups Creamy Black Bean Spread",
            "Shredded iceberg lettuce, thinly sliced white onion, crema (Mexican salted cream) or sour cream, queso fresco, cilantro leaves with tender stems (for serving)",
            "A candy or deep-fry thermometer"
        ],
        "instructions": [
            "Fill a large pot with 8 cups water; stir in 1/4 cup salt. Add chicken and simmer over medium-low heat until just cooked through, about 45 minutes. Drain, then chop or tear chicken into bite-size chunks. Discard bones.",
            "Meanwhile, purée tomatoes, chiles, adobo sauce, pepper, cinnamon, and cloves in a blender until smooth.",
            "Cook onion in a large skillet over medium-high heat, stirring occasionally, until sweet and charred (you want more char than \"caramelization\"), 8–10 minutes. Add garlic and cook, stirring occasionally, until golden brown and fragrant, about 3 minutes longer.",
            "Add tomato mixture to skillet (it will splatter), reduce heat, and simmer, partially covered, about 30 minutes. Add chicken and chorizo, if using, and cook, stirring occasionally, until chicken is well-coated and moist and liquid is reduced and thickened, about 10 minutes more. Season with salt, if needed.",
            "Assemble the tostadas: If frying tortillas, fit a large skillet with candy or deep-fry thermometer; pour in oil to measure 1\". Heat over medium-high until thermometer registers 375°F. Fry tortillas in batches until crispy, turning every 30 seconds, about 2 minutes total. Drain on paper towel-lined baking sheets and season with salt. Spread 1 Tbsp. Creamy Black Bean Spread on a tostada shell. Top with 1/4 cup spicy chicken topping, then lettuce, onion, crema, queso fresco, and cilantro. Repeat with remaining tostada shells. Serve at room temperature.",
            "If frying tortillas, fit a large skillet with candy or deep-fry thermometer; pour in oil to measure 1\". Heat over medium-high until thermometer registers 375°F. Fry tortillas in batches until crispy, turning every 30 seconds, about 2 minutes total. Drain on paper towel-lined baking sheets and season with salt.",
            "Spread 1 Tbsp. Creamy Black Bean Spread on a tostada shell. Top with 1/4 cup spicy chicken topping, then lettuce, onion, crema, queso fresco, and cilantro. Repeat with remaining tostada shells. Serve at room temperature.",
            "Do Ahead Spicy chicken topping can be chilled for up to 3 days. Reheat and let cool to room temperature before using.",
            "Spicy chicken topping can be chilled for up to 3 days. Reheat and let cool to room temperature before using."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55ac430f2165ea177986f59b/6:4/w_274%2Ch_169/EP_07132015_summer100_chickentostada_6x4.jpg",
        "color": 16642755
    }
}