{
    "recipe": {
        "title": "Spicy Charred Octopus ",
        "ingredients": [
            "2 garlic cloves",
            "1 1\" piece ginger, peeled",
            "1 red Thai chile",
            "1/2 cup hot chili paste",
            "2 tablespoons fish sauce",
            "1 tablespoon fresh lime juice",
            "1 tablespoon gochugaru (Korean red pepper powder)",
            "1 tablespoon unseasoned rice vinegar",
            "6 tablespoons olive oil, divided, plus more for drizzling",
            "1 medium onion, chopped",
            "1 carrot, peeled, chopped",
            "1 celery stalk, chopped",
            "2 teaspoons coriander seeds",
            "2 teaspoons hot smoked Spanish paprika",
            "1 750-ml bottle Cabernet Sauvignon",
            "1/2 cup red wine vinegar",
            "Kosher salt, freshly ground pepper",
            "1 5–6 pound octopus, cleaned, head and beak removed",
            "2 tablespoons unsalted butter",
            "1 cup torn fresh tender herbs (such as basil, mint, and/or cilantro)",
            "1 tablespoon fresh lime juice",
            "1/2 cup plain whole-milk Greek yogurt",
            "Gochugaru can be found in Korean markets."
        ],
        "instructions": [
            "Chili sauce: Purée garlic, ginger, chile, chili paste, fish sauce, lime juice, gochugaru, and vinegar in a blender until smooth. Do ahead: Sauce can be made 1 week ahead. Cover and chill.",
            "Purée garlic, ginger, chile, chili paste, fish sauce, lime juice, gochugaru, and vinegar in a blender until smooth.",
            "Do ahead: Sauce can be made 1 week ahead. Cover and chill.",
            "Octopus and assembly: Heat 4 tablespoons oil in a large pot over medium-high heat. Cook onion, carrot, and celery, stirring often, until softened, 8–10 minutes. Add coriander seeds and paprika and cook, stirring, until fragrant, 2 minutes. Add wine, vinegar, and 6 cups water; season with salt and pepper and bring to a boil. Add octopus to liquid, reduce heat, and partially cover pot. Simmer gently, turning octopus occasionally, until flesh is tender enough to cut with a spoon, 60–75 minutes. Transfer octopus to a platter with a slotted spoon; let cool. Rub off skin with paper towels. Separate tentacles and cut into equal lengths. Heat a large skillet, preferably cast iron, over medium-high heat. Toss octopus with 1 tablespoon oil and season with salt and pepper. Cook, turning occasionally, until charred, 8–10 minutes. Brush with chili sauce (you may not use all of it) and cook, turning occasionally, until sauce is deeply caramelized, about 5 minutes. Remove from heat and toss with butter to coat. Toss herbs, lime juice, and 1 tablespoon oil in a small bowl; season with salt and pepper. Swipe yogurt across plates and top with octopus, then herb salad; drizzle with more oil. Do ahead: Octopus can be braised 2 days ahead. Cover and chill.",
            "Heat 4 tablespoons oil in a large pot over medium-high heat. Cook onion, carrot, and celery, stirring often, until softened, 8–10 minutes. Add coriander seeds and paprika and cook, stirring, until fragrant, 2 minutes. Add wine, vinegar, and 6 cups water; season with salt and pepper and bring to a boil.",
            "Add octopus to liquid, reduce heat, and partially cover pot. Simmer gently, turning octopus occasionally, until flesh is tender enough to cut with a spoon, 60–75 minutes. Transfer octopus to a platter with a slotted spoon; let cool. Rub off skin with paper towels. Separate tentacles and cut into equal lengths.",
            "Heat a large skillet, preferably cast iron, over medium-high heat. Toss octopus with 1 tablespoon oil and season with salt and pepper. Cook, turning occasionally, until charred, 8–10 minutes. Brush with chili sauce (you may not use all of it) and cook, turning occasionally, until sauce is deeply caramelized, about 5 minutes. Remove from heat and toss with butter to coat.",
            "Toss herbs, lime juice, and 1 tablespoon oil in a small bowl; season with salt and pepper. Swipe yogurt across plates and top with octopus, then herb salad; drizzle with more oil.",
            "Do ahead: Octopus can be braised 2 days ahead. Cover and chill."
        ],
        "picture_link": null
    }
}