{
    "recipe": {
        "title": "Spiced Cranberry Bundt Cake ",
        "ingredients": [
            "2 cups all purpose flour",
            "3/4 cup almond flour or almond meal* (about 2 1/2 ounces)",
            "2 1/2 teaspoons Chinese five-spice powder**",
            "1 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "1/2 teaspoon salt",
            "1/2 teaspoon ground cinnamon",
            "1/2 teaspoon ground ginger",
            "1 cup (2 sticks) unsalted butter, room temperature",
            "1 cup sugar",
            "1 cup (packed) golden brown sugar",
            "3 large eggs",
            "1 1/2 teaspoons vanilla extract",
            "1 cup plain reduced-fat (2%) Greek-style yogurt",
            "1 cup chopped toasted almonds",
            "1 cup halved fresh or frozen cranberries (do not thaw)",
            "1/2 cup dried sweetened cranberries",
            "2/3 cup powdered sugar",
            "4 teaspoons (about) orange juice"
        ],
        "instructions": [
            "Preheat oven to 350°F. Butter and flour 12-cup Bundt pan. Whisk first 8 ingredients in medium bowl to blend. Using electric mixer, beat butter in large bowl until smooth. Add both sugars and beat until fluffy, about 3 minutes. Add eggs, 1 at a time, beating 1 minute after each addition. Beat in vanilla extract, then Greek-style yogurt. Add dry ingredients; beat just until blended. Fold in almonds and all cranberries. Transfer batter to prepared Bundt pan.",
            "Bake cake until tester inserted near center comes out clean, about 1 hour 10 minutes. Cool cake in pan 10 minutes. Turn cake out onto rack and cool completely.",
            "For icing: Stir powdered sugar and 2 teaspoons orange juice in small bowl until sugar dissolves. Mix in more juice by 1/2 teaspoonfuls to reach consistency of heavy cream. Spoon icing over cake, allowing it to drip down sides. Let stand until icing sets, at least 30 minutes. DO AHEAD: Can be made 3 days ahead. Cover with cake dome and store at room temperature. Sometimes labeled \"ground almonds\"; available at specialty foods stores and natural foods stores. ** A spice blend that usually contains ground fennel seeds, Szechuan peppercorns, cinnamon, star anise, and cloves; available in the spice section of most supermarkets and online at penzeys.com.",
            "Stir powdered sugar and 2 teaspoons orange juice in small bowl until sugar dissolves. Mix in more juice by 1/2 teaspoonfuls to reach consistency of heavy cream. Spoon icing over cake, allowing it to drip down sides. Let stand until icing sets, at least 30 minutes. DO AHEAD: Can be made 3 days ahead. Cover with cake dome and store at room temperature.",
            "Sometimes labeled \"ground almonds\"; available at specialty foods stores and natural foods stores.",
            "Sometimes labeled \"ground almonds\"; available at specialty foods stores and natural foods stores.",
            "** A spice blend that usually contains ground fennel seeds, Szechuan peppercorns, cinnamon, star anise, and cloves; available in the spice section of most supermarkets and online at penzeys.com.",
            "More info: Greek-style yogurt is especially thick and rich, even the reduced-fat variety.",
            "Greek-style yogurt is especially thick and rich, even the reduced-fat variety."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56016c69bd6b8b837d72d4b3/6:4/w_274%2Ch_169/1211-BA-FOBA.02.jpg"
    }
}