{
    "recipe": {
        "title": "Spiced Pumpkin Layer Cake ",
        "ingredients": [
            "3 cups all purpose flour",
            "2 teaspoons baking powder",
            "1 teaspoon baking soda",
            "1 tablespoon ground cinnamon",
            "2 teaspoons ground ginger",
            "1 3/4 teaspoons ground allspice",
            "1 teaspoon salt",
            "1/2 teaspoon ground nutmeg",
            "1 1/2 cups sugar",
            "1 cup (packed) golden brown sugar",
            "1 cup canola oil",
            "4 large eggs",
            "1 15-ounce can pure pumpkin",
            "1 tablespoon vanilla extract",
            "1 tablespoon grated orange peel",
            "3/4 cup raisins",
            "3/4 cup sweetened flaked coconut plus additional for garnish",
            "1 8-ounce package cream cheese, room temperature",
            "10 tablespoons (1 1/4 sticks) unsalted butter, room temperature",
            "1 tablespoon dark rum",
            "1 teaspoon vanilla extract or vanilla paste",
            "4 1/2 cups powdered sugar (measured, then sifted)"
        ],
        "instructions": [
            "Position rack in center of oven and preheat to 350°F. Butter two 9-inch-diameter cake pans with 1 1/2-inch-high sides. Line bottom of pans with parchment paper; dust pans with flour. Sift 3 cups flour and next 7 ingredients into medium bowl. Using electric mixer, beat both sugars and oil in large bowl until combined (mixture will look grainy). Add eggs 1 at a time, beating until well blended after each addition. Add pumpkin, vanilla, and orange peel; beat until well blended. Add flour mixture; beat just until incorporated. Stir in raisins and 3/4 cup coconut. Divide batter between prepared pans. Smooth tops.",
            "Bake cakes until tester inserted into center comes out clean, about 1 hour. Cool cakes completely in pans on rack. Run knife around cakes to loosen. Invert cakes onto racks; remove parchment paper. Turn cakes over, rounded side up. Using serrated knife, trim rounded tops of cakes to level.",
            "For frosting: Using electric mixer, beat cream cheese and butter in large bowl until smooth. Beat in dark rum and vanilla. Add powdered sugar in 3 additions, beating just until frosting is smooth after each addition (do not overbeat or frosting may become too soft to spread). Place 1 pumpkin cake layer, flat side down, on platter. Spread half of cream cheese frosting over top of cake to edges. Top with second cake layer, trimmed side down. Spread remaining frosting over top (not sides) of cake. Sprinkle additional coconut over. DO AHEAD: Can be made 1 day ahead. Cover with cake dome and refrigerate. Let stand at room temperature 1 hour before serving. Cut cake into wedges and serve.",
            "Using electric mixer, beat cream cheese and butter in large bowl until smooth. Beat in dark rum and vanilla. Add powdered sugar in 3 additions, beating just until frosting is smooth after each addition (do not overbeat or frosting may become too soft to spread). Place 1 pumpkin cake layer, flat side down, on platter. Spread half of cream cheese frosting over top of cake to edges. Top with second cake layer, trimmed side down. Spread remaining frosting over top (not sides) of cake. Sprinkle additional coconut over. DO AHEAD: Can be made 1 day ahead. Cover with cake dome and refrigerate. Let stand at room temperature 1 hour before serving.",
            "Cut cake into wedges and serve.",
            "GOOD TO KNOW: It's better to underbeat the frosting than overbeat it. That bit of restraint makes for a slightly firmer frosting that's easier to spread.",
            "It's better to underbeat the frosting than overbeat it. That bit of restraint makes for a slightly firmer frosting that's easier to spread."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a33f9a84192308a1be8/6:4/w_274%2Ch_169/240123_hires.jpg",
        "color": 3600765
    }
}