{
    "recipe": {
        "title": "Spicy Larb with Cabbage Cups ",
        "ingredients": [
            "1/2 cup raw skin-on peanuts",
            "2 Tbsp. vegetable oil",
            "4 garlic cloves, crushed",
            "1 lb. ground pork, beef, or lamb",
            "Kosher salt",
            "1 large shallot, thinly sliced into rings",
            "5 scallions, thinly sliced",
            "4 red or green Thai chiles, thinly sliced",
            "1 lemongrass stalk, bottom third only, tough outer layers removed, thinly sliced",
            "2 Tbsp. fresh lime juice",
            "1 Tbsp. plus 1 tsp. fish sauce",
            "1 cup torn mint leaves",
            "1/4 head of green cabbage, halved crosswise, leaves separated",
            "Cooked short-grain rice and lime wedges (for serving)"
        ],
        "instructions": [
            "Preheat oven to 350°F. Toast peanuts on a rimmed baking sheet, tossing halfway through, until skins are slightly darkened and nuts are golden brown, 6–8 minutes. Let cool, then coarsely chop or crush into small pieces.",
            "Heat oil in a large saucepan over medium-high until shimmering. Add garlic and cook, smashing down on cloves to break into smaller pieces with a wooden spoon, until some parts are golden brown, about 3 minutes. Push garlic to one side of pan, then add pork and a pinch of salt to the other side. Cook, smashing and stirring pork and garlic together, until no clumps remain and meat is no longer pink, about 4 minutes. Be careful not to overcook; as soon as you can’t see any pink, remove from heat. Mix in shallot, scallions, chiles, lemongrass, lime juice, fish sauce, and half of peanuts. Let larb cool slightly, then stir in mint. Taste and season with more salt if needed.",
            "Transfer larb to a large bowl. Serve with cabbage, rice, lime wedges, and remaining peanuts."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ac27196968b1f5f9f70b528/6:4/w_274%2Ch_169/larb-with-cabbage-recipe-BA-032918.jpg",
        "color": 10448027
    }
}