{
    "recipe": {
        "title": "Spiced Apple Pie ",
        "ingredients": [
            "2 1/2 cups all purpose flour",
            "1 tablespoon sugar",
            "1 teaspoon salt",
            "1/4 teaspoon mace",
            "1/2 cup (1 stick) chilled unsalted butter, cut into small pieces",
            "1/2 cup chilled solid vegetable shortening, cut into small pieces",
            "5 tablespoons (about) ice water",
            "3 pounds tart green apples (such as Granny Smith), peeled, cut into 1/4-inch-thick slices",
            "1/2 cup plus 1 teaspoon sugar",
            "1/2 cup packed golden brown sugar",
            "1/4 cup all purpose flour",
            "1 tablespoon fresh lemon juice",
            "1 teaspoon ground cinnamon",
            "1/2 teaspoon ground nutmeg",
            "1/2 teaspoon grated lemon peel",
            "1/4 teaspoon ground mace",
            "1/4 teaspoon ground cloves",
            "1/4 teaspoon ground allspice",
            "1 teaspoon milk"
        ],
        "instructions": [
            "Combine flour, sugar, salt and mace in processor. Using on/off turns, cut in chilled butter and vegetable shortening until mixture resembles coarse meal. Gradually blend in enough water by tablespoonfuls to form moist clumps. Gather dough into ball. Divide dough into 2 pieces. Flatten each into disk. Wrap each in plastic and refrigerate 1 hour. (Can be prepared 3 days ahead. Keep refrigerated. Soften dough slightly at room temperature before rolling.)",
            "For filling: Position rack in lowest third of oven and preheat to 400°F. In large bowl, toss apples with 1/2 cup sugar, brown sugar, flour, lemon juice, cinnamon, nutmeg, lemon peel, mace, cloves and allspice. Roll out 1 dough disk on lightly floured surface to 12-inch-diameter round. Transfer to 9-inch-diameter round. Transfer to 9-inch-diameter deep dish glass pie plate. Trim dough overhang to 1/2 inch. Brush edge of crust lightly with water. Transfer apple mixture to crust, mounding in center. Roll out second dough disk to 12-inch-diameter round. Place atop apples. Trim dough overhang to 1 inch: reserve scraps. Fold top crust edge under bottom crust edge, pressing to seal. Crimp edge decoratively. Reroll pastry scraps and cut out leaf shapes. Brush 1 side of each leaf with milk and arrange, milk side down, decoratively atop crust. Cut several slits in crust to allow steam to escape. Brush crust with milk; sprinkle with remaining 1 teaspoon sugar. Place pie on baking sheet. Bake until crust is golden brown and juices bubble, covering crust edges with aluminum foil if browning too quickly, about 1 hour 10 minutes. Transfer pie to rack and cool.",
            "Position rack in lowest third of oven and preheat to 400°F. In large bowl, toss apples with 1/2 cup sugar, brown sugar, flour, lemon juice, cinnamon, nutmeg, lemon peel, mace, cloves and allspice.",
            "Roll out 1 dough disk on lightly floured surface to 12-inch-diameter round. Transfer to 9-inch-diameter round. Transfer to 9-inch-diameter deep dish glass pie plate. Trim dough overhang to 1/2 inch. Brush edge of crust lightly with water. Transfer apple mixture to crust, mounding in center. Roll out second dough disk to 12-inch-diameter round. Place atop apples. Trim dough overhang to 1 inch: reserve scraps. Fold top crust edge under bottom crust edge, pressing to seal. Crimp edge decoratively.",
            "Reroll pastry scraps and cut out leaf shapes. Brush 1 side of each leaf with milk and arrange, milk side down, decoratively atop crust. Cut several slits in crust to allow steam to escape. Brush crust with milk; sprinkle with remaining 1 teaspoon sugar.",
            "Place pie on baking sheet. Bake until crust is golden brown and juices bubble, covering crust edges with aluminum foil if browning too quickly, about 1 hour 10 minutes. Transfer pie to rack and cool."
        ],
        "picture_link": "https://assets.epicurious.com/photos/583f313eb80c02a24264c1c3/6:4/w_274%2Ch_169/spiced-apple-pie.jpg",
        "color": 14466520
    }
}