{
    "recipe": {
        "title": "Spicy Green Salad with Manchego and Pears ",
        "ingredients": [
            "1/3 cup green (hulled) pumpkin seeds (pepitas; not toasted)",
            "1/3 cup plus 1 tablespoon olive oil, divided",
            "3 tablespoons Sherry vinegar",
            "1 teaspoon mild honey",
            "1 teaspoon grainy mustard",
            "4 cups packed spicy salad greens, such as radish greens, watercress, and/or arugula, tough stems discarded",
            "4 cups packed frisée (French curly endive), torn into bite-size pieces",
            "1 (1/2-pound) piece Manchego cheese, rind removed and cheese shaved into 32 thin slices (preferably with a cheese plane)",
            "8 small red or yellow Bartlett pears (preferably with stems)"
        ],
        "instructions": [
            "Cook seeds in 1 tablespoon oil in a small heavy skillet over medium-low heat, stirring frequently, until puffed and beginning to brown, about 4 minutes. Transfer with a slotted spoon to paper towels and reserve oil. Season seeds with salt and pepper. Whisk together vinegar, honey, mustard, 1/4 teaspoon salt, and 1/8 teaspoon pepper. Add remaining 1/3 cup olive oil and reserved oil from skillet in a slow stream, whisking until emulsified. Divide greens and cheese among salad plates. Cut off 2 opposite sides of each pear (reserve for another use), leaving a 1/2-inch-thick lengthwise center slice with stem and core. Arrange a pear slice on each plate and drizzle dressing over salads. Sprinkle with seeds.",
            "Cook seeds in 1 tablespoon oil in a small heavy skillet over medium-low heat, stirring frequently, until puffed and beginning to brown, about 4 minutes. Transfer with a slotted spoon to paper towels and reserve oil. Season seeds with salt and pepper.",
            "Whisk together vinegar, honey, mustard, 1/4 teaspoon salt, and 1/8 teaspoon pepper. Add remaining 1/3 cup olive oil and reserved oil from skillet in a slow stream, whisking until emulsified.",
            "Divide greens and cheese among salad plates. Cut off 2 opposite sides of each pear (reserve for another use), leaving a 1/2-inch-thick lengthwise center slice with stem and core. Arrange a pear slice on each plate and drizzle dressing over salads. Sprinkle with seeds."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a8d7b55306961bf78f1/6:4/w_274%2Ch_169/240600_hires.jpg"
    }
}