{
    "recipe": {
        "title": "Spiced Chickpeas and Greens Frittata ",
        "ingredients": [
            "12 large eggs",
            "1 1/2 cups chopped tender herbs (such as basil, cilantro, and/or parsley)",
            "3/4 cup sour cream",
            "1/2 tsp. crushed red pepper flakes",
            "1 tsp. kosher salt, plus more",
            "4 Tbsp. extra-virgin olive oil, divided",
            "2 (15.5-oz.) cans chickpeas, rinsed,patted dry",
            "2 tsp. medium curry powder",
            "1 medium onion, finely chopped",
            "6 garlic cloves, 5 thinly sliced, 1 whole",
            "1 small bunch hardy greens (such as mustard, kale, or Swiss chard), ribs and stems removed, leaves torn into 2\" pieces",
            "2/3 cup mayonnaise"
        ],
        "instructions": [
            "Preheat oven to 350°F. Whisk eggs, herbs, sour cream, red pepper flakes, and 1 tsp. salt in a bowl until no streaks remain.",
            "Heat 2 Tbsp. oil in a medium cast-iron or ovenproof nonstick skillet over medium-high. Add chickpeas and curry powder and season with salt. Cook, tossing occasionally, until golden brown, 6–8 minutes. Transfer 1 cup chickpeas to a bowl; set aside.",
            "Reduce heat to medium, add onion, sliced garlic, and remaining 2 Tbsp. oil to chickpeas in skillet and cook, stirring occasionally, until onion is softened and starting to brown, 7–9 minutes.",
            "Add a handful of greens and 2 Tbsp. water and cook until slightly wilted. Continue adding greens a handful at a time, letting them wilt slightly before adding more, until all greens are wilted, about 5 minutes total; season with salt. Let cool 3 minutes.",
            "Return pan to medium-low, pour in egg mixture, and cook, stirring eggs and swirling pan often, until edges are just set (texture should be like a very soft scramble), about 6 minutes. Transfer to oven and bake frittata until puffed slightly and center is barely set, 10–15 minutes. Let cool 5–10 minutes.",
            "Place mayonnaise in a small bowl and grate in remaining garlic clove; mix well. Season with salt.",
            "Serve frittata with garlic mayo and reserved chickpeas."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c1146159ee3cf630f891235/6:4/w_274%2Ch_169/spiced-chickpeas-and-greens-frittata-recipe-BA-121218.jpg"
    }
}