{
    "recipe": {
        "title": "Spicy Popcorn With Piment d'\u0092Espelette and Marcona Almonds ",
        "ingredients": [
            "1 teaspoon piment d'Espelette or Hungarian hot paprika, divided",
            "1 teaspoon salt, divided",
            "6 tablespoons (3/4 stick) unsalted butter",
            "1/2 cup popcorn kernels",
            "1/4 cup peanut oil",
            "3/4 cup whole roasted Marcona almonds*"
        ],
        "instructions": [
            "Mix 1/2 teaspoon piment d'Espelette and 1/2 teaspoon salt in small bowl and reserve.",
            "Melt butter in small saucepan over medium heat. Remove from heat; stir in remaining 1/2 teaspoon piment d'Espelette and 1/2 teaspoon salt.",
            "Combine popcorn kernels and peanut oil in large deep pot with lid. Heat over medium-high heat, occasionally swirling pot so that popcorn kernels are coated with oil. Cover pot. When popcorn kernels start popping, rotate pot over burner until all kernels have popped. Remove popcorn from heat. Immediately add melted butter mixture and Marcona almonds to pot. Cover pot. Using oven mitts, firmly hold pot and lid together and shake until popcorn and Marcona almonds are well coated with melted butter mixture. Transfer popcorn mixture to serving bowl. Sprinkle with reserved piment d'Espelette-salt mixture and serve.",
            "Tender Spanish almonds that are usually sold roasted and salted; available at some supermarkets and at specialty foods stores and natural foods stores and online from latienda.com.",
            "Tender Spanish almonds that are usually sold roasted and salted; available at some supermarkets and at specialty foods stores and natural foods stores and online from latienda.com.",
            "Tender Spanish almonds that are usually sold roasted and salted; available at some supermarkets and at specialty foods stores and natural foods stores and online from latienda.com."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55f08719ad4e361c200f7955/6:4/w_274%2Ch_169/0210-BA-FD4-01.jpg",
        "color": 3577529
    }
}