{
    "recipe": {
        "title": "Spicy Crab Soup ",
        "ingredients": [
            "16 cups water",
            "4 1/2 to 5 1/2 lb live blue crabs (about 14) or Dungeness crabs* (about 3)",
            "1 medium white onion",
            "6 garlic cloves, 3 peeled and halved, 3 left unpeeled",
            "1 dried whole chipotle chile**, stemmed",
            "2 lb tomatoes",
            "2 tablespoons olive oil",
            "3 fresh epazote sprigs*** or 1 tablespoon crumbled dried",
            "4 (5-inch) corn tortillas, torn into 2-inch pieces",
            "1 teaspoon cornstarch",
            "1 3/4 teaspoons salt",
            "a wide 8- to 10-qt heavy pot with a tight-fitting lid; kitchen shears; cheesecloth"
        ],
        "instructions": [
            "Bring water to a simmer in pot and add crabs using tongs. Cover pot and cook over high heat until crab shells are bright red, 5 to 6 minutes. Transfer crabs to a shallow baking pan and reserve cooking liquid in pot.",
            "When crabs are cool enough to handle, break off 16 claws, working over pan to catch juices, and reserve claws, covered and chilled, for garnish (if using Dungeness crabs, reserve 16 hind legs). Still working over pan, pull off aprons (abdomens), legs, and remaining claws from crabs and add to pot, then cut crabs in half, through shell, with kitchen shears (if using Dungeness crabs, pull top shells from bodies and crack front claws with a mallet). Dip crabs into cooking liquid to rinse off mustard (tomalley), then pull apart shells and extract meat and any orange-red roe with your fingers. (There are bits of meat in all the nooks and crannies.) Put meat and roe in a small bowl and chill, covered. Add all shells and any juices from baking pan to cooking liquid in pot.",
            "Make broth: Quarter onion and add 1 quarter to crab cooking liquid along with halved garlic cloves. Boil broth, uncovered, skimming froth frequently, until liquid is reduced to about 8 cups, about 50 minutes. Carefully pour broth through a cheesecloth-lined sieve into a large bowl, pressing on and then discarding solids.",
            "Quarter onion and add 1 quarter to crab cooking liquid along with halved garlic cloves. Boil broth, uncovered, skimming froth frequently, until liquid is reduced to about 8 cups, about 50 minutes. Carefully pour broth through a cheesecloth-lined sieve into a large bowl, pressing on and then discarding solids.",
            "Make sofrito while broth is reducing: Heat a dry well-seasoned cast-iron skillet over moderately high heat until hot, then toast chile 30 seconds on each side and transfer to a blender. Pan-roast unpeeled garlic, turning with tongs, until browned in spots, 3 to 5 minutes. Cool garlic, then peel and add to blender. Pan-roast tomatoes, turning occasionally, until browned in spots, about 10 minutes. Meanwhile, chop remaining onion and add to blender. Cool tomatoes, then core, peel, and quarter and add to blender.Purée mixture until smooth. Force purée through a medium-mesh sieve into a bowl and discard solids. Heat oil in a 4-quart heavy pot over moderately high heat until hot but not smoking and carefully stir in purée (oil will splatter). Cook, stirring frequently, until thickened, about 15 minutes, to make sofrito. Add epazote and 7 cups strained broth, then simmer soup over moderately low heat, stirring occasionally, 30 minutes. Add remaining broth to blender along with tortillas, cornstarch, and salt and blend until smooth, 1 to 2 minutes. Pour mixture through cleaned medium-mesh sieve into a bowl, pressing on and then discarding solids. Stir tortilla purée into soup and simmer, stirring occasionally, until slightly thickened, about 10 minutes. Remove and discard epazote if fresh. Stir in reserved crabmeat and simmer just until heated through. Serve soup ladled over reserved claws.",
            "Heat a dry well-seasoned cast-iron skillet over moderately high heat until hot, then toast chile 30 seconds on each side and transfer to a blender. Pan-roast unpeeled garlic, turning with tongs, until browned in spots, 3 to 5 minutes. Cool garlic, then peel and add to blender. Pan-roast tomatoes, turning occasionally, until browned in spots, about 10 minutes. Meanwhile, chop remaining onion and add to blender. Cool tomatoes, then core, peel, and quarter and add to blender.Purée mixture until smooth. Force purée through a medium-mesh sieve into a bowl and discard solids.",
            "Heat oil in a 4-quart heavy pot over moderately high heat until hot but not smoking and carefully stir in purée (oil will splatter). Cook, stirring frequently, until thickened, about 15 minutes, to make sofrito. Add epazote and 7 cups strained broth, then simmer soup over moderately low heat, stirring occasionally, 30 minutes.",
            "Add remaining broth to blender along with tortillas, cornstarch, and salt and blend until smooth, 1 to 2 minutes. Pour mixture through cleaned medium-mesh sieve into a bowl, pressing on and then discarding solids. Stir tortilla purée into soup and simmer, stirring occasionally, until slightly thickened, about 10 minutes. Remove and discard epazote if fresh. Stir in reserved crabmeat and simmer just until heated through. Serve soup ladled over reserved claws."
        ],
        "picture_link": null
    }
}