{
    "recipe": {
        "title": "Spiced and Glazed Molasses Cookies ",
        "ingredients": [
            "1 1/4 cups all-purpose flour",
            "1/2 cup whole wheat flour",
            "1 teaspoon baking soda",
            "1 teaspoon kosher salt",
            "2 teaspoons ground ginger",
            "1 1/2 teaspoon ground cinnamon",
            "1/2 teaspoon ground cloves",
            "1 1/2 teaspoons finely ground black pepper, plus more for sprinkling",
            "1 cup (packed) dark brown sugar",
            "1/2 cup (1 stick) unsalted butter, room temperature",
            "1 large egg, room temperature",
            "1/3 cup plus 1 tablespoon mild-flavored (light) molasses",
            "3/4 cup powdered sugar",
            "1 tablespoon (or more) milk",
            "Raw sugar (for sprinkling)"
        ],
        "instructions": [
            "Whisk all-purpose flour, whole wheat flour, baking soda, salt, ginger, cinnamon, cloves, and 1 1/2 tsp. pepper in a medium bowl to combine.",
            "Using an electric mixer on medium speed,beat brown sugar and butter in a large bowl until light and fluffy, about 3 minutes. Add egg and beat to incorporate. Add 1/3 cup molasses and mix just to combine. Reduce mixer speed to low and gradually add dry ingredients; beat just until incorporated. Pat dough together and wrap in plastic. Chill until firm, about 1 hour.",
            "Place racks in upper and lower thirds of oven; preheat to 350°F. Scoop out level tablespoonfuls of dough and roll between the palms of your hands into smooth balls. Place on 2 parchment-lined baking sheets, spacing about 2\" apart (you should be able to fit about 12 on each sheet).",
            "Bake cookies, rotating baking sheets top to bottom and back to front halfway through, until just firm around the edges, 9–12 minutes (if you like chewier cookies, bake less, and if a crispier cookie is your thing, bake a little longer). Let cookies cool about 5 minutes on baking sheets, then transfer to wire racks and let cool completely.",
            "Repeat with remaining dough, using fresh parchment paper on baking sheets.",
            "Whisk powdered sugar, milk, and remaining 1 Tbsp. molasses in a medium bowl until smooth. The glaze should be very thick and glossy but still pourable. If needed, add more milk or water 1/2-teaspoonful at a time until you get to the right consistency. Drizzle glaze over cookies and sprinkle with raw sugar and more pepper.",
            "Do Ahead Cookies can be baked and glazed 2 days ahead. Once glaze is set, store airtight at room temperature, or freeze unglazed cookies up to 1 month in resealable plastic bags.",
            "Cookies can be baked and glazed 2 days ahead. Once glaze is set, store airtight at room temperature, or freeze unglazed cookies up to 1 month in resealable plastic bags."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a3002ba1108fa327e38acc5/6:4/w_274%2Ch_169/spiced-molasses-cookies-recipe-BA-121217.jpg"
    }
}