{
    "recipe": {
        "title": "Spiced Plum-Cherry Turnovers ",
        "ingredients": [
            "1/2 cup (packed) dark brown sugar",
            "2 teaspoons cornstarch",
            "1/2 teaspoon ground allspice",
            "4 small plums or 2 large plums (about 12 ounces total), cut into 1/4-inch-thick slices",
            "1 cup cherries (generous; about 7 ounces), stemmed, pitted",
            "1 teaspoon cherry balsamic vinegar or raspberry vinegar",
            "1 15-ounce package refrigerated pie crusts (2 crusts), room temperature"
        ],
        "instructions": [
            "Preheat oven to 400°F. Mix dark brown sugar, cornstarch, and allspice in medium bowl. Add plums, cherries, and vinegar, and toss to combine. Unroll crusts on work surface. Cut each round in half. Mound 1/4 of filling on half of each dough piece, reserving 1 tablespoon juices in bowl. Fold plain dough halves over filling. Press edges to seal; fold edges over to double, then crimp decoratively. Brush turnovers with reserved juices from bowl. Cut small slits in tops for steam to escape. Transfer turnovers to rimmed baking sheet. Bake turnovers until juices bubble and pastry is golden, about 20 minutes. Cool 15 minutes and serve warm or at room temperature.",
            "Preheat oven to 400°F. Mix dark brown sugar, cornstarch, and allspice in medium bowl. Add plums, cherries, and vinegar, and toss to combine.",
            "Unroll crusts on work surface. Cut each round in half. Mound 1/4 of filling on half of each dough piece, reserving 1 tablespoon juices in bowl. Fold plain dough halves over filling. Press edges to seal; fold edges over to double, then crimp decoratively. Brush turnovers with reserved juices from bowl. Cut small slits in tops for steam to escape. Transfer turnovers to rimmed baking sheet.",
            "Bake turnovers until juices bubble and pastry is golden, about 20 minutes. Cool 15 minutes and serve warm or at room temperature."
        ],
        "picture_link": null
    }
}