{
    "recipe": {
        "title": "Spice-Rubbed Pork Tenderloin with a Mediterranean Grain Salad ",
        "ingredients": [
            "2 small pork tenderloins (about 1 1/2 pounds total)",
            "1 3/4 teaspoons kosher salt, divided",
            "4 tablespoons olive oil, divided",
            "3 cups cooked farro, rice, or quinoa",
            "1 cup cucumber half moons",
            "1 cup cherry tomatoes, halved",
            "1 teaspoon ground cumin",
            "1 teaspoon light brown sugar",
            "1 1/4 teaspoons freshly ground black pepper, divided",
            "2 tablespoons fresh lemon juice",
            "1/2 cup crumbled feta",
            "2 teaspoons harissa paste",
            "1 cup dry white wine or low-sodium chicken broth",
            "4 tablespoons unsalted cold butter, cut into 8 pieces",
            "2 teaspoons fresh lemon juice (optional)",
            "Kosher salt, freshly ground pepper",
            "1/2 cup coarsely chopped herbs, such as dill, parsley, and/or mint",
            "1/4 cup pitted Kalamata olives, sliced in half lengthwise"
        ],
        "instructions": [
            "Preheat oven to 375°F. Season pork all over with 1 tsp. salt. Heat 2 Tbsp. oil in a large, heavy, ovenproof skillet (preferably cast iron) over medium-high. Sear pork, turning occasionally, until browned on all sides, about 7 minutes. Transfer skillet to oven and roast, flipping pork halfway through, until an instant-read thermometer inserted into the thickest part of meat registers 145°F for medium/medium-rare, 10–12 minutes. Transfer pork to a cutting board (reserve skillet if you're going for Option 3) and let rest at least 5 minutes. Slice into medallions. Meanwhile, toss grains with remaining 2 Tbsp. oil and 3/4 tsp. salt in a large bowl. Fold in cucumbers and tomatoes, or serve them alongside.",
            "Option 2: A little more flavor: Before searing pork, add cumin, brown sugar, and 1 tsp. pepper to 1 tsp. salt. Rub all over pork, then follow cooking directions above. Fold lemon juice and remaining 1/4 tsp. pepper into grain salad. Top salad with feta before serving.",
            "Before searing pork, add cumin, brown sugar, and 1 tsp. pepper to 1 tsp. salt. Rub all over pork, then follow cooking directions above. Fold lemon juice and remaining 1/4 tsp. pepper into grain salad. Top salad with feta before serving.",
            "Option 3: Take it next level: After searing pork, drain excess fat from skillet and heat over medium. Add harissa and cook, stirring constantly with a spatula or wooden spoon, until bubbling and slightly browned, about 30 seconds. Pour in wine or broth, increase heat to high, and cook, scraping up browned bits, until reduced by half, about 5 minutes. Remove skillet from heat and add butter, one piece at a time, whisking to incorporate after each addition until emulsified. Stir in lemon juice, if using (we especially like it with the chicken broth-based sauce); season with salt and pepper. Fold herbs and olives into grain salad. Divide pork and salad among plates and serve sauce alongside.",
            "After searing pork, drain excess fat from skillet and heat over medium. Add harissa and cook, stirring constantly with a spatula or wooden spoon, until bubbling and slightly browned, about 30 seconds. Pour in wine or broth, increase heat to high, and cook, scraping up browned bits, until reduced by half, about 5 minutes. Remove skillet from heat and add butter, one piece at a time, whisking to incorporate after each addition until emulsified. Stir in lemon juice, if using (we especially like it with the chicken broth-based sauce); season with salt and pepper. Fold herbs and olives into grain salad. Divide pork and salad among plates and serve sauce alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58fa7509db823722bb6279d9/6:4/w_274%2Ch_169/Spice-Rubbed-Pork-Tenderloin-with-Herby-Grain-Salad-recipe-20042017.jpg",
        "color": 6136835
    }
}