{
    "recipe": {
        "title": "Spicy Tahini and Avocado Soba ",
        "ingredients": [
            "1/4 cup tahini paste",
            "3 1/2 tablespoons organic red miso paste",
            "1/4 cup plus 1 tablespoon rice vinegar",
            "1 to 2 tablespoons sriracha sauce (depending on how hot you like it)",
            "1 (8- to 9.5-ounce) pack dried soba noodles",
            "1 cup thin jicama matchsticks",
            "2 cups baby spinach",
            "1 avocado, pitted, peeled, and sliced",
            "2 tablespoons gomashio, plus more as needed"
        ],
        "instructions": [
            "In a medium saucepan, cook the soba noodles in boiling water, as directed on your package. Make the dressing: Put the tahini paste, miso paste, rice vinegar, and sriracha in a large bowl. Whisk well. Drain the cooked noodles and rinse under cold running water; set aside in the colander. (Quick tip: To keep your noodles from clumping together, rub the noodles together when rinsing under cold running water to wash away excess starch. This will also make sure your noodles maintain a perfect texture.) Add your drained and cooled soba noodles to the dressing bowl and toss. Add the jicama and baby spinach; mix well. Top off the soba noodles with avocado slices and gomashio. To serve, twirl the noodles using tongs and place in individual serving bowls.",
            "In a medium saucepan, cook the soba noodles in boiling water, as directed on your package.",
            "Make the dressing: Put the tahini paste, miso paste, rice vinegar, and sriracha in a large bowl. Whisk well.",
            "Drain the cooked noodles and rinse under cold running water; set aside in the colander. (Quick tip: To keep your noodles from clumping together, rub the noodles together when rinsing under cold running water to wash away excess starch. This will also make sure your noodles maintain a perfect texture.)",
            "Add your drained and cooled soba noodles to the dressing bowl and toss.",
            "Add the jicama and baby spinach; mix well. Top off the soba noodles with avocado slices and gomashio.",
            "To serve, twirl the noodles using tongs and place in individual serving bowls."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b197a3dfe03a87f78126b7e/6:4/w_274%2Ch_169/tahini-avocado-soba-noodles-060618.jpg"
    }
}