{
    "recipe": {
        "title": "Spiced Sweet-Potato Cake with Brown Sugar Icing ",
        "ingredients": [
            "4 8-ounce red-skinned sweet potatoes(yams)",
            "Nonstick vegetable oil spray",
            "2 3/4 cups all purpose flour",
            "2 teaspoons ground cinnamon",
            "1 1/4 teaspoons ground ginger",
            "1 teaspoon baking powder",
            "1 teaspoon baking soda",
            "1/2 teaspoon salt",
            "2 cups sugar",
            "1 cup vegetable oil",
            "4 large eggs",
            "1 teaspoon vanilla extract",
            "1 cup powdered sugar",
            "3/4 cup (packed) dark brown sugar",
            "1/2 cup whipping cream",
            "1/4 cup (1/2 stick) unsalted butter",
            "1/4 teaspoon vanilla extract"
        ],
        "instructions": [
            "Pierce sweet potatoes with fork. Microwave on high until very tender, about 8 minutes per side. Cool, peel and mash sweet potatoes.",
            "Position rack in center of oven; preheat to 325°F. Spray 12-cup Bundt pan with nonstick spray, then generously butter pan. Sift flour, cinnamon, ginger, baking powder, baking soda and salt into medium bowl. Measure enough mashed sweet potatoes to equal 2 cups. Transfer to large bowl. Add sugar and oil to sweet potatoes; using electric mixer, beat until smooth. Add eggs 2 at a time, beating well after each addition. Add flour mixture; beat just until blended. Beat in vanilla. Transfer batter to prepared pan. Bake cake until tester inserted near center comes out clean, about 1 hour 5 minutes. Cool cake in pan on rack 15 minutes. Using small knife, cut around sides of pan and center tube to loosen cake. Turn out onto rack; cool completely.",
            "For icing: Sift powdered sugar into medium bowl. Stir brown sugar, whipping cream and butter in medium saucepan over medium-low heat until butter melts and sugar dissolves. Increase heat to medium-high and bring to boil. Boil 3 minutes, occasionally stirring and swirling pan. Remove from heat and stir in vanilla. Pour brown sugar mixture over powdered sugar. Whisk icing until smooth and lightened in color, about 1 minute. Cool icing until lukewarm and icing falls in heavy ribbon from spoon, whisking often, about 15 minutes. Spoon icing thickly over top of cake, allowing icing to drip down sides of cake. Let stand until icing is firm, at least 1 hour. (Can be prepared 1 day ahead. Cover with cake dome and let stand at room temperature.)",
            "Sift powdered sugar into medium bowl. Stir brown sugar, whipping cream and butter in medium saucepan over medium-low heat until butter melts and sugar dissolves. Increase heat to medium-high and bring to boil. Boil 3 minutes, occasionally stirring and swirling pan. Remove from heat and stir in vanilla. Pour brown sugar mixture over powdered sugar. Whisk icing until smooth and lightened in color, about 1 minute. Cool icing until lukewarm and icing falls in heavy ribbon from spoon, whisking often, about 15 minutes. Spoon icing thickly over top of cake, allowing icing to drip down sides of cake. Let stand until icing is firm, at least 1 hour. (Can be prepared 1 day ahead. Cover with cake dome and let stand at room temperature.)"
        ],
        "picture_link": null
    }
}