{
    "recipe": {
        "title": "Spiced Middle Eastern Lamb Patties with Pita and Yogurt ",
        "ingredients": [
            "1 cup plain full-fat or low-fat yogurt",
            "2 tablespoons fresh lemon juice",
            "2 tablespoons finely chopped herbs, such as mint, dill or cilantro, plus herb sprigs, for serving",
            "Kosher salt",
            "1 1/2 pounds ground lamb or beef",
            "1 tablespoon minced garlic (about 1 large clove)",
            "1 tablespoon coriander",
            "2 teaspoons ground cumin",
            "1 1/2 teaspoons hot paprika",
            "11/2 teaspoons kosher salt",
            "1 1/2 tablespoons extra-virgin olive oil",
            "4 to 6 pita bread rounds"
        ],
        "instructions": [
            "In a small bow, whisk the yogurt with the lemon juice. Stir in the chopped herbs, season with salt and refrigerate until ready to use.",
            "For the patties and pita: In a bowl, use your hands to mix together all of the ingredients, except for the pita. Form the mixture into twelve 3-inch oval patties (about 1 inch thick). Arrange the patties on a plate and refrigerate for at least 30 minutes, until firm Preheat a grill for at least 10 minutes and prepare it for grilling over moderately high heat. If you are using a charcoal grill, leave one area where you can grill the pita indirectly. Oil the grill grates and grill the patties until dark brown grill marks form on the bottom, 5 to 6 minutes. Flip the patties and grill for 4 to 6 minutes longer, until just cooked through. Meanwhile, wrap the pita in foil and set the package on the top shelf of a gas grill or in the cooler spot of a charcoal grill and allow them to warm through, 8 to 10 minutes. Wrap 2 or 3 patties in each pita, spoon some of the yogurt sauce alongside and serve with herb sprigs, passing the remaining yogurt sauce at the table.",
            "In a bowl, use your hands to mix together all of the ingredients, except for the pita. Form the mixture into twelve 3-inch oval patties (about 1 inch thick). Arrange the patties on a plate and refrigerate for at least 30 minutes, until firm",
            "Preheat a grill for at least 10 minutes and prepare it for grilling over moderately high heat. If you are using a charcoal grill, leave one area where you can grill the pita indirectly.",
            "Oil the grill grates and grill the patties until dark brown grill marks form on the bottom, 5 to 6 minutes. Flip the patties and grill for 4 to 6 minutes longer, until just cooked through.",
            "Meanwhile, wrap the pita in foil and set the package on the top shelf of a gas grill or in the cooler spot of a charcoal grill and allow them to warm through, 8 to 10 minutes.",
            "Wrap 2 or 3 patties in each pita, spoon some of the yogurt sauce alongside and serve with herb sprigs, passing the remaining yogurt sauce at the table."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac3dd819925f464b3a9922/6:4/w_274%2Ch_169/51237020_middle-eastern-lamb-patties_1x1.jpg"
    }
}