{
    "recipe": {
        "title": "Spicy Black Bean and Corn Tacos ",
        "ingredients": [
            "1/4 cup hazelnuts, coarsely chopped",
            "1/4 cup raw pumpkin seeds",
            "2 ears of corn, shucked",
            "1 medium jalapeño, seeded, finely chopped",
            "1 teaspoon crushed red pepper flakes",
            "1/4 cup chopped cilantro, plus more for serving",
            "5 tablespoons olive oil, divided",
            "5 tablespoons fresh lime juice, divided, plus lime wedges for serving",
            "1 1/4 teaspoons kosher salt, divided",
            "1 red onion, coarsely chopped",
            "2 (15-ounce) cans black beans, rinsed, drained",
            "1 tablespoon ground cumin",
            "12 small corn tortillas",
            "1/2 cup sour cream",
            "1 large avocado, thinly sliced"
        ],
        "instructions": [
            "Toast hazelnuts and pumpkin seeds in a medium skillet over medium heat, tossing occasionally, until golden brown, 8–10 minutes.",
            "Meanwhile, slice corn off cobs into a large bowl (you should have about 2 cups kernels). Add toasted nuts and seeds, jalapeño, red pepper, 1/4 cup chopped cilantro, 1/4 cup oil, 3 Tbsp. lime juice, and 1/2 tsp. salt; toss to combine.",
            "Heat remaining 1 Tbsp. oil in a medium skillet over medium. Add onion and cook, stirring, until onion starts to release moisture and turns translucent, 4–5 minutes. Add beans, cumin, 1/3 cup water, and remaining 3/4 tsp. salt. Cover and cook until liquid is reduced and beans soften, about 5 minutes. Uncover, add 1/3 cup water, and use the back of a fork to mash up about half of beans.",
            "Working one at a time, warm tortillas with tongs directly over a gas burner over medium heat, turning often, until lightly charred and puffed in spots, about 45 seconds per side. (Alternatively, wrap tortillas in foil and heat in a 350°F oven until warmed through, or wrap in damp paper towels and microwave in 20-second bursts until warm.) Transfer to a plate and cover with a kitchen towel to keep warm.",
            "Whisk sour cream and remaining 2 Tbsp. lime juice in a small bowl. Fill tortillas with bean mixture, then top with corn salsa, avocado, and cilantro leaves. Drizzle with sour cream mixture and serve with lime wedges alongside.",
            "Do Ahead Corn salsa and beans can be made 3 days ahead; store separately, cover, and chill. Bring corn salsa to room temperature. Reheat beans in skillet before serving.",
            "Corn salsa and beans can be made 3 days ahead; store separately, cover, and chill. Bring corn salsa to room temperature. Reheat beans in skillet before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59849a0ad93955638dbcd32d/6:4/w_274%2Ch_169/Spicy-Black-Bean-and-Corn-Tacos-NO-MEAT-NO-PROBLEM-hero-02082017.jpg"
    }
}