{
    "recipe": {
        "title": "Spicy and Greasy Rhode Island Calamari ",
        "ingredients": [
            "1 lb cleaned medium squid (4\"-5″), with tentacles",
            "3/4 cup cornstarch",
            "3/4 cup all-purpose flour",
            "1/2 cup yellow cornmeal",
            "2 teaspoons salt",
            "1/2 teaspoon freshly ground black pepper",
            "1/2 teaspoon cayenne pepper",
            "About 6 cups peanut, canola, or other vegetable oil, for deep-frying",
            "2 cups buttermilk",
            "4 tablespoons unsalted butter",
            "4 large garlic cloves, finely chopped",
            "1 cup sliced hot cherry peppers in vinegar, drained",
            "2 tablespoons chopped fresh Italian parsley",
            "Deep-fry thermometer"
        ],
        "instructions": [
            "Working Ahead: The squid can be cleaned (if necessary) and cut in the morning, then covered and refrigerated. The fry mix can also be made early in the day. Cut squid bodies into 1/2″ rings and put in a colander set over a bowl; add whole tentacles. Cover and refrigerate until ready to use (up to 6 hours).",
            "The squid can be cleaned (if necessary) and cut in the morning, then covered and refrigerated. The fry mix can also be made early in the day.",
            "Cut squid bodies into 1/2″ rings and put in a colander set over a bowl; add whole tentacles. Cover and refrigerate until ready to use (up to 6 hours).",
            "Fry Mix: Combine cornstarch, flour, cornmeal, salt, and both peppers in a large bowl and whisk well. Refrigerate if not using within an hour or two to prevent humidity from changing the mixture. Line a baking sheet with paper towels. Heat 3\" of oil in a 4-quart Dutch oven over medium heat (or in a deep fryer) until it registers 360° on a deep-fry thermometer. While oil is heating, pour buttermilk into a large bowl and drop squid into it. Stir with a Chinese wire-mesh skimmer to coat, then lift about half of squid pieces from buttermilk, allowing excess buttermilk to drip back into bowl, and drop pieces into the dry mix. Rinse and dry the wire skimmer. Toss pieces to coat evenly with the mix, then lift them out with skimmer, gently shake off excess fry mix, and transfer to a plate. Bread remaining squid. Rinse and dry skimmer. Heat a 10″-12″sauté pan over medium heat and add butter. Once it melts, add garlic and sauté until golden. Add drained cherry peppers and toss to combine. Turn heat down to low while you fry squid. When the oil is hot, carefully drop half the squid pieces into oil. If any of the pieces stick to the bottom of the pot, loosen with tongs. Turn squid occasionally to cook evenly; it will only take about 1 1/2 minutes until they are crisp and golden. Fry remaining squid and drain. Add all of fried squid to the hot pan with the garlic and sliced peppers, sprinkle with chopped parsley, and quickly and gently toss (only twice). Divide among 4 small plates and serve immediately.",
            "Combine cornstarch, flour, cornmeal, salt, and both peppers in a large bowl and whisk well. Refrigerate if not using within an hour or two to prevent humidity from changing the mixture.",
            "Line a baking sheet with paper towels. Heat 3\" of oil in a 4-quart Dutch oven over medium heat (or in a deep fryer) until it registers 360° on a deep-fry thermometer.",
            "While oil is heating, pour buttermilk into a large bowl and drop squid into it. Stir with a Chinese wire-mesh skimmer to coat, then lift about half of squid pieces from buttermilk, allowing excess buttermilk to drip back into bowl, and drop pieces into the dry mix. Rinse and dry the wire skimmer. Toss pieces to coat evenly with the mix, then lift them out with skimmer, gently shake off excess fry mix, and transfer to a plate. Bread remaining squid. Rinse and dry skimmer.",
            "Heat a 10″-12″sauté pan over medium heat and add butter. Once it melts, add garlic and sauté until golden. Add drained cherry peppers and toss to combine. Turn heat down to low while you fry squid.",
            "When the oil is hot, carefully drop half the squid pieces into oil. If any of the pieces stick to the bottom of the pot, loosen with tongs. Turn squid occasionally to cook evenly; it will only take about 1 1/2 minutes until they are crisp and golden.",
            "Fry remaining squid and drain.",
            "Add all of fried squid to the hot pan with the garlic and sliced peppers, sprinkle with chopped parsley, and quickly and gently toss (only twice). Divide among 4 small plates and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac3db419925f464b3a9828/6:4/w_274%2Ch_169/51237100_calamari_1x1.jpg"
    }
}