{
    "recipe": {
        "title": "Spicy Grilled Chicken with Crunchy Fennel Salad ",
        "ingredients": [
            "1 1/2 lb. skinless, boneless chicken thighs",
            "Kosher salt",
            "2 garlic cloves",
            "3 oil-packed anchovy fillets (optional)",
            "1 red chile (such as Fresno or Holland), seeds removed, coarsely chopped",
            "2 Tbsp. tomato paste",
            "2 tsp. finely chopped oregano",
            "5 Tbsp. extra-virgin olive oil, divided, plus more for grilling",
            "2 lemons, halved",
            "2 medium fennel bulbs, tough outer layers removed, halved lengthwise, thinly sliced crosswise",
            "1 small white onion, very thinly sliced into rounds",
            "2 Tbsp. unseasoned rice vinegar",
            "1 Tbsp. toasted white and/or black sesame seeds"
        ],
        "instructions": [
            "Pat chicken dry and season with salt. Set aside on a plate.",
            "Smash garlic under the flat side of a chef’s knife on your cutting board. Add anchovies, if using, chile, and a couple of pinches of salt and continue smashing with the side of your knife until a paste forms. (You can also do this with a mortar and pestle.) Transfer paste to a large bowl and stir in tomato paste, oregano, and 3 Tbsp. oil. Add chicken and toss to coat. Let sit at room temperature 1 hour.",
            "Meanwhile, prepare a grill for medium heat. Clean and oil grate. Grill chicken, turning once, until lightly charred and cooked through, about 4 minutes per side.",
            "While the chicken is cooking, grill lemons, cut side down, until lightly charred and starting to caramelize, about 4 minutes. Transfer to a platter.",
            "Transfer chicken to platter with lemons and let rest 5 minutes.",
            "While the chicken is resting, toss fennel, onion, and vinegar in a medium bowl; drizzle with remaining 2 Tbsp. oil and season with a big pinch of salt and toss once more.",
            "Mound fennel salad next to chicken and sprinkle sesame seeds over both. Squeeze grilled lemons over chicken and fennel salad."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b16fb152d124719c33e5a54/6:4/w_274%2Ch_169/spicy-grilled-chicken-with-crunchy-fennel-salad-recipe-BA-060518.jpg"
    }
}