{
    "recipe": {
        "title": "Spiced Moroccan Vegetable Soup with Chickpeas, Cilantro, and Lemon (Harira) ",
        "ingredients": [
            "4 tablespoons olive oil",
            "1 large onion, diced (about 2 cups)",
            "3 stalks celery, diced (about 1 1/2 cups)",
            "3 large carrots, peeled and cut in rounds",
            "1/2 teaspoon ground turmeric",
            "1 teaspoon ground cumin",
            "1/2 to 1 teaspoon harissa or dried red chile flakes, plus more for serving",
            "Salt to taste",
            "1 bunch parsley, chopped (about 1 1/2 cups/75 grams), divided",
            "1 bunch cilantro, chopped (about 1 1/2 cups/75 grams), divided",
            "1 (15-ounce/425-gram) can tomatoes, crushed, or 2 cups (450 grams) tomato sauce",
            "7 cups (1 2/3 liters) chicken or vegetable stock",
            "1 cup (200 grams) dried chickpeas, soaked overnight and cooked or 1 (15-ounce/425-gram) can chickpeas, drained",
            "1 cup (370 grams) green lentils",
            "1 teaspoon freshly ground black pepper",
            "2 tablespoons all-purpose unbleached flour",
            "1 large egg",
            "Juice of 2 lemons (about 1/4 cup)"
        ],
        "instructions": [
            "Heat the oil in a large skillet over medium heat and sauté the onion, celery, and carrots until the onion turns translucent and begin to brown, about 5 to 10 minutes. Add the turmeric, cumin, harissa or chile flakes, 1 teaspoon of salt, 1 cup each of the parsley and cilantro, tomatoes, and the stock or water and bring to a boil. If using the soaked chickpeas, drain them and add to the pot. Simmer uncovered for 25 minutes, then add the lentils, another teaspoon of salt and a teaspoon of pepper and continue simmering until the chickpeas and lentils are cooked, about 20 minutes more. If using canned chickpeas omit the first 25 minutes of simmering and add with the lentils.",
            "Whisk the flour, egg, and lemon juice into 2 cups (470 ml) of water. Stir into the soup. Simmer the soup about 5 minutes more and serve, sprinkled with the remaining cilantro and parsley. And don’t forget to have some extra harissa in a plate on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58e2b7bad04eb57b5d84813b/6:4/w_274%2Ch_169/harira-moroccan-vegetable-soup-040317.jpg"
    }
}