{
    "recipe": {
        "title": "Spinach-Yogurt Dip with Sizzled Mint ",
        "ingredients": [
            "1 cup walnuts",
            "8 ounces baby spinach (about 10 cups)",
            "6 tablespoons extra-virgin olive oil, divided",
            "1 small onion, finely chopped",
            "2 garlic cloves, thinly sliced",
            "Kosher salt",
            "2 tablespoons dried mint",
            "3 cups plain whole-milk Greek yogurt",
            "1 tablespoons fresh lemon juice",
            "Freshly ground black pepper"
        ],
        "instructions": [
            "Preheat oven to 350°F. Toast walnuts on a baking sheet, tossing once, until golden brown, 6–8 minutes. Let cool; finely crush with the side of a chef’s knife. Place a medium skillet over medium heat and add 1/2 cup water. As soon as you see bubbles, add one-third of the spinach and cook, stirring occasionally, until most of the spinach is wilted, then add more. Continue to cook, stirring occasionally, until all the spinach is in the pan and wilted, 6–8 minutes. Transfer spinach to a bowl of ice water to stop the cooking and lock in its bright green color. Drain and squeeze out excess liquid. Finely chop spinach and set aside. Wipe out skillet and heat 2 Tbsp. oil over medium. Cook onion, stirring occasionally, until soft but without taking on any color, 6–8 minutes. Add garlic and a pinch of salt and cook, stirring occasionally, until garlic is softened, 2–3 minutes. Transfer to a small bowl. Heat remaining 4 Tbsp. oil in a small skillet over medium. Once oil begins to shimmer, remove from heat and stir in dried mint. The oil will sizzle immediately and the mint will become fragrant. Transfer to a small bowl; season with salt. Combine yogurt, lemon juice, onion mixture, half of the walnuts, and reserved spinach in a medium bowl. Taste and season with salt and pepper. Scrape into a shallow serving bowl and use the back of a spoon to carve a few swirls into the dip. Top with remaining walnuts and spoon sizzled mint oil over.",
            "Preheat oven to 350°F. Toast walnuts on a baking sheet, tossing once, until golden brown, 6–8 minutes. Let cool; finely crush with the side of a chef’s knife.",
            "Place a medium skillet over medium heat and add 1/2 cup water. As soon as you see bubbles, add one-third of the spinach and cook, stirring occasionally, until most of the spinach is wilted, then add more. Continue to cook, stirring occasionally, until all the spinach is in the pan and wilted, 6–8 minutes. Transfer spinach to a bowl of ice water to stop the cooking and lock in its bright green color. Drain and squeeze out excess liquid. Finely chop spinach and set aside.",
            "Wipe out skillet and heat 2 Tbsp. oil over medium. Cook onion, stirring occasionally, until soft but without taking on any color, 6–8 minutes. Add garlic and a pinch of salt and cook, stirring occasionally, until garlic is softened, 2–3 minutes. Transfer to a small bowl.",
            "Heat remaining 4 Tbsp. oil in a small skillet over medium. Once oil begins to shimmer, remove from heat and stir in dried mint. The oil will sizzle immediately and the mint will become fragrant. Transfer to a small bowl; season with salt.",
            "Combine yogurt, lemon juice, onion mixture, half of the walnuts, and reserved spinach in a medium bowl. Taste and season with salt and pepper. Scrape into a shallow serving bowl and use the back of a spoon to carve a few swirls into the dip. Top with remaining walnuts and spoon sizzled mint oil over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a5fc85e21f1764a205f88b1/6:4/w_274%2Ch_169/spinach-yogurt-dip-with-sizzled-mint-recipe-BA-011718.jpg"
    }
}