{
    "recipe": {
        "title": "Spinach Gnocchi ",
        "ingredients": [
            "10 ounces block frozen chopped spinach",
            "1 cup whole milk ricotta cheese",
            "2/3 cup parmesan cheese, plus 2 tbsp for sprinkling before serving.",
            "1 egg yolk",
            "2 tablespoons flour, plus more for dusting your hands while rolling"
        ],
        "instructions": [
            "Defrost the brick of frozen spinach (you can also do this in the microwave). Squeeze ALL (and I mean ALL) of the water out of the spinach in small handfuls (I use my hands and do it over a bowl to make sure I don't lose any spinach). Place all of the ingredients in a food processor and pulse. You want to make sure the spinach is in tiny pieces and the mixture is thoroughly combined. Dust your hands with a little flour so the mixture doesn't stick to your hands. Take 1 teaspoon of the spinach mixture and roll into tiny balls. Place on a plate covered with waxed paper or parchment. Bring a large pot of water to a boil for cooking the gnocchi. Add the gnocchi to the water in batches and cook for 3 minutes or until they rise to the surface. Using a slotted spoon, remove the gnocchi to a plate or bowl. Sprinkle with parmesan cheese, cool and serve. To Freeze: After step 5, place on sheet tray and freeze for 30 minutes. Transfer to a ziploc bag, label and freeze up to 4 months. When ready, thaw to room temperature and follow steps 6-9.",
            "Defrost the brick of frozen spinach (you can also do this in the microwave).",
            "Squeeze ALL (and I mean ALL) of the water out of the spinach in small handfuls (I use my hands and do it over a bowl to make sure I don't lose any spinach).",
            "Place all of the ingredients in a food processor and pulse. You want to make sure the spinach is in tiny pieces and the mixture is thoroughly combined.",
            "Dust your hands with a little flour so the mixture doesn't stick to your hands.",
            "Take 1 teaspoon of the spinach mixture and roll into tiny balls. Place on a plate covered with waxed paper or parchment.",
            "Bring a large pot of water to a boil for cooking the gnocchi.",
            "Add the gnocchi to the water in batches and cook for 3 minutes or until they rise to the surface.",
            "Using a slotted spoon, remove the gnocchi to a plate or bowl.",
            "Sprinkle with parmesan cheese, cool and serve.",
            "To Freeze: After step 5, place on sheet tray and freeze for 30 minutes. Transfer to a ziploc bag, label and freeze up to 4 months. When ready, thaw to room temperature and follow steps 6-9."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54cad73e1f13bb9b2edf90fa/6:4/w_274%2Ch_169/51262540_spinach-gnocchi_1x1.jpg"
    }
}