{
    "recipe": {
        "title": "Spinach and Red-Pepper Calzones ",
        "ingredients": [
            "1 1/2 tablespoons cornmeal",
            "1 large onion, halved and sliced lengthwise",
            "3 tablespoons extra-virgin olive oil, divided",
            "2 garlic cloves, finely chopped",
            "5 ounces baby spinach (8 packed cups)",
            "4 bottled roasted red peppers, rinsed, patted dry, and cut into 1-inch pieces (1 cup)",
            "12 oil-cured black olives, pitted and coarsely chopped (about 3 tablespoons)",
            "1 pound store-bought pizza dough, thawed",
            "1/2 pound smoked mozzarella, cut into 16 pieces"
        ],
        "instructions": [
            "Preheat oven to 500°F with rack in lowest position. Sprinkle cornmeal on a large baking sheet.",
            "Cook onion with 1/4 teaspoon salt in 2 tablespoons oil in a large heavy skillet over medium heat, stirring occasionally, until beginning to brown, 8 to 10 minutes. Add garlic and cook until fragrant, about 1 minute. Add spinach and cook, stirring frequently, until wilted, about 2 minutes. Stir in red peppers, olives, and pepper to taste. Remove from heat.",
            "Roll out dough on a lightly floured surface with a lightly floured rolling pin into a 14-inch round, then cut into quarters. Roll out 1 quarter into an 8-inch square (keep remaining pieces covered) and arrange with a corner nearest you. Put one fourth of filling on lower half, leaving a 1-inch border, and top with 4 pieces of cheese. Fold dough over to enclose filling. Seal edges. Beginning in 1 corner, stretch sealed edge outward, pinching and rolling dough up over edge to resemble a rope, working your way around. Transfer to baking sheet. Make 3 more calzones in same manner. Cut 3 steam vents in top of each and brush with remaining tablespoon oil.",
            "Bake until golden-brown, 13 to 15 minutes. Cool 5 minutes before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55dcd3e0b7b823b62a10d55f/6:4/w_274%2Ch_169/352293_hires-CP.jpg",
        "color": 193890
    }
}