{
    "recipe": {
        "title": "Spinach, Lamb and Orzo Soup ",
        "ingredients": [
            "7 cups water",
            "1 14 1/2-ounce can chicken broth",
            "3 pounds lamb shanks",
            "1 carrot, chopped",
            "1 onion, chopped",
            "1 celery stalk, chopped",
            "1 bay leaf",
            "3 tablespoons olive oil",
            "1 small onion, sliced",
            "3/4 cup (about 5 ounces) orzo (rice-shaped pasta)*",
            "1 pound fresh spinach, chopped or 1 10-ounce package frozen chopped spinach, thawed",
            "Freshly grated Parmesan cheese",
            "*Available at Italian markets, specialty foods stores and many supermarkets."
        ],
        "instructions": [
            "Bring water and chicken broth to boil in heavy large saucepan or Dutch oven over high heat. Add lamb shanks, carrot, chopped onion, celery and bay leaf and bring to boil. Reduce heat and simmer until lamb is tender, about 1 hour 20 minutes. Transfer lamb to plate and cool slightly. Remove meat from bone and cut into 1/2-inch pieces. Strain cooking liquid and reserve. In same pot, heat olive oil over medium heat. Add sliced onion and sauté until tender, about 6 minutes. Add reserved cooking liquid, lamb meat and orzo. Cook soup over medium heat until orzo is tender but still firm to bite, about 20 minutes. Add spinach to soup and cook until wilted, about 2 minutes. Season soup to taste with salt and pepper. (Soup can be prepared 1 day ahead. Cover and refrigerate. Bring soup to simmer before serving.) Ladle soup into bowls. Serve, passing grated Parmesan cheese separately.",
            "Bring water and chicken broth to boil in heavy large saucepan or Dutch oven over high heat. Add lamb shanks, carrot, chopped onion, celery and bay leaf and bring to boil. Reduce heat and simmer until lamb is tender, about 1 hour 20 minutes. Transfer lamb to plate and cool slightly. Remove meat from bone and cut into 1/2-inch pieces. Strain cooking liquid and reserve.",
            "In same pot, heat olive oil over medium heat. Add sliced onion and sauté until tender, about 6 minutes. Add reserved cooking liquid, lamb meat and orzo. Cook soup over medium heat until orzo is tender but still firm to bite, about 20 minutes. Add spinach to soup and cook until wilted, about 2 minutes. Season soup to taste with salt and pepper. (Soup can be prepared 1 day ahead. Cover and refrigerate. Bring soup to simmer before serving.) Ladle soup into bowls. Serve, passing grated Parmesan cheese separately."
        ],
        "picture_link": null
    }
}