{
    "recipe": {
        "title": "Spinach and Artichoke Melts ",
        "ingredients": [
            "1/2 tsp. kosher salt, plus more",
            "10 oz. baby spinach",
            "1 (14-oz.) can artichoke hearts",
            "1 large garlic clove, finely chopped",
            "2 oz. Parmesan, finely grated (about 1/2 cup)",
            "2 Tbsp. mayonnaise",
            "Juice of 1/2 lemon",
            "Dash or 2 of hot sauce",
            "Freshly ground black pepper",
            "2 oz. chilled cream cheese, cut into 1/2\" pieces",
            "4 1/2\"-thick slices country-style bread (such as sourdough)",
            "Extra-virgin olive oil (for drizzling)",
            "6 slices provolone cheese"
        ],
        "instructions": [
            "Heat broiler. Bring 1/2 cup water and a large pinch of salt to a simmer in a large skillet with straight sides over medium-high heat. Add spinach, a fistful at a time, letting it wilt slightly before adding more and using tongs or a heatproof rubber spatula to toss as you go. Continue to cook, tossing occasionally, until all of the spinach is wilted, about 2 minutes. Drain and let cool slightly, then squeeze out as much liquid as you can.",
            "Drain artichoke hearts and press out as much liquid as you can. Coarsely chop artichoke hearts and spinach and place in a large bowl. Add garlic, Parmesan, mayonnaise, lemon juice, hot sauce, and 1/2 tsp. salt and mix well; season with pepper. Gently mix in cream cheese, taking care not to fully break up pieces. Taste and season with more salt if needed.",
            "Arrange slices of bread on a foil-lined rimmed baking sheet and broil until lightly toasted, about 1 minute per side. Drizzle 1 side of each toast with oil and spoon spinach mixture on top, packing it on and taking care to cover edges so they don’t burn. Cut 2 slices of cheese in half. Place a slice and a half of cheese on top of each toast, arranging so that spinach mixture is covered.",
            "Broil toasts until cheese is melted and browned in spots, about 2 minutes (keep a watchful eye on toasts as no two broilers are the same and you don’t want the toasts to burn)."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5cb9debd3572782e652ccd3d/6:4/w_274%2Ch_169/spinach-and-artichoke-melts-recipe-BA-040519.jpg",
        "color": 10006796
    }
}