{
    "recipe": {
        "title": "Spring Greens with Orange-Fennel Vinaigrette ",
        "ingredients": [
            "1/4 cup fresh blood orange juice or fresh orange juice",
            "2 tablespoons minced shallots",
            "1 tablespoon fresh thyme leaves",
            "2 teaspoons (packed) grated orange peel",
            "1 teaspoon honey",
            "1/2 cup extra-virgin olive oil",
            "1/4 cup finely chopped fresh fennel bulb",
            "2 tablespoons chopped fennel fronds",
            "3 blood oranges or seedless oranges",
            "12 cups torn assorted salad greens (such as arugula, watercress, mâche, and endive) or 1 1/2 five-ounce bags mixed baby greens",
            "1 cup chopped green onions",
            "2/3 cup walnuts, toasted"
        ],
        "instructions": [
            "Whisk orange juice, shallots, thyme, orange peel, and honey in medium bowl to blend. Gradually whisk in oil, then fennel and fennel fronds. Season dressing to taste with salt and pepper. (Can be made 1 day ahead. Cover and chill. Rewhisk before using.) Cut peel and white pith from oranges. Working over bowl, cut between membranes to release orange segments from pith. Combine assorted greens, green onions, and toasted walnuts in large bowl. Drain orange segments and add to salad. Toss salad with enough dressing to coat evenly. Season to taste with salt and pepper and serve.",
            "Whisk orange juice, shallots, thyme, orange peel, and honey in medium bowl to blend. Gradually whisk in oil, then fennel and fennel fronds. Season dressing to taste with salt and pepper. (Can be made 1 day ahead. Cover and chill. Rewhisk before using.)",
            "Cut peel and white pith from oranges. Working over bowl, cut between membranes to release orange segments from pith.",
            "Combine assorted greens, green onions, and toasted walnuts in large bowl. Drain orange segments and add to salad. Toss salad with enough dressing to coat evenly. Season to taste with salt and pepper and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd7387b55306961bfa97b/6:4/w_274%2Ch_169/234417.jpg"
    }
}