{
    "recipe": {
        "title": "Spring Lamb in Herbs ",
        "ingredients": [
            "2 Tbsp. coriander seeds",
            "2 Tbsp. fennel seeds",
            "1 bunch cilantro",
            "1 bunch dill",
            "3 small bunches tarragon",
            "4 scallions or spring onions, thinly sliced",
            "2 small preserved lemons, skin and flesh chopped",
            "4 garlic cloves, coarsely chopped",
            "1/4 cup extra-virgin olive oil, plus more for serving",
            "2 tsp. kosher salt, plus more",
            "1 (6–7-lb.) bone-in leg of lamb",
            "4 lb. baby Yukon Gold potatoes",
            "2 lemons, cut into wedges",
            "Flaky sea salt"
        ],
        "instructions": [
            "Preheat oven to 325°F. Toast coriander and fennel seeds in a dry small skillet over medium-low heat, tossing occasionally, until very fragrant, about 2 minutes. Let cool.",
            "Coarsely chop cilantro leaves and tender stems (you’ll get about 2 cups) and transfer to a large bowl. Coarsely chop dill leaves and tender stems (you’ll get about 2 cups) and add to bowl with cilantro. Pick leaves from tarragon bunches (do not chop; you’ll get about 1 cup) and add to bowl; discard stems. Add scallions and toss to combine. Transfer 2 cups herb mixture to a small bowl, cover with a damp kitchen towel, and chill until ready to use. Transfer remaining herb mixture to a food processor. Add coriander and fennel seeds, preserved lemons, garlic, 1/4 cup oil, and 2 tsp. kosher salt. Purée until a paste forms.",
            "Roll out a piece of foil that’s more than double the length of a rimmed baking sheet. Center foil on baking sheet, then place lamb on foil. Rub lamb all over with herb paste. Bring up foil around lamb and wrap tightly to seal. Roast until lamb is super tender and is falling off the bone, 4–4 1/2 hours. (It’s important that you don’t open the foil packet once sealed. To check the meat, slide a skewer or small knife through the top of the foil; the meat should yield and shred easily.)",
            "Meanwhile, place potatoes in a large pot. Pour in water to cover; season with salt. Cover pot and bring water to a boil. Cook until potatoes are tender, about 30 minutes. Drain, then transfer to a medium bowl.",
            "Unwrap lamb (juices will run everywhere, so be careful to make sure they stay on the baking sheet) and let cool 20 minutes. Transfer lamb to a cutting board. Pull meat off bone and shred into pieces. Return meat to baking sheet and toss in herby juices.",
            "Transfer lamb to a platter. Pour juices over lamb and potatoes. Top lamb with reserved herb mixture. Drizzle lamb and potatoes with oil and lemon juice, then sprinkle with sea salt."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aa93031c9663d77f1fc8ad9/6:4/w_274%2Ch_169/Spring-Lamb-in-Herbs-recipe-03012018.jpg",
        "color": 9947513
    }
}