{
    "recipe": {
        "title": "Spring Chicken Soup with Matzo Balls ",
        "ingredients": [
            "3 medium leeks (about 1 1/2 pounds), top 2 inches of dark green parts discarded, then halved lengthwise and cut crosswise into thirds",
            "5 large carrots (about 1 pound), cut into thirds",
            "2 celery ribs, cut into thirds",
            "1 (4- to 4-1/2 pound) chicken (giblets and liver removed)",
            "1 small head garlic, halved crosswise",
            "1/3 cup sliced fresh ginger (unpeeled but skin scrubbed); from one 1/2-ounce piece",
            "15 long fresh flat leaf parsley stems",
            "15 long fresh dill stems",
            "12 black peppercorns",
            "1 tablespoon kosher salt",
            "4 quarts cold water",
            "1 cup matzo meal, plus 1 tablespoon",
            "1/3 cup finely chopped flat leaf parsley",
            "3 tablespoons finely chopped fresh dill",
            "3 tablespoons rendered chicken fat",
            "1/2 cup chicken broth (reserved from recipe below)",
            "4 large eggs, separated",
            "Dill sprigs for garnish"
        ],
        "instructions": [
            "Wash leeks in a bowl of cold water, agitating them to remove all sand and grit, then lift out and transfer to an 8-quart stockpot.",
            "Add all remaining broth ingredients to pot and bring to a boil over medium heat.",
            "Reduce heat and simmer, uncovered, skimming foam occasionally, 3 hours.",
            "Make matzo balls: Stir together matzo meal, parsley, dill, 1/2 teaspoon kosher salt, and 1/4 teaspoon black pepper in a bowl. Work rendered chicken fat into mixture with your fingers until incorporated, then stir in 1/2 cup broth from chicken and yolks. Mixture will be stiff. Beat egg whites with a pinch of salt in another bowl until they just form soft peaks. Stir one-third of egg whites into matzo mixture to lighten, and then fold in remaining whites gently but thoroughly. Chill, covered, 30 minutes. If after being chilled, the matzo mixture is still not firm, add 1 tablespoon additional matzo meal.",
            "Stir together matzo meal, parsley, dill, 1/2 teaspoon kosher salt, and 1/4 teaspoon black pepper in a bowl.",
            "Work rendered chicken fat into mixture with your fingers until incorporated, then stir in 1/2 cup broth from chicken and yolks. Mixture will be stiff.",
            "Beat egg whites with a pinch of salt in another bowl until they just form soft peaks.",
            "Stir one-third of egg whites into matzo mixture to lighten, and then fold in remaining whites gently but thoroughly. Chill, covered, 30 minutes. If after being chilled, the matzo mixture is still not firm, add 1 tablespoon additional matzo meal.",
            "Finish soup: Transfer chicken from broth to a cutting board to cool. When cool enough to handle, tear chicken into shreds, discarding skin and bones. Remove carrots from broth and once cool, cut into 1/2-inch pieces. Line a large sieve with a double layer of dampened paper towels. Pour broth through sieve into a 5-to 6-quart pot, pressing hard on and discarding solids. Return broth to a simmer. With dampened hands, gently form chilled matzo mixture into roughly 1-inch balls, gently dropping them into simmering soup as formed (this should yield about 20 matzo balls; moisten hands as necessary to prevent sticking). Simmer matzo balls, covered, until just cooked through, about 45 minutes (To test: Halve one matzo ball. It should have a uniformly moist interior; if uncooked, it will be dry in the center). Stir carrots and chicken into hot soup to warm through before serving. Garnish with dill sprigs.",
            "Transfer chicken from broth to a cutting board to cool. When cool enough to handle, tear chicken into shreds, discarding skin and bones.",
            "Remove carrots from broth and once cool, cut into 1/2-inch pieces.",
            "Line a large sieve with a double layer of dampened paper towels. Pour broth through sieve into a 5-to 6-quart pot, pressing hard on and discarding solids. Return broth to a simmer.",
            "With dampened hands, gently form chilled matzo mixture into roughly 1-inch balls, gently dropping them into simmering soup as formed (this should yield about 20 matzo balls; moisten hands as necessary to prevent sticking).",
            "Simmer matzo balls, covered, until just cooked through, about 45 minutes (To test: Halve one matzo ball. It should have a uniformly moist interior; if uncooked, it will be dry in the center).",
            "Stir carrots and chicken into hot soup to warm through before serving.",
            "Garnish with dill sprigs."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b1954ba801766f773f3fc5/6:4/w_274%2Ch_169/395009_chicken-soup-matzoh-balls_1x1.jpg"
    }
}