{
    "recipe": {
        "title": "Steak Stroganoff ",
        "ingredients": [
            "1 lb. boneless New York strip steak, patted dry",
            "3 Tbsp. extra-virgin olive oil, divided",
            "2 tsp. kosher salt, divided, plus more",
            "1 tsp. freshly ground black pepper, divided, plus more",
            "1 lb. wild mushrooms, such as oyster or maitake, torn into pieces",
            "4 garlic cloves, crushed",
            "12 oz. wide egg noodles",
            "4 Tbsp. unsalted butter",
            "2 tsp. finely grated lemon zest",
            "2 Tbsp fresh. lemon juice",
            "3 Tbsp. brandy",
            "1/2 cup heavy cream",
            "1 Tbsp. Worcestershire sauce",
            "1 tsp. Dijon mustard",
            "1/2 cup sour cream",
            "1/2 cup torn dill"
        ],
        "instructions": [
            "Heat a dry 10\" skillet, preferably cast iron, over medium-high. Rub steak with 1 Tbsp. oil, then season all over with 1 tsp. salt and 1/2 tsp. pepper. Cook, turning every 2 minutes and making sure to get color on the fat cap, until browned on all sides and medium-rare (an instant-read thermometer inserted into the center should register 120°F), 10–15 minutes. Transfer steak to a plate. Pour off oil from skillet, leaving crispy bits behind.",
            "Heat remaining 2 Tbsp. oil in same skillet over medium-high. Add mushrooms and cook, stirring occasionally, until golden brown and beginning to crisp, 6–8 minutes. Add garlic, season with 1 tsp. salt and 1/2 tsp. pepper, and continue to cook until mushrooms are well browned and garlic is fragrant, 3–4 minutes.",
            "Meanwhile, cook noodles in a large pot of boiling salted water, stirring occasionally, until al dente. Drain and return to pot. Add butter, lemon zest, and lemon juice; season to taste with salt and pepper.",
            "Stir brandy and 1/2 cup water in a small bowl. Add to mushroom mixture and cook, stirring occasionally, until reduced by half, about 2 minutes. Remove from heat, then add cream, Worcestershire, and mustard and stir to combine. The heat of the pan will reduce and thicken the sauce slightly—if it doesn’t, cook over medium-low heat for about 1 minute. Stir in sour cream until combined and warmed through.",
            "Slice steak against the grain into 1/2\"-thick slices. Divide noodles among plates. Top with steak, creamed mushrooms, and dill, then season with a few cranks of pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c61ff8a4f003745865190d6/6:4/w_274%2Ch_169/Weeknight-Beef-Stroganoff-recipe-07022019.jpg"
    }
}