{
    "recipe": {
        "title": "Steak and Fries with Pickled Onions ",
        "ingredients": [
            "1 cup white vinegar",
            "1/2 cup sugar",
            "1/2 red onion, thinly sliced",
            "2 rib eye steaks, 1 to 1 1/2 inches thick",
            "1 1/2 to 2 cups crumbled blue cheese",
            "4 tablespoons (1/2 stick) unsalted butter, plus more for slathering",
            "16 to 20 cremini mushrooms, stems removed and caps left whole",
            "1/2 cup seasoned rice vinegar",
            "1/4 cup soy sauce",
            "1 tablespoon truffle oil",
            "1 teaspoon grated fresh ginger",
            "3 or 4 scallions, sliced, white and light green parts only",
            "1 teaspoon garlic powder",
            "Kosher salt and freshly ground black pepper",
            "3 cloves garlic, smashed 2 sprigs fresh thyme",
            "1 sprig fresh rosemary",
            "Triple-Cooked Fries, for serving"
        ],
        "instructions": [
            "In a small saucepan, bring the vinegar and sugar to a boil over medium-high heat. Put the red onion slices in a small glass bowl and pour the hot liquid over them. Set aside to steep and cool for at least 1 hour.",
            "For the steak and fries: Put the steaks in a resealable plastic bag and pack the blue cheese around them. Push as much air as you can from the bag and zip it closed. Refrigerate the steaks for 12 hours or overnight. In a large skillet set over medium-high heat, melt 1 tablespoon of the butter and, when bubbling hot, sear the mushrooms until golden brown, 4 to 5 minutes. In a glass mixing bowl, stir together the vinegar, soy sauce, truffle oil, and ginger. Add the scallions and browned mushrooms. Stir to mix and coat the mushrooms with the marinade. Set aside at room temperature while you prepare the steaks. Remove the steaks from the bag and scrape off the blue cheese. Pat them dry with paper towels. Season both sides of the steaks with the garlic powder and salt and pepper and set them aside to come to room temperature. Preheat the oven to 400°F. Heat a large, heavy, oven-safe skillet—I like an old cast-iron pan with character—over medium-high heat and, when hot, melt the remaining 3 tablespoons butter. When the butter melts, add the smashed garlic, thyme, and rosemary. Stir these around a little, and then put the steaks in the pan. Cook the steaks for 3 minutes, and then turn over and cook for about 3 minutes on the other side, basting them with the melted butter as if you are in a race. Transfer the skillet to the oven and cook for a few minutes longer, or until an instant-read thermometer inserted in a thick part of a steak registers 130° to 135°F. I insist on medium-pink meat with a touch of gray on the inside, and then nicely caramelized but not crunchy on the outside. Let the meat rest for about 10 minutes. Slather more butter on the meat as it rests. Serve the steaks with the veggies and pickled red onions.",
            "Put the steaks in a resealable plastic bag and pack the blue cheese around them. Push as much air as you can from the bag and zip it closed. Refrigerate the steaks for 12 hours or overnight.",
            "In a large skillet set over medium-high heat, melt 1 tablespoon of the butter and, when bubbling hot, sear the mushrooms until golden brown, 4 to 5 minutes. In a glass mixing bowl, stir together the vinegar, soy sauce, truffle oil, and ginger. Add the scallions and browned mushrooms. Stir to mix and coat the mushrooms with the marinade. Set aside at room temperature while you prepare the steaks.",
            "Remove the steaks from the bag and scrape off the blue cheese. Pat them dry with paper towels. Season both sides of the steaks with the garlic powder and salt and pepper and set them aside to come to room temperature.",
            "Preheat the oven to 400°F.",
            "Heat a large, heavy, oven-safe skillet—I like an old cast-iron pan with character—over medium-high heat and, when hot, melt the remaining 3 tablespoons butter. When the butter melts, add the smashed garlic, thyme, and rosemary. Stir these around a little, and then put the steaks in the pan. Cook the steaks for 3 minutes, and then turn over and cook for about 3 minutes on the other side, basting them with the melted butter as if you are in a race.",
            "Transfer the skillet to the oven and cook for a few minutes longer, or until an instant-read thermometer inserted in a thick part of a steak registers 130° to 135°F. I insist on medium-pink meat with a touch of gray on the inside, and then nicely caramelized but not crunchy on the outside.",
            "Let the meat rest for about 10 minutes. Slather more butter on the meat as it rests.",
            "Serve the steaks with the veggies and pickled red onions.",
            "Do Ahead The pickled onions and their brine will keep in a lidded container in the refrigerator for at least 2 weeks. (I prefer glass containers for pickles.)",
            "The pickled onions and their brine will keep in a lidded container in the refrigerator for at least 2 weeks. (I prefer glass containers for pickles.)"
        ],
        "picture_link": "https://assets.epicurious.com/photos/591a0a8218603d3835001934/6:4/w_274%2Ch_169/steak-fries-with-pickled-red-onions-051517.jpg",
        "color": 10178448
    }
}