{
    "recipe": {
        "title": "Steak and Eggs with Saucy Beans ",
        "ingredients": [
            "2 tsp. hot smoked Spanish paprika",
            "2 tsp. Aleppo-style pepper",
            "2 1/2 tsp. kosher salt, plus more",
            "1 tsp. freshly ground black pepper, plus more",
            "2 (1 1/4\"-thick) boneless New York strip steaks (about 14 oz. each), patted dry",
            "7 Tbsp. extra-virgin olive oil, divided",
            "2 medium shallots, finely chopped",
            "4 garlic cloves, thinly sliced",
            "1 small bunch cilantro, stems finely chopped, leaves coarsely chopped",
            "1 (15.5-oz.) can pinto beans, drained",
            "2 Tbsp. unsalted butter",
            "3 limes, halved",
            "4 large eggs"
        ],
        "instructions": [
            "Mix paprika, Aleppo-style pepper, 2 1/2 tsp. salt, and 1 tsp. black pepper in a bowl. Rub all over steaks, pressing to adhere. Let sit while you make the beans.",
            "Heat 2 Tbsp. oil in a medium saucepan over medium-low. Cook shallots, garlic, and cilantro stems, stirring often, until softened but not yet browned, about 3 minutes. Add beans, butter, and ¾ cup water. Bring to a simmer and cook, stirring occasionally, until beans are saucy, 6–9 minutes. Remove from heat and stir in cilantro leaves. Finely grate some lime zest from one of the lime halves into beans, then squeeze in its juice. Season with salt and pepper. Cover to keep warm.",
            "Heat a dry 12\" skillet, preferably cast iron, over medium-high. Rub steaks with 3 Tbsp. oil and cook, undisturbed, 3 minutes. Turn and cook on other side 3 minutes, then turn again. Add all remaining lime halves, arranging cut side down. Cook until steaks are medium-rare (a thermometer inserted into thickest part should register 120°F) and limes are nicely charred, 2–3 minutes. Transfer steaks and limes to a cutting board. Wipe out skillet.",
            "Heat remaining 2 Tbsp. oil in skillet over medium-high. Cook eggs sunny side up until whites are golden brown and crisp around edges and yolks are runny, about 2 minutes.",
            "Slice steaks against the grain. Divide beans and steaks among plates and top each with an egg. Serve with charred limes for squeezing over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c11461638482752692662ef/6:4/w_274%2Ch_169/steak-and-eggs-with-saucy-beans-recipe-BA-121218.jpg",
        "color": 2150390
    }
}