{
    "recipe": {
        "title": "Steak Salad with Horseradish Dressing ",
        "ingredients": [
            "1/2 cup sour cream",
            "3 tablespoons prepared horseradish",
            "1 tablespoon chopped fresh chives",
            "1 teaspoon honey",
            "1 teaspoon red wine vinegar",
            "Kosher salt, freshly ground pepper",
            "2 tablespoons olive oil, divided",
            "1 1-pound rib-eye, flank, or skirt steak",
            "Kosher salt, freshly ground pepper",
            "12 ounces fingerling potatoes, thinly sliced",
            "1/2 English hothouse cucumber, thinly sliced",
            "6 radishes, cut into thin wedges",
            "2 cups greens (such as arugula or torn Bibb lettuce leaves)",
            "Pickled Red Onions"
        ],
        "instructions": [
            "Whisk sour cream, horseradish, chives, honey, and vinegar in a small bowl; season with salt and pepper.",
            "For steak salad: Heat 1 tablespoon oil in a large skillet, preferably cast-iron, over medium-high heat. Season steak with salt and pepper. Cook over medium-high heat until cooked to desired doneness, 5-8 minutes per side for medium-rare rib eye, about 4 minutes per side for flank steak, or 3 minutes per side for skirt steak. Transfer meat to a plate and let rest for 10 minutes. While steak rests, wipe out skillet and heat remaining 1 tablespoon oil over medium-high heat. Add potatoes, season with salt, and cook, tossing occasionally, until tender, 8-10 minutes. Slice steak and serve with horseradish dressing, potatoes, cucumber, radishes, greens, and Pickled Red Onions.",
            "Heat 1 tablespoon oil in a large skillet, preferably cast-iron, over medium-high heat. Season steak with salt and pepper. Cook over medium-high heat until cooked to desired doneness, 5-8 minutes per side for medium-rare rib eye, about 4 minutes per side for flank steak, or 3 minutes per side for skirt steak. Transfer meat to a plate and let rest for 10 minutes.",
            "While steak rests, wipe out skillet and heat remaining 1 tablespoon oil over medium-high heat. Add potatoes, season with salt, and cook, tossing occasionally, until tender, 8-10 minutes.",
            "Slice steak and serve with horseradish dressing, potatoes, cucumber, radishes, greens, and Pickled Red Onions."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b02e1b766062b203448394/6:4/w_274%2Ch_169/51149200_steak-salad_1x1.jpg",
        "color": 3119936
    }
}