{
    "recipe": {
        "title": "Steak Taquitos ",
        "ingredients": [
            "2 1/2 cups chopped tomatoes",
            "2 cups chopped onions",
            "3/4 cup chopped fresh cilantro",
            "6 tablespoons fresh lime juice",
            "1 1/2 tablespoons chopped serrano chilies or jalapeño chilies",
            "3 cups crumbled queso fresco or mild feta cheese (about 18 ounces). Queso fresco, also known as queso blanco, is available at Latin American markets and in some supermarkets.",
            "24 4-inch corn tortillas",
            "2 pounds skirt steaks, trimmed"
        ],
        "instructions": [
            "Combine first 5 ingredients in medium bowl. Season salsa with salt and pepper. (Can be made 4 hours ahead. Cover; chill.) Preheat oven to 350°F. Place queso fresco in bowl. Wrap tortillas in foil, enclosing completely. Place in oven until heated through, about 15 minutes. Meanwhile, prepare barbecue (medium-high heat) or preheat broiler. Season steaks generously with salt and pepper. Grill or broil steaks to desired doneness, about 5 minutes per side for medium-rare. Thinly slice steaks across grain. Place in serving bowl. Arrange bowls of salsa, queso fresco, corn tortillas and steak on table. Allow guests to assemble their own taquitos.",
            "Combine first 5 ingredients in medium bowl. Season salsa with salt and pepper. (Can be made 4 hours ahead. Cover; chill.)",
            "Preheat oven to 350°F. Place queso fresco in bowl. Wrap tortillas in foil, enclosing completely. Place in oven until heated through, about 15 minutes.",
            "Meanwhile, prepare barbecue (medium-high heat) or preheat broiler. Season steaks generously with salt and pepper. Grill or broil steaks to desired doneness, about 5 minutes per side for medium-rare. Thinly slice steaks across grain. Place in serving bowl.",
            "Arrange bowls of salsa, queso fresco, corn tortillas and steak on table. Allow guests to assemble their own taquitos."
        ],
        "picture_link": null
    }
}