{
    "recipe": {
        "title": "Steak Salad with Caraway Vinaigrette and Rye Croutons ",
        "ingredients": [
            "2 slices seeded rye bread, torn into 1/4\" pieces",
            "3 tablespoons plus 1/4 cup olive oil, divided",
            "1 1/2 pounds hanger steak, center membrane removed, cut into 4 pieces",
            "Kosher salt, freshly ground pepper",
            "1 teaspoon caraway seeds",
            "2 tablespoons Sherry vinegar",
            "1 tablespoon whole grain mustard",
            "1/2 teaspoon honey",
            "4 small carrots, peeled, shaved lengthwise with a vegetable peeler",
            "4 cups mustard greens, ribs removed, leaves torn into bite-size pieces",
            "1 cup fresh flat-leaf parsley leaves with tender stems"
        ],
        "instructions": [
            "Preheat oven to 400°. Toss bread with 2 tablespoons oil on a rimmed baking sheet and toast, tossing halfway through, until golden brown, 8–10 minutes; set aside. Meanwhile, heat 1 tablespoon oil in a large skillet over medium-high heat. Season steak with salt and pepper and cook, turning occasionally, 8–10 minutes for mediumrare. Transfer to a cutting board; let rest 5 minutes before slicing. Toast caraway seeds in a small dry skillet over medium heat, tossing, until fragrant, about 2 minutes. Let cool. Whisk caraway, vinegar, mustard, honey, and remaining 1/4 cup oil in a large bowl; season with salt and pepper. Add carrots, mustard greens, parsley, and steak and toss. Serve salad topped with reserved croutons. DO AHEAD: Vinaigrette can be made 2 days ahead; cover and chill. Croutons can be made 1 day ahead. Store airtight at room temperature.",
            "Preheat oven to 400°. Toss bread with 2 tablespoons oil on a rimmed baking sheet and toast, tossing halfway through, until golden brown, 8–10 minutes; set aside.",
            "Meanwhile, heat 1 tablespoon oil in a large skillet over medium-high heat. Season steak with salt and pepper and cook, turning occasionally, 8–10 minutes for mediumrare. Transfer to a cutting board; let rest 5 minutes before slicing.",
            "Toast caraway seeds in a small dry skillet over medium heat, tossing, until fragrant, about 2 minutes. Let cool.",
            "Whisk caraway, vinegar, mustard, honey, and remaining 1/4 cup oil in a large bowl; season with salt and pepper. Add carrots, mustard greens, parsley, and steak and toss. Serve salad topped with reserved croutons.",
            "DO AHEAD: Vinaigrette can be made 2 days ahead; cover and chill. Croutons can be made 1 day ahead. Store airtight at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac87156529d92b2c03b85c/6:4/w_274%2Ch_169/51234240_steak-salad_1x1.jpg"
    }
}