{
    "recipe": {
        "title": "Sticky Sesame Bars with Raw Chocolate Drizzle ",
        "ingredients": [
            "2 cups raw nuts (e.g., cashews, peanuts, pistachios, pecans)",
            "1 cup raw sesame seeds",
            "1/2 cup chia seeds or poppy seeds",
            "1/2 cup raw agave nectar or raw honey",
            "1/3 cup natural, unsweetened raw nut or seed butter (e.g., tahini, sunflower, or peanut)",
            "2 tablespoons virgin coconut oil, warmed until melted",
            "1 teaspoons vanilla extract (omit, if strictly raw)",
            "1/4 teaspoon fine sea salt",
            "2 tablespoons virgin coconut oil, warmed until melted",
            "2 tablespoons raw agave nectar or raw honey",
            "2 tablespoons raw, unsweetened, natural cocoa powder (not Dutch process)"
        ],
        "instructions": [
            "1. Line an 8-inch square baking pan with foil or parchment paper and grease the pan with coconut oil or vegetable oil. 2. Place the nuts, sesame seeds, and chia seeds in a food processor and process until finely chopped. Add the agave nectar, nut or seed butter, oil, vanilla, and salt. Process, using on/off pulses, until the mixture is blended and begins to stick together and clump on the sides of the bowl. 3. Transfer the mixture to the prepared pan. Place a large piece of parchment paper, wax paper, or plastic wrap (lightly greased with coconut or vegetable oil) atop the bar mixture and use it to spread and flatten the mixture evenly in the pan; leave the paper or plastic wrap to cover. Place the mixture in the freezer for 30 minutes. 4. To prepare the chocolate drizzle: Mix the oil, agave nectar, and cocoa powder in a small bowl until blended. Remove the bar mixture from the freezer, uncover, and decoratively drizzle or spread with the chocolate mixture. Refrigerate for at least 4 hours or place in the freezer for 1 hour until the mixture is firm. 5. Using the liner, lift the mixture from the pan and transfer to a cutting board. Cut into 20 bars. Store in the refrigerator or freezer.",
            "1. Line an 8-inch square baking pan with foil or parchment paper and grease the pan with coconut oil or vegetable oil.",
            "2. Place the nuts, sesame seeds, and chia seeds in a food processor and process until finely chopped. Add the agave nectar, nut or seed butter, oil, vanilla, and salt. Process, using on/off pulses, until the mixture is blended and begins to stick together and clump on the sides of the bowl.",
            "3. Transfer the mixture to the prepared pan. Place a large piece of parchment paper, wax paper, or plastic wrap (lightly greased with coconut or vegetable oil) atop the bar mixture and use it to spread and flatten the mixture evenly in the pan; leave the paper or plastic wrap to cover. Place the mixture in the freezer for 30 minutes.",
            "4. To prepare the chocolate drizzle: Mix the oil, agave nectar, and cocoa powder in a small bowl until blended. Remove the bar mixture from the freezer, uncover, and decoratively drizzle or spread with the chocolate mixture. Refrigerate for at least 4 hours or place in the freezer for 1 hour until the mixture is firm.",
            "5. Using the liner, lift the mixture from the pan and transfer to a cutting board. Cut into 20 bars. Store in the refrigerator or freezer."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad50d56529d92b2c044305/6:4/w_274%2Ch_169/51200410_sticky-sesame-bars_1x1.jpg"
    }
}