{
    "recipe": {
        "title": "Sticky-Sweet Grilled Pork Shoulder with Hoisin and Molasses ",
        "ingredients": [
            "2 heads of garlic, cloves separated, peeled",
            "1 (wide, 6\") piece ginger, peeled, chopped",
            "1 cup hoisin sauce",
            "3/4 cup fish sauce",
            "2/3 cup honey",
            "2/3 cup Shaoxing (Chinese rice) wine",
            "1/2 cup chili oil",
            "1/3 cup oyster sauce",
            "1/3 cup toasted sesame oil",
            "1 (4–5-lb.) skinless boneless pork shoulder (Boston butt)",
            "Kosher salt",
            "3/4 cup (packed) dark brown sugar",
            "1 Tbsp. mild-flavored (light)molasses",
            "Bread-and-butter pickles, white bread, cilantro, and rinsed thinly sliced white onion (for serving)"
        ],
        "instructions": [
            "Purée garlic, ginger, hoisin sauce, fish sauce, honey, wine, chili oil, oyster sauce, and sesame oil in a blender until very smooth. Place 1 1/2 cups in a small bowl for glaze; cover and chill until ready to use. Pour remaining marinade into a 2-gal. resealable plastic bag.",
            "Place pork shoulder, fat side down, on a cutting board with a short end facing you. Holding a long sharp knife about 1\"–1 1/2\" above cutting board, make a shallow cut along the entire length of a long side of shoulder. Continue cutting deeper into meat, lifting and unfurling with your free hand, until it lies flat (it’s better to end up with 2–3 even pieces than 1 uneven piece). Add to bag with marinade and seal, pressing out air. Work pork around inside bag to coat with marinade. Chill at least 8 hours and up to 1 day.",
            "Prepare a Big Green Egg for medium heat (with cover closed, thermometer should register 350°F). Remove pork from marinade, letting excess drip off. Lightly season all over with salt. Fit grill with convection plate and set pork on top. (If you don’t have a convection plate, bank coals on one side and set pork over cooler area to avoid flare-ups.) Cover and roast pork until an instant-read thermometer inserted into the thickest part registers 140°F–145°F. (You can also do initial cooking in a 350°F oven.) Transfer to a cutting board and let rest at least 20 minutes.",
            "Glaze and assembly: Bring brown sugar, molasses, and reserved marinade to a simmer in a large saucepan; cook until reduced by one-third, 6–8 minutes (you should have about 1 1/3 cups). Keep warm. Prepare a Big Green Egg for medium-high heat (or use a conventional grill). Grill pork, basting and turning with 2 pairs of tongs every minute or so, until thickly coated with glaze, lightly charred in spots, and warmed through (an instant-read thermometer inserted into the thickest part should register 130°F–145°F; be careful not to overcook), 6–8 minutes. Transfer to a cutting board; slice against the grain ¼\" thick. Serve with pickles, bread, cilantro, and onion.",
            "Bring brown sugar, molasses, and reserved marinade to a simmer in a large saucepan; cook until reduced by one-third, 6–8 minutes (you should have about 1 1/3 cups). Keep warm.",
            "Prepare a Big Green Egg for medium-high heat (or use a conventional grill). Grill pork, basting and turning with 2 pairs of tongs every minute or so, until thickly coated with glaze, lightly charred in spots, and warmed through (an instant-read thermometer inserted into the thickest part should register 130°F–145°F; be careful not to overcook), 6–8 minutes. Transfer to a cutting board; slice against the grain ¼\" thick. Serve with pickles, bread, cilantro, and onion.",
            "Do Ahead Pork can be roasted 2 days ahead. Let cool; cover and chill.",
            "Pork can be roasted 2 days ahead. Let cool; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b16fb0e2d4d6e0d3df1aa81/6:4/w_274%2Ch_169/hoisin-marinated-pork-shoulder-with-molasses-glaze-BA-060518.jpg"
    }
}