{
    "recipe": {
        "title": "Sticky Spare Ribs Casserole ",
        "ingredients": [
            "2 tablespoons Dijon mustard",
            "2 tablespoons blackstrap molasses",
            "1 1/2 tablespoons Chinese five-spice powder",
            "1 teaspoon smoked salt or sea salt",
            "2 1/2–3 pounds pork spare ribs rack",
            "1 small head of red cabbage (about 2 pounds), shredded",
            "2 unpeeled Fuji apples, cut into 1/2-inch cubes",
            "6–8 green onions, diced",
            "1/4 cup dried unsweetened cherries (optional)",
            "1/4 cup apple cider vinegar",
            "1/4 cup ghee or lard, melted",
            "1/2 tablespoon sea salt",
            "6-quart Dutch oven or a large casserole with lid"
        ],
        "instructions": [
            "Preheat the oven to 400°F. In a medium bowl, make the marinade by whisking together the mustard, molasses, five-spice powder, and salt. Pat the ribs dry, remove the membrane, and cut the rack in half. Place the ribs in a baking pan and rub with the marinade on both sides. In the Dutch oven, toss the cabbage, apples, green onions, cherries, cider vinegar, ghee, and salt. Place the ribs on top of the vegetables, meaty side up, cover, and cook for 1 hour. Carefully remove the lid so the steam does not burn you, and switch the oven to broil; broil the ribs for another 10 minutes or until they are brown. Remove from the oven and let the ribs rest for 10 minutes before serving. Keeps well in the refrigerator for up to 5 days or in the freezer for up to 3 months.",
            "Preheat the oven to 400°F.",
            "In a medium bowl, make the marinade by whisking together the mustard, molasses, five-spice powder, and salt.",
            "Pat the ribs dry, remove the membrane, and cut the rack in half. Place the ribs in a baking pan and rub with the marinade on both sides.",
            "In the Dutch oven, toss the cabbage, apples, green onions, cherries, cider vinegar, ghee, and salt.",
            "Place the ribs on top of the vegetables, meaty side up, cover, and cook for 1 hour.",
            "Carefully remove the lid so the steam does not burn you, and switch the oven to broil; broil the ribs for another 10 minutes or until they are brown. Remove from the oven and let the ribs rest for 10 minutes before serving.",
            "Keeps well in the refrigerator for up to 5 days or in the freezer for up to 3 months."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a9ecb6b1abf176cbb566277/6:4/w_274%2Ch_169/sticky-spare-ribs-casserole-recipe-HC-030618.jpg"
    }
}