{
    "recipe": {
        "title": "Stilton Tart with Cranberry Chutney ",
        "ingredients": [
            "Pastry dough",
            "1 cup heavy cream",
            "1 whole large egg",
            "2 large egg yolks",
            "1/4 teaspoon salt",
            "1/4 teaspoon black pepper",
            "5 oz chilled Stilton, rind removed and cheese crumbled (1 1/2 cups)",
            "Accompaniment: cranberry chutney",
            "Special equipment: a 13 1/2- by 4- by 1-inch rectangular fluted tart pan with a removable bottom",
            "pie weights or raw rice"
        ],
        "instructions": [
            "Preheat oven to 350°F.",
            "Roll out dough on a lightly floured surface with a floured rolling pin into a 17- by 8-inch rectangle and fit into tart pan. Trim excess dough, leaving a 1/2-inch overhang, then fold overhang inward and press against side of pan to reinforce edge. Lightly prick bottom and sides all over with a fork. Chill until firm, about 30 minutes.",
            "Line pastry shell with foil and fill with pie weights. Bake in middle of oven 20 minutes, then carefully remove foil and weights and bake until golden, 10 to 15 minutes more. Cool shell in pan 20 minutes.",
            "Reduce oven temperature to 325°F.",
            "Make filling: Whisk together cream, whole egg, yolks, salt, and pepper until combined. Put tart shell (still in pan) on a baking sheet and scatter cheese evenly in shell. Slowly pour custard into shell and bake in middle of oven until golden around edge and custard is just set, 30 to 35 minutes. Cool tart completely in pan on a rack. Cut tart into 32 rectangles and serve at room temperature, topped with chutney.",
            "Whisk together cream, whole egg, yolks, salt, and pepper until combined.",
            "Put tart shell (still in pan) on a baking sheet and scatter cheese evenly in shell. Slowly pour custard into shell and bake in middle of oven until golden around edge and custard is just set, 30 to 35 minutes. Cool tart completely in pan on a rack.",
            "Cut tart into 32 rectangles and serve at room temperature, topped with chutney."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea8a27b55306961bff80c/6:4/w_274%2Ch_169/105906.jpg",
        "color": 8882947
    }
}