{
    "recipe": {
        "title": "Stir-Fried Buckwheat ",
        "ingredients": [
            "1 cup buckwheat groats",
            "1 large egg, lightly beaten",
            "2 cups reduced-sodium vegetable broth",
            "2 tablespoons soy sauce (regular or reduced-sodium)",
            "2 tablespoons unseasoned rice vinegar",
            "1 teaspoon Asian chile paste or sambal",
            "1 teaspoon sugar",
            "2 tablespoons toasted sesame oil",
            "6 scallions, thinly sliced",
            "2 garlic cloves, minced",
            "1 tablespoon minced fresh ginger",
            "2 large carrots, shredded through the large holes of a box grater",
            "1 red bell pepper, seeded and chopped",
            "1/2 pound green beans, cut into 1/2-inch pieces"
        ],
        "instructions": [
            "1. Pour the buckwheat groats into a large bowl and mix in the egg until they are well coated, all the grains separated from one another.",
            "2. Heat a large, dry saucepan over medium heat. Pour in the coated groats and stir over the heat for 2 minutes to set the egg. The groats should still be separate from each other.",
            "3. Pour in the broth and increase the heat to high. Bring to a boil. Cover, reduce the heat to low, and simmer until the liquid has been absorbed and the groats are tender, about 15 minutes.",
            "4. Spread the buckwheat on a large rimmed baking sheet and cool for 10 minutes to make sure the grains stay separate, rather than glomming onto each other.",
            "5. Meanwhile, whisk the soy sauce, vinegar, chile paste, and sugar in a small bowl.",
            "6. Heat a large wok over medium-high heat. Swirl in the oil, then add the scallions, garlic, and ginger. Stir-fry for 30 seconds.",
            "7. Add the carrots, bell pepper, and green beans. Stir-fry until crisp-tender, about 2 minutes. Add all the buckwheat. Continue stir-frying for 1 minute. Pour in the soy sauce mixture and bring to a simmer, tossing and stirring for 1 more minute."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5603472d08929a1609a16b30/6:4/w_274%2Ch_169/51195240_hires.jpg"
    }
}