{
    "recipe": {
        "title": "Stir-Fried Pork with Long Beans ",
        "ingredients": [
            "1 stalk fresh lemongrass, root end trimmed and 1 or 2 outer layers discarded",
            "3 (2- to 3-inch) dried hot Thai chiles, including seeds",
            "3 tablespoons minced shallot",
            "2 tablespoons minced garlic",
            "2 tablespoons shrimp powder or 1 1/2 tablespoons dried peeled shrimp (see cooks' note, below)",
            "1 teaspoon minced cilantro root or stem",
            "1 teaspoon minced Kaffir lime zest or regular lime zest",
            "1 teaspoon minced peeled galangal (fresh or thawed frozen)",
            "1 teaspoon kosher salt",
            "5 black peppercorns",
            "1 teaspoon Thai shrimp paste",
            "1/2 pound long beans or green beans, cut into 1-inch pieces",
            "3/4 pound boneless pork shoulder",
            "3 tablespoons peanut or vegetable oil",
            "1 tablespoon Asian fish sauce",
            "1 tablespoon packed grated palm sugar or light brown sugar",
            "3 medium Kaffir lime leaves (fresh or thawed frozen; 2 sections each), ribs discarded and leaves minced",
            "Equipment: a smooth stone mortar and pestle",
            "Accompaniment: white rice"
        ],
        "instructions": [
            "Mince 1 tablespoon lemongrass from root end. Put minced lemongrass and remaining paste ingredients in mortar and vigorously pound to a smooth paste using pestle (most chile seeds should be crushed), 6 to 8 minutes.",
            "Cook beans and pork: Cook beans in a medium saucepan of boiling salted water (1 teaspoon salt for 2 quarts water), uncovered, until crisp-tender, about 3 minutes. Drain and transfer to a bowl of cold water to stop cooking. Drain again. Pat pork dry, then cut across the grain into ÿ-inch-thick slices (about 2 by 1 inch). Heat oil in a 12-inch skillet over high heat until it shimmers, then cook seasoning paste, stirring constantly, until fragrant, about 1 minute. Add pork, tossing to coat, then spread out in skillet and brown, turning occasionally (to keep paste from burning), about 2 minutes. Add fish sauce, palm sugar, and beans and cook, tossing, until pork is just cooked through and beans are hot, about 1 minute. Remove from heat and toss with lime leaves.",
            "Cook beans in a medium saucepan of boiling salted water (1 teaspoon salt for 2 quarts water), uncovered, until crisp-tender, about 3 minutes. Drain and transfer to a bowl of cold water to stop cooking. Drain again.",
            "Pat pork dry, then cut across the grain into ÿ-inch-thick slices (about 2 by 1 inch).",
            "Heat oil in a 12-inch skillet over high heat until it shimmers, then cook seasoning paste, stirring constantly, until fragrant, about 1 minute. Add pork, tossing to coat, then spread out in skillet and brown, turning occasionally (to keep paste from burning), about 2 minutes. Add fish sauce, palm sugar, and beans and cook, tossing, until pork is just cooked through and beans are hot, about 1 minute. Remove from heat and toss with lime leaves."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d78657b55306961bf33bc/6:4/w_274%2Ch_169/242310_hires.jpg",
        "color": 11847375
    }
}