{
    "recipe": {
        "title": "Stir-Fried Tofu and Shiitake Mushrooms in Spicy Black Bean Sauce ",
        "ingredients": [
            "18 dried shiitake mushrooms",
            "3 cups boiling water",
            "1 tablespoon cornstarch",
            "1 cup vegetable broth",
            "2 tablespoons soy sauce",
            "1 tablespoon rice vinegar",
            "1 1/2 teaspoons sugar",
            "1/4 teaspoon coarse salt",
            "3 tablespoons peanut oil",
            "1 small leek (white and pale green parts only), cut into matchstick-size strips",
            "2 tablespoons Asian fermented black beans,* minced",
            "2 tablespoons minced fresh ginger",
            "3 garlic cloves, minced",
            "2 teaspoons chili-garlic sauce*",
            "1/4 teaspoon finely crushed Szechuan peppercorns (wild pepper),* or coarsely cracked black pepper",
            "2 14-ounce containers soft tofu, drained, cut into 1/2-inch cubes",
            "Fresh cilantro sprigs (for garnish)"
        ],
        "instructions": [
            "Place mushrooms in large bowl. Pour 3 cups boiling water over; let soak until mushrooms soften, at least 25 minutes and up to 4 hours. Drain. Cut off stems and discard; finely chop caps. Dissolve cornstarch in 2 tablespoons vegetable broth in 2-cup measuring cup. Stir in remaining broth, soy sauce, vinegar, sugar, and salt. Heat oil in heavy large wok or nonstick skillet over high heat until very hot. Add mushrooms; stir-fry until browned, about 3 minutes. Add leek; stir-fry until beginning to brown, about 1 minute. Add black beans, ginger, garlic, chili-garlic sauce, and peppercorns; stir-fry 30 seconds. Stir cornstarch mixture to blend, then stir into vegetable mixture. Add tofu; toss gently to coat with sauce. Reduce heat to low, cover, and simmer until sauce thickens slightly, about 4 minutes. Spoon tofu mixture into serving bowl. Garnish with cilantro and serve. *Available at Asian markets and specialty foods stores and in the Asian foods section of some supermarkets.",
            "Place mushrooms in large bowl. Pour 3 cups boiling water over; let soak until mushrooms soften, at least 25 minutes and up to 4 hours. Drain. Cut off stems and discard; finely chop caps.",
            "Dissolve cornstarch in 2 tablespoons vegetable broth in 2-cup measuring cup. Stir in remaining broth, soy sauce, vinegar, sugar, and salt.",
            "Heat oil in heavy large wok or nonstick skillet over high heat until very hot. Add mushrooms; stir-fry until browned, about 3 minutes. Add leek; stir-fry until beginning to brown, about 1 minute. Add black beans, ginger, garlic, chili-garlic sauce, and peppercorns; stir-fry 30 seconds. Stir cornstarch mixture to blend, then stir into vegetable mixture. Add tofu; toss gently to coat with sauce. Reduce heat to low, cover, and simmer until sauce thickens slightly, about 4 minutes.",
            "Spoon tofu mixture into serving bowl. Garnish with cilantro and serve.",
            "*Available at Asian markets and specialty foods stores and in the Asian foods section of some supermarkets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df88a7b55306961bfe739/6:4/w_274%2Ch_169/107857.jpg"
    }
}