{
    "recipe": {
        "title": "Stir-Fried Rice Noodles with Shrimp and Adobo (Pansit Bihon Guisado) ",
        "ingredients": [
            "2 dried mushrooms",
            "1 1/2 cups warm water",
            "1/2 cup leftover chicken and/or pork adobo meat, shredded (or shredded rotisserie chicken)",
            "1 tablespoon red or white wine (optional)",
            "3 tablespoons vegetable oil, divided",
            "4–6 cloves garlic, minced",
            "1 small to medium onion, cut into slivers",
            "1–2 celery ribs, chopped",
            "1 small red bell pepper, seeded and cut into thin strips",
            "1/4 cup fresh shrimp, peeled and deveined, or dried shrimp",
            "1/4 cup soy sauce, plus a dash for serving",
            "1 medium carrot, cut into thin strips",
            "1 chayote or zucchini, cut into thin strips, or 1/2 head broccoli or napa cabbage, chopped",
            "1/2 pound bihon (dry rice noodles) (see Note)",
            "1/2 teaspoon freshly ground black pepper",
            "Dash freshly squeezed calamansi (or lime) juice, for serving (optional)"
        ],
        "instructions": [
            "Soak the mushrooms in the warm water for at least 20 minutes. Drain the mushrooms, reserve the soaking liquid, and thinly slice the mushrooms. Combine the adobo and wine (if using) in a bowl.",
            "Heat 2 tablespoons of the oil in a large skillet or wok over medium heat until it shimmers. Add the garlic and stir-fry until light gold. Add the onion and cook, stirring occasionally, for about 2 minutes, or until translucent. Stir in the celery and bell pepper. Cook, stirring occasionally, for 2 minutes. Add the adobo. If you are using fresh shrimp, add them, too. Cook, stirring, for about 1 minute. Remove from the heat and set aside.",
            "Pour the reserved mushroom soaking liquid into a saucepan and add the soy sauce, mushrooms, carrot, and chayote. If you are using dried shrimp, add those, too. Bring the mixture to a boil over high heat. Add the noodles and toss with the rest of the ingredients. As the noodles become tender, separate them until they are able to mix evenly with the veggies, about 3 minutes.",
            "When the noodles have completely absorbed the liquid and are chewable, stir in the celery, bell pepper, and adobo mixture. Season with the black pepper and mix thoroughly. Pour in the remaining 1 tablespoon oil. Reduce the heat to low to gently fry the noodles for about 2 minutes. Serve with an extra dash of soy sauce and calamansi juice, if using."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b8eb62f64455e2da315abf4/6:4/w_274%2Ch_169/pancit-bihon-recipe-090418.jpg",
        "color": 9372763
    }
}