{
    "recipe": {
        "title": "Stir-Fried Bok Choy and Mizuna with Tofu ",
        "ingredients": [
            "3 1/2 tablespoons soy sauce, divided",
            "4 teaspoons Asian sesame oil, divided",
            "3 1/2 teaspoons unseasoned rice vinegar, divided",
            "1 14- to 16-ounce container extra-firm tofu, drained",
            "2 tablespoons peanut oil",
            "4 green onions, chopped",
            "1 tablespoon finely chopped peeled fresh ginger",
            "2 garlic cloves, finely chopped",
            "4 baby bok choy, leaves separated",
            "12 cups loosely packed mizuna (about 8 ounces)",
            "Ingredient info: Mizuna is sold at some supermarkets and at Asian markets"
        ],
        "instructions": [
            "Whisk 2 tablespoons soy sauce, 2 teaspoons sesame oil, and 1/2 teaspoon vinegar in bowl.",
            "Stack 2 paper towels on work surface. Cut tofu crosswise into 3/4-inch-thick slices; cut each slice crosswise in half. Arrange tofu on paper towels and let stand 10 minutes. Pat top of tofu dry.",
            "Heat peanut oil in large nonstick skillet over medium-high heat. Add tofu and cook, without moving, until golden brown on bottom, 2 to 3 minutes per side. Transfer tofu to paper towel to drain, then place tofu on sheet of foil and brush both sides with soy sauce mixture.",
            "Wipe out any peanut oil from skillet. Add 2 teaspoons sesame oil and place skillet over medium heat. Add green onions, ginger, and garlic. Stir until fragrant, about 30 seconds. Add remaining 1 1/2 tablespoons soy sauce and 3 teaspoons vinegar, then bok choy. Toss until bok choy wilts, 1 to 2 minutes. Add mizuna in 2 batches, tossing to wilt before adding more, 1 to 2 minutes per batch. Season greens with salt and pepper. Add tofu to skillet. Toss gently to blend. Transfer to platter."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b4218ed5e8c3e1070b237c/6:4/w_274%2Ch_169/362936_bok-choy-mizuna_1x1.jpg",
        "color": 6044087
    }
}