{
    "recipe": {
        "title": "Stout Floats with Cocoa Syrup ",
        "ingredients": [
            "2/3 cup sugar",
            "1/2 cup natural unsweetened cocoa powder (spooned into cup to measure, then leveled)",
            "2/3 cup boiling water",
            "1 teaspoon vanilla extract",
            "1 cup chilled heavy whipping cream",
            "1 teaspoon vanilla extract",
            "6 tablespoons Kahlúa or other coffee-flavored liqueur",
            "Chocolate ice cream",
            "3 12-ounce bottles or 2 pints (about) chilled stout",
            "6 iced-teaspoons",
            "6 straws"
        ],
        "instructions": [
            "Whisk sugar, cocoa powder, and pinch of salt in small saucepan. Pour 2/3 cup boiling water into heat-resistant measuring cup. Whisk just enough boiling water from cup into cocoa mixture in saucepan to form smooth paste (about 3 tablespoons), then whisk in remaining water. Bring to simmer over low heat, stirring constantly. Simmer syrup 1 1/2 minutes, stirring often. Remove from heat; stir in vanilla. Cool to room temperature. DO AHEAD: Can be made 3 weeks ahead. Cover; chill.",
            "For floats: Using electric mixer, beat cream and vanilla in medium bowl until peaks form. Cover; chill. Pour 1 tablespoon Kahlúa and 1 tablespoon cocoa syrup into each of six 10-ounce glasses. Place 1 scoop of ice cream in each glass. Add stout, pouring gently down side of tilted glass to prevent too much head from forming. Spoon dollop of whipped cream into each glass. Drizzle with cocoa syrup, place spoon and straw in each, and serve immediately.",
            "Using electric mixer, beat cream and vanilla in medium bowl until peaks form. Cover; chill. Pour 1 tablespoon Kahlúa and 1 tablespoon cocoa syrup into each of six 10-ounce glasses. Place 1 scoop of ice cream in each glass. Add stout, pouring gently down side of tilted glass to prevent too much head from forming. Spoon dollop of whipped cream into each glass. Drizzle with cocoa syrup, place spoon and straw in each, and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b42aad2413537c0d45e4ff/6:4/w_274%2Ch_169/363725_stout-floats_1x1.jpg"
    }
}