{
    "recipe": {
        "title": "Strawberry-Hibiscus Granita ",
        "ingredients": [
            "2 tablespoons dried hibiscus flowers or 6 hibiscus tea bags",
            "1 sprig basil plus leaves for garnish",
            "1 pound strawberries, hulled, quartered, plus 1 1/2 cups diced strawberries for garnish",
            "1/2 cup plus 2 tablespoons (or more) light agave syrup (nectar)",
            "1 tablespoon (or more) fresh lime juice",
            "Ingredient info: Agave syrup is available at natural foods stores and some supermarkets."
        ],
        "instructions": [
            "Bring 1 1/2 cups water to a boil in a small saucepan. Stir in hibiscus and basil sprig. Remove from heat, cover, and steep for 20 minutes. Strain through a fine-mesh sieve into a small bowl. Cover and chill hibiscus tea until cold, at least 1 hour. Meanwhile, blend quartered strawberries in a blender until finely puréed. Transfer to a large bowl; add tea, agave syrup, and 1 tablespoon lime juice. Season to taste, adding more agave and lime juice, if desired. Pour strawberry mixture into a 13x9x2\" metal pan and freeze until top layer begins to harden, about 2 hours. Using a fork, scrape mixture to break frozen portions into tiny pieces. Freeze for 30 minutes; scrape again. Repeat until granita resembles fluffy shaved ice, about 4 hours. Divide among bowls. Garnish with basil leaves and diced strawberries.",
            "Bring 1 1/2 cups water to a boil in a small saucepan. Stir in hibiscus and basil sprig. Remove from heat, cover, and steep for 20 minutes. Strain through a fine-mesh sieve into a small bowl. Cover and chill hibiscus tea until cold, at least 1 hour.",
            "Meanwhile, blend quartered strawberries in a blender until finely puréed. Transfer to a large bowl; add tea, agave syrup, and 1 tablespoon lime juice. Season to taste, adding more agave and lime juice, if desired.",
            "Pour strawberry mixture into a 13x9x2\" metal pan and freeze until top layer begins to harden, about 2 hours. Using a fork, scrape mixture to break frozen portions into tiny pieces. Freeze for 30 minutes; scrape again. Repeat until granita resembles fluffy shaved ice, about 4 hours.",
            "Divide among bowls. Garnish with basil leaves and diced strawberries."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b0a5901cc76a014cfadbc8/6:4/w_274%2Ch_169/51104690_strawberry-hibiscus-granita_1x1.jpg"
    }
}