{
    "recipe": {
        "title": "Strawberry-Rhubarb Galette with Buckwheat Crust ",
        "ingredients": [
            "1 cup all-purpose flour",
            "1/3 cup buckwheat flour",
            "3 Tbsp. sugar",
            "1 tsp. kosher salt",
            "1/2 cup (1 stick) unsalted butter, cut into pieces",
            "All-purpose flour (for surface)",
            "1 lb. rhubarb, cut into 3/4\" pieces",
            "8 oz. strawberries, hulled, halved if large",
            "1 Tbsp. plus 1 1/2 tsp. cornstarch",
            "1/3 cup sugar, plus more for sprinkling",
            "1/2 vanilla bean, halved lengthwise",
            "1 large egg, beaten to blend",
            "Whipped cream, ice cream, or crème fraîche (for serving)"
        ],
        "instructions": [
            "Dough: Whisk all-purpose and buckwheat flours, sugar, and salt in a large bowl to combine. Add butter and work into dry ingredients with your hands, mashing it into big flat pieces and smooshing it between your palms into the flour, until you have pea- and nickel-size pieces. Drizzle 1/4 cup ice water over mixture and rake it in with your fingers until evenly dispersed. Squeeze clumps with your hands to moisten until a shaggy dough forms, then turn out onto a work surface. Gather dough together, pushing and working it into a ball, then flattening it, until only a few dry spots remain. Pat into a 3/4\"-thick square. Using a bench scraper or knife, divide dough into 4 pieces. Stack pieces on top of one another, placing any unincorporated dry bits in between layers, and press down to combine. Form dough into a 3/4\"-thick disk and wrap tightly in plastic. Chill until firm, at least 2 hours and up to 3 days.",
            "Whisk all-purpose and buckwheat flours, sugar, and salt in a large bowl to combine. Add butter and work into dry ingredients with your hands, mashing it into big flat pieces and smooshing it between your palms into the flour, until you have pea- and nickel-size pieces.",
            "Drizzle 1/4 cup ice water over mixture and rake it in with your fingers until evenly dispersed. Squeeze clumps with your hands to moisten until a shaggy dough forms, then turn out onto a work surface.",
            "Gather dough together, pushing and working it into a ball, then flattening it, until only a few dry spots remain. Pat into a 3/4\"-thick square. Using a bench scraper or knife, divide dough into 4 pieces. Stack pieces on top of one another, placing any unincorporated dry bits in between layers, and press down to combine. Form dough into a 3/4\"-thick disk and wrap tightly in plastic. Chill until firm, at least 2 hours and up to 3 days.",
            "Filling and assembly: Preheat oven to 400°F. Roll out dough on a well-floured surface to a 14\" round, rotating dough and tossing more flour underneath as needed to keep it from sticking. Transfer dough to a large parchment-lined rimmed baking sheet (most galettes will spring a leak at the creases of the pastry, even for pros). Place rhubarb, strawberries, cornstarch, and 1/3 cup sugar in a medium bowl. Scrape in vanilla seeds and discard pod; toss ingredients to evenly distribute. Mound filling in center of dough, making sure to scoop up all the sugar and cornstarch in bowl, and spread out, leaving a 2\" border around edges. Fold dough up and over filling, overlapping slightly. Brush dough with egg and sprinkle dough and filling generously with sugar. Bake galette until filling is bubbling and crust is deeply browned, 40–50 minutes. Let cool slightly. Serve topped with whipped cream.",
            "Preheat oven to 400°F. Roll out dough on a well-floured surface to a 14\" round, rotating dough and tossing more flour underneath as needed to keep it from sticking. Transfer dough to a large parchment-lined rimmed baking sheet (most galettes will spring a leak at the creases of the pastry, even for pros). Place rhubarb, strawberries, cornstarch, and 1/3 cup sugar in a medium bowl. Scrape in vanilla seeds and discard pod; toss ingredients to evenly distribute.",
            "Mound filling in center of dough, making sure to scoop up all the sugar and cornstarch in bowl, and spread out, leaving a 2\" border around edges. Fold dough up and over filling, overlapping slightly. Brush dough with egg and sprinkle dough and filling generously with sugar.",
            "Bake galette until filling is bubbling and crust is deeply browned, 40–50 minutes. Let cool slightly. Serve topped with whipped cream."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ac27232aa1661676dc5f960/6:4/w_274%2Ch_169/rhubarb-galette-with-buckwheat-crust-recipe-BA-032818.jpg"
    }
}