{
    "recipe": {
        "title": "Strawberry Shortcakes with Balsamic and Black Pepper Syrup ",
        "ingredients": [
            "2 cups unbleached all purpose flour",
            "5 tablespoons sugar, divided",
            "2 1/2 teaspoons baking powder",
            "1/4 teaspoon salt",
            "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
            "1 cup chilled heavy whipping cream",
            "1 large egg, beaten to blend (for glaze)",
            "2 pounds fresh strawberries (about 8 cups), hulled, quartered if small, sliced if large",
            "6 tablespoons sugar, divided",
            "3 tablespoons balsamic vinegar",
            "1 large pinch of freshly ground black pepper",
            "1 cup chilled heavy whipping cream",
            "1 teaspoon vanilla extract"
        ],
        "instructions": [
            "Position rack in center of oven and preheat to 425°F. Line baking sheet with parchment paper. Place flour, 4 tablespoons sugar, baking powder, and salt in processor. Using on/off turns, process to blend. Add butter; cut in using on/off turns until butter resembles large peas, about five 1-second intervals. Add cream; using on/off turns, process until moist clumps form. Transfer dough to lightly floured work surface. Gather dough into ball; flatten into 8 x 4-inch rectangle (about 1 1/4 inches thick). Cut lengthwise in half, then crosswise into 4 equal strips, forming 8 square biscuits. Transfer biscuits to prepared baking sheet and chill 20 minutes. DO AHEAD: Can be made 1 day ahead. Cover and keep chilled.",
            "Brush top of biscuits with egg glaze; sprinkle with remaining 1 tablespoon sugar. Bake until biscuits are golden brown and tester inserted horizontally comes out clean, about 15 minutes. Transfer to rack and cool. DO AHEAD: Can be made 8 hours ahead. Let stand at room temperature.",
            "For filling: Mix strawberries, 5 tablespoons sugar, vinegar, and black pepper in medium bowl. Let macerate 30 minutes, stirring occasionally. Using electric mixer, beat cream, vanilla, and remaining 1 tablespoon sugar in another medium bowl until peaks form. Cut biscuits horizontally in half. Place bottom half of each biscuit, cut side up, on plate. Using slotted spoon, divide strawberries among biscuits. Spoon dollop of whipped cream atop strawberries. Cover each with top half of biscuit. Drizzle some of juices from strawberries around shortcakes.",
            "Mix strawberries, 5 tablespoons sugar, vinegar, and black pepper in medium bowl. Let macerate 30 minutes, stirring occasionally.",
            "Using electric mixer, beat cream, vanilla, and remaining 1 tablespoon sugar in another medium bowl until peaks form.",
            "Cut biscuits horizontally in half. Place bottom half of each biscuit, cut side up, on plate. Using slotted spoon, divide strawberries among biscuits. Spoon dollop of whipped cream atop strawberries. Cover each with top half of biscuit. Drizzle some of juices from strawberries around shortcakes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3b187460b4423363f3d6e/6:4/w_274%2Ch_169/359412_strawberry-shortcakes_1x1.jpg"
    }
}