{
    "recipe": {
        "title": "Strawberry Buckwheat Bars ",
        "ingredients": [
            "1 cup (2 sticks) cold unsalted butter, cut into pieces, plus more for pan",
            "2 1/4 cups all-purpose flour",
            "3/4 cup buckwheat flour",
            "1/2 cup granulated sugar",
            "1/2 cup light brown sugar",
            "1/2 teaspoon kosher salt",
            "1 teaspoon baking powder",
            "1 large egg, beaten to blend",
            "3 cups hulled, quartered strawberries (about 1 pound)",
            "1 (12–13-ounce) jar strawberry preserves",
            "1 tablespoon cornstarch",
            "2 teaspoons fresh lemon juice",
            "Powdered sugar (for dusting; optional)"
        ],
        "instructions": [
            "Preheat oven to 375°F. Butter a 9x13\" baking pan and line with parchment paper, leaving a 1\" overhang on both long sides.",
            "Pulse all-purpose flour, buckwheat flour, granulated sugar, brown sugar, salt, and baking powder in a food processor until well combined. Add 1 cup butter and pulse until mixture resembles coarse meal. Add egg and pulse until well distributed. Transfer mixture to a large bowl and mix with your fingers until clumps form; it should look like crumb topping at this point. Chill dough while you make the filling.",
            "Make the filling: Combine strawberries, preserves, cornstarch, and lemon juice in a small saucepan. Cook over medium heat, stirring constantly, until preserves are melted and cornstarch is dissolved, 2–3 minutes. Press half of dough into prepared pan, patting with your knuckles to an even thickness. Pour strawberry mixture evenly over dough. Sprinkle remaining dough evenly over top. Bake bar until fruit is bubbling and top is golden brown, 40–45 minutes. Let cool on a wire rack. Lift bar out of pan using parchment overhang and cut into 24 squares. Dust with powdered sugar, if desired.",
            "Combine strawberries, preserves, cornstarch, and lemon juice in a small saucepan. Cook over medium heat, stirring constantly, until preserves are melted and cornstarch is dissolved, 2–3 minutes.",
            "Press half of dough into prepared pan, patting with your knuckles to an even thickness. Pour strawberry mixture evenly over dough. Sprinkle remaining dough evenly over top. Bake bar until fruit is bubbling and top is golden brown, 40–45 minutes.",
            "Let cool on a wire rack. Lift bar out of pan using parchment overhang and cut into 24 squares. Dust with powdered sugar, if desired.",
            "Do Ahead Bars can be stored in an airtight container at room temperature for up to 3 days.",
            "Bars can be stored in an airtight container at room temperature for up to 3 days."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55ac4e7398d8666b6dcdac5a/6:4/w_274%2Ch_169/EP_15072015_BARCOOKIE_strawberrybuckweatbars_6x4.jpg",
        "color": 5566293
    }
}