{
    "recipe": {
        "title": "Strawberry Jam Biscuits ",
        "ingredients": [
            "12 ounces fresh strawberries, hulled, halved or quartered if large (about 3 cups)",
            "1/4 cup sugar",
            "1 teaspoon finely grated lime zest",
            "2 tablespoons fresh lime juice",
            "3/4 cup sugar",
            "2 teaspoons baking powder",
            "3/4 teaspoons kosher salt",
            "2 1/4 cups all-purpose flour plus more",
            "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2\" pieces",
            "1 teaspoon finely grated lime zest",
            "3/4 cup buttermilk",
            "1 large egg, beaten to blend",
            "1 tablespoon raw sugar",
            "Vanilla ice cream (for serving)"
        ],
        "instructions": [
            "Cook strawberries and sugar in a medium saucepan over mediumhigh heat, stirring occasionally, until jamlike in consistency, 12-15 minutes. Remove from heat; stir in lime zest and juice. Pour into a shallow bowl and let cool.",
            "For biscuits: Preheat oven to 400°. Whisk sugar, baking powder, salt, and 2 1/4 cups flour in a large bowl. Add butter and lime zest and blend with your fingertips until coarse crumbs form. Add buttermilk and, using a fork, mix until just combined. Transfer to a lightly floured surface. Gently knead just until a shaggy, moist dough forms, about 4 times. Roll out dough about 1/2\" thick. Using a 2 1/2\" biscuit cutter or inverted glass, cut out rounds. Gather scraps and repeat rolling and cutting until all dough is used. Place biscuits on a parchment-lined baking sheet. Using your thumb, make a large divot in the center of each biscuit; brush with egg and sprinkle liberally with raw sugar. Spoon a scant 1 teaspoon strawberry jam into each divot. Bake biscuits until golden brown, 18-22 minutes. Serve warm with vanilla ice cream, if using, and remaining jam. DO AHEAD: Jam can be made 3 days ahead. Cover and chill.",
            "Preheat oven to 400°. Whisk sugar, baking powder, salt, and 2 1/4 cups flour in a large bowl. Add butter and lime zest and blend with your fingertips until coarse crumbs form. Add buttermilk and, using a fork, mix until just combined. Transfer to a lightly floured surface. Gently knead just until a shaggy, moist dough forms, about 4 times.",
            "Roll out dough about 1/2\" thick. Using a 2 1/2\" biscuit cutter or inverted glass, cut out rounds. Gather scraps and repeat rolling and cutting until all dough is used.",
            "Place biscuits on a parchment-lined baking sheet. Using your thumb, make a large divot in the center of each biscuit; brush with egg and sprinkle liberally with raw sugar. Spoon a scant 1 teaspoon strawberry jam into each divot.",
            "Bake biscuits until golden brown, 18-22 minutes. Serve warm with vanilla ice cream, if using, and remaining jam.",
            "DO AHEAD: Jam can be made 3 days ahead. Cover and chill."
        ],
        "picture_link": null
    }
}