{
    "recipe": {
        "title": "Strawberry-Basil Shortcakes ",
        "ingredients": [
            "1/4 cup sugar",
            "1 tablespoon baking powder",
            "1/2 teaspoons kosher salt",
            "2 cups all-purpose flour, plus more for surface",
            "6 tablespoons (3/4 stick) chilled unsalted butter, cut into pieces",
            "1 cup heavy cream",
            "1 large egg, beaten to blend",
            "1 1/2 pounds fresh strawberries, hulled, quartered (about 3 cups), divided",
            "4 tablespoons sugar, divided",
            "2 sprigs basil",
            "2 cups heavy cream",
            "2 tablespoons crème fraîche"
        ],
        "instructions": [
            "Shortcakes: Preheat oven to 400°. Whisk sugar, baking powder, salt, and 2 cups flour in a large bowl. Using your fingers or a pastry cutter, work in butter until the texture of coarse meal with a few pea-size pieces of butter remaining. Add cream and mix until dough just comes together (it will be sticky). Turn out dough onto a lightly floured surface and pat into a 12x4\" rectangle about 3/4\" thick. Cut out rounds with a 2 1/2\" biscuit cutter, re-rolling scraps as needed to make 8 rounds. Whisk egg with 1 tablespoon water in a small bowl. Transfer rounds to a parchmentlined baking sheet and brush tops with egg wash. Bake until tops are golden brown and shortcakes are cooked through, 15–20 minutes. DO AHEAD: Shortcakes can be made 2 days ahead. Store tightly wrapped at room temperature.",
            "Preheat oven to 400°. Whisk sugar, baking powder, salt, and 2 cups flour in a large bowl. Using your fingers or a pastry cutter, work in butter until the texture of coarse meal with a few pea-size pieces of butter remaining. Add cream and mix until dough just comes together (it will be sticky).",
            "Turn out dough onto a lightly floured surface and pat into a 12x4\" rectangle about 3/4\" thick. Cut out rounds with a 2 1/2\" biscuit cutter, re-rolling scraps as needed to make 8 rounds. Whisk egg with 1 tablespoon water in a small bowl. Transfer rounds to a parchmentlined baking sheet and brush tops with egg wash. Bake until tops are golden brown and shortcakes are cooked through, 15–20 minutes.",
            "DO AHEAD: Shortcakes can be made 2 days ahead. Store tightly wrapped at room temperature.",
            "Berries and Assembly: Coarsely chop 2 cups strawberries (use any bruised or less perfect ones) and cook with 2 tablespoons sugar in a medium saucepan over medium heat, stirring occasionally, until berries are softened and mixture is slightly thickened, about 5 minutes. Let berry compote cool. Meanwhile, toss basil, 1 tablespoon sugar, and remaining 1 cup strawberries in a medium bowl and let sit until fruit begins to release juices, 10–15 minutes. Discard basil. Using an electric mixer, beat cream, crème fraîche, and remaining 1 tablespoon sugar to soft peaks, about 4 minutes. Split shortcakes and fill with berry compote, whipped cream mixture, and macerated strawberries.",
            "Coarsely chop 2 cups strawberries (use any bruised or less perfect ones) and cook with 2 tablespoons sugar in a medium saucepan over medium heat, stirring occasionally, until berries are softened and mixture is slightly thickened, about 5 minutes. Let berry compote cool.",
            "Meanwhile, toss basil, 1 tablespoon sugar, and remaining 1 cup strawberries in a medium bowl and let sit until fruit begins to release juices, 10–15 minutes. Discard basil.",
            "Using an electric mixer, beat cream, crème fraîche, and remaining 1 tablespoon sugar to soft peaks, about 4 minutes.",
            "Split shortcakes and fill with berry compote, whipped cream mixture, and macerated strawberries."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac425a6529d92b2c03a2d9/6:4/w_274%2Ch_169/51234900_strawberry-basil-shortcakes_1x1.jpg"
    }
}