{
    "recipe": {
        "title": "Strawberries Romanoff with Crème Fraîche Ice Cream ",
        "ingredients": [
            "2/3 cup sugar",
            "6 large egg yolks",
            "2 cups crème fraîche*",
            "1 1/2 cups buttermilk, well shaken",
            "1 tablespoon fresh lemon juice",
            "1 1/2 teaspoons finely grated lemon peel",
            "Pinch of salt",
            "4 cups quartered hulled fresh strawberries (about 20 ounces) plus",
            "1/4 cup orange juice",
            "1/4 cup powdered sugar",
            "2 tablespoons Grand Marnier or other orange liqueur",
            "1/2 teaspoon finely grated orange peel"
        ],
        "instructions": [
            "Place fine strainer over large glass bowl. Fill another bowl (larger than bowl with strainer) halfway with ice and water. Whisk sugar and egg yolks in third large bowl to blend. Combine crème fraîche, buttermilk, lemon juice, lemon peel, and salt in heavy large saucepan. Stir constantly over medium heat just until hot (do not allow mixture to boil), about 4 minutes. Gradually whisk crème fraîche mixture into yolk mixture. Return mixture to same saucepan. Stir constantly over medium heat just until instant-read thermometer inserted into custard registers 170&DegF and custard thickens very slightly, about 4 minutes (do not boil). Pour custard through strainer set over bowl. Set bowl with custard in bowl filled with ice water; whisk occasionally until custard is cold. DO AHEAD: Can be made 2 days ahead. Cover and chill.",
            "Transfer custard to ice cream maker and process according to manufacturer's instructions. Transfer ice cream to container; cover and freeze until firm, at least 6 hours. DO AHEAD: Ice cream can be made 3 days ahead. Keep frozen.",
            "For berries: Toss quartered berries, orange juice, powdered sugar, Grand Marnier, and orange peel in medium bowl. Cover and refrigerate at least 1 hour. DO AHEAD: Can be made 4 hours ahead. Keep chilled. Scoop ice cream into 6 dessert glasses or bowls. Top with berry mixture. Garnish each serving with 1 whole berry and serve. Available at most supermarkets and at specialty foods stores.",
            "Toss quartered berries, orange juice, powdered sugar, Grand Marnier, and orange peel in medium bowl. Cover and refrigerate at least 1 hour. DO AHEAD: Can be made 4 hours ahead. Keep chilled.",
            "Scoop ice cream into 6 dessert glasses or bowls. Top with berry mixture. Garnish each serving with 1 whole berry and serve.",
            "Available at most supermarkets and at specialty foods stores.",
            "Available at most supermarkets and at specialty foods stores."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a597e0acd286555db87a/6:4/w_274%2Ch_169/353424_hires.jpg",
        "color": 2296949
    }
}