{
    "recipe": {
        "title": "Strawberry-Elderflower Cake ",
        "ingredients": [
            "1/2 cup (1 stick) unsalted butter, melted, slightly cooled, plus more, room temperature, for pan",
            "1 cup granulated sugar, plus more for pan",
            "1 1/2 cups all-purpose flour, sifted",
            "1/4 teaspoons kosher salt",
            "6 large eggs",
            "1 pound strawberries, hulled, quartered",
            "1/4 cup granulated sugar",
            "3 tablespoons elderflower, raspberry, or unseasoned rice vinegar",
            "2 large egg whites",
            "A pinch of kosher salt",
            "2 1/2 cups powdered sugar",
            "Elderflowers (optional; for serving)"
        ],
        "instructions": [
            "Preheat oven to 350°F. Butter a 9\"-diameter cake pan and sprinkle with granulated sugar. Whisk flour and salt in a small bowl; set aside.",
            "Whisk eggs and 1 cup granulated sugar in a heatproof bowl and place over a saucepan of simmering water (bowl should not touch water). Heat, whisking constantly, until sugar is dissolved and mixture is warm to the touch, about 4 minutes. Remove bowl from heat and, using an electric mixer on high speed, beat egg mixture until it is pale and tripled in volume, about 5 minutes.",
            "Gently fold reserved dry ingredients into egg mixture in 3 additions, then fold in melted butter. Scrape batter into prepared pan and smooth top. Bake cake until golden brown and a tester inserted into the center comes out clean, 25–30 minutes. Transfer pan to a wire rack and let cake cool in pan before turning out.",
            "For strawberries and assembly: Bring strawberries, granulated sugar, and 2 tablespoons vinegar to a simmer in a medium saucepan. Crush berries with a spoon to release more juices and simmer until berries are completely soft and mixture resembles a coarse jam, 5–8 minutes. Transfer to a medium bowl; let cool. Using a long serrated knife, slice cake in half horizontally. Spread strawberry mixture over bottom layer of cake and place top layer over strawberry mixture. Whisk egg whites, salt, and remaining 1 tablespoon vinegar in a medium bowl until frothy. Gradually whisk in powdered sugar; thin icing with water as needed (it should be pourable). Place cake on a wire rack set inside a rimmed baking sheet and pour icing over cake. Spread with an offset spatula to smooth top and cover sides. Let stand at room temperature until set, at least 30 minutes. Decorate with elderflowers, if using, just before serving. DO AHEAD: Cake can be made 1 day ahead. Store covered at room temperature.",
            "Bring strawberries, granulated sugar, and 2 tablespoons vinegar to a simmer in a medium saucepan. Crush berries with a spoon to release more juices and simmer until berries are completely soft and mixture resembles a coarse jam, 5–8 minutes. Transfer to a medium bowl; let cool.",
            "Using a long serrated knife, slice cake in half horizontally. Spread strawberry mixture over bottom layer of cake and place top layer over strawberry mixture.",
            "Whisk egg whites, salt, and remaining 1 tablespoon vinegar in a medium bowl until frothy. Gradually whisk in powdered sugar; thin icing with water as needed (it should be pourable).",
            "Place cake on a wire rack set inside a rimmed baking sheet and pour icing over cake. Spread with an offset spatula to smooth top and cover sides. Let stand at room temperature until set, at least 30 minutes. Decorate with elderflowers, if using, just before serving.",
            "DO AHEAD: Cake can be made 1 day ahead. Store covered at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac90026529d92b2c03c611/6:4/w_274%2Ch_169/51232260_strawberry-elderflower-cake_1x1.jpg"
    }
}