{
    "recipe": {
        "title": "Strawberry, Pomegranate, and Rose Petal Mess ",
        "ingredients": [
            "2 large egg whites",
            "1/4 cup granulated sugar",
            "1/4 cup powdered sugar",
            "3/4 cup crème fraîche",
            "1/2 cup mascarpone",
            "2 tablespoons powdered sugar",
            "1/2 teaspoon rose water (optional)",
            "6 ounces strawberries, hulled, halved if large",
            "1 pint strawberry or raspberry sorbet",
            "1 tablespoon pomegranate molasses or 1 1/2 teaspoons honey",
            "1/4 cup pomegranate seeds",
            "1 teaspoon ground sumac",
            "2 teaspoons dried rose petals (optional)",
            "Sumac is available at specialty foods stores, and pomegranate molasses is available at some grocery stores. Both are available at Middle Eastern markets."
        ],
        "instructions": [
            "Preheat oven to 200°. Using an electric mixer on medium-high speed, beat egg whites until foamy, about 1 minute. With mixer running, gradually add granulated sugar. Continue to beat until meringue triples in volume, is shiny, and holds medium-stiff peaks, 8–10 minutes. Add powdered sugar and beat just to blend.",
            "Spoon 2 heaping tablespoonfuls of meringue onto a parchment-lined baking sheet; repeat to fill baking sheet, spacing 1\" apart. Bake until dry, about 4 hours.",
            "Do ahead: Meringues can be baked 5 days ahead. Keep airtight at room temperature.",
            "Assembly: Whisk crème fraîche, mascarpone, powdered sugar, and rose water, if using, in a medium bowl. Arrange meringues, crème fraîche mixture, strawberries, and scoops of sorbet in a large bowl. Drizzle with pomegranate molasses and top with pomegranate seeds, sumac, and rose petals, if using.",
            "Whisk crème fraîche, mascarpone, powdered sugar, and rose water, if using, in a medium bowl.",
            "Arrange meringues, crème fraîche mixture, strawberries, and scoops of sorbet in a large bowl. Drizzle with pomegranate molasses and top with pomegranate seeds, sumac, and rose petals, if using."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54abfed219925f464b3a5095/6:4/w_274%2Ch_169/51242160_strawberry-pomegranate-rose_1x1.jpg"
    }
}