{
    "recipe": {
        "title": "Stracciatella Gelato ",
        "ingredients": [
            "2 cups whole milk",
            "1 vanilla bean, split lengthwise",
            "3/4 cup sugar",
            "5 large egg yolks",
            "Pinch of kosher salt",
            "1/2 cup chilled heavy whipping cream",
            "1/3 cup bittersweet chocolate chips",
            "2 teaspoons vegetable oil"
        ],
        "instructions": [
            "Place milk in a medium saucepan. Scrape in seeds from vanilla bean; add bean. Bring to a simmer, whisking often. Whisk sugar, yolks, and salt in a medium bowl until well blended, about 1 minute. Gradually whisk hot milk mixture into yolk mixture. Return to saucepan; stir over medium-low heat until custard thickens and a thermometer registers 170°F-175°F, about 5 minutes (do not boil). Strain into a medium bowl. Stir in cream. Chill custard until cold, at least 2 hours. Stir chocolate and oil in a small sauce-pan over low heat until melted; let cool. Process custard in an ice cream maker according to manufacturer's instructions. Slowly add all but 1 tsp. melted chocolate during the last 30 seconds of churning (chocolate will form small chips). Transfer to a bowl. Drizzle remaining chocolate over gelato in zigzag lines. Serve immediately.",
            "Place milk in a medium saucepan. Scrape in seeds from vanilla bean; add bean. Bring to a simmer, whisking often. Whisk sugar, yolks, and salt in a medium bowl until well blended, about 1 minute. Gradually whisk hot milk mixture into yolk mixture. Return to saucepan; stir over medium-low heat until custard thickens and a thermometer registers 170°F-175°F, about 5 minutes (do not boil). Strain into a medium bowl. Stir in cream. Chill custard until cold, at least 2 hours.",
            "Stir chocolate and oil in a small sauce-pan over low heat until melted; let cool.",
            "Process custard in an ice cream maker according to manufacturer's instructions. Slowly add all but 1 tsp. melted chocolate during the last 30 seconds of churning (chocolate will form small chips). Transfer to a bowl. Drizzle remaining chocolate over gelato in zigzag lines. Serve immediately."
        ],
        "picture_link": null
    }
}