{
    "recipe": {
        "title": "Striped Bass with Lime Broth ",
        "ingredients": [
            "2 tablespoons coriander seeds",
            "1 tablespoon cracked cardamom pods",
            "1 teaspoon Thai green curry paste",
            "4 sprigs cilantro, stems and leaves separated",
            "2 kaffir lime leaves or 1/2 teaspoon finely grated lime zest",
            "1 tablespoon fish sauce",
            "1/3 cup (or more) fresh lime juice",
            "Kosher salt",
            "1 grapefruit",
            "1 lime",
            "2 tablespoons vegetable oil",
            "4 6-ounce striped bass fillets or snapper, John Dory, or black bass fillets, halved if long and narrow",
            "Freshly ground black pepper",
            "Fresh mint and basil leaves, extra-virgin olive oil, and flaky sea salt (such as Maldon; for serving)",
            "Ingredient info: Thai green curry paste is available at Asian markets and in the Asian foods section of many supermarkets."
        ],
        "instructions": [
            "Toast coriander, cardamom, and curry paste in a medium saucepan over medium heat, stirring, until spices are fragrant and curry paste begins to caramelize, about 2 minutes. Add cilantro stems, kaffir lime leaves, fish sauce, and 1 cup water. Bring to a boil, reduce heat, and simmer gently until flavors meld, 8-10 minutes. Strain broth through a fine-mesh sieve into a large heatproof measuring cup; discard solids. Let cool, then stir in lime juice; season with kosher salt and more lime juice, if desired. Meanwhile, using a sharp knife, cut all peel and white pith from grapefruit; discard. Working over a small bowl, cut between membranes to release segments into bowl; discard membranes. Repeat with lime. Heat vegetable oil in a large cast-iron or other heavy skillet over medium-high heat. Season fish with salt and pepper. Cook fillets, skin side down, 1 minute, then firmly press down with a fish spatula to ensure even browning and crispiness. Continue cooking until skin is golden brown and fish is mostly cooked through, about 4 minutes; carefully turn fish and sauté until just cooked through, about 1 minute longer. Divide lime broth and fish among shallow bowls. Scatter citrus segments, cilantro leaves, and mint and basil over; drizzle with olive oil and season with sea salt. DO AHEAD: Broth can be made 1 day ahead (do not add lime juice). Cover and chill. Bring to room temperature and add lime juice just before serving.",
            "Toast coriander, cardamom, and curry paste in a medium saucepan over medium heat, stirring, until spices are fragrant and curry paste begins to caramelize, about 2 minutes. Add cilantro stems, kaffir lime leaves, fish sauce, and 1 cup water. Bring to a boil, reduce heat, and simmer gently until flavors meld, 8-10 minutes.",
            "Strain broth through a fine-mesh sieve into a large heatproof measuring cup; discard solids. Let cool, then stir in lime juice; season with kosher salt and more lime juice, if desired.",
            "Meanwhile, using a sharp knife, cut all peel and white pith from grapefruit; discard. Working over a small bowl, cut between membranes to release segments into bowl; discard membranes. Repeat with lime.",
            "Heat vegetable oil in a large cast-iron or other heavy skillet over medium-high heat. Season fish with salt and pepper. Cook fillets, skin side down, 1 minute, then firmly press down with a fish spatula to ensure even browning and crispiness. Continue cooking until skin is golden brown and fish is mostly cooked through, about 4 minutes; carefully turn fish and sauté until just cooked through, about 1 minute longer.",
            "Divide lime broth and fish among shallow bowls. Scatter citrus segments, cilantro leaves, and mint and basil over; drizzle with olive oil and season with sea salt.",
            "DO AHEAD: Broth can be made 1 day ahead (do not add lime juice). Cover and chill. Bring to room temperature and add lime juice just before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54aef4486529d92b2c04b694/6:4/w_274%2Ch_169/51187320_striped-bass_1x1.jpg"
    }
}