{
    "recipe": {
        "title": "Striped Bass with Heirloom Tomato Scampi ",
        "ingredients": [
            "2 tablespoons olive oil",
            "4 striped bass fillets (6 ounces each)",
            "Salt and freshly ground black pepper",
            "Grated zest and juice of 1 lemon",
            "1/2 bunch thyme sprigs",
            "3 tablespoons Roasted Garlic Oil (page 93)",
            "6 garlic cloves, finely chopped",
            "2 shallots, finely diced",
            "1 tablespoon fennel seeds, toasted in a dry skillet",
            "4 celery ribs, sliced 1/4 inch thick",
            "1 tablespoon drained, chopped capers",
            "1/4 cup dry white wine",
            "1 tablespoon red wine vinegar",
            "Grated zest and juice of 1 lemon",
            "3 pounds mixed heirloom tomatoes, cut in wedges",
            "1 cup tightly packed hand-torn fresh basil leaves"
        ],
        "instructions": [
            "Preheat the oven to 350°F.",
            "In a large ovenproof nonstick skillet, heat the olive oil over medium-high heat. Season the fish liberally with salt and pepper and sprinkle with the lemon zest and juice. Once the oil begins to shimmer, place the fillets skin-side-down in the pan and let them cook, without moving them, until the skin is crisp and golden brown, 45 seconds to 1 minute. Give a light push to loosen the skin from the pan. Add the thyme sprigs to the pan. Transfer the pan to the oven and bake until the fish flakes easily with a fork, 6 to 8 minutes. Remove fish from the oven and transfer to paper towels.",
            "To make the scampi: In a large skillet, heat the garlic oil over medium-high heat. Add the garlic, shallots, and fennel seeds and cook, stirring frequently, until the shallots are translucent, about 2 minutes. Add the celery and capers and cook until the celery has softened, about 2 minutes. Add the wine to the pan and cook until it is reduced by half, about 1 minute. Add the vinegar, lemon zest and juice, tomatoes, and basil and cook for 1 to 2 minutes to incorporate the flavors and heat the tomatoes through. Serve the bass fillets topped with the tomato scampi.",
            "In a large skillet, heat the garlic oil over medium-high heat. Add the garlic, shallots, and fennel seeds and cook, stirring frequently, until the shallots are translucent, about 2 minutes. Add the celery and capers and cook until the celery has softened, about 2 minutes. Add the wine to the pan and cook until it is reduced by half, about 1 minute. Add the vinegar, lemon zest and juice, tomatoes, and basil and cook for 1 to 2 minutes to incorporate the flavors and heat the tomatoes through.",
            "Serve the bass fillets topped with the tomato scampi."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b290b79a93d64c380b326e/6:4/w_274%2Ch_169/368670_striped-bass_1x1.jpg",
        "color": 6912987
    }
}