{
    "recipe": {
        "title": "Stuffed Baked Potatoes with Horseradish Cream ",
        "ingredients": [
            "6 large russet potatoes, rinsed, dried",
            "6 tablespoons plus 1/2 cup sour cream",
            "6 tablespoons (3/4 stick) butter",
            "4 tablespoons prepared white horseradish, drained",
            "2 tablespoons chopped fresh dill"
        ],
        "instructions": [
            "Preheat oven to 400° F. Pierce potatoes several times with fork. Place on oven rack; bake until crisp outside and cooked through, about 1 hour. Transfer to small baking sheet; cool 5 minutes. Cut off top third of potatoes. Scoop potato from bottoms into large bowl, leaving 1/4-inch-thick shell. Scoop potato from tops and add to same bowl; discard tops. Mash potato with 6 tablespoons sour cream, butter and 2 tablespoons horseradish. Season with salt and pepper. Spoon into potato shells, dividing equally. Mix 1/2 cup sour cream, 2 tablespoons horseradish and dill in small bowl. (Potatoes and sour cream topping can be made 1 day ahead. Cover and chill.) Preheat oven to 400° F. Place potatoes in baking pan and cook until heated through and golden brown, about 50 minutes. Spoon sour cream topping on each. Serve, passing remaining sour cream topping separately.",
            "Preheat oven to 400° F. Pierce potatoes several times with fork. Place on oven rack; bake until crisp outside and cooked through, about 1 hour. Transfer to small baking sheet; cool 5 minutes. Cut off top third of potatoes. Scoop potato from bottoms into large bowl, leaving 1/4-inch-thick shell. Scoop potato from tops and add to same bowl; discard tops.",
            "Mash potato with 6 tablespoons sour cream, butter and 2 tablespoons horseradish. Season with salt and pepper. Spoon into potato shells, dividing equally.",
            "Mix 1/2 cup sour cream, 2 tablespoons horseradish and dill in small bowl. (Potatoes and sour cream topping can be made 1 day ahead. Cover and chill.)",
            "Preheat oven to 400° F. Place potatoes in baking pan and cook until heated through and golden brown, about 50 minutes. Spoon sour cream topping on each. Serve, passing remaining sour cream topping separately."
        ],
        "picture_link": null
    }
}