{
    "recipe": {
        "title": "Stuffed Matzo Ball Soup with Chicken and Apples ",
        "ingredients": [
            "1 1/4 cups matzo meal",
            "2 tablespoons extra-virgin olive oil",
            "2 teaspoons fine sea salt",
            "1/4 teaspoon finely ground cubeb pepper (available from www.laboiteny.com) or black pepper",
            "1 tablespoon nigella or black-sesame seeds",
            "1 large egg",
            "1/4 pound ground chicken",
            "1/8 teaspoon ground fennel",
            "1/2 teaspoon orgeat (almond syrup), or 1 drop almond extract",
            "1/4 teaspoon fine sea salt",
            "1/8 teaspoon freshly ground black pepper",
            "1/3 cup olive oil or rendered chicken schmaltz",
            "2 Granny Smith apples, peeled and cut into 1-inch matchsticks",
            "2 Golden Delicious apples, peeled and cut into 1-inch matchsticks",
            "2 1/2 tablespoons Calvados (apple brandy)",
            "3 1/2 cups low-sodium chicken broth, for serving",
            "2 teaspoons nigella or black-sesame seeds, for garnish"
        ],
        "instructions": [
            "In a medium bowl, combine the matzo meal, oil, salt, pepper, and nigella seeds. Add 1 cup boiling water and mix well to incorporate. Add the egg, incorporating quickly to avoid partially cooking it. Using wet hands, form the dough into 12 equal-size disks and reserve.",
            "In a medium bowl, combine the chicken, fennel, orgeat or almond extract, salt, and pepper. Using wet hands, form the mixture into 12 equal-size balls. Place a ball of filling on a matzo-meal disk and pinch and roll the edges together to form a ball. Repeat with remaining filling and matzo-meal disks.",
            "Cook the matzo balls: Bring a large pot of salted water to a boil. Gently add the stuffed matzo balls, reduce heat, cover, and simmer until matzo balls are cooked through and float, 20 to 25 minutes.",
            "Bring a large pot of salted water to a boil. Gently add the stuffed matzo balls, reduce heat, cover, and simmer until matzo balls are cooked through and float, 20 to 25 minutes.",
            "Cook the apples: In a medium saucepan over medium-high heat, heat the oil. Add the apples and sauté until slightly softened, about 5 minutes. Add the Calvados and stir, scraping up any bits on the bottom of the pan, until most of the Calvados has evaporated, about 2 minutes. Remove apples from pan and reserve.",
            "In a medium saucepan over medium-high heat, heat the oil. Add the apples and sauté until slightly softened, about 5 minutes. Add the Calvados and stir, scraping up any bits on the bottom of the pan, until most of the Calvados has evaporated, about 2 minutes. Remove apples from pan and reserve.",
            "Assemble the soup: In a pot, heat the broth until just simmering. Divide the apples among four soup bowls, then ladle broth and matzo balls into each bowl. Garnish with nigella seeds before serving.",
            "In a pot, heat the broth until just simmering. Divide the apples among four soup bowls, then ladle broth and matzo balls into each bowl. Garnish with nigella seeds before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b87b397cbba01c0db7fa8d/6:4/w_274%2Ch_169/51251610_stuffed-matzoh-balls_1x1.jpg"
    }
}