{
    "recipe": {
        "title": "Stuffed Baby Bell Peppers ",
        "ingredients": [
            "1 medium onion, chopped",
            "2 anchovy fillets, rinsed, patted dry, and finely chopped",
            "2 tablespoons olive oil",
            "3/4 cup toasted bread crumbs",
            "1 cup whole-milk ricotta",
            "1/3 cup finely grated Parmigiano-Reggiano (1 oz)",
            "2 tablespoons drained capers, rinsed, patted dry, and chopped",
            "2 large eggs, lightly beaten",
            "3 tablespoons finely chopped fresh flat-leaf parsley",
            "1 1/2 lb baby red and yellow bell peppers* (2 inches in diameter; 24)",
            "1/2 cup water",
            "1 tablespoon olive oil"
        ],
        "instructions": [
            "Cook onion and anchovies in oil in a heavy skillet over moderate heat, stirring frequently, until onion is golden, about 8 minutes. (Anchovies will dissolve.) Transfer to a bowl and stir in bread crumbs, cheeses, capers, eggs, and parsley until combined well.",
            "Stuff and bake peppers: Preheat oven to 350°F. Cut tops from baby peppers (keep stems on tops) and reserve. Cut a very thin slice from bottom of each pepper so it can stand upright (don't worry if you make a hole in bottom). Scoop out and discard seeds, then divide filling among peppers. Cover with reserved tops and arrange peppers upright in an oiled baking dish. Add water to dish and drizzle peppers with oil. Bake, uncovered, in middle of oven until peppers are tender and filling is puffed, 50 to 60 minutes.",
            "Preheat oven to 350°F.",
            "Cut tops from baby peppers (keep stems on tops) and reserve. Cut a very thin slice from bottom of each pepper so it can stand upright (don't worry if you make a hole in bottom). Scoop out and discard seeds, then divide filling among peppers. Cover with reserved tops and arrange peppers upright in an oiled baking dish. Add water to dish and drizzle peppers with oil.",
            "Bake, uncovered, in middle of oven until peppers are tender and filling is puffed, 50 to 60 minutes.",
            "Available at specialty produce markets like Garden of Eden (212-255-4200), mail orders accepted.",
            "Available at specialty produce markets like Garden of Eden (212-255-4200), mail orders accepted.",
            "Available at specialty produce markets like Garden of Eden (212-255-4200), mail orders accepted."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea0a37b55306961bfee94/6:4/w_274%2Ch_169/106281.jpg",
        "color": 3047502
    }
}