{
    "recipe": {
        "title": "Stuffed Sliders Your Way ",
        "ingredients": [
            "3 pounds ground beef, turkey, lamb, or pork",
            "2 large eggs, lightly beaten",
            "2/3 cup grated Parmesan cheese",
            "1/2 cup chopped fresh parsley (or other fresh herbs; see Cooks' Notes)",
            "2 small garlic cloves, crushed with a garlic press",
            "6 ounces Cheddar, feta, Saga blue cheese, Gouda, Pepper Jack, or whatever cheese you're partial to, chilled and cut into 1/2-inch cubes",
            "30 (2-inch; a.k.a. party size) soft rolls, such as potato and brioche, or mini pitas",
            "lettuce, sliced tomatoes, coleslaw, pickles, sliced raw onion and/or sautéed golden brown onions (see Cooks' Notes), ketchup, barbecue sauce, and garlic yogurt sauce (see Cooks' Notes)"
        ],
        "instructions": [
            "Gently combine meat, eggs, cheese, parsley, garlic, 1 teaspoon salt and 1/2 teaspoon pepper with your hands. (Do not overmix).",
            "Form scant 1/4 cupfuls of meat mixture into about 30 meatballs. Push a cheese cube into center of each ball and encase meat around cheese, then slightly flatten each ball to a 2-inch diameter.",
            "Broiler directions: Preheat broiler. Put half of sliders on an oiled rack of a broiler pan and broil, turning over once, until just cooked through (no longer pink), 4 to 8 minutes total. Repeat with remaining sliders.",
            "Preheat broiler. Put half of sliders on an oiled rack of a broiler pan and broil, turning over once, until just cooked through (no longer pink), 4 to 8 minutes total. Repeat with remaining sliders.",
            "Grill directions: For easy entertaining, go with a gas grill. Preheat all burners on high, covered, 10 minutes, then adjust heat to medium-high. Grill sliders, in batches if necessary, turning once, until just cooked through, 4 to 8 minutes total.",
            "For easy entertaining, go with a gas grill. Preheat all burners on high, covered, 10 minutes, then adjust heat to medium-high. Grill sliders, in batches if necessary, turning once, until just cooked through, 4 to 8 minutes total.",
            "Make sliders with toppings and rolls.",
            "Make sliders with toppings and rolls."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b283df9a93d64c380b0e98/6:4/w_274%2Ch_169/369150_stuffed-sliders_1x1.jpg",
        "color": 10031424
    }
}