{
    "recipe": {
        "title": "Stuffed Sweet Potatoes with Beans and Guacamole ",
        "ingredients": [
            "2 medium sweet potatoes (about 9 ounces each)",
            "2 tablespoons melted virgin coconut or vegetable oil, divided",
            "1 teaspoon kosher salt, divided",
            "1/2 teaspoon cayenne pepper, divided",
            "1/2 teaspoon ground cumin, divided",
            "1 red onion, coarsely chopped",
            "2 garlic cloves, finely chopped, divided",
            "1 (15.5-ounce) can black beans, rinsed, drained",
            "3/4 cup vegetable broth",
            "1 ripe avocado",
            "3 tablespoons chopped cilantro, divided",
            "2 tablespoons fresh lime juice, divided",
            "2 cups baby spinach (about 2 ounces)",
            "1 ounce crumbled queso fresco (about 1/4 cup)",
            "Tortilla chips (optional; for serving)"
        ],
        "instructions": [
            "Preheat oven to 450°F. Cut potatoes in half lengthwise. Toss with 1 Tbsp. oil, 1/2 tsp. salt, 1/4 tsp. cayenne, and 1/4 tsp. cumin on a rimmed baking sheet. Arrange cut side up and roast until fork-tender, about 25 minutes. Meanwhile, heat remaining 1 Tbsp. oil in a medium skillet over medium. Add onion and half of garlic and cook, stirring, until onion starts to release moisture and turns translucent, 2–3 minutes. Add beans, broth, 1/4 tsp. salt, and remaining 1/4 tsp. cayenne and 1/4 tsp. cumin and cook until liquid is reduced and beans soften, about 10 minutes. Meanwhile, mash avocado and remaining garlic in a medium bowl with a fork until smooth. Stir in 2 Tbsp. cilantro, 1 Tbsp. lime juice, and remaining 1/4 tsp. salt. Add spinach and remaining 1 Tbsp. lime juice to bean mixture. Continue to cook until spinach wilts, about 30 seconds. Using the back of a spoon, gently push down in center of potato halves to create a divot. Spoon bean mixture into potato halves, then top evenly with 2 Tbsp. avocado mixture, quesco fresco, and remaining 1 Tbsp. cilantro. Serve with tortilla chips, if using, and remaining avocado dip alongside.",
            "Preheat oven to 450°F. Cut potatoes in half lengthwise. Toss with 1 Tbsp. oil, 1/2 tsp. salt, 1/4 tsp. cayenne, and 1/4 tsp. cumin on a rimmed baking sheet. Arrange cut side up and roast until fork-tender, about 25 minutes.",
            "Meanwhile, heat remaining 1 Tbsp. oil in a medium skillet over medium. Add onion and half of garlic and cook, stirring, until onion starts to release moisture and turns translucent, 2–3 minutes. Add beans, broth, 1/4 tsp. salt, and remaining 1/4 tsp. cayenne and 1/4 tsp. cumin and cook until liquid is reduced and beans soften, about 10 minutes.",
            "Meanwhile, mash avocado and remaining garlic in a medium bowl with a fork until smooth. Stir in 2 Tbsp. cilantro, 1 Tbsp. lime juice, and remaining 1/4 tsp. salt.",
            "Add spinach and remaining 1 Tbsp. lime juice to bean mixture. Continue to cook until spinach wilts, about 30 seconds.",
            "Using the back of a spoon, gently push down in center of potato halves to create a divot. Spoon bean mixture into potato halves, then top evenly with 2 Tbsp. avocado mixture, quesco fresco, and remaining 1 Tbsp. cilantro. Serve with tortilla chips, if using, and remaining avocado dip alongside.",
            "Do Ahead Potatoes and beans can be made 3 days ahead; store separately, cover, and chill. Reheat potatoes in oven and beans in skillet before serving.",
            "Potatoes and beans can be made 3 days ahead; store separately, cover, and chill. Reheat potatoes in oven and beans in skillet before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58bdb21192eece36cc1d3f7e/6:4/w_274%2Ch_169/_Stuffed-Sweet-Potatoes-03022017.jpg"
    }
}