{
    "recipe": {
        "title": "Stuffed Hamburger \"Swingers\" ",
        "ingredients": [
            "1 garlic clove, minced",
            "1/4 cup yellow onion, peeled and finely diced",
            "1/4 cup tomato, finely diced",
            "1/4 cup green pepper, finely diced",
            "1 teaspoon dried oregano",
            "salt and freshly ground black pepper to taste",
            "1 pound lean ground beef",
            "1 egg",
            "3 tablespoons extra-virgin olive oil",
            "2 large yellow onions, peeled and thinly sliced"
        ],
        "instructions": [
            "In a medium bowl, combine the garlic, diced onion, tomato, green bell pepper, and oregano. Add the salt and pepper, and mix well. Cover with plastic wrap and set aside. In a large bowl, combine the ground beef, egg, salt, and pepper. Shape into eight 4-inch round, flat patties. Place a spoonful of the vegetable filling in the center of one patty, top with a second patty, press down firmly, and shape into a round, carefully sealing the sides by pinching together. Repeat with the remaining patties. In a large nonstick skillet, heat the oil over medium-high heat and sauté the sliced onions until lightly brown. Transfer to a bowl and keep warm. Transfer to a bowl and keep warm. Brown the hamburgers for about 5 minutes on each side, or until cooked to medium; return the onions to the pan and heat. Serve immediately.",
            "In a medium bowl, combine the garlic, diced onion, tomato, green bell pepper, and oregano. Add the salt and pepper, and mix well. Cover with plastic wrap and set aside.",
            "In a large bowl, combine the ground beef, egg, salt, and pepper. Shape into eight 4-inch round, flat patties. Place a spoonful of the vegetable filling in the center of one patty, top with a second patty, press down firmly, and shape into a round, carefully sealing the sides by pinching together. Repeat with the remaining patties.",
            "In a large nonstick skillet, heat the oil over medium-high heat and sauté the sliced onions until lightly brown. Transfer to a bowl and keep warm. Transfer to a bowl and keep warm. Brown the hamburgers for about 5 minutes on each side, or until cooked to medium; return the onions to the pan and heat. Serve immediately."
        ],
        "picture_link": null
    }
}