{
    "recipe": {
        "title": "Stuffed Veal Breast with Spinach and Sun-Dried Tomatoes ",
        "ingredients": [
            "1 pound ground veal",
            "2 cups fresh breadcrumbs made from crustless French bread",
            "1 10-ounce package frozen chopped spinach, thawed, squeezed dry",
            "1 cup drained oil-packed sun-dried tomatoes, chopped",
            "2 large eggs",
            "3 tablespoons chopped fresh marjoram",
            "2 1/2 tablespoons minced garlic",
            "1 1/2 teaspoons salt",
            "1/2 teaspoon ground black pepper",
            "1/2 teaspoon ground nutmeg",
            "1 3 1/2- to 3 3/4-pound piece boneless veal breast, butterflied, pounded to 15 x 13-inch rectangle",
            "2 tablespoons olive oil",
            "6 cups coarsely chopped onions",
            "3 cups coarsely chopped carrots",
            "2 cups coarsely chopped celery",
            "1 750-ml bottle dry red wine",
            "3 1/2 cups (about) chicken stock or canned low-salt chicken broth",
            "1 14 1/2- to 16-ounce can diced tomatoes in juice"
        ],
        "instructions": [
            "Mix first 5 ingredients, 1 tablespoon marjoram, 1 tablespoon garlic, 1 1/2 teaspoons salt, 1/2 teaspoon pepper and nutmeg in large bowl to blend.",
            "Preheat oven to 400°F. Place veal breast, pounded side up, on work surface. Sprinkle lightly with salt and pepper. Form ground veal mixture into 8-inch-long, 3 1/2-inch-wide loaf. Place loaf atop breast about 3 inches from 1 long side. Fold short sides of breast over stuffing. Fold long side nearest stuffing over. Roll up, enclosing stuffing. Tie in several places with twine. Fasten each short end with toothpicks. (Can be made 8 hours ahead. Wrap in plastic; chill.)",
            "Sprinkle veal with salt and pepper. Heat 1 tablespoon oil in heavy large skillet over high heat. Add veal; sauté until brown on all sides, about 10 minutes. Transfer to large roasting pan. Add 1 tablespoon oil, onions, carrots and celery to skillet; sauté until golden, about 15 minutes. Transfer vegetables to pan with veal. Add wine, 2 cups stock, tomatoes with juices, 2 tablespoons marjoram and 1 1/2 tablespoons garlic to roasting pan.",
            "Roast veal until very tender, turning and basting with pan juices every 30 minutes and adding stock as needed to keep juices halfway up sides of veal, about 2 hours 30 minutes. Remove from oven. Transfer to platter; let stand 30 minutes. Remove twine. Slice veal. Transfer pan juices and vegetables to saucepan; rewarm. Season with salt and pepper. Spoon juices and vegetables around veal."
        ],
        "picture_link": null,
        "color": 14755133
    }
}