{
    "recipe": {
        "title": "Summertime Sōmen Noodles ",
        "ingredients": [
            "1 (9.5-ounce) package sōmen noodles",
            "1 large bowl filled with 1 to 2 cups ice and water",
            "Rice vinegar",
            "Reduced-sodium tamari soy sauce",
            "Sriracha sauce",
            "Katsuobushi (Japanese dried bonito flakes)",
            "Negi (green onions, thinly sliced on the bias)",
            "Furikake (Japanese seaweed seasoning)",
            "Arugula or your favorite leafy greens",
            "Kaiware sprouts (daikon radish sprouts)",
            "Gomashio (toasted, salted, crushed sesame seeds)",
            "Tofu cubes",
            "Avocado slices"
        ],
        "instructions": [
            "In a large pot of boiling water, cook the sōmen noodles as directed on the package. Drain the noodles and place them in a large bowl filled with ice and water to serve. Your sōmen noodles will be the highlight of the table, so serve them up in a gorgeous bowl. Serve family-style in the middle of your table. Using tongs or chopsticks, place the noodles into individual bowls, shaking off any residual water before serving. Add your choice of sauces and toppings. I usually top with a touch of shōyu and rice vinegar, and offer a variety of toppings— negi, katsuobushi, arugula, tofu, avocado slices, etc.",
            "In a large pot of boiling water, cook the sōmen noodles as directed on the package. Drain the noodles and place them in a large bowl filled with ice and water to serve. Your sōmen noodles will be the highlight of the table, so serve them up in a gorgeous bowl.",
            "Serve family-style in the middle of your table. Using tongs or chopsticks, place the noodles into individual bowls, shaking off any residual water before serving.",
            "Add your choice of sauces and toppings. I usually top with a touch of shōyu and rice vinegar, and offer a variety of toppings— negi, katsuobushi, arugula, tofu, avocado slices, etc."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b197f58591cd463d5983542/6:4/w_274%2Ch_169/summertime-somen-noodles-060618.jpg"
    }
}