{
    "recipe": {
        "title": "Summer Fruit Crisp ",
        "ingredients": [
            "3/4 cup oldfashioned oats+ 1/4 cup old-fashioned oats",
            "1/2 cup all-purpose flour",
            "1/4 cup light brown sugar",
            "1/2 teaspoon kosher salt",
            "1 stick cut-up chilled unsalted butter",
            "8 cups sliced stone fruit, berries, or pitted cherries",
            "1 cup sugar",
            "2 tablespoons cornstarch",
            "1 teaspoon finely grated lemon, lime, or orange zest",
            "2 tablespoons lemon, lime, or orange juice",
            "1 pinch of kosher salt",
            "unsweetened coconut flakes, sliced almonds, chopped pecans, or sunflower seeds",
            "Small amount of grated peeled ginger",
            "Lemon thyme, or a pinch of cinnamon"
        ],
        "instructions": [
            "Oat Topping: Pulse 3/4 cup oldfashioned oats, 1/2 cup all-purpose flour, 1/4 cup light brown sugar, and 1/2 teaspoon kosher salt in a food processor to blend. Pulse in 1 stick cut-up chilled unsalted butter until no dry spots remain. Transfer to a bowl and work in 1/4 cup old-fashioned oats with your fingers.",
            "Pulse 3/4 cup oldfashioned oats, 1/2 cup all-purpose flour, 1/4 cup light brown sugar, and 1/2 teaspoon kosher salt in a food processor to blend. Pulse in 1 stick cut-up chilled unsalted butter until no dry spots remain. Transfer to a bowl and work in 1/4 cup old-fashioned oats with your fingers.",
            "Assembly: Toss 8 cups sliced stone fruit, berries, or pitted cherries with 1 cup sugar, 2 tablespoons cornstarch, 1 teaspoon finely grated lemon, lime, or orange zest, 2 tablespoons lemon, lime, or orange juice, and a pinch of kosher salt. Transfer mixture to a 1 1/2 quart baking dish, scatter oat topping over mixture, place on a baking sheet, and bake at 375° until fruit juices are bubbling and topping is golden brown, 60–70 minutes. Transfer to a wire rack and let cool 1 hour.",
            "Toss 8 cups sliced stone fruit, berries, or pitted cherries with 1 cup sugar, 2 tablespoons cornstarch, 1 teaspoon finely grated lemon, lime, or orange zest, 2 tablespoons lemon, lime, or orange juice, and a pinch of kosher salt. Transfer mixture to a 1 1/2 quart baking dish, scatter oat topping over mixture, place on a baking sheet, and bake at 375° until fruit juices are bubbling and topping is golden brown, 60–70 minutes. Transfer to a wire rack and let cool 1 hour.",
            "The crumble: Try swapping in unsweetened coconut flakes, sliced almonds, chopped pecans, or sunflower seeds at the end for all or part of the 1/4 cup of oats.",
            "Try swapping in unsweetened coconut flakes, sliced almonds, chopped pecans, or sunflower seeds at the end for all or part of the 1/4 cup of oats.",
            "The filling: Mix in a little grated peeled ginger (great with cherries), lemon thyme (delicious with berries), or a pinch of cinnamon.",
            "Mix in a little grated peeled ginger (great with cherries), lemon thyme (delicious with berries), or a pinch of cinnamon."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac3c576529d92b2c03983e/6:4/w_274%2Ch_169/51236670_summer-fruit-crisp_1x1.jpg"
    }
}