{
    "recipe": {
        "title": "Summer Pizza with Salami, Zucchini, and Tomatoes ",
        "ingredients": [
            "5 Tbsp. extra-virgin olive oil, divided",
            "2 lb. store-bought pizza dough, room temperature",
            "2 cups whole-milk fresh ricotta (about 1 lb.)",
            "1 1/2 tsp. kosher salt, divided",
            "1 tsp. freshly ground black pepper, divided",
            "4 oz. thinly sliced soppressata",
            "1 medium shallot, finely chopped",
            "2 Tbsp. red wine vinegar",
            "2 medium zucchini (about 1 lb. total), thinly shaved lengthwise on a mandoline or with a vegetable peeler",
            "1 pint grape tomatoes, halved",
            "1 cup basil leaves"
        ],
        "instructions": [
            "Preheat oven to 425°F. Brush an 18x13\" rimmed baking pan with 1 Tbsp. oil. Gently stretch dough to a 16x12\" oval and place in prepared baking sheet, pressing dough into edges of pan. (If dough springs back, cover with plastic wrap and let rest 10 minutes before stretching again.) Brush dough with 1 Tbsp. oil, then bake until golden and dry, 15–18 minutes.",
            "Meanwhile, whisk ricotta, 1 Tbsp. oil, 1 tsp. salt, and 1/2 tsp. pepper in a medium bowl until mixture looks a little whipped and fluffy. (If your ricotta is on the drier side, add another tablespoonful of oil.)",
            "Spread ricotta mixture over crust, leaving about a 1/2\" margin on all sides. Top with a single layer of soppressata, overlapping slightly if needed. Bake pizza until ricotta mixture is golden and edges of soppressata are curled up and crisp, about 15 minutes.",
            "Whisk shallot, vinegar, and remaining 2 Tbsp. oil, 1/2 tsp. salt, and 1/2 tsp. pepper in a small bowl. Gently toss zucchini, tomatoes, and basil in a large bowl. Drizzle about one-third of the dressing over and toss again. Pile onto pizza with your hands. Drizzle remaining dressing over pizza and cut into slices."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b608b44147e630cca6a6d49/6:4/w_274%2Ch_169/Summer-Pizza-with-Zucchini-Salami-and-Tomatoes-recipe-25072018.jpg",
        "color": 2635233
    }
}