{
    "recipe": {
        "title": "Summer Bean Salad with Toasted Walnuts and Pecorino Fresco ",
        "ingredients": [
            "1 tablespoon minced shallot",
            "4 1/2 teaspoons Sherry wine vinegar",
            "1 teaspoon Dijon mustard",
            "1/4 cup extra-virgin olive oil",
            "1 tablespoon walnut oil",
            "8 ounces green beans, trimmed",
            "8 ounces yellow wax beans, trimmed",
            "8 ounces haricots verts, trimmed",
            "8 cups (packed) torn frisée leaves",
            "1/4 cup walnuts, toasted, chopped",
            "2 teaspoons fresh savory leaves or fresh thyme leaves",
            "2 ounces semi-firm sheep's-milk cheese (such as pecorino fresco), shaved with vegetable peeler",
            "Buy pecorino fresco at cheese shops and online at murrayscheese.com. Manchego cheese is a good substitute."
        ],
        "instructions": [
            "Whisk shallot, vinegar, and mustard in small bowl. Gradually whisk in both oils. Season dressing with salt and pepper. DO AHEAD:Can be made 1 day ahead. Cover; chill. Bring to room temperature and rewhisk before using salad.",
            "For salad: Cook green beans in large pot of boiling salted water just until crisp-tender, 3 to 4 minutes. Using slotted spoon, transfer beans to colander; rinse with cold water. Cook wax beans and haricots verts separately in same pot of boiling salted water, 3 to 4 minutes for wax beans and 2 to 3 minutes for haricots verts. Transfer to colander; rinse with cold water. DO AHEAD:Can be made 1 day ahead. Wrap green beans, wax beans, and haricots verts separately in paper towels. Enclose in resealable plastic bag and chill. Combine all beans and frisée in large bowl. Toss with dressing. Transfer salad to serving platter; sprinkle with walnuts, herbs, and pepper. Top with cheese.",
            "Cook green beans in large pot of boiling salted water just until crisp-tender, 3 to 4 minutes. Using slotted spoon, transfer beans to colander; rinse with cold water. Cook wax beans and haricots verts separately in same pot of boiling salted water, 3 to 4 minutes for wax beans and 2 to 3 minutes for haricots verts. Transfer to colander; rinse with cold water. DO AHEAD:Can be made 1 day ahead. Wrap green beans, wax beans, and haricots verts separately in paper towels. Enclose in resealable plastic bag and chill.",
            "Combine all beans and frisée in large bowl. Toss with dressing. Transfer salad to serving platter; sprinkle with walnuts, herbs, and pepper. Top with cheese."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3083b3edeef84363b844d/6:4/w_274%2Ch_169/360254_lamb-kebabs_1x1.jpg"
    }
}