{
    "recipe": {
        "title": "Sunchoke Soup with Pumpkin Seeds ",
        "ingredients": [
            "8 cups water",
            "1 1/2 teaspoons white wine vinegar",
            "2 pounds Jerusalem artichokes (also called sunchokes)*",
            "3 tablespoons butter",
            "1 cup chopped onion",
            "1 cup chopped leek (white and pale green parts only)",
            "2 garlic cloves, chopped",
            "7 cups (or more) vegetable broth",
            "1/2 cup heavy whipping cream",
            "Ground white pepper",
            "Shelled pumpkin seeds, toasted",
            "Pumpkin seed oil (optional)",
            "Sautéed chanterelle mushrooms (optional garnish)"
        ],
        "instructions": [
            "Mix 8 cups water and vinegar in large bowl. Working with 1 Jerusalem artichoke at a time, peel and place in vinegar water to prevent discoloration. Set aside. Melt butter in heavy large pot over medium heat. Add onion, leek, and garlic; sprinkle with salt and sauté until soft and translucent, stirring often, about 12 minutes. Drain artichokes; rinse well and drain again. Cut into 1-inch pieces. Add to onion mixture and sauté 5 minutes. Add 7 cups vegetable broth, increase heat to high, and bring to boil. Reduce heat to medium-low, cover, and simmer until artichokes are very tender, about 1 hour. Cool slightly. Working in batches, puree soup in blender until very smooth. Return to pot. Rewarm soup, adding more broth by 1/4 cupfuls if needed to thin. Stir in cream and season to taste with salt and white pepper. do ahead Can be made 1 day ahead. Cool, cover, and chill. Rewarm before continuing. Divide soup among bowls and garnish with toasted pumpkin seeds; top with a drizzle of pumpkin seed oil and some sautéed mushrooms, if desired. Tubers of a variety of sunflower; available in the produce section of some supermarkets and at farmers' markets.",
            "Mix 8 cups water and vinegar in large bowl. Working with 1 Jerusalem artichoke at a time, peel and place in vinegar water to prevent discoloration. Set aside.",
            "Melt butter in heavy large pot over medium heat. Add onion, leek, and garlic; sprinkle with salt and sauté until soft and translucent, stirring often, about 12 minutes. Drain artichokes; rinse well and drain again. Cut into 1-inch pieces. Add to onion mixture and sauté 5 minutes. Add 7 cups vegetable broth, increase heat to high, and bring to boil. Reduce heat to medium-low, cover, and simmer until artichokes are very tender, about 1 hour. Cool slightly.",
            "Working in batches, puree soup in blender until very smooth. Return to pot. Rewarm soup, adding more broth by 1/4 cupfuls if needed to thin. Stir in cream and season to taste with salt and white pepper. do ahead Can be made 1 day ahead. Cool, cover, and chill. Rewarm before continuing. Divide soup among bowls and garnish with toasted pumpkin seeds; top with a drizzle of pumpkin seed oil and some sautéed mushrooms, if desired.",
            "Tubers of a variety of sunflower; available in the produce section of some supermarkets and at farmers' markets.",
            "Tubers of a variety of sunflower; available in the produce section of some supermarkets and at farmers' markets."
        ],
        "picture_link": null
    }
}