{
    "recipe": {
        "title": "Sweet Potato Bowls with Spiced Lamb and Mushrooms ",
        "ingredients": [
            "1 tsp. kosher salt, divided, plus more",
            "1 large sweet potato (about 1 lb.), halved lengthwise",
            "1/2 fennel bulb (about 6 oz.), thinly sliced, plus fronds (for serving; optional)",
            "1/2 small red onion, thinly sliced",
            "1/4 cup apple cider, coconut, or unseasoned rice vinegar",
            "3 Tbsp. extra-virgin olive oil, divided",
            "1/2 lb. ground lamb",
            "1 tsp. ground cumin",
            "1/2 tsp. ground cinnamon",
            "1 tsp. Aleppo-style pepper, plus more for serving",
            "8 oz. wild mushrooms (such as oyster or shiitake), sliced into 1/4\" slices",
            "1/2 cup plain whole-milk yogurt",
            "2 Tbsp. fresh lemon juice",
            "1/4 cup mint leaves"
        ],
        "instructions": [
            "Fill a large pot with about 1\" water; season with a big pinch of salt. Set a steamer basket in pot. Cover pot and bring water to a boil. Add potato, cover, and steam until fork-tender, 20–25 minutes.",
            "Meanwhile, toss sliced fennel, onion, vinegar, and 1/4 tsp. salt in a medium bowl. Let sit, tossing occasionally, at least 10 minutes and up to 30 minutes.",
            "Heat 2 Tbsp. oil in a large skillet over medium-high. Add lamb, cumin, cinnamon, 1 tsp. pepper, and 1/2 tsp. salt and press into an even layer. Cook, undisturbed, until well browned on the bottom, about 4 minutes. Break up into pieces with a spatula and continue to cook, stirring occasionally, until browned, 1–2 minutes. Push mixture to one side of skillet and add mushrooms in an even layer; season with salt. Cook, undisturbed, until beginning to brown and soften, 3 minutes, then stir together with lamb mixture. Continue to cook, stirring occasionally, until mushrooms are golden brown, about 2 minutes more.",
            "Whisk yogurt, lemon juice, and remaining 1 Tbsp. oil and 1/4 tsp. salt in a small bowl.",
            "Divide potato halves between bowls and mash slightly with a fork. Top with yogurt sauce and mushroom mixture. Lift fennel and onion out of vinegar with your hands and scatter over bowls; discard vinegar. Top with mint, fennel fronds (if using), and pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c891cb1c0596b6e36add2c6/6:4/w_274%2Ch_169/sweet-potato-bowls-with-spiced-lamb-and-mushrooms-recipe-BA-031319.jpg"
    }
}