{
    "recipe": {
        "title": "Sweet Crepes with Jam ",
        "ingredients": [
            "2 cups milk (do not use low-fat or nonfat)",
            "2 large eggs",
            "1/2 cup club soda",
            "1/4 cup sugar",
            "1 tablespoon dark rum",
            "1 teaspoon vanilla extract",
            "1/4 teaspoon salt",
            "2 cups all purpose flour",
            "1/4 cup (1/2 stick) unsalted butter, melted, slightly cooled",
            "1 tablespoon grated lemon or orange peel",
            "Vegetable oil",
            "1 cup (about) cherry or apricot jam",
            "Powdered sugar"
        ],
        "instructions": [
            "Combine milk, eggs, club soda, sugar, dark rum, vanilla extract and salt in large bowl. Whisk until sugar dissolves. Gradually sift in flour, whisking until blended. Stir in melted butter and lemon peel. Preheat oven to 250°F. Brush 6- to 7-inch-diameter crêpe pan lightly with vegetable oil and heat over medium-high heat. Pour scant 1/4 cup batter into pan, tilting to coat bottom thinly; return any excess batter to bowl. Cook until crêpe is brown, about 2 minutes. Carefully turn over and cook until crêpe is light brown in spots, about 30 seconds. Transfer crêpe to baking sheet. Place in oven. Repeat with remaining batter, lightly brushing pan with vegetable oil before pouring in batter for each crêpe. Spread 1 tablespoon jam over each crêpe; fold crêpe in half, then fold in half again, forming triangle. Sprinkle with powdered sugar and serve warm.",
            "Combine milk, eggs, club soda, sugar, dark rum, vanilla extract and salt in large bowl. Whisk until sugar dissolves. Gradually sift in flour, whisking until blended. Stir in melted butter and lemon peel.",
            "Preheat oven to 250°F. Brush 6- to 7-inch-diameter crêpe pan lightly with vegetable oil and heat over medium-high heat. Pour scant 1/4 cup batter into pan, tilting to coat bottom thinly; return any excess batter to bowl. Cook until crêpe is brown, about 2 minutes. Carefully turn over and cook until crêpe is light brown in spots, about 30 seconds. Transfer crêpe to baking sheet. Place in oven. Repeat with remaining batter, lightly brushing pan with vegetable oil before pouring in batter for each crêpe.",
            "Spread 1 tablespoon jam over each crêpe; fold crêpe in half, then fold in half again, forming triangle. Sprinkle with powdered sugar and serve warm."
        ],
        "picture_link": null
    }
}