{
    "recipe": {
        "title": "Sweet 'n' Spicy Sriracha-Glazed Salmon ",
        "ingredients": [
            "1/4 cup reduced-sodium soy sauce (or tamari for gluten-free)",
            "2 tablespoons honey",
            "1 tablespoon rice vinegar",
            "1 tablespoon Sriracha sauce (or to taste)",
            "1 tablespoon grated fresh ginger",
            "1 tablespoon minced garlic",
            "1 pound wild salmon fillet, cut into 4 (4-ounce) pieces",
            "1 1/2 teaspoons sesame oil",
            "2 tablespoons finely chopped scallions, for garnish"
        ],
        "instructions": [
            "In a 1-gallon zip-top plastic bag, combine the soy sauce, honey, vinegar, Sriracha, ginger, and garlic. Add the salmon, toss to coat evenly, and refrigerate for at least 1 hour, or up to 8 hours, turning the fish once. Remove the salmon from the bag, reserving the marinade. Heat a large sauté pan over medium-high heat and add the sesame oil. Rotate the pan to coat the bottom evenly and add the salmon. Cook until one side of the fish is browned, about 2 minutes. Flip the salmon and cook until the other side browns, 2 more minutes. Reduce the heat to low and pour in the reserved marinade. Cover and cook until the fish is cooked through, 4 to 5 minutes. Place a piece of salmon on each of 4 serving plates and sprinkle with the scallions.",
            "In a 1-gallon zip-top plastic bag, combine the soy sauce, honey, vinegar, Sriracha, ginger, and garlic. Add the salmon, toss to coat evenly, and refrigerate for at least 1 hour, or up to 8 hours, turning the fish once.",
            "Remove the salmon from the bag, reserving the marinade. Heat a large sauté pan over medium-high heat and add the sesame oil. Rotate the pan to coat the bottom evenly and add the salmon. Cook until one side of the fish is browned, about 2 minutes. Flip the salmon and cook until the other side browns, 2 more minutes. Reduce the heat to low and pour in the reserved marinade. Cover and cook until the fish is cooked through, 4 to 5 minutes.",
            "Place a piece of salmon on each of 4 serving plates and sprinkle with the scallions."
        ],
        "picture_link": "https://assets.epicurious.com/photos/555a0e57644d45515b754296/6:4/w_274%2Ch_169/51252440_sriracha-glazed-salmon_1x1.jpg"
    }
}