{
    "recipe": {
        "title": "Sweet-and-Sour Halibut ",
        "ingredients": [
            "1/4 cup water",
            "1 1/2 tablespoons red-wine vinegar",
            "1 whole scallion, sliced thin, plus the green parts of 2 scallions, sliced thin",
            "1 1/2 teaspoons minced peeled fresh gingerroot",
            "1 1/2 teaspoons sugar",
            "1 tablespoon soy sauce",
            "1 tablespoon ketchup",
            "1/4 teaspoon Asian (toasted) sesame oil",
            "1 teaspoon cornstarch dissolved in 2 tablespoons water",
            "a 1-inch-thick halibut steak (about 1 pound), the skin and bone discarded and the fish cut into 3/4-inch pieces",
            "all-purpose flour seasoned with salt and pepper for dredging the fish",
            "vegetable oil for frying the fish",
            "cooked rice as a accompaniment"
        ],
        "instructions": [
            "In a saucepan simmer the water and the vinegar with the sliced whole scallion, the gingerroot, the sugar, the soy sauce, and the ketchup, stirring occasionally, for 5 minutes, add the sesame oil and the cornstarch mixture, stirred, and simmer the sauce, stirring, for 2 minutes. Keep the sauce warm, covered. In a bag shake the halibut in the flour, transfer it to a large sieve or colander, and shake it to remove the excess. In a large deep skillet heat 1/4 inch of the vegetable oil over moderately high heat until it is hot but not smoking and in it fry the halibut in 2 batches, turning it, for 2 to 3 minutes, or until it is cooked through, transferring it as it is cooked with a slotted spoon to paper towels to drain. Add the halibut to the sauce, stirring to coat it well, and serve it over the rice and sprinkle with the scallion greens.",
            "In a saucepan simmer the water and the vinegar with the sliced whole scallion, the gingerroot, the sugar, the soy sauce, and the ketchup, stirring occasionally, for 5 minutes, add the sesame oil and the cornstarch mixture, stirred, and simmer the sauce, stirring, for 2 minutes. Keep the sauce warm, covered.",
            "In a bag shake the halibut in the flour, transfer it to a large sieve or colander, and shake it to remove the excess. In a large deep skillet heat 1/4 inch of the vegetable oil over moderately high heat until it is hot but not smoking and in it fry the halibut in 2 batches, turning it, for 2 to 3 minutes, or until it is cooked through, transferring it as it is cooked with a slotted spoon to paper towels to drain. Add the halibut to the sauce, stirring to coat it well, and serve it over the rice and sprinkle with the scallion greens."
        ],
        "picture_link": null
    }
}