{
    "recipe": {
        "title": "Sweet and Spicy Bacon Kebabs with Scallion-Ginger Relish ",
        "ingredients": [
            "6 scallions, thinly sliced",
            "1 serrano chile, thinly sliced",
            "1 tablespoon fresh lime juice",
            "1 teaspoon toasted sesame oil",
            "1/2 teaspoon finely grated peeled ginger",
            "1/2 teaspoon light brown sugar",
            "Kosher salt",
            "Vegetable oil (for grill)",
            "2 tablespoons honey",
            "2 tablespoons sambal oelek",
            "1 tablespoon unseasoned rice vinegar",
            "1 teaspoon Sriracha",
            "1/2 pound thick-cut bacon",
            "Lime wedges (for serving)",
            "8 (8–12-inch-long) metal skewers"
        ],
        "instructions": [
            "Toss scallions, chile, lime juice, oil, ginger, and brown sugar in a medium bowl to combine; season with salt.",
            "Make the bacon kebabs: Prepare a grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Oil grates. Combine honey, sambal oelek, vinegar, and Sriracha in a small bowl; set glaze aside. Thread bacon onto 6–8 skewers, folding back and forth in accordion style, and grill over indirect heat, turning every minute or so, until browned and crisp, 10–12 minutes. Baste with reserved glaze, turning every 30 seconds or so, until lacquered and slightly sticky, about 3 minutes (move to an even cooler spot if needed to keep glaze from scorching). Serve bacon with relish and lime wedges.",
            "Prepare a grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Oil grates. Combine honey, sambal oelek, vinegar, and Sriracha in a small bowl; set glaze aside.",
            "Thread bacon onto 6–8 skewers, folding back and forth in accordion style, and grill over indirect heat, turning every minute or so, until browned and crisp, 10–12 minutes. Baste with reserved glaze, turning every 30 seconds or so, until lacquered and slightly sticky, about 3 minutes (move to an even cooler spot if needed to keep glaze from scorching). Serve bacon with relish and lime wedges.",
            "Do Ahead Glaze can be made 1 week ahead. Cover and chill.",
            "Glaze can be made 1 week ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57605c1f42e4a5ed66d1df2c/6:4/w_274%2Ch_169/Sweet-and-Spicy-Bacon-With-Scallion%E2%80%93Ginger-Relish.jpg"
    }
}