{
    "recipe": {
        "title": "Sweet Lavender Scones ",
        "ingredients": [
            "3 cups all-purpose flour plus more for surface",
            "3/4 cup granulated sugar",
            "1 tablespoon baking powder",
            "1 teaspoon dried lavender buds",
            "1 teaspoon kosher salt",
            "1/2 teaspoon baking soda",
            "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/4\" cubes",
            "1 cup plus 2 tablespoons buttermilk",
            "2 teaspoons finely grated lemon zest",
            "1 teaspoon vanilla extract",
            "2 tablespoons sanding or granulated sugar",
            "1 1/2 cups store-bought lemon curd",
            "Ingredient info: Dried lavender buds (culinary lavender) are available at some supermarkets and natural foods stores."
        ],
        "instructions": [
            "Arrange racks in upper and lower thirds of oven; preheat to 425°F. Line 2 baking sheets with parchment paper. Whisk 3 cups flour and next 5 ingredients in a large bowl. Add butter; rub in with your fingers until mixture resembles coarse meal. Whisk 1 cup buttermilk, zest, and vanilla in a small bowl. Add wet ingredients to dry ingredients. Stir until shaggy dough forms. Transfer to a lightly floured surface; knead until dough forms, about 5 turns. Pat into a 10x6\" rectangle. Halve dough lengthwise. Cut each half crosswise into 4 squares. Cut each square diagonally in half into 2 triangles. Divide between baking sheets. Brush with 2 tablespoons buttermilk. Sprinkle with sanding sugar. Bake until scones are golden and a tester inserted into the center comes out clean, 13-15 minutes. Transfer to wire racks; let cool. Serve warm or at room temperature with lemon curd.",
            "Arrange racks in upper and lower thirds of oven; preheat to 425°F. Line 2 baking sheets with parchment paper. Whisk 3 cups flour and next 5 ingredients in a large bowl. Add butter; rub in with your fingers until mixture resembles coarse meal.",
            "Whisk 1 cup buttermilk, zest, and vanilla in a small bowl. Add wet ingredients to dry ingredients. Stir until shaggy dough forms.",
            "Transfer to a lightly floured surface; knead until dough forms, about 5 turns. Pat into a 10x6\" rectangle. Halve dough lengthwise. Cut each half crosswise into 4 squares. Cut each square diagonally in half into 2 triangles. Divide between baking sheets. Brush with 2 tablespoons buttermilk. Sprinkle with sanding sugar.",
            "Bake until scones are golden and a tester inserted into the center comes out clean, 13-15 minutes. Transfer to wire racks; let cool.",
            "Serve warm or at room temperature with lemon curd."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b17a2f1cc76a014cfb0993/6:4/w_274%2Ch_169/395443_lavender-scones_1x1.jpg"
    }
}