{
    "recipe": {
        "title": "Sweet and Buttery Loaf ",
        "ingredients": [
            "1 teaspoon dry yeast",
            "1/4 cup (60ml) warm water",
            "2 2/3 cups (400g) plain (all-purpose) flour, plus more for dusting",
            "175g (about 12 1/3 tablespoons) unsalted butter, chopped; plus 25g (about 1 3/4 tablespoons), melted; and more to serve",
            "1/3 cup (75g) caster (superfine) sugar",
            "2 egg yolks",
            "1/2 cup (125ml) buttermilk",
            "1 teaspoon vanilla extract",
            "1/2 teaspoon table salt"
        ],
        "instructions": [
            "Place the yeast, water and 1 tablespoon of the flour in a small bowl. Mix to combine and set aside.",
            "Place the chopped butter and sugar in the bowl of an electric mixer and beat on low speed until combined.",
            "Increase the speed to medium and beat for 8 minutes or until pale and creamy.",
            "Scrape down the sides of the bowl and add the egg yolks. Beat until well combined.",
            "Reduce the speed to low and gradually add the buttermilk, vanilla, salt, the remaining flour and the yeast mixture and beat until combined.",
            "Scrape down the sides of the bowl. Beat for a further 8–10 minutes or until the dough is smooth.",
            "Turn the dough out onto a lightly floured surface and, kneading gently, bring together.",
            "Transfer to a lightly greased bowl and cover with plastic wrap. Set aside in a warm place for 2–3 hours or until the dough has doubled in size.",
            "Brush a 10cm x 20cm (2-liter/2-quart-capacity) loaf tin with half the melted butter. Turn the dough out onto a lightly floured surface. Divide the dough into 4 equal pieces and shape into rounds. Arrange in the prepared tin, cover with plastic wrap and set aside in a warm place for 1–2 hours or until doubled in size.",
            "Preheat oven to 180°C (350°F). Using kitchen scissors, snip lengthways down the center of the dough in the tin to create 8 portions. Brush the dough with the remaining butter and bake for 30–35 minutes or until golden. Pull the loaf apart and spread with extra butter to serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a25b984a1b77660318fd529/6:4/w_274%2Ch_169/sweet-and-buttery-loaf-donna-hay-recipe-112917.jpg",
        "color": 9127209
    }
}