{
    "recipe": {
        "title": "Sweet Potato and Poblano Salad with Honey and Rosemary ",
        "ingredients": [
            "2 tablespoons honey",
            "1 1/2 tablespoons white wine vinegar",
            "1 tablespoon chopped fresh rosemary",
            "1 tablespoon minced shallot (about 1 small)",
            "2 teaspoons Dijon mustard",
            "Dash of Worcestershire sauce",
            "1/4 cup olive oil",
            "2 1/2 pounds red-skinned sweet potatoes (yams), peeled, quartered lengthwise",
            "Canola oil or vegetable oil (for brushing)",
            "2 fresh poblano chiles (about 8 ounces total),* seeded, diced",
            "1/4 cup green onions, thinly sliced diagonally (about 2)",
            "1/4 cup chopped fresh Italian parsley"
        ],
        "instructions": [
            "Whisk first 6 ingredients in small bowl. Gradually whisk in olive oil. Season to taste with salt and pepper. Cook sweet potatoes in large saucepan of boiling salted water until just barely tender, about 6 minutes. Drain; run under cold water to cool. Cover and chill at least 1 hour and up to 1 day. Preheat barbecue (high heat). Brush potato wedges with canola oil. Sprinkle with salt and pepper. Grill potatoes until grill marks appear, about 2 minutes per side. Transfer potatoes to work surface. Cut crosswise into 1-inch pieces. Place potatoes, poblanos, green onions, and parsley in large bowl. Drizzle dressing over; toss to coat. Season to taste with salt and pepper. Serve warm or at room temperature. DO AHEAD: Can be made 1 day ahead. Cover and chill. Bring to room temperature before serving.",
            "Whisk first 6 ingredients in small bowl. Gradually whisk in olive oil. Season to taste with salt and pepper.",
            "Cook sweet potatoes in large saucepan of boiling salted water until just barely tender, about 6 minutes. Drain; run under cold water to cool. Cover and chill at least 1 hour and up to 1 day.",
            "Preheat barbecue (high heat). Brush potato wedges with canola oil. Sprinkle with salt and pepper. Grill potatoes until grill marks appear, about 2 minutes per side. Transfer potatoes to work surface. Cut crosswise into 1-inch pieces. Place potatoes, poblanos, green onions, and parsley in large bowl. Drizzle dressing over; toss to coat. Season to taste with salt and pepper. Serve warm or at room temperature. DO AHEAD: Can be made 1 day ahead. Cover and chill. Bring to room temperature before serving.",
            "Often called pasillas; available at some supermarkets and at specialty foods stores and Latin markets.",
            "Often called pasillas; available at some supermarkets and at specialty foods stores and Latin markets.",
            "Often called pasillas; available at some supermarkets and at specialty foods stores and Latin markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a5b56a59cdb91b5ff580/6:4/w_274%2Ch_169/353851_hires.jpg"
    }
}