{
    "recipe": {
        "title": "Sweet and Chunky Apple Butter ",
        "ingredients": [
            "2 pounds (1 kg) McIntosh apples, peeled and cored (6 large apples)",
            "2 pounds (1 kg) Granny Smith apples, peeled and cored (4 large apples)",
            "1 cup (250 mL) apple cider",
            "2 cups (500 mL) granulated sugar",
            "2 tablespoons (25 mL) lemon juice"
        ],
        "instructions": [
            "1. Cut McIntosh apples into 1-inch (2.5 cm) pieces. Cut Granny Smith apples into smaller dice. 2. Combine apples and cider in a very large stainless steel or enamel saucepan. Bring to a boil over medium-high heat, stirring occasionally. Reduce heat and boil gently for 20 minutes or until mixture is reduced by half. 3. Stir in sugar and lemon juice. Return to a boil, reduce heat, and boil gently for about 25 minutes or until mixture is very thick. There should still be some tender apple chunks remaining. Remove from heat. 4. Ladle into sterilized jars and process as directed for Shorter Time Processing Procedure .",
            "1. Cut McIntosh apples into 1-inch (2.5 cm) pieces. Cut Granny Smith apples into smaller dice.",
            "2. Combine apples and cider in a very large stainless steel or enamel saucepan. Bring to a boil over medium-high heat, stirring occasionally. Reduce heat and boil gently for 20 minutes or until mixture is reduced by half.",
            "3. Stir in sugar and lemon juice. Return to a boil, reduce heat, and boil gently for about 25 minutes or until mixture is very thick. There should still be some tender apple chunks remaining. Remove from heat.",
            "4. Ladle into sterilized jars and process as directed for Shorter Time Processing Procedure .",
            "Variation: Spiced Apple Butter Add 2 tsp (10 mL) ground cinnamon and 1/2 tsp (2 mL) each ground cloves and allspice with the sugar.",
            "Add 2 tsp (10 mL) ground cinnamon and 1/2 tsp (2 mL) each ground cloves and allspice with the sugar."
        ],
        "picture_link": null
    }
}