{
    "recipe": {
        "title": "Sweet and Sour Cherry and Buckwheat Crumble ",
        "ingredients": [
            "2 10-ounce bags frozen sweet cherries, thawed",
            "1 24-ounce jar pitted sour cherries in light syrup, drained",
            "1/4 cup sugar",
            "2 tablespoons red wine vinegar",
            "1 tablespoon cornstarch",
            "1/3 cup unsalted, roasted sunflower seeds",
            "1/4 cup buckwheat flour",
            "1/4 cup toasted sesame seeds",
            "2 tablespoons flaxseeds",
            "1 tablespoon cornstarch",
            "1/4 teaspoon kosher salt",
            "3 tablespoons sugar, divided",
            "1/4 cup (1/2 stick) chilled unsalted butter, cut into pieces, or virgin coconut oil"
        ],
        "instructions": [
            "Preheat oven to 350°F. Toss cherries, sugar, vinegar, and cornstarch in a large bowl; transfer to a shallow 1.5-quart baking dish.",
            "For topping and assembly: Combine sunflower seeds, buckwheat flour, sesame seeds, flaxseeds, cornstarch, salt, and 2 tablespoons sugar in a medium bowl. Using your fingers, work butter into seed mixture until it comes together. Break up into small clumps and scatter over fruit; sprinkle remaining 1 tablespoon sugar over. Bake crumble until topping is golden brown and fruit is bubbling and syrupy, 65–75 minutes. DO AHEAD: Unbaked topping can be made 1 day ahead. Cover and chill.",
            "Combine sunflower seeds, buckwheat flour, sesame seeds, flaxseeds, cornstarch, salt, and 2 tablespoons sugar in a medium bowl. Using your fingers, work butter into seed mixture until it comes together. Break up into small clumps and scatter over fruit; sprinkle remaining 1 tablespoon sugar over.",
            "Bake crumble until topping is golden brown and fruit is bubbling and syrupy, 65–75 minutes.",
            "DO AHEAD: Unbaked topping can be made 1 day ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560c19f65c8f991910df1a9f/6:4/w_274%2Ch_169/51210530_hires.jpg",
        "color": 12446208
    }
}