{
    "recipe": {
        "title": "Sweet-and-Spicy Ribs ",
        "ingredients": [
            "3/4 cup (packed) light brown sugar",
            "1/4 cup smoked paprika",
            "2 tablespoons cayenne pepper",
            "2 tablespoons garlic powder",
            "3 tablespoons kosher salt, plus more",
            "2 St. Louis-style pork ribs (3–4 pounds each)",
            "1/2 cup (1 stick) unsalted butter",
            "1/2 cup apple cider vinegar",
            "Vegetable oil"
        ],
        "instructions": [
            "Preheat oven to 325°F. Combine brown sugar, paprika, cayenne, garlic powder, and 3 tablespoons salt in a small bowl; set aside 1/4 cup spice mixture. Pat ribs dry with paper towels and rub with remaining spice mixture, massaging into crevices. Wrap each rack in a double layer of foil, crimping edges to seal tightly. Place each foil packet on a rimmed baking sheet and bake until meat is fork-tender at the thickest part but not falling off the bone, 2–3 hours. Let cool. Tear open a corner of each foil packet and carefully pour juices from ribs into a large heatproof measuring cup. Let juices settle, then spoon fat from surface and discard. Heat butter in a medium saucepan over medium, stirring often, until it foams, then browns (do not burn), 5–8 minutes. Add juices from ribs and 1/4 cup reserved spice mixture and bring to a simmer. Cook until reduced by one-third, 15–20 minutes. Remove sauce from heat, add vinegar, and season with salt. Prepare grill for medium-high heat; oil grate. Remove ribs from foil and grill, basting with sauce and turning occasionally, until charred in spots, 5–7 minutes. Transfer to a cutting board and let rest 10 minutes. Slice between ribs and serve with remaining sauce.",
            "Preheat oven to 325°F. Combine brown sugar, paprika, cayenne, garlic powder, and 3 tablespoons salt in a small bowl; set aside 1/4 cup spice mixture.",
            "Pat ribs dry with paper towels and rub with remaining spice mixture, massaging into crevices. Wrap each rack in a double layer of foil, crimping edges to seal tightly. Place each foil packet on a rimmed baking sheet and bake until meat is fork-tender at the thickest part but not falling off the bone, 2–3 hours. Let cool.",
            "Tear open a corner of each foil packet and carefully pour juices from ribs into a large heatproof measuring cup. Let juices settle, then spoon fat from surface and discard.",
            "Heat butter in a medium saucepan over medium, stirring often, until it foams, then browns (do not burn), 5–8 minutes. Add juices from ribs and 1/4 cup reserved spice mixture and bring to a simmer. Cook until reduced by one-third, 15–20 minutes. Remove sauce from heat, add vinegar, and season with salt.",
            "Prepare grill for medium-high heat; oil grate. Remove ribs from foil and grill, basting with sauce and turning occasionally, until charred in spots, 5–7 minutes. Transfer to a cutting board and let rest 10 minutes. Slice between ribs and serve with remaining sauce.",
            "Do Ahead Ribs can be baked 1 day ahead; let cool in foil, then chill. Bring to room temperature before grilling. Sauce can be made 1 day ahead; cover and chill. Reheat over low.",
            "Ribs can be baked 1 day ahead; let cool in foil, then chill. Bring to room temperature before grilling. Sauce can be made 1 day ahead; cover and chill. Reheat over low."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5580666b74cbe9ed7c20c4df/6:4/w_274%2Ch_169/56389655_sweet-spicy-ribs_1x1.jpg"
    }
}