{
    "recipe": {
        "title": "Sweet-and-Sour Chicken Thighs with Carrots ",
        "ingredients": [
            "8 small chicken thighs with skin and bone (2 1/2 to 2 3/4 lb total), trimmed of excess fat",
            "2 teaspoons salt",
            "1 1/4 teaspoons paprika",
            "3/4 teaspoon cinnamon",
            "1/2 teaspoon black pepper",
            "1 1/2 tablespoons olive oil",
            "1 large onion, halved lengthwise, then cut lengthwise into1/4-inch-wide strips",
            "1 lb carrots (6 medium), cut diagonally into 1-inch pieces",
            "2 tablespoons minced garlic",
            "1/2 cup water",
            "1/4 cup fresh lemon juice",
            "2 tablespoons mild honey",
            "1 tablespoon finely chopped fresh flat-leaf parsley",
            "1 tablespoon finely chopped fresh cilantro"
        ],
        "instructions": [
            "Pat chicken dry. Stir together 1 1/2 teaspoons salt with paprika, cinnamon, and pepper and rub onto chicken.",
            "Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then brown chicken in 2 batches, turning over once, about 10 minutes per batch. Transfer chicken as browned to a plate.",
            "Discard all but 3 tablespoons fat from skillet, then add onion and carrots. Sprinkle with remaining 1/2 teaspoon salt and pepper to taste and cook over moderate heat, stirring occasionally, until onion is softened and beginning to brown, 8 to 10 minutes. Add garlic and cook, stirring occasionally, 1 minute.",
            "Return chicken, skin sides up, to skillet, nestling it into vegetables. Stir together water, lemon juice, and honey until blended and add to skillet, then cook over moderately low heat, covered, until chicken is cooked through and carrots are tender, 25 to 30 minutes. If necessary, skim fat from sauce, then add salt to taste. Sprinkle with herbs just before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de540f9a84192308a7ae5/6:4/w_274%2Ch_169/231790.jpg"
    }
}