{
    "recipe": {
        "title": "Sweet Potato-Pork Belly Hash ",
        "ingredients": [
            "1 pound fresh, skin-on pork belly",
            "Kosher salt, freshly ground pepper",
            "1 large sprig thyme",
            "4 garlic cloves, smashed",
            "3 cups low-salt chicken stock",
            "3 tablespoons extra-virgin olive oil, divided",
            "2 pounds red-skinned sweet potatoes, peeled, cut into 3/4\" cubes",
            "3 large shallots, chopped",
            "2 tablespoons Banyuls vinegar or red wine vinegar",
            "2 teaspoons pure maple syrup",
            "4 poached eggs (optional)"
        ],
        "instructions": [
            "Preheat oven to 275°F. Season pork belly generously with salt and pepper. Place in a large ovenproof saucepan. Add thyme and garlic. Pour stock over. Bring to a simmer over low heat, cover tightly, and braise in oven until tender, about 3 hours. Uncover; let cool. Transfer pork belly to a 9\" glass pie dish. Place another 9\" glass pie dish on top of pork belly. Weight with a 15-ounce canned good. Chill overnight.",
            "Remove skin from pork belly. Cut meat into 1/2\" cubes. Heat 1 tablespoon oil in a large cast-iron skillet over medium-high heat. Add pork and sauté until browned on all sides, about 4 minutes. Using a slotted spoon, transfer pork to a medium bowl. Season potatoes with salt and pepper. Add to same skillet; sauté until golden brown, about 10 minutes. Using slotted spoon, transfer to bowl with pork. Add 2 tablespoons oil and shallots to skillet; sauté over medium heat until golden brown, 3-4 minutes. Return potatoes and pork with any accumulated juices to pan. Drizzle vinegar and syrup over; stir to coat. Cook, stirring occasionally, until heated through, about 2 minutes. Serve with poached eggs if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56043a92968c2fa94dc98ac5/6:4/w_274%2Ch_169/367177_hires.jpg"
    }
}