{
    "recipe": {
        "title": "Swirled Sesame Tea Cake ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "White sesame seeds (for sprinkling)",
            "2 Tbsp. black sesame seeds, plus more for sprinkling",
            "1 cup sugar, plus more for sprinkling",
            "1 1/2 cups all-purpose flour",
            "1 3/4 tsp. baking powder",
            "1 tsp. kosher salt",
            "1/2 tsp. ground cardamom",
            "1/4 tsp. baking soda",
            "1/2 cup plain whole-milk yogurt",
            "1/2 cup tahini",
            "2 large eggs",
            "1 tsp. vanilla extract",
            "1/2 cup vegetable oil",
            "1 1/2 tsp. toasted sesame oil"
        ],
        "instructions": [
            "Preheat oven to 350°F. Lightly coat an 8 1/2x4 1/2\" loaf pan with nonstick spray. Line with parchment paper, leaving overhang on long sides. Lightly coat parchment with nonstick spray. Sprinkle sides and bottom of pan with white and black sesame seeds and sugar and shake around in pan to coat; tap out excess. Finely grind 2 Tbsp. black sesame seeds in a spice mill, food processor, or blender; set aside.",
            "Whisk flour, baking powder, salt, cardamom, and baking soda in a medium bowl to combine. Whisk yogurt and tahini in another small bowl until smooth (mixture will seize and stiffen at first).",
            "Using an electric mixer on medium-high speed, beat eggs, vanilla, and 1 cup sugar in a large bowl until eggs are pale and thick (use the paddle attachment if using a stand mixer), about 2 minutes. Reduce speed to medium and, with motor running, gradually stream in vegetable oil and sesame oil. Reduce speed to low and add dry ingredients in 3 additions, alternating with yogurt mixture in 2 additions, beginning and ending with dry ingredients. Beat after each addition until fully incorporated. Scrape half of batter into the bowl that held the dry ingredients. Add reserved ground black sesame seeds to the remaining batter and mix on medium speed until evenly distributed—this is your black swirl.",
            "Alternating between batters, spoon large dollops into prepared pan, then drag the tip of a paring knife through batter in a figure-eight pattern to swirl. Sprinkle with more white and black sesame seeds, then with more sugar. Bake until a tester inserted into the center of cake comes out clean, 55–65 minutes. Transfer pan to a wire rack and let cake cool in pan 10 minutes. Run a knife around short sides of pan and use parchment to help lift cake out of pan and onto rack. Let cool completely.",
            "Do Ahead Cake can be baked 2 days ahead. Store tightly wrapped at room temperature.",
            "Cake can be baked 2 days ahead. Store tightly wrapped at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ac271fa968b1f5f9f70b52c/6:4/w_274%2Ch_169/swirled-sesame-tea-cake-recipe-BA-032818.jpg",
        "color": 10877443
    }
}