{
    "recipe": {
        "title": "Swiss Chard and Herb Fritters ",
        "ingredients": [
            "1 1/2 bunches Swiss chard (about 1 pound, 3 ounces), stemmed",
            "1 teaspoon kosher salt, divided, plus more",
            "1 tablespoon coriander seeds",
            "1/2 teaspoon caraway seeds",
            "1 bunch parsley",
            "1 bunch cilantro",
            "1 bunch dill",
            "3 medium onions, grated on large size box grater, excess water squeezed out using a paper towel",
            "1 tablespoon harissa pepper paste",
            "3/4 cup plain unseasoned breadcrumbs",
            "1/4 teaspoon freshly ground pepper",
            "6 large eggs, divided",
            "Vegetable oil (for frying; about 1 1/2 cups)",
            "Plain Greek-style yogurt (for serving; optional)",
            "A spice mill or mortar and pestle"
        ],
        "instructions": [
            "Season chard with 1/2 tsp. salt. Let sit in a colander 10 minutes. Squeeze out excess water with your hands. Transfer to a cutting board and chop.",
            "Finely grind coriander and caraway seeds in spice mill or with mortar and pestle. Finely chop cilantro, dill, and parsley.",
            "Toss chard, ground coriander and caraway seeds, herbs, onions, breadcrumbs, harissa, pepper, and 1/2 tsp. salt in a large bowl. Beat 3 eggs to blend in a small bowl, then stir into chard mixture.",
            "Working 3 Tbsp. at a time, portion chard mixture into round, flat patties (you should have about 25 total). Transfer to a rimmed baking sheet or plate.",
            "Shape 3 tablespoons of the mixture into round flat patties. Repeat with the remaining mixture.",
            "Pour oil into a large heavy skillet to a depth of 1/4\" and heat over medium until shimmering. Beat remaining 3 eggs to blend in a medium wide shallow bowl.",
            "Dip each patty into egg, letting excess drip back into bowl. Working in batches, fry patties until set and a golden brown crust forms, 3–4 minutes per side. Transfer to a paper towel-lined plate; season with salt.",
            "Serve immediately or at room temperature with yogurt alongside, if using."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59baceadc8db02177faff1b7/6:4/w_274%2Ch_169/Leek-and-Swiss-Chard-Cakes-12092017.jpg"
    }
}