{
    "recipe": {
        "title": "Swordfish Steaks with Asparagus and Frisée Salad ",
        "ingredients": [
            "3 Tbsp. plus 1/4 cup extra-virgin olive oil",
            "1 lb. asparagus, trimmed, cut into 2 1/2\" pieces",
            "3 1/2 tsp. kosher salt, divided",
            "4 (1\"-thick) swordfish steaks (about 1 1/2 lb. total)",
            "1 Tbsp. herbes de Provence",
            "1 Tbsp. Dijon mustard",
            "1 Tbsp. red wine vinegar",
            "1/2 lemon",
            "3/4 tsp. freshly ground black pepper, divided",
            "8 cups torn frisée",
            "3 medium Persian cucumbers, thinly sliced into rounds",
            "1/2 small white onion, very thinly sliced into rings, rinsed"
        ],
        "instructions": [
            "Heat 1 Tbsp. oil in a large skillet over medium-high. Add asparagus and cook, shaking pan occasionally, until tender and charred in spots, 3–5 minutes. Transfer asparagus to a large bowl, season with 1/2 tsp. salt, and toss to combine.",
            "Season swordfish all over with 1 1/2 tsp. salt. Heat 2 Tbsp. oil in same skillet over medium-high. Working in batches if needed, cook swordfish, turning occasionally, until cooked through (fish will feel firm when pressed), about 6 minutes. Transfer to a platter.",
            "Pour off any excess oil in pan. Pour in remaining 1/4 cup oil, then add herbes de Provence (no need to warm up the pan again). Add mustard and vinegar and whisk until sauce is creamy. Finely grate zest from lemon into sauce, then squeeze in juice lemon. Season with 1/2 tsp. salt and 1/4 tsp. pepper. Let cool slightly.",
            "Pour three-quarters of dressing over asparagus. Add frisée, cucumbers, and onion to bowl; season with remaining 1 tsp. salt and 1/2 tsp. pepper and toss to coat.",
            "Mound salad on platter next to swordfish. Spoon remaining dressing over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5af1b94132c9206db5f1a0db/6:4/w_274%2Ch_169/Swordfish-Steaks-with-Asparagus-and-Frise%CC%81e-Salad-03052018.jpg",
        "color": 15893257
    }
}