{
    "recipe": {
        "title": "Tacos with Pork in Green Sauce (Tacos de cerdo en salsa verde) ",
        "ingredients": [
            "1 1/2 pounds tomatillos (15 to 18), husked and rinsed",
            "2 serrano or jalapeño chiles, stemmed",
            "1 teaspoon cumin seed",
            "3 allspice berries",
            "1 whole clove",
            "3 medium garlic cloves, peeled",
            "1/2 cup coarsely chopped cilantro",
            "1 1/2 teaspoons salt, divided",
            "3 pounds pork shoulder, cut into 1-inch pieces",
            "2 tablespoons vegetable oil"
        ],
        "instructions": [
            "In a 3-quart saucepan, cover the tomatillos and chiles with cold water and bring to a boil. Reduce the heat and simmer the vegetables uncovered, turning occasionally, until the tomatillos are tender and khaki-green all over but still intact, about 15 minutes. Reserve the cooking liquid. Heat the cumin, allspice berries, and clove in a small, dry skillet over medium heat, shaking the pan or stirring the spices until they are fragrant and the cumin is a few shades darker, about 1 minute. Put the spices in a blender along with 1 cup of the tomatillo cooking water and blend until the spices are ground. Using a slotted spoon, gently lift the tomatillos and chiles out of the remaining cooking water and put them in the blender along with the garlic, cilantro, and 1/2 teaspoon salt. Blend until smooth. Pat the pork dry and season with the remaining 1 teaspoon salt. Heat the oil in a wide, heavy 4- to 5-quart pot over medium-high heat and brown the pork in batches without crowding, turning occasionally, about 8 minutes per batch. Return all the meat to the pan and add the tomatillo sauce. Bring to a simmer, stirring to coat the meat, then reduce the heat. Simmer the pork, covered, stirring occasionally, until the meat is tender and the sauce is thickened, 1 1/2 to 2 hours. If necessary, continue to cook uncovered to thicken the sauce. Shred the meat with two forks. Make tacos with the accompaniments.",
            "In a 3-quart saucepan, cover the tomatillos and chiles with cold water and bring to a boil. Reduce the heat and simmer the vegetables uncovered, turning occasionally, until the tomatillos are tender and khaki-green all over but still intact, about 15 minutes. Reserve the cooking liquid.",
            "Heat the cumin, allspice berries, and clove in a small, dry skillet over medium heat, shaking the pan or stirring the spices until they are fragrant and the cumin is a few shades darker, about 1 minute.",
            "Put the spices in a blender along with 1 cup of the tomatillo cooking water and blend until the spices are ground. Using a slotted spoon, gently lift the tomatillos and chiles out of the remaining cooking water and put them in the blender along with the garlic, cilantro, and 1/2 teaspoon salt. Blend until smooth.",
            "Pat the pork dry and season with the remaining 1 teaspoon salt. Heat the oil in a wide, heavy 4- to 5-quart pot over medium-high heat and brown the pork in batches without crowding, turning occasionally, about 8 minutes per batch.",
            "Return all the meat to the pan and add the tomatillo sauce. Bring to a simmer, stirring to coat the meat, then reduce the heat. Simmer the pork, covered, stirring occasionally, until the meat is tender and the sauce is thickened, 1 1/2 to 2 hours. If necessary, continue to cook uncovered to thicken the sauce. Shred the meat with two forks.",
            "Make tacos with the accompaniments."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b28dc99a93d64c380b2c46/6:4/w_274%2Ch_169/368310_tacos-pork_1x1.jpg"
    }
}