{
    "recipe": {
        "title": "Tamarind-Glazed Lamb Skewers with Dried-Apricot Relish ",
        "ingredients": [
            "1/2 cup seedless unsweetened tamarind paste*",
            "1/2 cup fresh orange juice",
            "1/3 cup mild-flavored (light) molasses",
            "1 teaspoon dried crushed red pepper",
            "3 tablespoons fresh lime juice",
            "2 cups chopped dried apricots",
            "6 tablespoons fresh lemon juice",
            "1/3 cup chopped fresh cilantro",
            "2 tablespoons minced seeded red jalapeño chilies",
            "2 tablespoons (packed) golden brown sugar",
            "2 tablespoons cracked coriander seeds",
            "2 pounds boneless leg of lamb, cut into 1/2-inch pieces; or 4 pounds lamb shoulder chops, fat trimmed, meat cut into 1/2-inch pieces",
            "1 large red onion, cut into 1/2-inch cubes",
            "20 (about) 12-inch metal skewers"
        ],
        "instructions": [
            "Bring first 4 ingredients to boil in small saucepan over high heat. Reduce heat and simmer until reduced to 1 cup, stirring occasionally, about 8 minutes. Remove from heat. Stir in lime juice.",
            "For apricot relish: Mix apricots and next 5 ingredients in medium bowl to blend. Season relish to taste with salt and pepper. (Glaze and relish can be made 1 day ahead; cover separately and chill. Bring relish to room temperature. Stir glaze over medium heat until heated through.) Thread lamb and onion pieces onto skewers, using about 6 onion and lamb pieces per skewer. (Skewers can be prepared 1 day ahead. Cover and chill.) Prepare barbecue (medium-high heat). Sprinkle skewers with salt and pepper. Grill lamb to desired doneness, turning once and basting with glaze during last minute of grilling, about 2 minutes total for medium-rare. Transfer skewers to platter. Serve with relish.",
            "Mix apricots and next 5 ingredients in medium bowl to blend. Season relish to taste with salt and pepper. (Glaze and relish can be made 1 day ahead; cover separately and chill. Bring relish to room temperature. Stir glaze over medium heat until heated through.)",
            "Thread lamb and onion pieces onto skewers, using about 6 onion and lamb pieces per skewer. (Skewers can be prepared 1 day ahead. Cover and chill.)",
            "Prepare barbecue (medium-high heat). Sprinkle skewers with salt and pepper. Grill lamb to desired doneness, turning once and basting with glaze during last minute of grilling, about 2 minutes total for medium-rare. Transfer skewers to platter. Serve with relish.",
            "Available at Indian markets.",
            "Available at Indian markets.",
            "Available at Indian markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560ea1007b55306961bfefbe/6:4/w_274%2Ch_169/106814.jpg",
        "color": 16098640
    }
}