{
    "recipe": {
        "title": "Tandoori Chicken and Vegetable Sheet-Pan Supper ",
        "ingredients": [
            "5 tablespoons organic canola oil",
            "4 cloves garlic, minced",
            "2 tablespoons grated fresh ginger",
            "1 tablespoon chili powder",
            "1 tablespoon garam masala",
            "2 teaspoons ground cumin",
            "2 teaspoons paprika",
            "1 teaspoon ground turmeric",
            "1 cup plain whole-milk yogurt",
            "2 tablespoons fresh lime juice",
            "1 jalapeño pepper, seeded and finely chopped",
            "Kosher salt",
            "Freshly ground black pepper",
            "2 pounds bone-in, skin-on chicken parts (a mix of breasts, split and cut in half, thighs, and legs)",
            "3/4 pound Yukon Gold potatoes, cut into 1-inch pieces",
            "4 cups 1-inch cauliflower florets",
            "4 cups 1-inch broccoli florets",
            "8 small cremini mushrooms, stems trimmed",
            "1/2 teaspoon fenugreek seeds or cumin seeds",
            "1/2 cup red onion, halved lengthwise, then sliced into thin half-moons",
            "Mango Chutney (homemade or your favorite store-bought chutney)"
        ],
        "instructions": [
            "In a small skillet over medium heat, heat 2 tablespoons of the canola oil. Add the garlic and ginger and cook, stirring continuously, until light brown and fragrant, about 1 minute. Add the chili powder, garam masala, 1 teaspoon of the cumin, the paprika, and turmeric and cook, stirring continuously, for an additional minute. Set aside to cool. In a large bowl, combine the yogurt, lime juice, jalapeño pepper, 2 teaspoons salt, 1/8 teaspoon black pepper, and the spice mixture and stir to combine. Using a sharp knife, score the skin of each piece of chicken, making two or three shallow cuts about 1 inch apart. Add the chicken and potatoes to the bowl with the spiced yogurt and massage the yogurt into the chicken until all the pieces are well coated. Transfer the chicken, potatoes, and spiced yogurt to a large zip-top freezer bag and set aside for 30 minutes at room temperature or refrigerate for up to 8 hours. Set a rack in the upper-third of the oven and preheat the oven to 425°F. Place the cauliflower, broccoli, and mushrooms in a large bowl. Add the remaining 3 tablespoons canola oil, remaining 1 teaspoon cumin, the fenugreek seeds, 1/2 teaspoon salt, and 1/8 teaspoon black pepper and mix well. Remove the marinated chicken from the bag, letting any excess marinade drip off, and arrange the pieces skin-side up on a rimmed baking sheet. Scatter the potatoes in and around the chicken. Roast for 20 minutes, then remove the pan from the oven and place the vegetables in a single layer in any spaces around the chicken. Return the pan to the oven and roast for an additional 20 minutes. Remove from the oven and switch the oven to broil. Sprinkle the red onion over the chicken and vegetables, return the baking sheet to the oven, and broil until the chicken is lightly charred and crispy, 2 to 3 minutes. Remove from the oven and serve with mango chutney, if desired.",
            "In a small skillet over medium heat, heat 2 tablespoons of the canola oil. Add the garlic and ginger and cook, stirring continuously, until light brown and fragrant, about 1 minute. Add the chili powder, garam masala, 1 teaspoon of the cumin, the paprika, and turmeric and cook, stirring continuously, for an additional minute. Set aside to cool.",
            "In a large bowl, combine the yogurt, lime juice, jalapeño pepper, 2 teaspoons salt, 1/8 teaspoon black pepper, and the spice mixture and stir to combine.",
            "Using a sharp knife, score the skin of each piece of chicken, making two or three shallow cuts about 1 inch apart. Add the chicken and potatoes to the bowl with the spiced yogurt and massage the yogurt into the chicken until all the pieces are well coated. Transfer the chicken, potatoes, and spiced yogurt to a large zip-top freezer bag and set aside for 30 minutes at room temperature or refrigerate for up to 8 hours.",
            "Set a rack in the upper-third of the oven and preheat the oven to 425°F.",
            "Place the cauliflower, broccoli, and mushrooms in a large bowl. Add the remaining 3 tablespoons canola oil, remaining 1 teaspoon cumin, the fenugreek seeds, 1/2 teaspoon salt, and 1/8 teaspoon black pepper and mix well.",
            "Remove the marinated chicken from the bag, letting any excess marinade drip off, and arrange the pieces skin-side up on a rimmed baking sheet. Scatter the potatoes in and around the chicken. Roast for 20 minutes, then remove the pan from the oven and place the vegetables in a single layer in any spaces around the chicken. Return the pan to the oven and roast for an additional 20 minutes. Remove from the oven and switch the oven to broil.",
            "Sprinkle the red onion over the chicken and vegetables, return the baking sheet to the oven, and broil until the chicken is lightly charred and crispy, 2 to 3 minutes. Remove from the oven and serve with mango chutney, if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c7561811808bd2c8ed6ca39/6:4/w_274%2Ch_169/tandoori-chicken-sheet-pan-supper-recipe-HC-022619.jpg"
    }
}