{
    "recipe": {
        "title": "Tandoori Pork on the Outdoor Grill ",
        "ingredients": [
            "14-ounce pork loin or tenderloin",
            "naan bread, to serve",
            "plain yogurt, to serve",
            "1 small cucumber, julienned",
            "2 x 4-inch pieces of fresh ginger, peeled and finely chopped",
            "12 garlic cloves, finely chopped",
            "1 tablespoon ground cumin",
            "1 tablespoon ground coriander",
            "1 tablespoon sweet paprika",
            "2 1/2 teaspoons garam masala",
            "1 teaspoon ground fenugreek",
            "2 teaspoons Indian chile paste (see note)",
            "5 tablespoons lemon juice",
            "1/4 cup mustard oil (see note)"
        ],
        "instructions": [
            "Soak 8 wooden skewers in water overnight. To make the marinade, combine all the ingredients in a nonreactive bowl. Cut the pork into 1-inch cubes. Add the pork to the marinade, toss to coat and refrigerate for at least 3 hours. Set up the outdoor grill for direct-heat cooking over high heat. Thread the pork onto the skewers (use gloves to avoid staining your hands) and cook on the grill for 5 minutes on each side or until cooked through. Warm the naan bread briefly on the grill and serve with the tandoori pork, yogurt and cucumber.",
            "Soak 8 wooden skewers in water overnight.",
            "To make the marinade, combine all the ingredients in a nonreactive bowl.",
            "Cut the pork into 1-inch cubes. Add the pork to the marinade, toss to coat and refrigerate for at least 3 hours.",
            "Set up the outdoor grill for direct-heat cooking over high heat. Thread the pork onto the skewers (use gloves to avoid staining your hands) and cook on the grill for 5 minutes on each side or until cooked through. Warm the naan bread briefly on the grill and serve with the tandoori pork, yogurt and cucumber."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b2dfa93edeef84363b21e6/6:4/w_274%2Ch_169/365989_tandoori-pork_1x1.jpg"
    }
}