{
    "recipe": {
        "title": "Tandy Ellis's Burgoo ",
        "ingredients": [
            "2 lbs. beef cut from the shank (soup bone included)",
            "1/2 lb. lamb (baby lamb, not mutton)",
            "1 medium-sized chicken",
            "2 C diced potatoes",
            "Red pepper to taste (1 small pod, or more to taste)",
            "3 C corn cut from the cob (young field corn is best)",
            "Salt and black pepper to taste",
            "1 \"toe\" of garlic",
            "2 C diced onions",
            "1 C fresh butterbeans or 1 pkg. frozen butterbeans",
            "3 carrots, diced",
            "1 C minced parsley",
            "2 green peppers, diced, seeds removed",
            "2 C okra, diced or cut in rings",
            "4 qts. water, or more if soup cooks too thick",
            "12 tomatoes or 1 qt. can"
        ],
        "instructions": [
            "Put the beef, lamb, and dismembered chicken in a soup kettle with water, salt, black and red pepper. An old-fashioned iron kettle was specified by Mr. Ellis, but any heavy aluminum or metal kettle with a tight-fitting lid will do. Let this come to a hard boil, reduce the heat, and simmer about 2 hours with the lid on. Add potatoes, onions, and at intervals of 10 minutes, the butterbeans, carrots, green peppers. Then add corn and simmer for 2 hours or until mixture seems very thick. Watch carefully so that it does not stick. Add more water from time to time if necessary, but use as little as possible. Add okra and tomatoes and the garlic and let simmer another 1 1/2 hours, or until these vegetables too are done and blended with the others. Mr. Ellis insisted that the stew should cook for 7 hours, but 4 to 5 hours should be quite sufficient. As soon as soup is taken from stove, stir the parsley into it. This soup improves by standing and can be kept for a long time in the refrigerator. It is delicious when reheated. Serve with corn pones and follow it with a piece of pie—a most satisfactory repast, Kentucky style."
        ],
        "picture_link": null
    }
}