{
    "recipe": {
        "title": "Tangy Grilled-Cabbage Slaw with Raisins and Walnuts ",
        "ingredients": [
            "1 cup (packed) light brown sugar",
            "5 whole cloves",
            "2 tablespoons whole black peppercorns",
            "3 1/4 cups apple cider vinegar, divided",
            "1/4 cup plus 1/2 teaspoon kosher salt, divided, plus more to taste",
            "1 green cabbage (about 2 3/4 pounds), quartered",
            "1/4 cup extra-virgin olive oil, plus more to taste",
            "7 thick-cut slices bacon (about 8 ounces)",
            "1 1/2 teaspoons honey",
            "3/4 teaspoon freshly ground black pepper, plus more to taste",
            "1/2 cup black raisins",
            "1/2 cup chopped fresh parsley",
            "1/2 cup toasted walnuts, coarsely chopped"
        ],
        "instructions": [
            "Bring brown sugar, cloves, peppercorns, 3 cups vinegar, 1/4 cup salt, and 3 cups water to a boil in a large pot over high heat. Reduce heat and simmer, stirring until sugar is dissolved, 10 minutes. Let cool 10 minutes.",
            "Place cabbage in a large resealable bag and fill with pickling liquid. Seal bag and chill at least 5 hours or up to overnight.",
            "Pat cabbage dry with paper towels; discard pickling liquid. Prepare a grill or grill pan for medium-high heat. Brush cabbage with oil and grill, turning occasionally, until all sides are well charred, 7–10 minutes per side. Let cool.",
            "If using a grill pan, cook bacon in pan, turning once, until browned and crisp. If using a grill, heat a cast iron pan or disposable foil pan on grill and cook bacon, turning once, until browned and crisp. Transfer to paper towels to drain and let cool, then cut crosswise into 1/8\" strips.",
            "Whisk honey, 1/2 tsp. salt, 3/4 tsp. black pepper, remaining 1/4 cup oil, and remaining 1/4 cup vinegar in a large bowl. Thinly slice cabbage lengthwise and add to bowl along with bacon, raisins, parsley, and walnuts. Toss well to combine and season with salt and pepper. Cover and chill until ready to serve.",
            "Do Ahead Slaw can be made and chilled for up to 8 hours.",
            "Slaw can be made and chilled for up to 8 hours."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55a6cf4998d8666b6dcd97db/6:4/w_274%2Ch_169/EP_07092015_summer100_slaws_pickledgreencabbage_6x4.jpg"
    }
}