{
    "recipe": {
        "title": "Tangerine Crème Brûlée ",
        "ingredients": [
            "2 1/2 cups heavy cream",
            "Finely grated zest of 6 medium tangerines",
            "3 eggs",
            "5 egg yolks",
            "3/4 cup (packed) brown sugar, divided",
            "1/2 cup fresh tangerine juice",
            "Salt",
            "1 teaspoon vanilla extract",
            "Ten 4-ounce ceramic ramekins; kitchen torch"
        ],
        "instructions": [
            "Preheat oven to 350°. Place ramekins in a roasting pan or other suitable ovenproof dish taller than the ramekins. Add hot water to pan until it reaches about three-quarters up sides of ramekins. Remove ramekins from water and place pan in oven (make sure there is no rack directly above it, so you'll have room to return filled ramekins to pan). Set ramekins aside. In a saucepan, combine cream and tangerine zest. Over medium heat, warm cream to the scalding point, stirring occasionally. In a medium bowl, lightly whisk together eggs and egg yolks. Whisk in 1/2 cup brown sugar and tangerine juice. Pour egg mixture into cream, stirring constantly. Add 1/2 teaspoon salt and vanilla extract. Strain custard through a fine-mesh sieve into a container that is easy to pour from. Divide custard evenly among ramekins; each one should be about three-quarters full. Carefully place filled ramekins in hot water bath. Bake custards for 25-30 minutes, or until they are just set (make sure not to overcook them-better under than over). Remove ramekins from water bath and place on a kitchen towel. Allow custards to cool for about 20 minutes, then refrigerate, covered, until thoroughly chilled. (Custards will keep up to 5 days in the refrigerator.) Reduce oven temperature to 300°. Line a rimmed baking sheet with parchment paper. Spread remaining 1/4 cup brown sugar into an even, thin layer on pan. Bake until sugar starts to dry out (about 5 minutes). Remove from oven, allow to cool, then roll sugar with a rolling pin to break it up into granules again. Set aside in an airtight container until you are ready to serve the crème brûlées. Sprinkle brown sugar evenly on tops of custards. Pass a kitchen torch over custards with quick swirling motions until sugar caramelizes.",
            "Preheat oven to 350°. Place ramekins in a roasting pan or other suitable ovenproof dish taller than the ramekins. Add hot water to pan until it reaches about three-quarters up sides of ramekins. Remove ramekins from water and place pan in oven (make sure there is no rack directly above it, so you'll have room to return filled ramekins to pan). Set ramekins aside.",
            "In a saucepan, combine cream and tangerine zest. Over medium heat, warm cream to the scalding point, stirring occasionally.",
            "In a medium bowl, lightly whisk together eggs and egg yolks. Whisk in 1/2 cup brown sugar and tangerine juice.",
            "Pour egg mixture into cream, stirring constantly. Add 1/2 teaspoon salt and vanilla extract. Strain custard through a fine-mesh sieve into a container that is easy to pour from.",
            "Divide custard evenly among ramekins; each one should be about three-quarters full. Carefully place filled ramekins in hot water bath.",
            "Bake custards for 25-30 minutes, or until they are just set (make sure not to overcook them-better under than over). Remove ramekins from water bath and place on a kitchen towel. Allow custards to cool for about 20 minutes, then refrigerate, covered, until thoroughly chilled. (Custards will keep up to 5 days in the refrigerator.)",
            "Reduce oven temperature to 300°. Line a rimmed baking sheet with parchment paper.",
            "Spread remaining 1/4 cup brown sugar into an even, thin layer on pan. Bake until sugar starts to dry out (about 5 minutes). Remove from oven, allow to cool, then roll sugar with a rolling pin to break it up into granules again. Set aside in an airtight container until you are ready to serve the crème brûlées.",
            "Sprinkle brown sugar evenly on tops of custards. Pass a kitchen torch over custards with quick swirling motions until sugar caramelizes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ff3ee1fe3762782ee2a59b/6:4/w_274%2Ch_169/51238300_tangerine-creme-brulee_6x4.jpg"
    }
}