{
    "recipe": {
        "title": "Tapenade-Filled Burgers ",
        "ingredients": [
            "2 1/4 pound lean ground beef chuck",
            "9 tablespoons black or green olive tapenade (sometimes labeled \"olive paste\")",
            "3/4 teaspoon salt",
            "1 teaspoon black pepper",
            "6 grilled or toasted hamburger buns or kaiser rolls",
            "Accompaniments: mayonnaise; coarse-grain mustard; thinly sliced red onion; thinly sliced sweet gherkin pickles; about 2 cups baby romaine lettuce"
        ],
        "instructions": [
            "Divide beef into 6 portions. Divide 1 portion in half, then flatten 1 half into a 4-inch patty and form a 1/4-inch rim around patty. Spread 1 1/2 tablespoons of tapenade onto patty within rim. Flatten remaining half into a 4-inch patty, then lay on top of tapenade-covered half and pinch edges together to seal. Pat side to form a straight-sided edge and transfer to a large tray. Make 5 more tapenade patties in same manner and transfer to tray, then refrigerate patties, covered, until ready to grill. Prepare grill for cooking over direct heat with medium-hot charcoal (moderately high heat for gas); see \"<\"\">Grilling Procedure< >.\" Sprinkle patties on both sides with salt and pepper. Lightly oil grill rack, then grill patties (covered only if using a gas grill), turning over once, 3 minutes total for medium-rare. (Burgers will continue to cook slightly after being removed from grill.) Spread mayonnaise and mustard on buns, then assemble burgers with onion, pickles, and romaine.",
            "Divide beef into 6 portions. Divide 1 portion in half, then flatten 1 half into a 4-inch patty and form a 1/4-inch rim around patty. Spread 1 1/2 tablespoons of tapenade onto patty within rim. Flatten remaining half into a 4-inch patty, then lay on top of tapenade-covered half and pinch edges together to seal. Pat side to form a straight-sided edge and transfer to a large tray. Make 5 more tapenade patties in same manner and transfer to tray, then refrigerate patties, covered, until ready to grill.",
            "Prepare grill for cooking over direct heat with medium-hot charcoal (moderately high heat for gas); see \"<\"\">Grilling Procedure< >.\"",
            "Sprinkle patties on both sides with salt and pepper. Lightly oil grill rack, then grill patties (covered only if using a gas grill), turning over once, 3 minutes total for medium-rare. (Burgers will continue to cook slightly after being removed from grill.)",
            "Spread mayonnaise and mustard on buns, then assemble burgers with onion, pickles, and romaine."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd743f3a00aeb2f1d2726/6:4/w_274%2Ch_169/234645.jpg"
    }
}