{
    "recipe": {
        "title": "Tapenade-Stuffed Leg of Lamb ",
        "ingredients": [
            "3 to 4 pounds boneless leg of lamb",
            "1/4 cup tapenade",
            "3 garlic cloves, sliced",
            "2 tablespoons chopped fresh rosemary leaves",
            "Fine sea salt and freshly ground black pepper to taste"
        ],
        "instructions": [
            "Preheat the oven to 350°F. Oil a roasting pan just large enough to hold the lamb. Place a rack in the pan. Stuff the lamb Unroll the lamb and spread the boned-out side with the tapenade. Roll up the lamb tightly. Tie it at 2-inch intervals with kitchen twine. With a small, sharp knife, cut slits 2 or 3 inches apart in the top of the roast. Push the garlic slices into the slits. Sprinkle the roast all over with the rosemary, salt, and pepper. Roast the lamb for about 1 hour and 15 minutes. To check for doneness, insert an instant-read thermometer in the thickest part of the meat. For medium-rare, the temperature should be 140 to 150°F. Cover loosely with foil and let the meat rest for at least 30 minutes before slicing. To serve Cut into thin slices.",
            "Preheat the oven to 350°F. Oil a roasting pan just large enough to hold the lamb. Place a rack in the pan.",
            "Stuff the lamb Unroll the lamb and spread the boned-out side with the tapenade. Roll up the lamb tightly. Tie it at 2-inch intervals with kitchen twine. With a small, sharp knife, cut slits 2 or 3 inches apart in the top of the roast. Push the garlic slices into the slits. Sprinkle the roast all over with the rosemary, salt, and pepper.",
            "Roast the lamb for about 1 hour and 15 minutes. To check for doneness, insert an instant-read thermometer in the thickest part of the meat. For medium-rare, the temperature should be 140 to 150°F. Cover loosely with foil and let the meat rest for at least 30 minutes before slicing.",
            "To serve Cut into thin slices."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9ab3f3a00aeb2f1cf8ea/6:4/w_274%2Ch_169/240912_hires.jpg"
    }
}