{
    "recipe": {
        "title": "Tarantula Cookies ",
        "ingredients": [
            "2 cups all-purpose flour",
            "1/2 teaspoon baking powder",
            "1/2 teaspoon salt",
            "1/8 teaspoon baking soda",
            "10 tablespoons unsalted butter, softened",
            "1/2 cup light brown sugaar",
            "1/4 cup granulated sugar",
            "1 egg",
            "1 teaspoon vanilla extract",
            "2 tablespoons unsweetened cocoa powder",
            "1 bag (8 ounces) thin, short pretzel sticks",
            "1 large bag (11 1/2 ounces) milk chocolate chips",
            "2 tablespoons vegetable oil",
            "Chocolate sprinkles",
            "Small red candies"
        ],
        "instructions": [
            "1. Preheat oven to 350°F. 2. In a medium mixing bowl, combine the flour, baking powder, salt, and baking soda. Set aside. 3. In a large mixing bowl, beat together the butter, brown sugar, and granulated sugar until light and fluffy. Add the egg and vanilla and beat until well blended. 4. Gradually add the flour mixture and cocoa powder. Beat to form a smooth dough. 5. Roll a tablespoon-sized ball of dough, and place it on a baking sheet. Arrange eight pretzel sticks around the ball like spokes on a wheel. Press the tips of the pretzel sticks firmly into the dough ball. Continue with the rest of the pretzels and dough. 6. Bake until cookies start to brown around edges, about 7-10 minutes. 7. Lift the cookies from the baking sheets with a spatula, and place on wire cooling racks. Let cool completely. Place the racks on sheets of aluminium foil or waxed paper. 8. In a double boiler (or the microwave), melt the chocolate chips with vegetable oil. 9. Pour the melted chocolate over each cookie. Coat with chocolate sprinkles. Press in two red candy eyes on the front of the head. Eeek!",
            "1. Preheat oven to 350°F.",
            "2. In a medium mixing bowl, combine the flour, baking powder, salt, and baking soda. Set aside.",
            "3. In a large mixing bowl, beat together the butter, brown sugar, and granulated sugar until light and fluffy. Add the egg and vanilla and beat until well blended.",
            "4. Gradually add the flour mixture and cocoa powder. Beat to form a smooth dough.",
            "5. Roll a tablespoon-sized ball of dough, and place it on a baking sheet. Arrange eight pretzel sticks around the ball like spokes on a wheel. Press the tips of the pretzel sticks firmly into the dough ball. Continue with the rest of the pretzels and dough.",
            "6. Bake until cookies start to brown around edges, about 7-10 minutes.",
            "7. Lift the cookies from the baking sheets with a spatula, and place on wire cooling racks. Let cool completely. Place the racks on sheets of aluminium foil or waxed paper.",
            "8. In a double boiler (or the microwave), melt the chocolate chips with vegetable oil.",
            "9. Pour the melted chocolate over each cookie. Coat with chocolate sprinkles. Press in two red candy eyes on the front of the head. Eeek!"
        ],
        "picture_link": "https://assets.epicurious.com/photos/560dd6d5f3a00aeb2f1d2612/6:4/w_274%2Ch_169/232937.jpg"
    }
}