{
    "recipe": {
        "title": "Tarragon Chicken with Anchovy Cream ",
        "ingredients": [
            "12 oz, about 2 boneless chicken breasts",
            "2 tbsp chopped tarragon",
            "2 tbsp lemon juice",
            "1 tbsp olive oil",
            "Salt and pepper to taste",
            "4 chopsticks, lacquered for color",
            "1 tbsp olive oil",
            "2 anchovy fillets in oil",
            "1 tsp lemon zest",
            "2 tbsp lemon juice",
            "1/2 cup crème fraîche",
            "2 tbsp grated parmesan cheese",
            "1 pinch tarragon",
            "Salt and pepper to taste"
        ],
        "instructions": [
            "1. Cut the chicken breasts into 1 inch cubes. Place in a Ziploc bag and add the rest of the ingredients. Seal and let marinate in the refrigerator for at least an hour. 2. Turn your oven to broil and skewer the cubes on the chopsticks. If the chopsticks are not lacquered then place them in water for an hour before use, so they won't char in the oven. 3. Grill the skewers in the top of your oven for about 12 minutes or until completely cooked through. Turn after half the time.",
            "1. Cut the chicken breasts into 1 inch cubes. Place in a Ziploc bag and add the rest of the ingredients. Seal and let marinate in the refrigerator for at least an hour.",
            "2. Turn your oven to broil and skewer the cubes on the chopsticks. If the chopsticks are not lacquered then place them in water for an hour before use, so they won't char in the oven.",
            "3. Grill the skewers in the top of your oven for about 12 minutes or until completely cooked through. Turn after half the time.",
            "Anchovy Cream 1. Heat the olive oil in a small saucepan. Add the anchovy fillets and stir them until they melt. 2. Remove the saucepan from the heat and add the rest of the ingredients. Salt and pepper to taste. Add more lemon juice if you want.",
            "1. Heat the olive oil in a small saucepan. Add the anchovy fillets and stir them until they melt.",
            "2. Remove the saucepan from the heat and add the rest of the ingredients. Salt and pepper to taste. Add more lemon juice if you want.",
            "Serving tip! The skewers can be served both warm and cold.",
            "The skewers can be served both warm and cold.",
            "Simplify: The sauce tastes better the longer it gets to absorb the flavors, so it can easily be prepared the day before. The same goes for the marinated skewers. Prepare and marinate the day before and just grill before the guests arrive.",
            "The sauce tastes better the longer it gets to absorb the flavors, so it can easily be prepared the day before. The same goes for the marinated skewers. Prepare and marinate the day before and just grill before the guests arrive.",
            "For a challenge: If you have access to a grill, then of course that adds to the flavor. Don't forget to soak nonlacquered skewers beforehand so that they don't catch fire.",
            "If you have access to a grill, then of course that adds to the flavor. Don't forget to soak nonlacquered skewers beforehand so that they don't catch fire."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d786df3a00aeb2f1cb550/6:4/w_274%2Ch_169/242386.jpg"
    }
}