{
    "recipe": {
        "title": "Tatsoi and Warm Scallop Salad with Spicy Pecan Praline ",
        "ingredients": [
            "1/3 cup pecans, chopped fine",
            "1/2 teaspoon salt",
            "1/8 teaspoon cayenne, or to taste",
            "3 tablespoons sugar",
            "3/4 pound sea scallops",
            "1 tablespoon all-purpose flour",
            "3/4 teaspoon salt",
            "3/4 teaspoon ground cumin",
            "1/8 teaspoon cayenne",
            "1/2 tablespoon unsalted butter",
            "1 tablespoon olive oil",
            "3 tablespoons fresh lemon juice",
            "3 tablespoons extra-virgin olive oil",
            "3/4 teaspoon Dijon mustard",
            "1 large firm-ripe avocado (preferably California)",
            "7 cups tatsoi (thick, spoon-shaped Asian greens) or baby spinach leaves, washed well and spun dry"
        ],
        "instructions": [
            "Make praline: In a bowl stir together pecans, salt, and cayenne. In a dry small heavy skillet or saucepan cook sugar over moderate heat, stirring with a fork, until melted and cook, without stirring, swirling skillet or pan, until a golden caramel. Add pecan mixture and stir to coat nuts with caramel. Spoon praline onto a sheet of foil and cool. Transfer praline to a cutting board and chop fine. Praline can be made 3 days ahead and kept in an airtight container. Remove tough muscle from side of each scallop if necessary and halve any large scallops. On a sheet of wax paper combine flour, salt, cumin, and cayenne and dip flat sides of each scallop into mixture to coat, knocking off excess. In a skillet heat butter and olive oil over moderately high heat until foam subsides and sauté scallops, flat sides down, until golden and just cooked through, about 2 minutes on each flat side. Remove skillet from heat and cool scallops slightly. In a large bowl whisk together lemon juice , extra-virgin olive oil, mustard, and salt and pepper to taste until emulsified. Peel and pit avocado and cut into 1/2-inch-thick wedges. Cut wedges in half crosswise and add to dressing. Add scallops with any liquid remaining in skillet, tatsoi or spinach, and praline and gently toss to coat.",
            "In a bowl stir together pecans, salt, and cayenne. In a dry small heavy skillet or saucepan cook sugar over moderate heat, stirring with a fork, until melted and cook, without stirring, swirling skillet or pan, until a golden caramel. Add pecan mixture and stir to coat nuts with caramel. Spoon praline onto a sheet of foil and cool. Transfer praline to a cutting board and chop fine. Praline can be made 3 days ahead and kept in an airtight container.",
            "Remove tough muscle from side of each scallop if necessary and halve any large scallops. On a sheet of wax paper combine flour, salt, cumin, and cayenne and dip flat sides of each scallop into mixture to coat, knocking off excess. In a skillet heat butter and olive oil over moderately high heat until foam subsides and sauté scallops, flat sides down, until golden and just cooked through, about 2 minutes on each flat side. Remove skillet from heat and cool scallops slightly.",
            "In a large bowl whisk together lemon juice , extra-virgin olive oil, mustard, and salt and pepper to taste until emulsified. Peel and pit avocado and cut into 1/2-inch-thick wedges. Cut wedges in half crosswise and add to dressing. Add scallops with any liquid remaining in skillet, tatsoi or spinach, and praline and gently toss to coat."
        ],
        "picture_link": null
    }
}