{
    "recipe": {
        "title": "Teddie's Apple Cake ",
        "ingredients": [
            "3 cups all-purpose flour",
            "1 teaspoon salt",
            "1 teaspoon ground cinnamon",
            "1 teaspoon baking soda",
            "1 1/2 cups peanut, vegetable, or corn oil",
            "2 cups sugar",
            "3 large eggs",
            "1 teaspoon vanilla extract",
            "3 cups peeled, cored, and thickly sliced apples",
            "1 cup chopped walnuts",
            "1 cup raisins",
            "Vanilla ice cream for serving (optional)"
        ],
        "instructions": [
            "1. Heat the oven to 350 degrees. Butter and flour a 9-inch tube pan. Sift together the flour, salt, cinnamon, and baking soda.",
            "2. Beat the oil and sugar together in a mixer with a paddle (or in a bowl with a hand mixer) for 5 minutes. Add the eggs and beat until the mixture is creamy. Stir in the dry ingredients. Add the vanilla, apples, walnuts, and raisins and stir until combined.",
            "3. Turn the batter into the prepared pan. Bake for 1 hour and 15 minutes, or until a toothpick inserted in the center comes out clean. Cool in the pan before turning out.",
            "4. Serve with vanilla ice cream, if desired.",
            "Cooking notes: If mixing the batter in a mixer, use a paddle attachment and turn the speed to low once you add the flour mixture, or the texture of the cake will be tough. Even better, mix the rest by hand. The recipe called for Red Delicious or McIntosh apples, but I'd recommend a variety that's brighter in flavor and firmer in texture, such as a Honeycrisp, Macoun, or Granny Smith. The apple slices can be halved if you want a more uniform texture. This cake can be eaten at any time of day, including breakfast. If you serve it for dessert, the recipe suggested a scoop of vanilla ice cream on the side. I prefer to whip 1/2 cup of heavy cream to soft peaks, then fold in crème fraîche to taste.",
            "If mixing the batter in a mixer, use a paddle attachment and turn the speed to low once you add the flour mixture, or the texture of the cake will be tough. Even better, mix the rest by hand.",
            "The recipe called for Red Delicious or McIntosh apples, but I'd recommend a variety that's brighter in flavor and firmer in texture, such as a Honeycrisp, Macoun, or Granny Smith.",
            "The apple slices can be halved if you want a more uniform texture.",
            "This cake can be eaten at any time of day, including breakfast. If you serve it for dessert, the recipe suggested a scoop of vanilla ice cream on the side. I prefer to whip 1/2 cup of heavy cream to soft peaks, then fold in crème fraîche to taste.",
            "Readers: \"I most recently baked this cake for Thanksgiving 2004. There was a small piece left over and several days later (it keeps beautifully), I wrapped it in aluminum foil and took it to NYC for my son and daughter-in-law. He took it from me and started looking around his kitchen. When I questioned him, he said he had to hide it from his wife.\" Rochelle Rogers-Lippin, Huntington, NY, letter SEPTEMBER 30, 1973: \"JUST DESSERTS,\" BY JEAN HEWITT. RECIPE BY TEDDIE. —1973",
            "\"I most recently baked this cake for Thanksgiving 2004. There was a small piece left over and several days later (it keeps beautifully), I wrapped it in aluminum foil and took it to NYC for my son and daughter-in-law. He took it from me and started looking around his kitchen. When I questioned him, he said he had to hide it from his wife.\"",
            "Rochelle Rogers-Lippin, Huntington, NY, letter",
            "SEPTEMBER 30, 1973: \"JUST DESSERTS,\" BY JEAN HEWITT. RECIPE BY TEDDIE. —1973"
        ],
        "picture_link": "https://assets.epicurious.com/photos/56098f1362fa7a9917c1d90a/6:4/w_274%2Ch_169/362089.jpg",
        "color": 16519938
    }
}