{
    "recipe": {
        "title": "Teff Gingerbread ",
        "ingredients": [
            "1/4 cup teff flour",
            "3/4 cup brown rice flour",
            "1/2 cup sorghum flour",
            "1/4 cup arrowroot",
            "1/4 cup potato starch",
            "1 teaspoon xanthan gum",
            "2 teaspoon baking powder",
            "1 teaspoon baking soda",
            "1 teaspoon ground cinnamon",
            "1 teaspoon ground ginger",
            "1/2 teaspoon ground allspice",
            "1/2 teaspoon ground cloves",
            "1/2 teaspoon sea salt",
            "4 tablespoons vegetable oil",
            "1 cup rice milk",
            "1/2 cup dark molasses",
            "1 egg (or 1 tablespoon flaxseed meal mixed with 3 tablespoons warm water)"
        ],
        "instructions": [
            "Preheat the oven to 425°F. Grease an 8-inch cake pan. Sift the flours, arrowroot, potato starch, xanthan gum, baking powder, baking soda, spices, and sea salt into a medium bowl. Stir until combined. In a separate large bowl combine the oil, rice milk, molasses, and egg and whisk together by hand or beat on low with a mixer until combined. Add the dry ingredients to the wet ingredients in thirds, mixing to incorporate after each addition. Pour the batter into the prepared pan and use a wet flexible rubber spatula to smooth the top. Bake 15 minutes, then reduce the heat to 400°F and bake another 35 minutes, or until the center bounces back when pressed gently with your fingertip.",
            "Preheat the oven to 425°F. Grease an 8-inch cake pan.",
            "Sift the flours, arrowroot, potato starch, xanthan gum, baking powder, baking soda, spices, and sea salt into a medium bowl. Stir until combined.",
            "In a separate large bowl combine the oil, rice milk, molasses, and egg and whisk together by hand or beat on low with a mixer until combined. Add the dry ingredients to the wet ingredients in thirds, mixing to incorporate after each addition. Pour the batter into the prepared pan and use a wet flexible rubber spatula to smooth the top. Bake 15 minutes, then reduce the heat to 400°F and bake another 35 minutes, or until the center bounces back when pressed gently with your fingertip."
        ],
        "picture_link": null
    }
}