{
    "recipe": {
        "title": "Thai-Style Pineapple-Coconut Rice ",
        "ingredients": [
            "1 1/2 cups uncooked long- grain brown rice, such as brown basmati",
            "1 cup light coconut milk (about half a 15-ounce can), or more as needed",
            "1 tablespoon safflower or other high-heat oil or 3 tablespoons vegetable broth or water",
            "1 large onion, preferably red, chopped",
            "2 cups small broccoli florets",
            "1 medium red or green bell pepper, diced",
            "2 medium carrots, peeled and sliced",
            "2 medium ripe fresh tomatoes, diced",
            "2 cups fresh pineapple chunks (about 3/4 inch thick) or one 20-ounce can unsweetened pineapple chunks in juice, drained (reserve liquid for another use)",
            "1 to 2 teaspoons good-quality curry powder",
            "2 teaspoons minced fresh or jarred ginger, or more to taste",
            "Salt to taste",
            "Crushed red pepper flakes to taste",
            "Crushed peanuts or cashews for topping (optional)"
        ],
        "instructions": [
            "Combine the rice with 2 cups water and the coconut milk in a saucepan. Bring to a rapid simmer, then cover and simmer gently until the water is absorbed, about 30 to 35 minutes. Meanwhile, heat the oil in a stir- fry pan or a wide skillet. Add the onion and saute over medium heat until golden. Add the broccoli, bell pepper, and carrots. Turn the heat up to medium-high and stir-fry for 3 to 4 minutes, or until the vegetables are just tender-crisp. Add the tomatoes and pineapple chunks and continue to stir-fry for a minute or two, just until the tomatoes soften slightly. Stir in the cooked rice, curry powder, and ginger. Stir gently until all the ingredients are completely combined. Since about half the can of coconut milk is remaining, if you’d like the mixture to be a bit more moist, add 1/4 cup or so more, but take care not to make the mixture soupy. Season with salt and red pepper flakes. Serve at once, passing around crushed nuts to top individual servings, if desired.",
            "Combine the rice with 2 cups water and the coconut milk in a saucepan. Bring to a rapid simmer, then cover and simmer gently until the water is absorbed, about 30 to 35 minutes.",
            "Meanwhile, heat the oil in a stir- fry pan or a wide skillet. Add the onion and saute over medium heat until golden.",
            "Add the broccoli, bell pepper, and carrots. Turn the heat up to medium-high and stir-fry for 3 to 4 minutes, or until the vegetables are just tender-crisp.",
            "Add the tomatoes and pineapple chunks and continue to stir-fry for a minute or two, just until the tomatoes soften slightly.",
            "Stir in the cooked rice, curry powder, and ginger. Stir gently until all the ingredients are completely combined. Since about half the can of coconut milk is remaining, if you’d like the mixture to be a bit more moist, add 1/4 cup or so more, but take care not to make the mixture soupy.",
            "Season with salt and red pepper flakes. Serve at once, passing around crushed nuts to top individual servings, if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59a4a163dabb0b5746cf6219/6:4/w_274%2Ch_169/thai-style-pineapple-coconut-rice-recipe-HC-082817.jpg"
    }
}