{
    "recipe": {
        "title": "Thai Beef Salad ",
        "ingredients": [
            "1 pound (455 g) strip steak (about 1 inch/2.5 cm thick; see Tip), trimmed and at room temperature",
            "Vegetable oil",
            "Salt and pepper",
            "1 large head of butter lettuce, also known as Boston or Bibb, leaves torn into bite-size pieces",
            "1/2 English cucumber, halved lengthwise and sliced",
            "1/2 pint (120 g) cherry tomatoes, halved",
            "1/2 small red onion, halved lengthwise and thinly sliced",
            "Handful of fresh mint leaves, roughly chopped",
            "Large handful of fresh cilantro leaves, roughly chopped",
            "Chile-Lime Sauce",
            "Handful of roasted peanuts, whole or roughly chopped (optional)"
        ],
        "instructions": [
            "Preheat the broiler, with a rack positioned so that the meat will be 3 to 4 inches (7.5 to 10 cm) from the heat. Line the bottom of a broiler pan with foil for easier clean-up, if you like, then top with the broiler rack. Put the meat on the broiler rack, lightly coat with the oil, and season with salt and pepper. Broil the meat for 5 to 7 minutes per side for medium-rare (err on the side of caution with the time; you can always cook it more). Transfer to a cutting board, sprinkle with salt, and let rest for 5 to 10 minutes.",
            "Meanwhile, in a large bowl, combine the lettuce, cucumbers, tomatoes, onions, mint, and cilantro.*",
            "Cut the meat against the grain into very thin slices and add to the bowl. (If the meat is still hot, wait a few minutes until it is warm or it will wilt the lettuce and herbs.) Drizzle the salad with just enough Chile-Lime Sauce to lightly coat and gently toss together. Top with the peanuts, if you like.",
            "Make Ahead Prepare to *, then cover and refrigerate the lettuce mixture and the unsliced meat separately for up to 1 day. The meat can be sliced and added to the salad cold or you can warm it in a 300°F (150°C) oven, if you prefer.",
            "Prepare to *, then cover and refrigerate the lettuce mixture and the unsliced meat separately for up to 1 day. The meat can be sliced and added to the salad cold or you can warm it in a 300°F (150°C) oven, if you prefer.",
            "Staggered If the salad will be served within 1 hour or so, cover the lettuce mixture and meat separately and leave them on the counter. People can help themselves and then toss their individual portions with the dressing.",
            "If the salad will be served within 1 hour or so, cover the lettuce mixture and meat separately and leave them on the counter. People can help themselves and then toss their individual portions with the dressing."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59a862efcf1de36df69075c8/6:4/w_274%2Ch_169/thai-beef-salad-recipe-083117.jpg"
    }
}