{
    "recipe": {
        "title": "Thai-Style Squid and Cucumber Salad ",
        "ingredients": [
            "1/4 cup fresh lime juice (from about 3 limes)",
            "1 garlic clove, finely grated",
            "1 Tbsp. fish sauce",
            "1 1/2 tsp. dark brown sugar",
            "1/4 cup plus 1 Tbsp. (or more) vegetable oil",
            "2 tsp. kosher salt, divided",
            "4 mini seedless or Persian cucumbers, halved lengthwise, sliced diagonally into 1/4\"-thick slices",
            "1–2 Fresno chiles, seeded, thinly sliced",
            "1/2 cup salted, roasted peanuts",
            "1 1/2 lb. cleaned squid, patted dry",
            "1/4 cup cilantro sprigs",
            "Steamed white rice (for serving; optional)"
        ],
        "instructions": [
            "Whisk lime juice, garlic, fish sauce, brown sugar, 1/4 cup oil, and 1/2 tsp. salt in a large bowl. Add cucumber, chiles, and peanuts and toss to coat. Set aside.",
            "Make sure squid is as dry as possible, then toss with remaining 1 1/2 tsp. salt. Separate bodies from tentacles.",
            "Heat 1 Tbsp. oil in a large cast-iron skillet until smoking. Sear half of the tentacles (don’t try to do more than half—you don’t want to crowd the pan), turning once halfway through, until lightly charred and opaque, 2–3 minutes. Transfer to a plate. Repeat with remaining tentacles, adding more oil if needed. Add a little more oil, then sear half of the bodies, turning once and picking up with tongs so that any liquid that has accumulated inside bodies can pour off into skillet and evaporate, until lightly charred and opaque, 2–3 minutes. Transfer to plate with cooked tentacles. Repeat with remaining bodies. Thinly slice bodies, then transfer squid to bowl with cucumber mixture and toss to coat.",
            "Arrange salad on a platter and drizzle remaining dressing over. Top with cilantro sprigs. Serve with rice alongside, if using."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b19aa4a18f10d6be39984cc/6:4/w_274%2Ch_169/Thai-Style-Squid-and-Cucumber-Salad-recipe-30052918.jpg",
        "color": 1855715
    }
}