{
    "recipe": {
        "title": "Thai Turkey Meatballs with Coconut Broth and Noodles ",
        "ingredients": [
            "1 large egg",
            "1 pound ground turkey",
            "1/2 cup panko (Japanese breadcrumbs) or fresh breadcrumbs",
            "1 scallion, finely chopped",
            "1 garlic clove, finely grated",
            "1 tablespoon low-sodium soy sauce or tamari",
            "1 teaspoon finely grated peeled ginger",
            "1/2 teaspoon kosher salt, plus more",
            "6 ounces sugar snap peas, strings removed",
            "1 medium red, yellow, or orange bell pepper, seeds and ribs removed, sliced into 1/4\"-thick strips",
            "4 ounces dried rice noodles, such as pad Thai noodles",
            "2 teaspoons virgin coconut or neutral vegetable oil",
            "1 tablespoon virgin coconut or neutral vegetable oil",
            "2 garlic cloves, finely grated",
            "1 1/2 tsp. finely grated peeled ginger",
            "1 1/2 cups canned unsweetened coconut milk",
            "1 1/2 cups low-sodium chicken broth",
            "2 tablespoons fresh lime juice",
            "1 tsp. soy sauce",
            "3/4 tsp. kosher salt",
            "1/4 cup Thai red curry paste (optional)",
            "Lime wedges, basil leaves, sliced scallion, sliced red chiles, chopped peanuts (for serving; optional)"
        ],
        "instructions": [
            "Preheat oven to 425°F. Line a rimmed baking sheet or 13x9\" glass or metal baking dish with parchment.",
            "Beat egg in a large bowl with a fork. Add turkey, panko, scallion, garlic, soy sauce, ginger, and 1/2 tsp. salt and stir well to combine. Using your hands, roll mixture into 1\" balls, packing firmly (you should have about 30). Transfer to prepared baking sheet.",
            "Roast meatballs, turning once halfway through, until firm and cooked through and an instant-read thermometer inserted into center of meatball registers 165°F, 15–20 minutes.",
            "Meanwhile, cook snap peas and bell pepper in a medium pot of boiling well-salted water 2 minutes. Transfer to a colander with a spider, slotted spoon, or tongs, reserving water in pot. Transfer to a medium bowl. Return water to a boil and cook noodles according to package directions. Drain noodles, then transfer to a large bowl and toss with oil.",
            "Option 1: For turkey meatballs, plain noodles, and vegetables: To make plain noodles with no broth, divide noodles among bowls and top with meatballs, snap peas, and bell pepper, or separate into different sections on a plate.",
            "To make plain noodles with no broth, divide noodles among bowls and top with meatballs, snap peas, and bell pepper, or separate into different sections on a plate.",
            "Option 2: For a mild coconut broth noodle bowl: Heat oil in a medium pot over medium. Add garlic and ginger and cook, stirring constantly, until fragrant, 30–60 seconds. Add coconut milk, broth, lime juice, soy sauce, and salt. Increase heat to medium-high and bring to a simmer. Cook, stirring occasionally, 5 minutes, then remove from heat. Divide noodles among bowls. Ladle broth over and top with meatballs, snap peas, and bell pepper.",
            "Heat oil in a medium pot over medium. Add garlic and ginger and cook, stirring constantly, until fragrant, 30–60 seconds. Add coconut milk, broth, lime juice, soy sauce, and salt. Increase heat to medium-high and bring to a simmer. Cook, stirring occasionally, 5 minutes, then remove from heat.",
            "Divide noodles among bowls. Ladle broth over and top with meatballs, snap peas, and bell pepper.",
            "Option 3: For a spicy red curry noodle bowl (optional): Whisk curry paste into coconut broth mixture (or keep half of broth “plain” to make 2 mild bowls, and whisk 2 Tbsp. curry paste into remaining half to make 2 spicy bowls). Divide noodles among bowls. Ladle broth over and top with meatballs, snap peas, and bell peppers. Garnish with lime wedges, basil, scallions, chiles, peanuts, if using.",
            "Whisk curry paste into coconut broth mixture (or keep half of broth “plain” to make 2 mild bowls, and whisk 2 Tbsp. curry paste into remaining half to make 2 spicy bowls).",
            "Divide noodles among bowls. Ladle broth over and top with meatballs, snap peas, and bell peppers. Garnish with lime wedges, basil, scallions, chiles, peanuts, if using.",
            "Do Ahead Meatballs and broth can be made 3 days ahead. Store separately and chill.",
            "Meatballs and broth can be made 3 days ahead. Store separately and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59a462b7e425862be92096f3/6:4/w_274%2Ch_169/Dinner-1-2-3-Thai-Meatballs-recipe-14082017.jpg",
        "color": 12988626
    }
}