{
    "recipe": {
        "title": "Thanksgiving Stock ",
        "ingredients": [
            "2 pounds chicken wings",
            "2 large turkey wings (about 3 pounds each) or 5 pounds chicken wings",
            "2 tablespoons extra-virgin olive oil, divided",
            "1 large onion, halved through root end",
            "2 medium carrots, scrubbed, very coarsely chopped",
            "2 celery stalks, very coarsely chopped",
            "1 head of garlic, halved crosswise",
            "8 ounces crimini mushrooms, halved",
            "1 smoked ham hock",
            "1 bunch parsley",
            "3 bay leaves",
            "1/4 cup dry white wine",
            "1 teaspoon black peppercorns",
            "Kosher salt",
            "A 3-gallon stockpot"
        ],
        "instructions": [
            "Preheat oven to 425°F. Spread out chicken and turkey wings on a rimmed baking sheet and drizzle with 1 Tbsp. oil; rub oil all over wings. Roast, turning every 10 minutes or so, until brown, 30–40 minutes. Remove from oven; set aside. Heat remaining 1 Tbsp. oil in stockpot over medium. Add onion, carrots, celery, garlic, and mushrooms and cook, stirring occasionally, until softened and lightly browned, 10–15 minutes. Add ham hock, parsley, bay leaves, wine, peppercorns, and a pinch of salt. Bring to a boil and cook until wine is evaporated, about 5 minutes. Add wings and use a wooden spoon to scrape any crispy bits off baking sheet. (Add a little water to help loosen if needed.) Add another pinch of salt and 2 gallons water; bring to a boil. Reduce heat to low and simmer, uncovered, until meat is falling apart and liquid is reduced by half, 3 1/2–4 1/2 hours (go the full distance for a rich and gelatinous stock). Scoop out large pieces of vegetables with a slotted spoon; discard. Strain stock into a large pot; discard solids. Let cool slightly, then chill until cold (the fat will solidify on top, making it easy to remove). Skim fat and ladle into airtight containers. Cover and chill until ready to use.",
            "Preheat oven to 425°F. Spread out chicken and turkey wings on a rimmed baking sheet and drizzle with 1 Tbsp. oil; rub oil all over wings. Roast, turning every 10 minutes or so, until brown, 30–40 minutes. Remove from oven; set aside.",
            "Heat remaining 1 Tbsp. oil in stockpot over medium. Add onion, carrots, celery, garlic, and mushrooms and cook, stirring occasionally, until softened and lightly browned, 10–15 minutes. Add ham hock, parsley, bay leaves, wine, peppercorns, and a pinch of salt. Bring to a boil and cook until wine is evaporated, about 5 minutes. Add wings and use a wooden spoon to scrape any crispy bits off baking sheet. (Add a little water to help loosen if needed.) Add another pinch of salt and 2 gallons water; bring to a boil. Reduce heat to low and simmer, uncovered, until meat is falling apart and liquid is reduced by half, 3 1/2–4 1/2 hours (go the full distance for a rich and gelatinous stock).",
            "Scoop out large pieces of vegetables with a slotted spoon; discard. Strain stock into a large pot; discard solids. Let cool slightly, then chill until cold (the fat will solidify on top, making it easy to remove). Skim fat and ladle into airtight containers. Cover and chill until ready to use.",
            "Do Ahead Stock can be made 1 week ahead. Keep chilled, or freeze up to 6 months.",
            "Stock can be made 1 week ahead. Keep chilled, or freeze up to 6 months."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a05db11cb1af42733736851/6:4/w_274%2Ch_169/make-ahead-thanksgiving-stock-recipe-BA-111017.jpg"
    }
}