{
    "recipe": {
        "title": "Thanksgiving Dinner for One ",
        "ingredients": [
            "1 sweet potato",
            "1 teaspoon finely grated orange zest",
            "1 teaspoon finely chopped thyme, plus 1 sprig",
            "Kosher salt, freshly ground pepper",
            "1 turkey breast tenderloin (about 10 ounces)",
            "1 tablespoon canola or vegetable oil",
            "1 large egg yolk",
            "5 tablespoons unsalted butter, divided",
            "2 tablespoons fresh orange juice, divided",
            "2 tablespoons coarsely chopped pecans",
            "2 tablespoons mini marshmallows",
            "1 shallot, thinly sliced",
            "4 ounces green beans, trimmed",
            "1/2 cup dry white wine"
        ],
        "instructions": [
            "Preheat oven to 375°F. Roast sweet potato on a foil-lined rimmed baking sheet until tender, 45–55 minutes. Let sit until cool enough to handle. Meanwhile, mix orange zest, chopped thyme, 1/2 tsp. salt, and 1/4 tsp. pepper in a small bowl. Rub turkey tenderloin all over with zest mixture and let sit at room temperature 15 minutes. Heat oil in a large ovenproof skillet over medium-high until shimmering. Sear turkey, turning occasionally, until lightly browned on all sides, about 5 minutes. Transfer skillet to oven and roast turkey, turning once halfway through, until an instant-read thermometer inserted into the center registers 165°F, 8–10 minutes. Transfer turkey to a cutting board and let sit at least 5 minutes before slicing; reserve drippings in skillet. Slice potato in half lengthwise. Working over a medium bowl, scoop out flesh from 1 half, leaving a 1/2\"-thick layer of flesh inside the skin—this will be your \"boat.\" Place \"boat\" on same foil-lined sheet. Scoop out all flesh from remaining half into bowl; discard skin. Mash flesh with a whisk. Add egg yolk, 1 Tbsp. butter, 1 Tbsp. orange juice, and 1/2 tsp. salt and whisk until mixture is as smooth as possible. Taste and adjust seasoning, if desired. Spoon filling into prepared \"boat.\" Top with pecans and marshmallows. Bake potato \"boat\" until top is lightly puffed and golden brown, about 15 minutes. Meanwhile, heat 1 Tbsp. butter in a small skillet over medium until melted. Add shallot and cook, stirring, 1 minute. Add green beans, cover, and cook, stirring occasionally, until beans are crisp-tender and shallot is lightly caramelized, 3–4 minutes. Season with 1/8 tsp. salt and a pinch of pepper. Heat skillet with turkey drippings over high. Add wine, scraping up browned bits with a wooden spoon. Add thyme sprig and cook, stirring, until liquid is reduced by half, about 5 minutes. Stir in remaining 1 Tbsp. orange juice, then remove from heat. Remove thyme sprig. Cut remaining 3 Tbsp. butter into cubes, then add to skillet one piece at a time, stirring until melted and emulsified before adding the next. Season with salt and pepper. Transfer sliced turkey to a plate. Spoon sauce over. Serve with green beans and stuffed sweet potato alongside.",
            "Preheat oven to 375°F. Roast sweet potato on a foil-lined rimmed baking sheet until tender, 45–55 minutes. Let sit until cool enough to handle.",
            "Meanwhile, mix orange zest, chopped thyme, 1/2 tsp. salt, and 1/4 tsp. pepper in a small bowl. Rub turkey tenderloin all over with zest mixture and let sit at room temperature 15 minutes.",
            "Heat oil in a large ovenproof skillet over medium-high until shimmering. Sear turkey, turning occasionally, until lightly browned on all sides, about 5 minutes. Transfer skillet to oven and roast turkey, turning once halfway through, until an instant-read thermometer inserted into the center registers 165°F, 8–10 minutes. Transfer turkey to a cutting board and let sit at least 5 minutes before slicing; reserve drippings in skillet.",
            "Slice potato in half lengthwise. Working over a medium bowl, scoop out flesh from 1 half, leaving a 1/2\"-thick layer of flesh inside the skin—this will be your \"boat.\" Place \"boat\" on same foil-lined sheet. Scoop out all flesh from remaining half into bowl; discard skin. Mash flesh with a whisk. Add egg yolk, 1 Tbsp. butter, 1 Tbsp. orange juice, and 1/2 tsp. salt and whisk until mixture is as smooth as possible. Taste and adjust seasoning, if desired. Spoon filling into prepared \"boat.\" Top with pecans and marshmallows. Bake potato \"boat\" until top is lightly puffed and golden brown, about 15 minutes.",
            "Meanwhile, heat 1 Tbsp. butter in a small skillet over medium until melted. Add shallot and cook, stirring, 1 minute. Add green beans, cover, and cook, stirring occasionally, until beans are crisp-tender and shallot is lightly caramelized, 3–4 minutes. Season with 1/8 tsp. salt and a pinch of pepper.",
            "Heat skillet with turkey drippings over high. Add wine, scraping up browned bits with a wooden spoon. Add thyme sprig and cook, stirring, until liquid is reduced by half, about 5 minutes. Stir in remaining 1 Tbsp. orange juice, then remove from heat. Remove thyme sprig. Cut remaining 3 Tbsp. butter into cubes, then add to skillet one piece at a time, stirring until melted and emulsified before adding the next. Season with salt and pepper.",
            "Transfer sliced turkey to a plate. Spoon sauce over. Serve with green beans and stuffed sweet potato alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59bfefbb335b1f2cee3c8f1e/6:4/w_274%2Ch_169/How-to-Cook-Thanksgiving-for-One-13092017.jpg"
    }
}