{
    "recipe": {
        "title": "Thanksgiving Sangria ",
        "ingredients": [
            "3 cups pomegranate juice",
            "5 (3\") cinnamon sticks",
            "1/2 teaspoon whole allspice",
            "1 (4\") piece peeled fresh ginger, thinly sliced (about 3/4 cup), divided",
            "1 (750-ml) bottle red wine",
            "1 Bartlett pear, quartered lengthwise, thinly sliced crosswise",
            "1/2 cup pomegranate seeds",
            "1/2 cup spiced rum",
            "1 (750-ml) bottle pear or apple sparkling cider"
        ],
        "instructions": [
            "Bring pomegranate juice, cinnamon, allspice, and one-third of ginger to a simmer in a small saucepan over medium-low heat. Cook 10 minutes, then remove from heat and let steep 10 minutes. Strain pomegranate mixture through a fine-mesh sieve into a pitcher, reserving cinnamon sticks. Add wine, pear, pomegranate seeds, rum, cinnamon sticks, and remaining ginger and stir to combine. Cover and chill at least 4 hours. To serve, fill pitcher or punch bowl with ice and pour sangria over. Top with cider.",
            "Bring pomegranate juice, cinnamon, allspice, and one-third of ginger to a simmer in a small saucepan over medium-low heat. Cook 10 minutes, then remove from heat and let steep 10 minutes.",
            "Strain pomegranate mixture through a fine-mesh sieve into a pitcher, reserving cinnamon sticks. Add wine, pear, pomegranate seeds, rum, cinnamon sticks, and remaining ginger and stir to combine. Cover and chill at least 4 hours.",
            "To serve, fill pitcher or punch bowl with ice and pour sangria over. Top with cider.",
            "Do Ahead Sangria, without ice or cider, can be made 1 day ahead. Cover and chill.",
            "Sangria, without ice or cider, can be made 1 day ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59bc35110222e72ca71d840d/6:4/w_274%2Ch_169/Say-Hello-to-Thanksgiving-Sangria-recipe-12092017.jpg"
    }
}