{
    "recipe": {
        "title": "The Celtic Buck ",
        "ingredients": [
            "1 tablespoon (1/2 ounce) whole allspice berries or 1 teaspoon ground allspice",
            "2 cups sugar",
            "2 cups water",
            "1/4 cup (2 ounces) Scotch whisky",
            "2 tablespoons (1 ounce) pear nectar",
            "1 tablespoon (1/2 ounce) fresh lemon juice",
            "About 5 to 6 cubes ice",
            "3 tablespoons (1 1/2 ounces) ginger ale",
            "3 slices pear (optional)",
            "1 stick cinnamon (optional)",
            "1 toothpick, 2 thin straws (optional)"
        ],
        "instructions": [
            "Make allspice syrup: If using whole allspice, in spice or coffee grinder, buzz until powdery (about 20 seconds) In medium saucepan over moderately high heat, combine 2 cups water and sugar, stirring until sugar dissolves. Bring to boil, then stir in allspice. Remove from heat and let stand 45 minutes. Strain through fine-mesh sieve. (Syrup can be made ahead and refrigerated, tightly covered, up to 3 weeks.)",
            "If using whole allspice, in spice or coffee grinder, buzz until powdery (about 20 seconds)",
            "In medium saucepan over moderately high heat, combine 2 cups water and sugar, stirring until sugar dissolves. Bring to boil, then stir in allspice. Remove from heat and let stand 45 minutes. Strain through fine-mesh sieve. (Syrup can be made ahead and refrigerated, tightly covered, up to 3 weeks.)",
            "Make cocktail: In cocktail shaker, combine Scotch, pear nectar, lemon juice, and 1 tablespoon allspice syrup. Fill with ice and shake 20 seconds. Strain drink into tall glass filled with fresh ice. Top with ginger ale. To garnish, insert toothpick through pear slices to create fan. Tuck fan into top of glass, then add cinnamon stick and straws.",
            "In cocktail shaker, combine Scotch, pear nectar, lemon juice, and 1 tablespoon allspice syrup. Fill with ice and shake 20 seconds. Strain drink into tall glass filled with fresh ice. Top with ginger ale.",
            "To garnish, insert toothpick through pear slices to create fan. Tuck fan into top of glass, then add cinnamon stick and straws."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5824b3931bdbd60e2541c3ef/6:4/w_274%2Ch_169/pear-cocktail-111016.jpg"
    }
}