{
    "recipe": {
        "title": "The Ultimate Key Lime Pie ",
        "ingredients": [
            "1 cup graham cracker crumbs from about 8 (2 1/4-inch by 4 3/4-inch) crackers",
            "1 cup honey-nut cereal crumbs, such as crushed Honey Nut Cheerios",
            "1/4 cup packed light brown sugar",
            "7 tablespoons salted sweet cream butter, melted",
            "1/2 teaspoon ground cardamom",
            "6 large egg yolks",
            "1 (14-ounce) can sweetened condensed milk",
            "1 cup vanilla ice cream, softened",
            "1/2 cup fresh or bottled Key lime juice",
            "1 cup heavy cream",
            "3 tablespoons confectioners' sugar",
            "9-inch pie plate, nonstick vegetable-oil spray, stand mixer fitted with the whisk attachment"
        ],
        "instructions": [
            "Arrange a rack in the middle of the oven and preheat to 350°F.",
            "Spray a 9-inch pie plate liberally with nonstick vegetable-oil spray.",
            "In a medium bowl, stir together the graham cracker crumbs, honey-nut cereal crumbs, and brown sugar. Drizzle with the melted butter and stir until well combined. Press the mixture evenly onto the bottom and up the sides of the prepared pie plate and refrigerate for 30 minutes.",
            "Make the filling: In the bowl of a stand mixer fitted with the whisk attachment, beat the egg yolks for 1 minute. Add the sweetened condensed milk and beat until pale and aerated, about 6 minutes. Add the ice cream and beat until smooth then add the lime juice and beat until combined. Pour the filling into the pie shell and bake until just set in the center, about 12 minutes. Transfer to a wire rack to cool completely then freeze until chilled through, at least 1 hour. DO AHEAD: The pie can be baked and kept in the freezer, well wrapped, up to 3 days.",
            "In the bowl of a stand mixer fitted with the whisk attachment, beat the egg yolks for 1 minute. Add the sweetened condensed milk and beat until pale and aerated, about 6 minutes. Add the ice cream and beat until smooth then add the lime juice and beat until combined. Pour the filling into the pie shell and bake until just set in the center, about 12 minutes. Transfer to a wire rack to cool completely then freeze until chilled through, at least 1 hour. DO AHEAD: The pie can be baked and kept in the freezer, well wrapped, up to 3 days.",
            "Garnish and serve: Remove the pie from the freezer and thaw in the refrigerator for 20 minutes prior to serving. In a medium bowl, combine the heavy cream and sugar and whip until soft peaks form. Cut the pie into slices and top each with a dollop of whipped cream.",
            "Remove the pie from the freezer and thaw in the refrigerator for 20 minutes prior to serving.",
            "In a medium bowl, combine the heavy cream and sugar and whip until soft peaks form. Cut the pie into slices and top each with a dollop of whipped cream."
        ],
        "picture_link": null,
        "color": 12036509
    }
}