{
    "recipe": {
        "title": "The Ultimate Pumpkin Pie ",
        "ingredients": [
            "1 1/4 cups all purpose flour",
            "1/2 cup powdered sugar",
            "1/2 cup (1 stick) chilled butter, cut into pieces",
            "3 tablespoons whipping cream",
            "3/4 cup sugar",
            "1 tablespoon packed golden brown sugar",
            "1 tablespoon cornstarch",
            "2 teaspoons ground cinnamon",
            "3/4 teaspoon ground ginger",
            "1/4 teaspoon (generous) salt",
            "1 16-ounce can solid pack pumpkin",
            "3/4 cup whipping cream",
            "1/2 cup sour cream",
            "3 large eggs, beaten to blend",
            "1/4 cup apricot preserves"
        ],
        "instructions": [
            "Preheat oven to 350°F. Blend first 3 ingredients in processor until mixture resembles coarse meal. Add cream and process until moist clumps form. Gather dough into ball, flatten into disk. Wrap in plastic; chill 15 minutes.",
            "Roll out dough on floured surface to 14-inch round. Transfer dough to 9-inch glass pie dish. Trim overhang to 1 inch. Fold overhang under. Make cut in crust edge at 1/2 inch intervals. Bend alternate edge pieces inward. Freeze 15 minutes.",
            "Line crust with foil, pressing firmly. Bake until sides are set, about 10 minutes. Remove foil. Bake crust until pale brown, about 10 minutes more. Reduce oven temperature to 325°F.",
            "Spread preserves over crust; pour in filling. Bake until filling puffs at edges and center is almost set, about 55 minutes. Cool on rack. Cover; chill until cold. (Can be made 1 day ahead.)",
            "For filling: Using whisk, mix first 6 ingredients in bowl until no lumps remain. Blend in pumpkin, whipping cream, sour cream and eggs. Spread preserves over crust; pour in filling. Bake until filling puffs at edges and center is almost set, about 55 minutes. Cool on rack. Cover; chill until cold. (Can be made 1 day ahead.)",
            "Using whisk, mix first 6 ingredients in bowl until no lumps remain. Blend in pumpkin, whipping cream, sour cream and eggs.",
            "Spread preserves over crust; pour in filling. Bake until filling puffs at edges and center is almost set, about 55 minutes. Cool on rack. Cover; chill until cold. (Can be made 1 day ahead.)"
        ],
        "picture_link": "https://assets.epicurious.com/photos/583f2a0b6cb6b4e20a9a94e7/6:4/w_274%2Ch_169/the-ultimate-pumpkin-pie.jpg"
    }
}