{
    "recipe": {
        "title": "The Burger Lover's Burger ",
        "ingredients": [
            "1 1/2 pounds well-marbled beef chuck top blade steaks",
            "1 1/4 teaspoons kosher salt",
            "4 hamburger buns, split",
            "Vegetable oil for brushing on burgers",
            "Freshly ground black pepper",
            "Your favorite condiments, such as ketchup, mustard, mayonnaise, lettuce, tomato slices, onion slices, and pickles",
            "Instant-read thermometer, preferably digital; meat grinder fitted with a fine (3/16-inch) or coarse (1/4-inch) die"
        ],
        "instructions": [
            "One day ahead, dry-brine the steaks: Pat the steaks dry with paper towels and rub kosher salt evenly into both sides. Put the steaks in a resealable plastic bag and chill in the refrigerator overnight.",
            "Remove the steaks from the plastic bag and pat them dry. Cut the meat into 1 1/2-inch cubes and grind them using a meat grinder fitted with a 3/16- or 1/4-inch die. Gently form the ground meat into 4 (3/4-inch-thick) burger patties—each patty should be about 4 inches in diameter. Chill the burgers on a wax paper–lined plate, covered, until ready to grill.",
            "Meanwhile, prepare your grill for direct-heat cooking over medium heat: If using a charcoal grill, open the vents on the bottom of grill and light a large chimney starter full of charcoal (preferably hardwood). When the coals are covered with white-gray ash (about 20 to 30 minutes later), spread them out on the grill's bottom rack, leaving a space to one side that is equal to the size of the food to be grilled so that it can be moved there in the case of flare-ups. Test the heat of the charcoal by holding your hand 5 inches above the coals for 3 to 4 seconds for medium heat. If the charcoal is too hot, continue to let it burn until it reaches medium.",
            "If using a gas grill, preheat all burners on high, covered, for 10 minutes, then adjust the heat to medium.",
            "Grill the buns, cut sides down, on the main grilling grate, until grill marks appear, 30 seconds to 1 minute.",
            "Lightly brush some oil on one side of each burger and season the same side with freshly ground black pepper. Grill the burgers, oiled and seasoned side down, covered, until nicely browned on the bottom, about 4 minutes. Season the other side of the burgers with pepper, then turn them carefully and continue to grill, covered, until an instant-read thermometer inserted sideways into the center of each patty registers 160°F for medium, about 4 to 5 minutes longer. Serve the burgers, topped with your favorite condiments, on the toasted buns."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54afdbff2edcf2b411439f66/6:4/w_274%2Ch_169/51168400_burger_1x1.jpg"
    }
}