{
    "recipe": {
        "title": "The Boy With The Bread: Hearty Raisin Nut Bread ",
        "ingredients": [
            "1 (.25-ounce) package or 5 teaspoons active dry yeast",
            "1/2 cup warm water (110°F)",
            "1 1/2 cups warm milk (110°F)",
            "1/2 cup (1 stick) butter, melted",
            "1/3 cup honey",
            "2 teaspoons salt",
            "2 teaspoons ground cinnamon",
            "2 teaspoons white sugar",
            "2 eggs",
            "3 cups whole wheat flour",
            "3 1/2 cups all-purpose flour",
            "2 cups raisins",
            "1 cup chopped walnuts",
            "1 egg white",
            "2 tablespoons cold water"
        ],
        "instructions": [
            "1. In a mixing bowl, dissolve yeast in the warm water until foamy, about 5 minutes. Add the milk, butter, honey, salt, cinnamon, sugar, eggs, and whole wheat flour. Beat until smooth. Stir in enough all-purpose flour to form a soft dough. 2. Place raisins in a bowl of tepid tap water. Let soak until needed. 3. Turn dough out onto a floured surface; knead until smooth and elastic, about 10 minutes. Place in a greased bowl, turning once to coat. Cover with a damp towel and let rise in a warm place until doubled, about 1 hour. 4. Grease two 8.5\" x 4.5\" loaf pans. 5. Punch dough down. Turn out onto the lightly floured surface; sprinkle with raisins and walnuts and knead them in. Divide dough in half. 6. Roll dough into loaves, keeping raisins folded inside. 7. Place loaves into greased loaf pans. Cover and let rise until doubled, about one hour. 8. Preheat oven to 375°F. 9. Beat egg white and cold water; brush over loaves. 10. Bake at 375°F for 40 minutes or until golden brown. If top browns too quickly, cover loosely with foil for the last 15 minutes. 11. Remove from pans to wire racks to cool.",
            "1. In a mixing bowl, dissolve yeast in the warm water until foamy, about 5 minutes. Add the milk, butter, honey, salt, cinnamon, sugar, eggs, and whole wheat flour. Beat until smooth. Stir in enough all-purpose flour to form a soft dough.",
            "2. Place raisins in a bowl of tepid tap water. Let soak until needed.",
            "3. Turn dough out onto a floured surface; knead until smooth and elastic, about 10 minutes. Place in a greased bowl, turning once to coat. Cover with a damp towel and let rise in a warm place until doubled, about 1 hour.",
            "4. Grease two 8.5\" x 4.5\" loaf pans.",
            "5. Punch dough down. Turn out onto the lightly floured surface; sprinkle with raisins and walnuts and knead them in. Divide dough in half.",
            "6. Roll dough into loaves, keeping raisins folded inside.",
            "7. Place loaves into greased loaf pans. Cover and let rise until doubled, about one hour.",
            "8. Preheat oven to 375°F.",
            "9. Beat egg white and cold water; brush over loaves.",
            "10. Bake at 375°F for 40 minutes or until golden brown. If top browns too quickly, cover loosely with foil for the last 15 minutes.",
            "11. Remove from pans to wire racks to cool."
        ],
        "picture_link": null
    }
}