{
    "recipe": {
        "title": "Thyme Gougères ",
        "ingredients": [
            "1/4 cup (1/2 stick) unsalted butter",
            "1 cup all-purpose flour",
            "Large pinch of cayenne pepper",
            "Large pinch of kosher salt",
            "1 cup plus 3 tablespoons grated Gruyère",
            "1/2 cup grated Asiago",
            "2 teaspoons fresh thyme leaves plus more for garnish",
            "5 large eggs"
        ],
        "instructions": [
            "Preheat oven to 400°F. Line 2 large baking sheets with parchment paper. Bring butter and 1 cup water to a boil in a large heavy saucepan. Remove from heat. Add flour, cayenne, and salt; stir vigorously to blend. Return to heat; stir vigorously over medium heat until mixture forms a ball and a thin, dry film forms on bottom and sides of pan, about 1 minute. Transfer mixture to a stand mixer fitted with a paddle attachment. Add 1 cup Gruyère, Asiago, and 2 teaspoons thyme; beat on low speed to blend. Add 4 eggs, one at a time, fully incorporating each egg between additions, and scraping down sides of bowl as needed.",
            "Spoon dough into a pastry bag fitted with a 1/2\" tip or a plastic bag with 1/2\" cut diagonally from 1 corner. Pipe dough onto prepared baking sheets in 1\"-1 1/4\" rounds, spacing 1\" apart. Whisk remaining egg with 1 tablespoon water in a small bowl. Brush egg wash lightly over rounds, patting down to form rounded tops. Sprinkle with remaining 3 tablespoons Gruyère. Garnish each with a few thyme leaves.",
            "Bake gougères until puffed and golden brown and centers are cooked through but still moist, 20-25 minutes. Let cool slightly and serve. DO AHEAD: Can be made 1 month ahead. Let cool completely. Store airtight in freezer. Rewarm in 325°F oven until hot, 10-15 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b29546a801766f773fb5f1/6:4/w_274%2Ch_169/367724_thyme-gougeres_1x1.jpg",
        "color": 11263292
    }
}