{
    "recipe": {
        "title": "Timballo ",
        "ingredients": [
            "1 1/2 tablespoons extra-virgin olive oil",
            "1/2 lb sweet Italian sausage meat (remove casings if in links)",
            "1 medium onion, finely chopped",
            "1 Turkish or 1/2 California bay leaf",
            "1 carrot, finely chopped",
            "1 celery rib, finely chopped",
            "1/4 teaspoon salt",
            "1 tablespoon tomato paste",
            "1/2 cup dry red wine",
            "1 (14- to 15-oz) can whole tomatoes in juice, forced with juices through a food mill (1 1/2 cups)",
            "Pinch of sugar",
            "3/4 lb ziti",
            "1 lb green Swiss chard, stems and center ribs discarded and leaves coarsely chopped (4 cups)",
            "1 1/2 tablespoons unsalted butter",
            "2 garlic cloves, minced",
            "1 tablespoon all-purpose flour",
            "1 cup whole milk",
            "1/4 teaspoon salt",
            "1/8 teaspoon white pepper",
            "1/8 teaspoon freshly grated nutmeg",
            "1 oz finely grated Parmigiano-Reggiano (1/2 cup)",
            "4 oz fresh mozzarella (not unsalted), cut into 1/2-inch cubes (scant 1cup)",
            "a 2-qt soufflé dish; parchment paper; a 6- to 8-qt wide pot"
        ],
        "instructions": [
            "For meat sauce: Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then sauté sausage, breaking up lumps with a fork, until no longer pink, about 5 minutes. Add onion and bay leaf and sauté, stirring frequently, until onion begins to brown, 5 to 7 minutes. Add carrot, celery, and salt and sauté, stirring occasionally, until vegetables begin to soften, about 4 minutes. Add tomato paste and cook, stirring constantly, 1 minute, then add wine and deglaze by boiling, scraping up any brown bits, until most of liquid is evaporated, 1 to 2 minutes. Add tomato purée and sugar and boil, stirring frequently, until thickened, 8 to 10 minutes. Cool sauce and discard bay leaf.",
            "Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then sauté sausage, breaking up lumps with a fork, until no longer pink, about 5 minutes. Add onion and bay leaf and sauté, stirring frequently, until onion begins to brown, 5 to 7 minutes. Add carrot, celery, and salt and sauté, stirring occasionally, until vegetables begin to soften, about 4 minutes. Add tomato paste and cook, stirring constantly, 1 minute, then add wine and deglaze by boiling, scraping up any brown bits, until most of liquid is evaporated, 1 to 2 minutes. Add tomato purée and sugar and boil, stirring frequently, until thickened, 8 to 10 minutes. Cool sauce and discard bay leaf.",
            "For pasta: Cook pasta in a 6- to 8-quart pot of boiling until al dente, then transfer with a skimmer to a colander to drain (do not rinse), reserving water in pot to cook chard. Cool pasta, spread in a baking pan, to warm.",
            "Cook pasta in a 6- to 8-quart pot of boiling until al dente, then transfer with a skimmer to a colander to drain (do not rinse), reserving water in pot to cook chard. Cool pasta, spread in a baking pan, to warm.",
            "For chard in béchamel sauce: Add chard to pot and simmer, uncovered, until tender, 3 to 5 minutes, then transfer with skimmer to a bowl of ice and cold water. Drain chard and squeeze handfuls, then finely chop. Heat butter in a 1 1/2- to 2-quart heavy saucepan over moderate heat until foam subsides, then add garlic and cook, whisking, 1 minute. Add flour and cook, whisking, 1 minute, then add milk in a slow stream, whisking. Bring to a boil, whisking. Reduce heat and simmer, whisking occasionally, until sauce is slightly thickened, about 5 minutes. Stir in chard, salt, pepper, nutmeg, and 2 tablespoons Parmigiano, then remove pan from heat.",
            "Add chard to pot and simmer, uncovered, until tender, 3 to 5 minutes, then transfer with skimmer to a bowl of ice and cold water. Drain chard and squeeze handfuls, then finely chop.",
            "Heat butter in a 1 1/2- to 2-quart heavy saucepan over moderate heat until foam subsides, then add garlic and cook, whisking, 1 minute. Add flour and cook, whisking, 1 minute, then add milk in a slow stream, whisking. Bring to a boil, whisking. Reduce heat and simmer, whisking occasionally, until sauce is slightly thickened, about 5 minutes. Stir in chard, salt, pepper, nutmeg, and 2 tablespoons Parmigiano, then remove pan from heat.",
            "Assemble and bake timballo: Put oven rack in lower third of oven and preheat oven to 375°F. Oil soufflé dish and line bottom with a round of parchment paper, then oil parchment. Cover bottom of dish with a single layer of pasta. Sprinkle 1/2 cup mozzarella and 3 tablespoons Parmigiano over pasta, then spoon half of meat sauce in an even layer over cheese. Arrange one third of remaining pasta over meat sauce in soufflé dish and top with all of chard, then another layer of pasta (about half of remainder). Sprinkle with remainder of cheeses, then spoon remaining meat sauce over cheese. Top with remaining pasta. (You may have pasta left over.) Cover pasta with an oiled round of parchment (oiled side down) and cover dish with foil. Bake in a in wide 6- to 8-quart pot until bubbling and a metal skewer or thin knife inserted in center of timballo comes out hot to the touch, about 1 hour. Remove soufflé dish from water bath and let stand, covered, 15 minutes. Remove foil and parchment and run a knife around edge of timballo to loosen, then invert a platter over soufflé dish and invert timballo onto platter. Remove soufflé dish and remaining parchment.",
            "Put oven rack in lower third of oven and preheat oven to 375°F.",
            "Oil soufflé dish and line bottom with a round of parchment paper, then oil parchment. Cover bottom of dish with a single layer of pasta. Sprinkle 1/2 cup mozzarella and 3 tablespoons Parmigiano over pasta, then spoon half of meat sauce in an even layer over cheese. Arrange one third of remaining pasta over meat sauce in soufflé dish and top with all of chard, then another layer of pasta (about half of remainder). Sprinkle with remainder of cheeses, then spoon remaining meat sauce over cheese. Top with remaining pasta. (You may have pasta left over.) Cover pasta with an oiled round of parchment (oiled side down) and cover dish with foil.",
            "Bake in a in wide 6- to 8-quart pot until bubbling and a metal skewer or thin knife inserted in center of timballo comes out hot to the touch, about 1 hour. Remove soufflé dish from water bath and let stand, covered, 15 minutes. Remove foil and parchment and run a knife around edge of timballo to loosen, then invert a platter over soufflé dish and invert timballo onto platter. Remove soufflé dish and remaining parchment."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df292f3a00aeb2f1d5d60/6:4/w_274%2Ch_169/230467.jpg"
    }
}