{
    "recipe": {
        "title": "To Dye Easter Eggs ",
        "ingredients": [
            "1 teaspoon white vinegar",
            "About 20 drops liquid food coloring",
            "White-shelled hard-boiled eggs"
        ],
        "instructions": [
            "Line large baking sheet with paper towels and top with wire cooling rack.",
            "In small bowl or cup, stir together 1/2 cup boiling water, vinegar, and food coloring. Immerse eggs in dye, turning occasionally to ensure even coating, until desired color, about 5 minutes. Using slotted spoon or tongs, remove eggs from dye and transfer to rack to drain. Refrigerate when dry.",
            "Here are some ways to create designs on your eggs: Striped Easter Eggs: Wrap a portion of the egg with a rubber band before dyeing. Once the egg is dry, remove the rubber band to reveal the white, undyed strip underneath. Decal Easter Eggs: Another way to block off portions of the egg: Affix stickers or tape in shapes such as daisies or dots before dyeing. Remove once the egg is dry. Free-Hand Easter Eggs: A third way to block off portions: Before dyeing, draw on the egg with a light-colored crayon or wax. If desired, once the egg is dry, the wax can be softened by holding the egg over a candle flame and then wiped off. Two-Toned Easter Eggs: All three of the above methods can be used to create two-toned eggs: Dye the whole egg a light color, such as pink, and let it dry. Then wrap the egg with a rubber band, affix stickers, or draw a design in crayon. Dye the egg a second color, such as blue. Once dry, remove the rubber band, stickers, or crayon. The areas blocked off will remain the first color (in this case, pink), while the rest of the egg will turn a combination of the 2 colors (in this case, purple). Ombre Easter Eggs: Dip a portion of the egg in one color and another portion in another color. If the two sections overlap, that area will turn a combination of the two colors.",
            "Striped Easter Eggs: Wrap a portion of the egg with a rubber band before dyeing. Once the egg is dry, remove the rubber band to reveal the white, undyed strip underneath.",
            "Decal Easter Eggs: Another way to block off portions of the egg: Affix stickers or tape in shapes such as daisies or dots before dyeing. Remove once the egg is dry.",
            "Free-Hand Easter Eggs: A third way to block off portions: Before dyeing, draw on the egg with a light-colored crayon or wax. If desired, once the egg is dry, the wax can be softened by holding the egg over a candle flame and then wiped off.",
            "Two-Toned Easter Eggs: All three of the above methods can be used to create two-toned eggs: Dye the whole egg a light color, such as pink, and let it dry. Then wrap the egg with a rubber band, affix stickers, or draw a design in crayon. Dye the egg a second color, such as blue. Once dry, remove the rubber band, stickers, or crayon. The areas blocked off will remain the first color (in this case, pink), while the rest of the egg will turn a combination of the 2 colors (in this case, purple).",
            "Ombre Easter Eggs: Dip a portion of the egg in one color and another portion in another color. If the two sections overlap, that area will turn a combination of the two colors."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5cb7634f06a6234dad98bfef/6:4/w_274%2Ch_169/how-to-dye-easter-eggs-recipe-041719.jpg",
        "color": 7682780
    }
}