{
    "recipe": {
        "title": "To Make an Excellent Cherry Bounce ",
        "ingredients": [
            "10 to 11 pounds fresh sour cherries, preferably Morello, or 3 jars (1 pound, 9 ounce) preserved Morello cherries",
            "4 cups brandy",
            "3 cups sugar, plus more as needed",
            "2 cinnamon sticks, broken into pieces",
            "2 to 3 cloves",
            "1 (1/4-inch) piece fresh whole nutmeg"
        ],
        "instructions": [
            "1. Pit the cherries, cut them in half, and put them in a large bowl. Using a potato masher, carefully mash the fruit to extract as much juice as possible. Strain the juice through a large fine-mesh strainer, pressing the fruit with a sturdy spoon. (You should have about 8 cups.) Reserve the mashed cherries in the freezer or refrigerator for later use. If using jarred cherries, drain the fruit and set the juice aside before halving and mashing the cherries. Add any pressed juice to the reserved jarred juice.",
            "2. In a lidded 1-gallon glass jar, combine the juice with the brandy and sugar, stirring to dissolve the sugar. Cover with the lid, and set aside in the refrigerator for 24 hours, occasionally stirring or carefully shaking the jar.",
            "3. Bring 2 cups of the juice to a simmer over medium heat. Taste the sweetened juice and add more sugar, if desired. Stir in the cinnamon sticks, cloves, and nutmeg. Then cover, and simmer for about 5 minutes. Remove from the heat, and set aside to cool to room temperature. Strain, and discard the spices.",
            "4. Stir the spiced juice back into the 1-gallon glass jar with the reserved sweetened juice. Cover loosely with the lid, and set aside for at least 2 weeks before serving, occasionally shaking the jar with care.",
            "5. Serve at room temperature in small cordial or wine glasses. Store the remaining cherry bounce in the refrigerator."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b408a5d5e8c3e1070ae5cb/6:4/w_274%2Ch_169/394679_cherry-bounce_1x1.jpg"
    }
}