{
    "recipe": {
        "title": "Toasted-Coconut Streusel Coffeecake ",
        "ingredients": [
            "3/4 cup firmly packed light brown sugar",
            "3/4 cup all-purpose flour",
            "1 tablespoon cinnamon",
            "3/4 stick (6 tablespoons) unsalted butter, cut into bits and softened",
            "1 cup sweetened flaked coconut, toasted lightly and cooled",
            "2 sticks (1 cup) unsalted butter, softened",
            "1 cup firmly packed light brown sugar",
            "3 large eggs",
            "1 tablespoon vanilla",
            "3 cups all-purpose flour",
            "2 1/2 teaspoons double-acting baking powder",
            "1 teaspoon baking soda",
            "1 teaspoon salt",
            "1 1/4 cups sour cream",
            "2 cups sweetened flaked coconut, toasted lightly and cooled"
        ],
        "instructions": [
            "In a bowl stir together the brown sugar, the flour, and the cinnamon, add the butter, and blend the mixture until it resembles coarse meal. Stir in the coconut and reserve the streusel.",
            "Make the cake batter: In a bowl with an electric mixer cream the butter, add the brown sugar, and beat the mixture until it is light and fluffy. Add the eggs, 1 at a time, beating well after each addition, and the vanilla and beat the mixture until it is combined well. In another bowl whisk together the flour, the baking powder, the baking soda, and the salt, add the flour mixture to the butter mixture alternately with the sour cream, beginning and ending with the flour mixture and beating the batter after each addition until it is just combined, and stir in the coconut.",
            "In a bowl with an electric mixer cream the butter, add the brown sugar, and beat the mixture until it is light and fluffy. Add the eggs, 1 at a time, beating well after each addition, and the vanilla and beat the mixture until it is combined well. In another bowl whisk together the flour, the baking powder, the baking soda, and the salt, add the flour mixture to the butter mixture alternately with the sour cream, beginning and ending with the flour mixture and beating the batter after each addition until it is just combined, and stir in the coconut.",
            "Spoon half the batter into a buttered and floured tube pan, measuring 10 inches across the top and about 4 inches deep, with a removable bottom, spreading it evenly. Sprinkle half the reserved streusel over the batter and spoon the remaining batter into the pan, spreading it carefully over the streusel. Sprinkle the remaining streusel over the top and bake the cake in the middle of a preheated 350°F. oven for 1 to 1 1/4 hours, or until the tester comes out clean. Let the cake cool in the pan on a rack for 10 minutes, remove the tube section from the pan, and run a thin knife under the cake to release the bottom. Lift the cake off the tube section of the pan with 2 long spatulas, let it cool completely on the rack, and transfer it to a serving plate.",
            "Spoon half the batter into a buttered and floured tube pan, measuring 10 inches across the top and about 4 inches deep, with a removable bottom, spreading it evenly. Sprinkle half the reserved streusel over the batter and spoon the remaining batter into the pan, spreading it carefully over the streusel. Sprinkle the remaining streusel over the top and bake the cake in the middle of a preheated 350°F. oven for 1 to 1 1/4 hours, or until the tester comes out clean. Let the cake cool in the pan on a rack for 10 minutes, remove the tube section from the pan, and run a thin knife under the cake to release the bottom. Lift the cake off the tube section of the pan with 2 long spatulas, let it cool completely on the rack, and transfer it to a serving plate."
        ],
        "picture_link": null,
        "color": 12469019
    }
}