{
    "recipe": {
        "title": "Toasted Spelt Soup with Escarole and White Beans ",
        "ingredients": [
            "1 medium onion, coarsely chopped",
            "1 small fennel bulb, cored, coarsely chopped",
            "1 carrot, coarsely chopped",
            "1 celery stalk, coarsely chopped",
            "2 tablespoons olive oil, plus more for serving",
            "3 ounces pancetta, cut into 1/4\" pieces",
            "1 cup spelt",
            "2 garlic cloves, chopped",
            "Kosher salt, freshly ground pepper",
            "1 tablespoon tomato paste",
            "3/4 teaspoon crushed red pepper flakes",
            "12 cups low-sodium chicken broth",
            "1/2 head escarole, leaves torn into bite-size pieces",
            "1 15-ounce can cannellini beans, rinsed",
            "Shaved Parmesan (for serving)"
        ],
        "instructions": [
            "Pulse onion in a food processor until finely chopped. Transfer to a medium bowl. Repeat with fennel, carrot, and celery, placing vegetables in bowl with onion.",
            "Heat 2 tablespoons oil in a large pot. Add pancetta and cook, stirring often, until golden brown, about 3 minutes. Add spelt and cook, stirring often, until grains are a couple of shades darker, about 3 minutes.",
            "Add onion, fennel, carrot, celery, and garlic to pot; season with salt and pepper. Cook, stirring occasionally, until vegetables are softened, 6–8 minutes. Add tomato paste and red pepper flakes, and cook until paste is slightly darkened, about 1 minute.",
            "Add broth to pot, bring to a boil, reduce heat, and simmer, partially covered, until spelt is tender, 60–70 minutes. Stir escarole and beans into soup and cook until escarole is wilted and beans are warmed though, about 4 minutes.",
            "Serve soup drizzled with oil and topped with Parmesan.",
            "DO AHEAD: Soup can be made 2 days ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54acc00f6529d92b2c03f5bb/6:4/w_274%2Ch_169/51210020_spelt-soup_1x1.jpg",
        "color": 6349913
    }
}