{
    "recipe": {
        "title": "Toasted Marshmallow Cupcakes ",
        "ingredients": [
            "60g (about 2 oz) digestive biscuits",
            "1 x My Favorite Vanilla Cupcakes recipe",
            "100g (3.5 oz) dark chocolate (70–80% cocoa solids)",
            "1 tsp butter",
            "50ml (1/4 cup) heavy cream",
            "125g (2/3 cup) superfine sugar",
            "75g (1/4 cup) golden syrup",
            "2 large egg whites",
            "1/2 tsp vanilla extract",
            "4 squares of dark chocolate, to decorate",
            "Electric hand-held whisk"
        ],
        "instructions": [
            "Blitz the digestive biscuits in a food processor until they are finely ground, or put them into a sealable bag, seal the bag and crush with a rolling pin. There shouldn’t be any large pieces remaining.",
            "Make My Favourite Vanilla Cupcakes recipe, adding the digestive biscuit crumbs with the flour in step 1.",
            "To make the filling, finely chop the chocolate and put it into a small bowl. Heat the butter and cream in a saucepan until steaming hot but not boiling, then pour over the chocolate. Remove from the heat and leave to stand for a minute before stirring to form a smooth ganache. If any lumps of chocolate remain, put the bowl into the microwave for ten seconds then stir; repeat until the lumps are gone. Chill in the fridge for 30 minutes or so, until it is firm and scoopable.",
            "To make the marshmallow topping, put the sugar, golden syrup and 2 tablespoons of water into a saucepan and cook over a medium-high heat without stirring until the mixture reaches the soft-ball stage (244°F/118°C on a candy thermometer). If you don't have a thermometer, the mixture is ready when the bubbles start to stick together in the pan and it drips off a spoon in a steady stream. Remove from the heat.",
            "Put the egg whites into a clean, grease-free bowl and whisk with an electric hand-held whisk until soft peaks form. With the whisk on low, carefully pour the hot sugar onto the egg whites, whisking all the time. When all the sugar has been added, increase the speed to high and whip until the sides of the bowl feel only slightly warm and the mixture is thick and glossy. Add the vanilla extract at the end. This icing is easiest to pipe when it is warm, so transfer immediately to a piping bag fitted with a large circular nozzle or with the tip cut off.",
            "To assemble, use a sharp knife or specialist cupcake corer to make a circular incision in the center of each cupcake, remove the center and fill each one with a teaspoon of the chocolate filling.",
            "Pipe a large mound of marshmallow topping on the top of each cupcake, covering the chocolate filling. Use a blowtorch, if you have one, to lightly brown each one, avoiding the paper case as this will burn. You could use the broiler to brown the marshmallow topping, but watch carefully because it is more difficult to control the color and prevent it burning.",
            "To finish, chop the chocolate squares finely and sprinkle over the top of the marshmallow."
        ],
        "picture_link": "https://assets.epicurious.com/photos/595d02e487ee53228621df63/6:4/w_274%2Ch_169/toasted-marshmallow-cupcakes-recipe-HC-070517.jpg",
        "color": 741277
    }
}