{
    "recipe": {
        "title": "Toasted Bread with Burrata and Arugula ",
        "ingredients": [
            "6 3x2-inch pieces friselle or crusty ciabatta bread, halved horizontally",
            "5 tablespoons (about) extra-virgin olive oil, divided",
            "2 garlic cloves, peeled, halved",
            "1 8-ounce ball burrata cheese,* cut into 12 wedges",
            "1 1/2 cups (about) baby arugula",
            "Finely grated peel from 1 lemon"
        ],
        "instructions": [
            "Finely grated peel from 1 lemon Preheat oven to 400°F. Fill small bowl with water. Place bread halves, cut side up, on baking sheet; brush bread with 2 tablespoons olive oil. Toast bread in oven until crisp and light golden around edges, about 15 minutes. Remove from oven. Lightly brush each bread half with water (do not soak). Rub cut sides of bread halves with cut sides of garlic halves. Place 2 bread halves, cut side up, on each of 6 plates. Drizzle each bread half lightly with olive oil. Top each half with 1 burrata wedge; sprinkle with salt and freshly ground black pepper and drizzle lightly with olive oil. Toss arugula with 1 tablespoon olive oil in small bowl; sprinkle with salt and freshly ground black pepper. Mound arugula salad atop burrata on each bread half; sprinkle each with grated lemon peel and serve.",
            "Finely grated peel from 1 lemon Preheat oven to 400°F. Fill small bowl with water. Place bread halves, cut side up, on baking sheet; brush bread with 2 tablespoons olive oil. Toast bread in oven until crisp and light golden around edges, about 15 minutes. Remove from oven. Lightly brush each bread half with water (do not soak). Rub cut sides of bread halves with cut sides of garlic halves.",
            "Place 2 bread halves, cut side up, on each of 6 plates. Drizzle each bread half lightly with olive oil. Top each half with 1 burrata wedge; sprinkle with salt and freshly ground black pepper and drizzle lightly with olive oil. Toss arugula with 1 tablespoon olive oil in small bowl; sprinkle with salt and freshly ground black pepper. Mound arugula salad atop burrata on each bread half; sprinkle each with grated lemon peel and serve.",
            "A soft, fresh Italian cheese made from mozzarella and cream; available at some supermarkets and at specialty foods stores and Italian markets.",
            "A soft, fresh Italian cheese made from mozzarella and cream; available at some supermarkets and at specialty foods stores and Italian markets.",
            "A soft, fresh Italian cheese made from mozzarella and cream; available at some supermarkets and at specialty foods stores and Italian markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b33eb721388ef838b083ce/6:4/w_274%2Ch_169/358496_toasted-bread-burrata-arugula_1x1.jpg"
    }
}