{
    "recipe": {
        "title": "Toffee Bar Coffee Cake ",
        "ingredients": [
            "2 cups all purpose flour",
            "1 cup (packed) dark brown sugar",
            "1/2 cup sugar",
            "1/2 cup (1 stick) unsalted butter, room temperature",
            "1/2 teaspoon salt",
            "4 1.4-ounce chocolate-covered English toffee bars (such as Heath Bars), chopped (about 1 cup)",
            "1 cup chopped pecans",
            "1 teaspoon baking soda",
            "1 cup buttermilk",
            "1 large egg",
            "1 teaspoon vanilla extract"
        ],
        "instructions": [
            "Preheat oven to 350°F. Butter 13x9x2-inch glass baking dish. Using electric mixer, beat first 5 ingredients in large bowl on low speed until mixture resembles coarse meal. Transfer 1/2 cup butter-sugar mixture to medium bowl; mix in toffee and pecans. Set aside. Stir baking soda into remaining butter-sugar mixture in large bowl. Add buttermilk, egg and vanilla, beating until just combined. Transfer batter to prepared dish. Sprinkle toffee topping evenly over batter. Bake until topping is golden brown and toothpick inserted into center of cake comes out clean, about 35 minutes. Cool completely in baking dish. Cut into 16 squares. (Can be made 1 day ahead. Store in airtight container at room temperature.)",
            "Preheat oven to 350°F. Butter 13x9x2-inch glass baking dish. Using electric mixer, beat first 5 ingredients in large bowl on low speed until mixture resembles coarse meal. Transfer 1/2 cup butter-sugar mixture to medium bowl; mix in toffee and pecans. Set aside. Stir baking soda into remaining butter-sugar mixture in large bowl. Add buttermilk, egg and vanilla, beating until just combined. Transfer batter to prepared dish.",
            "Sprinkle toffee topping evenly over batter. Bake until topping is golden brown and toothpick inserted into center of cake comes out clean, about 35 minutes. Cool completely in baking dish. Cut into 16 squares. (Can be made 1 day ahead. Store in airtight container at room temperature.)"
        ],
        "picture_link": null
    }
}