{
    "recipe": {
        "title": "Tom Kha Gai (Chicken Coconut Soup) ",
        "ingredients": [
            "2 stalks fresh lemongrass, tough outer layers removed",
            "1 1\" piece ginger, peeled",
            "10 kaffir lime leaves, or use 1 tablespoon lime zest and 1/4 cup lime juice",
            "6 cups low-sodium chicken broth",
            "1 1/2 pounds skinless, boneless chicken thighs, cut into 1\" pieces",
            "8 ounces shiitake, oyster, or maitake mushrooms, stemmed, caps cut into bite-size pieces",
            "1 13.5-ounce can coconut milk",
            "2 tablespoons fish sauce",
            "1 teaspoon sugar",
            "Chili oil, cilantro leaves with tender stems, and lime wedges (for serving)",
            "N/A cilantro leaves with tender stems",
            "N/A lime wedges"
        ],
        "instructions": [
            "Using the back of a knife, lightly smash lemongrass and ginger; cut lemongrass into 4\" pieces. Bring lemongrass, ginger, lime leaves, and broth to a boil in a large saucepan. Reduce heat and simmer until flavors are melded, 8-10 minutes. Strain broth into clean saucepan; discard solids. Add chicken and return to a boil. Reduce heat, add mushrooms, and simmer, skimming occasionally, until chicken is cooked through and mushrooms are soft, 20-25 minutes. Mix in coconut milk, fish sauce, and sugar. Divide soup among bowls. Serve with chili oil, cilantro, and lime wedges.",
            "Using the back of a knife, lightly smash lemongrass and ginger; cut lemongrass into 4\" pieces. Bring lemongrass, ginger, lime leaves, and broth to a boil in a large saucepan. Reduce heat and simmer until flavors are melded, 8-10 minutes. Strain broth into clean saucepan; discard solids.",
            "Add chicken and return to a boil. Reduce heat, add mushrooms, and simmer, skimming occasionally, until chicken is cooked through and mushrooms are soft, 20-25 minutes. Mix in coconut milk, fish sauce, and sugar.",
            "Divide soup among bowls. Serve with chili oil, cilantro, and lime wedges."
        ],
        "picture_link": "https://assets.epicurious.com/photos/579909a620ada1484ddf2ff6/6:4/w_274%2Ch_169/tom-kha-gai-em-chicken-coconut-soup-em.jpg"
    }
}