{
    "recipe": {
        "title": "Tomato Bread Pudding ",
        "ingredients": [
            "3 pounds plum tomatoes such as Roma, halved lengthwise",
            "1 1/2 teaspoon Herbes de Provence",
            "1/2 cup extra-virgin olive oil, divided",
            "1 head garlic, left whole",
            "10 cups cubed (1-inch) country-style Italian bread (1 pound)",
            "2 cups whole milk",
            "1 cup heavy cream",
            "8 large eggs",
            "2 cups coarsely grated chilled Italian Fontina (9 ounces)",
            "1/2 cup grated Parmigiano-Reggiano"
        ],
        "instructions": [
            "Preheat oven to 400°F with rack in middle. Butter a 3-quart shallow baking dish (about 13 by 9 inches). Toss tomatoes in a bowl with herbes de Provence, 1 tablespoon oil, 3/4 teaspoon salt, and 1/2 teaspoon pepper. Arrange tomatoes, cut sides up, in a large heavy 4-sided sheet pan. Cut off and discard 1/4 inch from top of garlic head to expose cloves, then put on a sheet of foil and drizzle with 1 teaspoon oil. Wrap garlic in foil and roast in pan with tomatoes until tomatoes are browned but still juicy and garlic is soft, 50 to 60 minutes. (Leave oven on.) Cool garlic to warm, then force through a medium-mesh sieve with a rubber spatula, discarding skins. Reserve purée While garlic cooks, toss bread cubes in a large bowl with remaining oil until coated, then spread out in a large 4-sided sheet pan and bake until golden brown, 20 to 25 minutes. Cool in pan. Reduce oven temperature to 350°F. Whisk together milk, cream, eggs, garlic purée, 2 teaspoons salt, and 1 1/2 teaspoon pepper. Stir in cheeses. Transfer bread to baking dish, then pour egg mixture over bread and add tomatoes, pushing some down between bread cubes. Bake until firm to the touch and golden brown in spots, 50 to 60 minutes.",
            "Preheat oven to 400°F with rack in middle. Butter a 3-quart shallow baking dish (about 13 by 9 inches).",
            "Toss tomatoes in a bowl with herbes de Provence, 1 tablespoon oil, 3/4 teaspoon salt, and 1/2 teaspoon pepper. Arrange tomatoes, cut sides up, in a large heavy 4-sided sheet pan.",
            "Cut off and discard 1/4 inch from top of garlic head to expose cloves, then put on a sheet of foil and drizzle with 1 teaspoon oil. Wrap garlic in foil and roast in pan with tomatoes until tomatoes are browned but still juicy and garlic is soft, 50 to 60 minutes. (Leave oven on.) Cool garlic to warm, then force through a medium-mesh sieve with a rubber spatula, discarding skins. Reserve purée",
            "While garlic cooks, toss bread cubes in a large bowl with remaining oil until coated, then spread out in a large 4-sided sheet pan and bake until golden brown, 20 to 25 minutes. Cool in pan.",
            "Reduce oven temperature to 350°F.",
            "Whisk together milk, cream, eggs, garlic purée, 2 teaspoons salt, and 1 1/2 teaspoon pepper. Stir in cheeses. Transfer bread to baking dish, then pour egg mixture over bread and add tomatoes, pushing some down between bread cubes. Bake until firm to the touch and golden brown in spots, 50 to 60 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54e4c2fe4f77a310045d5a0b/6:4/w_274%2Ch_169/242854_tomato-bread-pudding_6x4.jpg"
    }
}