{
    "recipe": {
        "title": "Tomato-Lemon Tart ",
        "ingredients": [
            "1 sheet frozen puff pastry (one 14-ounce package or half of a 17.3-ounce package), thawed",
            "1 garlic clove, finely grated",
            "2 tablespoons olive oil, divided, plus more for serving",
            "1 lemon, thinly sliced into rounds, preferably on a mandoline, seeds removed",
            "1 cup torn basil leaves",
            "1 pound ripe tomatoes (about 3 medium), sliced 1/4-inch thick, patted dry with paper towels"
        ],
        "instructions": [
            "Preheat oven to 375°F. Roll out puff pastry on a sheet of lightly floured parchment paper, smoothing out creases, to a large rectangle measuring about 15x10\". Prick pastry in a few places with a fork, leaving a 1\" border around the edges, then slide parchment paper onto a rimmed baking sheet. Combine garlic and 1 Tbsp. oil in a small bowl and brush dough with garlic oil, staying within border. Arrange lemon slices in a single layer over brushed pastry, then scatter basil over lemon slices. Arrange tomatoes on top (a little overlap is okay). Sprinkle with lots of salt and a few grinds of pepper, then drizzle with 1 Tbsp. oil. Bake tart until edges of pastry are browned, puffed, and crisp, 30–35 minutes. Let tart cool 10 minutes before cutting into 8 pieces. Drizzle with more oil and top each with a dollop of crème fraîche.",
            "Preheat oven to 375°F. Roll out puff pastry on a sheet of lightly floured parchment paper, smoothing out creases, to a large rectangle measuring about 15x10\". Prick pastry in a few places with a fork, leaving a 1\" border around the edges, then slide parchment paper onto a rimmed baking sheet.",
            "Combine garlic and 1 Tbsp. oil in a small bowl and brush dough with garlic oil, staying within border. Arrange lemon slices in a single layer over brushed pastry, then scatter basil over lemon slices.",
            "Arrange tomatoes on top (a little overlap is okay). Sprinkle with lots of salt and a few grinds of pepper, then drizzle with 1 Tbsp. oil.",
            "Bake tart until edges of pastry are browned, puffed, and crisp, 30–35 minutes. Let tart cool 10 minutes before cutting into 8 pieces. Drizzle with more oil and top each with a dollop of crème fraîche."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59c2f305ae34284e98657a2c/6:4/w_274%2Ch_169/tomato-lemon-puff-pastry-tart-recipe-091117.jpg"
    }
}