{
    "recipe": {
        "title": "Tomatillo-Pepita Gazpacho ",
        "ingredients": [
            "1/2 cup (generous) unsalted shelled pepitas (about 2 1/2 ounces)",
            "2 pounds tomatillos, husked, rinsed",
            "1 large fresh poblano chile",
            "1 garlic clove, pressed",
            "1 cup vegetable broth",
            "1/3 cup chopped green onion",
            "1/4 cup chopped fresh cilantro",
            "1/4 cup extra-virgin olive oil",
            "1 small unpeeled English hothouse cucumber, diced",
            "1 avocado, peeled, pitted, diced",
            "1 12-ounce container cherry tomatoes, halved or quartered if large"
        ],
        "instructions": [
            "Prepare barbecue (medium-high heat). Finely grind pepitas in processor; leave in processor. Grill tomatillos and poblano chile until tomatillos are slightly charred and soft and chile is charred all over, turning occasionally, 12 to 15 minutes. Add tomatillos to processor. Peel, seed, and coarsely chop chile; add to processor. Add garlic; process soup to coarse puree. Transfer to large bowl. Stir in vegetable broth. Season soup with salt and pepper. Cover; chill until cold, about 3 hours. Mix in green onion and all remaining ingredients. Divide soup among bowls.",
            "Prepare barbecue (medium-high heat). Finely grind pepitas in processor; leave in processor. Grill tomatillos and poblano chile until tomatillos are slightly charred and soft and chile is charred all over, turning occasionally, 12 to 15 minutes. Add tomatillos to processor. Peel, seed, and coarsely chop chile; add to processor. Add garlic; process soup to coarse puree. Transfer to large bowl. Stir in vegetable broth. Season soup with salt and pepper. Cover; chill until cold, about 3 hours.",
            "Mix in green onion and all remaining ingredients. Divide soup among bowls."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d78987b55306961bf3440/6:4/w_274%2Ch_169/242687_hires.jpg"
    }
}