{
    "recipe": {
        "title": "Tom's Tasty Tomato Soup with Brown Butter Croutons ",
        "ingredients": [
            "1 tablespoon unsalted butter",
            "1 tablespoon olive oil",
            "1 medium onion, thinly sliced",
            "3 garlic cloves, smashed with the side of a knife and peeled",
            "5 cups canned whole tomatoes in juice",
            "1 cup water",
            "2/3 cup heavy cream",
            "2 teaspoons kosher salt, plus more as needed",
            "1/4 teaspoon freshly ground black pepper, plus more as needed",
            "1/4 teaspoon crushed red pepper flakes",
            "1/4 teaspoon celery seed",
            "1/4 teaspoon dried oregano or 1/2 teaspoon finely chopped fresh oregano",
            "1 tablespoon sugar",
            "3 tablespoons unsalted butter",
            "4 slices european-style rustic bread, crusts removed, cut into 3/4- to 1-inch cubes (30 to 36 cubes)",
            "Kosher salt and freshly ground black pepper"
        ],
        "instructions": [
            "1. Heat the butter and olive oil in a large saucepan and sauté the onion and garlic until the onion is translucent, about 5 minutes. Add the tomatoes, water, cream, salt, red pepper flakes, celery seed, oregano, and sugar. Bring to a boil, then lower the heat to a simmer and simmer for 15 minutes.",
            "2. Remove from the heat and puree in batches in the container of a blender. Return the soup to the pot and reheat to a simmer, seasoning to taste with more salt and pepper.",
            "3. Meanwhile, to make the brown butter croutons, preheat the oven to 350°F. Heat the butter in a small pan over medium heat and cook, stirring often, until the butter is golden brown and aromatic, about 3 minutes after the butter melts. Remove from the heat. Put the bread cubes in a bowl and pour the brown butter over them, tossing to coat. Season to taste with salt and pepper and toss again. Spread the bread cubes on a baking sheet and place it in the oven. Bake until the croutons are toasted and golden, about 20 minutes, stirring occasionally. Remove the pan from the oven.",
            "4. Serve the soup hot, garnished with the croutons."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b05183fca98987608afb75/6:4/w_274%2Ch_169/51129200_tomato-soup_1x1.jpg",
        "color": 12965346
    }
}