{
    "recipe": {
        "title": "Tortilla Española ",
        "ingredients": [
            "2 1/4 cups olive oil plus 1 tablespoon olive oil",
            "1 thinly sliced medium onion",
            "salt",
            "2 peeled medium waxy potatoes, cut into 3/4\" pieces",
            "8 large eggs"
        ],
        "instructions": [
            "Heat 1 tablespoon olive oil in a large skillet over medium heat. Add 1 thinly sliced medium onion, season with salt, and cook, stirring occasionally, until softened and dark brown, 35–40 minutes; let cool slightly. Meanwhile, heat 2 peeled medium waxy potatoes, cut into 3/4\" pieces, in 2 cups olive oil in a medium saucepan over medium-high heat until oil around potatoes begins to bubble. Reduce heat to medium and cook until potatoes are tender but have not taken on any color, 10–12 minutes. Drain potatoes, reserving oil; season with salt and let cool slightly. Using a fork, gently beat 8 large eggs with onion, potatoes, and 1/4 cup reserved cooking oil in a large bowl. Heat 3 tablespoons reserved cooking oil in a 10\" nonstick skillet over medium heat (reserve remaining oil for another use). Add egg mixture and cook, lifting at edge and tilting skillet to let uncooked egg run underneath, until bottom and edge of tortilla are set but center is still wet. Set a large plate on top of skillet. Swiftly invert tortilla onto plate, then slide back into skillet, cooked side up. Cook until just set, about 2 minutes longer. Cut into wedges.",
            "Heat 1 tablespoon olive oil in a large skillet over medium heat. Add 1 thinly sliced medium onion, season with salt, and cook, stirring occasionally, until softened and dark brown, 35–40 minutes; let cool slightly.",
            "Meanwhile, heat 2 peeled medium waxy potatoes, cut into 3/4\" pieces, in 2 cups olive oil in a medium saucepan over medium-high heat until oil around potatoes begins to bubble. Reduce heat to medium and cook until potatoes are tender but have not taken on any color, 10–12 minutes. Drain potatoes, reserving oil; season with salt and let cool slightly.",
            "Using a fork, gently beat 8 large eggs with onion, potatoes, and 1/4 cup reserved cooking oil in a large bowl.",
            "Heat 3 tablespoons reserved cooking oil in a 10\" nonstick skillet over medium heat (reserve remaining oil for another use). Add egg mixture and cook, lifting at edge and tilting skillet to let uncooked egg run underneath, until bottom and edge of tortilla are set but center is still wet.",
            "Set a large plate on top of skillet. Swiftly invert tortilla onto plate, then slide back into skillet, cooked side up. Cook until just set, about 2 minutes longer. Cut into wedges."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac421819925f464b3a9e90/6:4/w_274%2Ch_169/51234670_tortilla-espanola_1x1.jpg"
    }
}