{
    "recipe": {
        "title": "Tortilla Casserole with Turkey ",
        "ingredients": [
            "3/4 cup plus 1 tablespoon corn oil",
            "18 corn tortillas",
            "3 medium zucchini, thinly sliced",
            "2 cups chayote* or other squash, thinly sliced",
            "1 cup fresh or thawed frozen corn kernels",
            "2 cups green beans, steamed and cut into 1-inch pieces",
            "2 to 3 cups leftover turkey, shredded",
            "2 cups (8 ounces) shredded Monterrey Jack or panela cheese**",
            "6 cups Salsa de Tomatillo***",
            "2 cups sour cream",
            "1 tablespoon milk",
            "Sea salt and ground black pepper to taste",
            "Makes 5 to 6 cups.",
            "60 tomatillos, husked and rinsed (about 3 pounds)",
            "8 serrano chiles (seeded and deveined for a milder dish)",
            "4 cups water",
            "5 garlic cloves, chopped",
            "1 cup coarsely chopped cilantro leaves",
            "2 tablespoons vegetable oil",
            "Sea salt to taste",
            "*Chayote, also known as christophene and mirliton, is a mild-tasting, pear-shaped squash. Any summer squash can be substituted.",
            "**Panela is a salty, crumbly cow's milk cheese. Feta is a good substitute.",
            "***Tomatillos are often referred to as \"green tomatoes,\" but are members of the gooseberry family. To prepare tomatillos for the salsa, remove their papery husks and rinse away their sticky outer coating. Or, canned whole tomatillos are available under the San Marcos brand."
        ],
        "instructions": [
            "Prepare the Salsa de Tomatillo. In a heavy, 6-quart, nonreactive saucepan over medium-high heat, combine tomatillos, chiles, and water; bring to a boil. Reduce heat to low and simmer until the tomatillos are tender, about 10 to 12 minutes. Drain, reserving 1/2 to 1 cup of the cooking liquid. Working in batches, combine tomatillos, chiles, reserved cooking liquid, garlic, and cilantro in a blender and blend to a smooth puree. In a heavy, 12-inch, deep-sided skillet, heat the oil over medium heat and cook the tomatillo mixture for about 10 minutes, stirring often. Add salt to taste.",
            "Prepare the casserole. In a heavy, 10-inch skillet, heat 3/4 cup of the corn oil over medium heat until the oil shimmers. Using tongs, submerge the tortillas, one at a time, in the hot oil for about 10 seconds (the tortillas should remain pliable). Transfer to a baking sheet lined with paper towels to drain. Lightly oil a 13-by-9-inch baking dish and set aside. In a heavy, 12-inch, nonstick skillet, heat the remaining 1 tablespoon of oil over medium heat until shimmering. Add both kinds of squash and cook over medium heat about 5 minutes. Add the corn and green beans and cook until just tender, about 2 to 3 minutes. Add salt and pepper to taste.",
            "Preheat oven to 375 degrees. Arrange 6 of the softened tortillas in the prepared baking dish, overlapping the edges. Cover with half of the shredded turkey, half of the vegetable mixture, 1 cup of the cheese, 1 cup of the Salsa de Tomatillo, and 3/4 cup of the sour cream. Repeat the layering process with 6 additional tortillas, the remaining turkey, vegetable mixture, and cheese, 1 cup of the Salsa de Tomatillo, and 3/4 cup of the sour cream. Top with the remaining 6 tortillas. Drizzle with 1 cup of the Salsa de Tomatillo, cover with foil, and bake in preheated oven for about 50 minutes, or until heated through.",
            "During the last few minutes of the cooking time, heat the remaining 3 cups Salsa de Tomatillo over low heat and keep warm. In a small bowl, whisk together the remaining 1/2 cup sour cream and the milk; drizzle over the hot casserole when it comes out of the oven. Serve the hot casserole with hot Salsa de Tomatillo on the side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d998d7b55306961bf7645/6:4/w_274%2Ch_169/238186.jpg",
        "color": 16225209
    }
}