{
    "recipe": {
        "title": "Torta Pasqualina ",
        "ingredients": [
            "3 1/2 cups all-purpose flour",
            "2 Tbsp. sugar",
            "1 1/2 tsp. kosher salt",
            "1 1/2 cups (3 sticks) unsalted butter, cut into pieces, chilled in freezer",
            "3 1/2 lb. Swiss chard (about 5 bunches), ribs and stems removed",
            "3 Tbsp. extra-virgin olive oil",
            "2 medium onions, finely chopped",
            "10 large eggs",
            "1 1/2 cups whole-milk fresh ricotta, preferably box-drained, patted dry",
            "4 oz. Parmesan, coarsely grated",
            "1 large garlic clove, finely grated",
            "2 tsp. finely grated lemon zest",
            "1/4 tsp. freshly grated nutmeg",
            "2 tsp. kosher salt, plus more",
            "1 1/2 tsp. freshly ground black pepper, plus more",
            "All-purpose flour (for surface)",
            "2 tsp. sugar",
            "A 10\"-diameter tart pan with a removable bottom"
        ],
        "instructions": [
            "Pulse flour, sugar, and salt in a food processor to combine. Add butter and process until largest pieces of butter are pea-size. Drizzle in 1/2 cup ice water and pulse until a few shaggy pieces of dough form.",
            "Transfer dough (get all the dry bits) to a work surface. Drizzle 1 Tbsp. ice water over; knead to just barely bring dough together. Divide in half. Place a half on a piece of plastic wrap. Using plastic and your hands, form dough into a 3/4\"-thick disk and tightly wrap. Repeat with remaining dough. Chill at least 2 hours.",
            "Filing and assembly: Working in batches, cook Swiss chard in a large pot of boiling water until bright green and slightly softened, about 2 minutes. Using tongs, transfer to an ice bath to stop the cooking. Swish to cool, then remove greens and squeeze out as much excess liquid as possible. Transfer greens to a cutting board and finely chop (you should have about 4 cups). Heat oil in a large saucepan over medium. Cook onions, stirring occasionally, until very soft and golden but not browned, 8–10 minutes. Remove from heat and mix in greens. Let cool. Using a fork, whisk 4 eggs in a large bowl to blend. Add ricotta, Parmesan, and Swiss chard mixture and mix to combine. Add garlic, lemon zest, nutmeg, 2 tsp. salt, and 1 1/2 tsp. pepper. Taste and adjust seasoning, if needed. Let dough sit at room temperature 5 minutes to soften. Roll out 1 disk of dough on a lightly floured surface to a 12\" round about 1/8\" thick. Transfer to a parchment-lined rimmed baking sheet. Roll out remaining disk of dough and carefully transfer to tart pan. Lift up edges and allow dough to slump down into pan. Press dough firmly into sides and bottom of pan. Trim, leaving about a 1/2\" overhang. Beat 1 egg in a small bowl to blend and brush edges of dough. Scrape filling into pan, creating a mound in the center. Using an offset spatula, evenly spread filling over bottom, smoothing surface. Use a spoon to create 5 divots in filling and crack an egg into each. Season eggs with a bit of salt. Arrange remaining round of dough over filling. Trim edges of top round, leaving 1/2\" overhang. Fold edge of bottom crust up and over top, then press edges together to seal. Crimp and brush top of dough with remaining beaten egg; sprinkle with sugar. Transfer pie to a foil-lined rimmed baking sheet and chill in freezer 10 minutes. Preheat oven to 375°F. Bake pie until crust is deep golden brown, 65–75 minutes. Transfer pan to a wire rack and let pie cool in pan at least 30 minutes before serving.",
            "Working in batches, cook Swiss chard in a large pot of boiling water until bright green and slightly softened, about 2 minutes. Using tongs, transfer to an ice bath to stop the cooking. Swish to cool, then remove greens and squeeze out as much excess liquid as possible. Transfer greens to a cutting board and finely chop (you should have about 4 cups).",
            "Heat oil in a large saucepan over medium. Cook onions, stirring occasionally, until very soft and golden but not browned, 8–10 minutes. Remove from heat and mix in greens. Let cool.",
            "Using a fork, whisk 4 eggs in a large bowl to blend. Add ricotta, Parmesan, and Swiss chard mixture and mix to combine. Add garlic, lemon zest, nutmeg, 2 tsp. salt, and 1 1/2 tsp. pepper. Taste and adjust seasoning, if needed.",
            "Let dough sit at room temperature 5 minutes to soften. Roll out 1 disk of dough on a lightly floured surface to a 12\" round about 1/8\" thick. Transfer to a parchment-lined rimmed baking sheet. Roll out remaining disk of dough and carefully transfer to tart pan. Lift up edges and allow dough to slump down into pan. Press dough firmly into sides and bottom of pan. Trim, leaving about a 1/2\" overhang. Beat 1 egg in a small bowl to blend and brush edges of dough.",
            "Scrape filling into pan, creating a mound in the center. Using an offset spatula, evenly spread filling over bottom, smoothing surface. Use a spoon to create 5 divots in filling and crack an egg into each. Season eggs with a bit of salt. Arrange remaining round of dough over filling. Trim edges of top round, leaving 1/2\" overhang. Fold edge of bottom crust up and over top, then press edges together to seal. Crimp and brush top of dough with remaining beaten egg; sprinkle with sugar. Transfer pie to a foil-lined rimmed baking sheet and chill in freezer 10 minutes.",
            "Preheat oven to 375°F. Bake pie until crust is deep golden brown, 65–75 minutes. Transfer pan to a wire rack and let pie cool in pan at least 30 minutes before serving.",
            "Do Ahead Dough can be made 5 days ahead. Keep chilled, or freeze up to 1 month. Pie can be baked 1 day ahead. Let cool; cover and chill.",
            "Dough can be made 5 days ahead. Keep chilled, or freeze up to 1 month. Pie can be baked 1 day ahead. Let cool; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ad78630f1bfb636b660d2ad/6:4/w_274%2Ch_169/torta-pasqualina-recipe-BA-041818.jpg",
        "color": 14350007
    }
}