{
    "recipe": {
        "title": "Tourtière du Shack ",
        "ingredients": [
            "3 1/3 cups all-purpose flour",
            "2 cups (4 sticks) chilled unsalted butter, cut into 1/2\" cubes",
            "1 teaspoon kosher salt",
            "1 1/2 cups low-salt chicken broth",
            "1 1/2 medium onions, chopped, divided",
            "4 garlic cloves, chopped, divided",
            "5 whole black peppercorns plus freshly ground black pepper",
            "5 sprigs thyme",
            "2 bay leaves",
            "1 1/2 pounds boneless pork shoulder (Boston butt), cut into 2\" pieces",
            "Kosher salt",
            "1 tablespoon unsalted butter",
            "8 medium button mushrooms, stemmed and finely chopped",
            "1/2 cup dry white wine",
            "1 1/4 pounds ground pork",
            "1/8 teaspoon cinnamon",
            "1/8 teaspoon ground cloves",
            "3/4 cup grated, peeled russet potato",
            "All-purpose flour (for surface)",
            "1 large egg yolk, beaten to blend",
            "A 9\"-diameter deep dish glass or ceramic pie dish"
        ],
        "instructions": [
            "Pulse flour, butter, and salt in a food processor until pea-size pieces of butter form. Transfer to a medium bowl. Add 1/4 cup ice water and stir just until shaggy clumps form, adding more water by teaspoonfuls if dry. Divide dough in half; flatten each half into a disk. Wrap disks in plastic wrap and chill for at least 2 hours. DO AHEAD: Dough can be made 2 days ahead. Keep chilled.",
            "For filling: Preheat oven to 325°F. Combine broth, 1/2 chopped onion, 1 chopped garlic clove, whole peppercorns, thyme, and bay leaves in a medium pot. Add pork shoulder; season with salt and pepper. Bring to a simmer over medium heat. Cover pot. Transfer to oven; braise until pork shoulder is tender and shreds easily, about 2 hours. Remove from oven; let cool. Transfer pork shoulder to a work surface. Shred meat with your fingers and transfer to a medium bowl. Strain pan juices through a fine-mesh sieve; add 1/2 cup juices to pork; discard solids in strainer. Melt butter in a large skillet over medium heat. Add remaining 1 chopped onion and 3 chopped garlic cloves; cook, stirring often, until soft, 5-7 minutes. Add mushrooms; cook, stirring often, until almost all liquid is evaporated, 5-7 minutes. Add wine; stir, scraping up browned bits. Bring to a boil; cook, stirring often, until liquid is almost evaporated, about 5 minutes. Add ground pork, cinnamon, and cloves. Cook, stirring to break up into small pieces, until pork is cooked through, about 5 minutes. Add potato. Cook until potato is soft, about 10 minutes. Remove from heat. Stir in shredded pork with juices. Season to taste with salt and pepper; let cool slightly. Chill until cold, about 1 hour. DO AHEAD: Can be made 1 day ahead. Cover and keep chilled. Roll out 1 dough disk on a lightly floured surface into a 12\" round. Transfer to pie dish, leaving overhang. Fill with cooled meat mixture. Roll out remaining dough disk into a 10\" round. Place dough over meat filling. Fold overhang over top crust and crimp edges. Brush crust with egg yolk. Cut three 2\" slits in top crust. Chill for 1 hour. Preheat oven to 400°F. Bake tourtière for 30 minutes. Reduce heat to 350°F; bake until crust is golden brown and filling is bubbling, 40-50 minutes. Let cool for 20 minutes before serving.",
            "Preheat oven to 325°F. Combine broth, 1/2 chopped onion, 1 chopped garlic clove, whole peppercorns, thyme, and bay leaves in a medium pot. Add pork shoulder; season with salt and pepper. Bring to a simmer over medium heat.",
            "Cover pot. Transfer to oven; braise until pork shoulder is tender and shreds easily, about 2 hours. Remove from oven; let cool.",
            "Transfer pork shoulder to a work surface. Shred meat with your fingers and transfer to a medium bowl. Strain pan juices through a fine-mesh sieve; add 1/2 cup juices to pork; discard solids in strainer.",
            "Melt butter in a large skillet over medium heat. Add remaining 1 chopped onion and 3 chopped garlic cloves; cook, stirring often, until soft, 5-7 minutes. Add mushrooms; cook, stirring often, until almost all liquid is evaporated, 5-7 minutes. Add wine; stir, scraping up browned bits. Bring to a boil; cook, stirring often, until liquid is almost evaporated, about 5 minutes.",
            "Add ground pork, cinnamon, and cloves. Cook, stirring to break up into small pieces, until pork is cooked through, about 5 minutes. Add potato. Cook until potato is soft, about 10 minutes. Remove from heat. Stir in shredded pork with juices. Season to taste with salt and pepper; let cool slightly. Chill until cold, about 1 hour. DO AHEAD: Can be made 1 day ahead. Cover and keep chilled.",
            "Roll out 1 dough disk on a lightly floured surface into a 12\" round. Transfer to pie dish, leaving overhang. Fill with cooled meat mixture. Roll out remaining dough disk into a 10\" round. Place dough over meat filling. Fold overhang over top crust and crimp edges. Brush crust with egg yolk. Cut three 2\" slits in top crust. Chill for 1 hour.",
            "Preheat oven to 400°F. Bake tourtière for 30 minutes. Reduce heat to 350°F; bake until crust is golden brown and filling is bubbling, 40-50 minutes. Let cool for 20 minutes before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b4099ad5e8c3e1070ae9ec/6:4/w_274%2Ch_169/380649_tourtiere-du-shack_1x1.jpg"
    }
}