{
    "recipe": {
        "title": "Traditional Sauerkraut with Caraway ",
        "ingredients": [
            "2 green cabbages (about 2 kg/4 lb 6 oz), shredded",
            "50 g (1 3/4 oz) fine ground salt (about 2.5%)",
            "15 g (1/2 oz) caraway seeds (optional)",
            "2 L (68 fl oz) jar, pounder (a heavy implement like the end of a rolling pin, potato masher, or cocktail muddler), follower (a whole cabbage leaf or small plate), weight (see note)"
        ],
        "instructions": [
            "Weigh the shredded cabbage (as cabbages vary in size and weight) to ensure the salt to cabbage ratio is correct. The amount of salt you use should come to about 1.5–2.5%, but no more than 3%, of the cabbage weight.",
            "In a large bowl, mix and massage the salt through the cabbage thoroughly, making sure to distribute the salt evenly.",
            "Let it sit to sweat a bit—maybe 10 minutes. This is simply to make the next step easier. This is a good time to get your vessel cleaned and to rest up for the next stage.",
            "With your pounder, pound quite energetically for about 5–10 minutes, until the cabbage is dripping with its own salty water when you pick up a handful. This part is important as you need this liquid—it’s your brine.",
            "You can also use the dough hook of a stand mixer to do the pounding part, which can speed things up somewhat. Don’t let it run for too long though, only a few minutes. Using a mixer is easy and great for people who are doing this a lot and in large batches, but it takes quite a bit of the emotional release and fun out of it.",
            "Next, mix in the caraway seeds (if using).",
            "Put the mixture into the jar, packing it down tightly as you go using the pounder. Push down well, particularly at the end to coax out any more brine. You need the brine to cover the cabbage.",
            "Don’t pack the cabbage all the way to the top; leave some headroom at the top of the jar to allow for a bit of growth and movement and, of course, the weight. You don’t want the liquid touching the top of the lid, as it will end up spewing out of your air-lock or up out of your lid.",
            "Cover with a cabbage leaf (the follower), the weight and then your chosen lid or system.",
            "Depending on your ferment, you can start trying it as soon as you’d like, but the less you fiddle with it in the first 2 weeks, the better. It is ready when you think it is delicious. With the right system and temperature, you can leave it to ferment for months before refrigeration.",
            "If you used a crock, you’ll need to decant the kraut to smaller jars before you refrigerate, unless you have a walk-in cool room, or large cellar. (Lucky you.) It will keep in the fridge for 12 months or more. Use your senses."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59417f15a55f291646ff79fd/6:4/w_274%2Ch_169/HOW-TO-MAKE-SAUERKRAUT-hero-09062017.jpg"
    }
}