{
    "recipe": {
        "title": "Traditional Achiote Recado ",
        "ingredients": [
            "1/2 cup water",
            "2 tablespoons achiote (annatto) seeds*",
            "3 garlic cloves, unpeeled",
            "1/2 medium white onion, sliced 1/2 inch thick",
            "1 tablespoon dried Mexican oregano*",
            "1 teaspoon freshly ground allspice",
            "2 teaspoons freshly ground black pepper",
            "1/2 cup ancho chile powder* (about 2 ounces)",
            "4 teaspoons coarse salt",
            "1/4 cup cider vinegar",
            "1 1/2 cups fresh orange juice",
            "available at mexican markets"
        ],
        "instructions": [
            "In a small saucepan bring water and achiote seeds to a boil. Cook seeds, covered, at a bare simmer 30 minutes and remove from heat. (Steep seeds 2 hours, or until softened.) Heat a dry comal or flat iron griddle over moderately low heat until hot and pan-roast garlic and onion, turning them occasionally to ensure even roasting, until browned and soft throughout, 25 to 30 minutes. Discard garlic skins. In a small heavy skillet dry-roast oregano over moderate heat, shaking skillet occasionally, until fragrant and beginning to brown, about 2 minutes and transfer to a small bowl. Cool oregano completely and in an electric coffee/spice grinder grind fine. Drain seeds and in a blender or food processor blend with garlic, onion, oregano, and remaining ingredients until smooth. (Recado may be made 5 days ahead and chilled and covered.)",
            "In a small saucepan bring water and achiote seeds to a boil. Cook seeds, covered, at a bare simmer 30 minutes and remove from heat. (Steep seeds 2 hours, or until softened.)",
            "Heat a dry comal or flat iron griddle over moderately low heat until hot and pan-roast garlic and onion, turning them occasionally to ensure even roasting, until browned and soft throughout, 25 to 30 minutes. Discard garlic skins.",
            "In a small heavy skillet dry-roast oregano over moderate heat, shaking skillet occasionally, until fragrant and beginning to brown, about 2 minutes and transfer to a small bowl. Cool oregano completely and in an electric coffee/spice grinder grind fine.",
            "Drain seeds and in a blender or food processor blend with garlic, onion, oregano, and remaining ingredients until smooth. (Recado may be made 5 days ahead and chilled and covered.)"
        ],
        "picture_link": null
    }
}