{
    "recipe": {
        "title": "Traditional Soft Pretzels ",
        "ingredients": [
            "1 (1/4-oz/7-g) package active dry yeast (2 1/4 tsp)",
            "1/2 cup/120 ml warm water (between 100 and 115°F/38 and 45°C)",
            "1 tbsp barley malt syrup or 1 tbsp firmly packed dark brown sugar",
            "3 1/4 cups/420 g unbleached bread flour",
            "1/2 cup/120 ml cold pilsner-style beer",
            "2 tbsp unsalted butter, cubed, at room temperature, plus more for greasing the bowl",
            "2 tsp fine sea salt, such as fleur de sel or sel gris",
            "2 tbsp food-grade lye, or 1/4 cup/60 g baked baking soda (see separate notes)"
        ],
        "instructions": [
            "Sprinkle the yeast over the warm water in the bowl of a stand mixer or in a large bowl. Add the barley malt syrup, stirring until it is dissolved. Allow the yeast to bloom until it is foamy, 5 to 7 minutes. Stir in the flour, beer, butter, and salt and continue stirring to form a shaggy mass. Attach the bowl and the dough hook to the stand mixer and begin kneading on medium-low speed. After about 1 minute the dough will form a smooth ball. The dough should be quite firm and may be slightly tacky, but not sticky. (If it is sticky, add a little more flour, about 1 tbsp at a time, and knead it in until the dough is smooth. If the dough is too dry to come together, add more water, 1 tsp at a time.) Continue kneading the dough on medium-low speed until it is elastic, 5 to 7 minutes. Alternatively, turn the shaggy dough out onto an unfloured work surface and knead it by hand.",
            "Choose a bowl that will be large enough to contain the dough after it has doubled in size, and grease it lightly with butter. Transfer the dough to the greased bowl and cover the bowl tightly with plastic wrap. Put the dough in the refrigerator to rise for at least 8 hours, and up to 24 hours, for optimal flavor.",
            "For quick pretzels, allow the dough to rise at room temperature (in a warm spot) until it has doubled in size, about 1 1/2 hours.",
            "Shaping: Line two 12-by-17-in/30.5-by-43-cm rimmed baking sheets with parchment paper; set aside. Turn the dough out onto an unfloured work surface and firmly press it down to deflate. To form the classic pretzel shape, cut the dough into eight equal portions. Work with one piece of dough at a time and keep the rest covered with a damp, clean kitchen towel. Pat a piece of dough down with your fingertips to form a rough rectangle about 3 1/2 by 5 1/2 in/9 by 14 cm. Beginning on a long side, roll the dough up tightly, forming it into a little loaf. Pinch the seam together. Shape the dough into a rope by rolling it against the work surface with your palms and applying mild pressure, working from the center of the dough out to the ends. If you need more friction, spray the counter with a little water from a squirt bottle or drizzle a few drops of water and spread it with your hand. Once you can feel that the dough rope doesn’t want to stretch any farther (usually when it is between 12 to 16 in/30.5 to 40.5 cm long), set it aside to rest and begin shaping another piece in the same manner. Repeat this process with the remaining pieces of dough. Return to the first dough rope and continue rolling it out to a length of 24 to 28 in/61 to 71 cm, leaving the center about 1 in/2.5 cm in diameter and tapering the ends thinly by applying a little more pressure as you work your way out. Position the dough rope into a U shape, with the ends pointing away from you. Holding an end in each hand, cross the ends about 3 in/7.5 cm from the tips and then cross them again. Fold the ends down and press them into the U at about 4 and 8 o’clock, allowing about 1/4 in/6 mm of the ends to overhang. Place the pretzel on one of the prepared baking sheets and cover it with a damp towel. Repeat this process with the remaining dough, spacing out the pretzels on the baking sheets at least 1 in/2.5 cm apart and covering them with a damp towel. Allow the covered pretzels to rise at warm room temperature until they have increased in size by about half, 20 to 30 minutes. (The pretzels can be refrigerated at this point, covered tightly with plastic wrap, for up to 8 hours before dipping and baking them.) At least 20 minutes before baking, position one rack in the upper third and another rack in the lower third of the oven and preheat it to 500°F/260°C/gas 10.",
            "Line two 12-by-17-in/30.5-by-43-cm rimmed baking sheets with parchment paper; set aside.",
            "Turn the dough out onto an unfloured work surface and firmly press it down to deflate. To form the classic pretzel shape, cut the dough into eight equal portions. Work with one piece of dough at a time and keep the rest covered with a damp, clean kitchen towel. Pat a piece of dough down with your fingertips to form a rough rectangle about 3 1/2 by 5 1/2 in/9 by 14 cm. Beginning on a long side, roll the dough up tightly, forming it into a little loaf. Pinch the seam together. Shape the dough into a rope by rolling it against the work surface with your palms and applying mild pressure, working from the center of the dough out to the ends. If you need more friction, spray the counter with a little water from a squirt bottle or drizzle a few drops of water and spread it with your hand. Once you can feel that the dough rope doesn’t want to stretch any farther (usually when it is between 12 to 16 in/30.5 to 40.5 cm long), set it aside to rest and begin shaping another piece in the same manner. Repeat this process with the remaining pieces of dough.",
            "Return to the first dough rope and continue rolling it out to a length of 24 to 28 in/61 to 71 cm, leaving the center about 1 in/2.5 cm in diameter and tapering the ends thinly by applying a little more pressure as you work your way out. Position the dough rope into a U shape, with the ends pointing away from you. Holding an end in each hand, cross the ends about 3 in/7.5 cm from the tips and then cross them again. Fold the ends down and press them into the U at about 4 and 8 o’clock, allowing about 1/4 in/6 mm of the ends to overhang. Place the pretzel on one of the prepared baking sheets and cover it with a damp towel. Repeat this process with the remaining dough, spacing out the pretzels on the baking sheets at least 1 in/2.5 cm apart and covering them with a damp towel.",
            "Allow the covered pretzels to rise at warm room temperature until they have increased in size by about half, 20 to 30 minutes. (The pretzels can be refrigerated at this point, covered tightly with plastic wrap, for up to 8 hours before dipping and baking them.)",
            "At least 20 minutes before baking, position one rack in the upper third and another rack in the lower third of the oven and preheat it to 500°F/260°C/gas 10.",
            "Dipping: Prepare the lye solution or baked baking soda solution. Use a large skimmer to gently dip the pretzels in the lye or baked baking soda solution, one or two at a time. Leave them in the solution for about 20 seconds, carefully turning once after 10 seconds. Remove the pretzels from the liquid, drain, and return them to the baking sheets, spacing them at least 1 in/2.5 cm apart. If the ends come detached, simply reposition them. Repeat with the remaining pretzels.",
            "Prepare the lye solution or baked baking soda solution.",
            "Use a large skimmer to gently dip the pretzels in the lye or baked baking soda solution, one or two at a time. Leave them in the solution for about 20 seconds, carefully turning once after 10 seconds. Remove the pretzels from the liquid, drain, and return them to the baking sheets, spacing them at least 1 in/2.5 cm apart. If the ends come detached, simply reposition them. Repeat with the remaining pretzels.",
            "Topping and baking: Use a sharp paring knife or razor blade to cut a slit about 1/4 in/6 mm deep in the thickest part of each pretzel (the bottom of the U). Top them as you choose, if desired. Bake the pretzels until they are deep mahogany in color, 8 to 12 minutes, rotating the pans from front to back and top to bottom halfway through the baking time. Transfer the pretzels to a rack to cool for 10 minutes before serving. The pretzels are best enjoyed the day they are made, ideally warm from the oven or within an hour of being baked.",
            "Use a sharp paring knife or razor blade to cut a slit about 1/4 in/6 mm deep in the thickest part of each pretzel (the bottom of the U). Top them as you choose, if desired. Bake the pretzels until they are deep mahogany in color, 8 to 12 minutes, rotating the pans from front to back and top to bottom halfway through the baking time. Transfer the pretzels to a rack to cool for 10 minutes before serving. The pretzels are best enjoyed the day they are made, ideally warm from the oven or within an hour of being baked.",
            "Storing: To store the pretzels, allow them to cool completely and then wrap each one individually in plastic wrap. Store them at room temperature for up to 2 days, or put the plastic-wrapped pretzels in a resealable plastic freezer bag and freeze them for up to 1 month. Reheat the pretzels in a 350°F/180°C/gas 4 oven for about 5 minutes, or for 10 to 12 minutes if frozen.",
            "To store the pretzels, allow them to cool completely and then wrap each one individually in plastic wrap. Store them at room temperature for up to 2 days, or put the plastic-wrapped pretzels in a resealable plastic freezer bag and freeze them for up to 1 month. Reheat the pretzels in a 350°F/180°C/gas 4 oven for about 5 minutes, or for 10 to 12 minutes if frozen."
        ],
        "picture_link": "https://assets.epicurious.com/photos/598a373a6af68734ef53e0f4/6:4/w_274%2Ch_169/how-to-make-soft-pretzels-02082017.jpg"
    }
}