{
    "recipe": {
        "title": "Trail Mix Freezer Cookies ",
        "ingredients": [
            "3/4 cup all purpose flour",
            "1/2 cup white whole wheat flour",
            "1 teaspoon salt",
            "1 teaspoon baking soda",
            "1/2 teaspoon baking powder",
            "1/2 teaspoon ground cinnamon",
            "1 cup (2 sticks) unsalted butter, room temperature",
            "1 cup (packed) golden brown sugar",
            "3/4 cup sugar",
            "2 large eggs",
            "1 teaspoon vanilla extract",
            "2 cups old-fashioned oats",
            "1/2 cup unsweetened flaked coconut",
            "2 cups trail mix, coarsely chopped"
        ],
        "instructions": [
            "Line 3 baking sheets with parchment paper. Mix first 6 ingredients in bowl. Using electric mixer, beat butter and both sugars in large bowl until fluffy. Add eggs and vanilla; beat until mixture is fluffy, 1 to 2 minutes. Reduce speed to low; beat in flour mixture until just combined. Fold in oats and coconut. Stir in trail mix. Using 2-inch-diameter ice cream scoop, drop dough onto sheets, spacing about 2 inches apart. Do Ahead For ready-to-bake dough, freeze dough on sheets until firm. Transfer frozen dough to resealable plastic bags; keep frozen until ready to bake. Preheat oven to 350°F. For freshly made cookie dough, bake until cookies are golden brown, about 13 minutes. (For frozen dough, arrange frozen cookies 2 inches apart on parchment lined baking sheets; bake until golden brown, about 16 minutes.) Transfer to racks to cool.",
            "Line 3 baking sheets with parchment paper. Mix first 6 ingredients in bowl. Using electric mixer, beat butter and both sugars in large bowl until fluffy. Add eggs and vanilla; beat until mixture is fluffy, 1 to 2 minutes. Reduce speed to low; beat in flour mixture until just combined. Fold in oats and coconut. Stir in trail mix.",
            "Using 2-inch-diameter ice cream scoop, drop dough onto sheets, spacing about 2 inches apart. Do Ahead For ready-to-bake dough, freeze dough on sheets until firm. Transfer frozen dough to resealable plastic bags; keep frozen until ready to bake.",
            "Preheat oven to 350°F. For freshly made cookie dough, bake until cookies are golden brown, about 13 minutes. (For frozen dough, arrange frozen cookies 2 inches apart on parchment lined baking sheets; bake until golden brown, about 16 minutes.) Transfer to racks to cool."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3e08a21388ef838b0c5d5/6:4/w_274%2Ch_169/354854_trail-mix-freezer-cookies_1x1.jpg"
    }
}