{
    "recipe": {
        "title": "Tricolor Vegetable Pâté ",
        "ingredients": [
            "2 15-ounce cans cannellini (white kidney beans), rinsed, drained thoroughly",
            "1 tablespoon fresh lemon juice",
            "1 tablespoon olive oil",
            "1 tablespoon minced fresh oregano or 1 teaspoon dried",
            "2 garlic cloves, pressed",
            "1 7-ounce jar roasted red bell peppers, drained, chopped",
            "3/4 cup crumbled feta cheese (about 4 ounces)",
            "2 garlic cloves",
            "1 cup fresh basil leaves",
            "1 cup fresh Italian parsley leaves",
            "1/4 cup toasted pine nuts",
            "3 tablespoons olive oil",
            "1/2 cup low-fat ricotta cheese",
            "Fresh herb sprigs",
            "Sourdough bread slices"
        ],
        "instructions": [
            "Line 8 1/2x4 1/2-inch loaf pan with plastic wrap, overlapping sides.",
            "For Bean Layer: Mash beans in large bowl. Add lemon juice, olive oil, oregano and garlic and blend until smooth. Season to taste with salt and pepper. Spread bean mixture evenly on bottom of prepared pan.",
            "Mash beans in large bowl. Add lemon juice, olive oil, oregano and garlic and blend until smooth. Season to taste with salt and pepper. Spread bean mixture evenly on bottom of prepared pan.",
            "For Red Pepper Layer: Combine peppers and feta in processor and blend until smooth. Spread pepper mixture evenly over bean layer in prepared dish.",
            "Combine peppers and feta in processor and blend until smooth. Spread pepper mixture evenly over bean layer in prepared dish.",
            "For Pesto Layer: Mince garlic in processor. Add basil, parsley and pine nuts and mince. With machine running, gradually add oil through feed tube and process until smooth. Mix in ricotta. Spread pesto evenly over red pepper layer. Cover with plastic wrap and refrigerate overnight.",
            "Mince garlic in processor. Add basil, parsley and pine nuts and mince. With machine running, gradually add oil through feed tube and process until smooth. Mix in ricotta. Spread pesto evenly over red pepper layer. Cover with plastic wrap and refrigerate overnight.",
            "To unmold, invert pâté onto serving platter. Peel off plastic wrap from pâté. Garnish with herb sprigs and serve with sourdough bread slices.",
            "To unmold, invert pâté onto serving platter. Peel off plastic wrap from pâté. Garnish with herb sprigs and serve with sourdough bread slices."
        ],
        "picture_link": null,
        "color": 15876293
    }
}