{
    "recipe": {
        "title": "Triple-Cherries Jubilee ",
        "ingredients": [
            "1 (1-pound) bag frozen dark sweet cherries, thawed",
            "2 cups plus 1 tablespoon cherry juice",
            "1/2 cup dried tart cherries",
            "3 tablespoons sugar",
            "1 vanilla bean, split lengthwise",
            "1 tablespoon arrowroot",
            "1/4 cup thin matchstick-size strips orange peel (orange part only)",
            "1/3 cup kirsch (clear cherry brandy)",
            "1 quart vanilla or cherry-vanilla-swirl ice cream"
        ],
        "instructions": [
            "Place sieve over bowl. Add thawed cherries; let drain. Pour drained juices into heavy medium skillet (set cherries aside). Mix 2 cups cherry juice, dried cherries and sugar into same skillet. Scrape in seeds from vanilla bean; add bean. Boil sauce until reduced to 1 1/2 cups, stirring occasionally, about 12 minutes. Mix arrowroot with remaining 1 tablespoon juice in small bowl. Whisk into sauce. Boil until thickened, about 1 minute. Discard vanilla bean. Mix in drained cherries and orange peel. Heat kirsch in skillet over low heat. Remove from heat. Carefully ignite kirsch with match. Carefully pour flaming kirsch into sauce. Scoop ice cream into bowls. Spoon sauce over.",
            "Place sieve over bowl. Add thawed cherries; let drain. Pour drained juices into heavy medium skillet (set cherries aside). Mix 2 cups cherry juice, dried cherries and sugar into same skillet. Scrape in seeds from vanilla bean; add bean. Boil sauce until reduced to 1 1/2 cups, stirring occasionally, about 12 minutes. Mix arrowroot with remaining 1 tablespoon juice in small bowl. Whisk into sauce. Boil until thickened, about 1 minute. Discard vanilla bean. Mix in drained cherries and orange peel.",
            "Heat kirsch in skillet over low heat. Remove from heat. Carefully ignite kirsch with match. Carefully pour flaming kirsch into sauce. Scoop ice cream into bowls. Spoon sauce over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a78cba2833ab61b13e334d0/6:4/w_274%2Ch_169/Cherries-Jubilee-plated-31012018.jpg"
    }
}