{
    "recipe": {
        "title": "Triple Chocolate Tart with Boozy Whipped Cream ",
        "ingredients": [
            "1/2 cup unsalted roasted almonds (see Cooks' Notes)",
            "15 chocolate wafer cookies (such as Famous Chocolate Wafers; 4 ounces)",
            "2 tablespoons packed light brown sugar",
            "5 tablespoons unsalted butter, melted",
            "1 cup whole milk",
            "1/2 cup heavy cream",
            "1/2 cup chocolate stout, preferably double chocolate stout (to measure, tilt cup and pour it slowly down side of a liquid measuring cup, then let foam dissipate or skim it off)",
            "2 tablespoons packed light brown sugar",
            "2 tablespoons unsweetened cocoa powder",
            "2 tablespoons cornstarch",
            "2 ounces good-quality bittersweet chocolate (60 - 62% cacao), finely chopped",
            "1/2 teaspoon pure vanilla extract",
            "1 cup chilled heavy cream",
            "2 tablespoons bourbon",
            "2 teaspoons sugar",
            "1/4 teaspoon pure vanilla extract",
            "9-inch tart pan (1-inch deep with removable bottom) or 9-inch springform pan",
            "Chocolate shavings or cocoa powder, optional"
        ],
        "instructions": [
            "Preheat oven to 350°F with rack in middle.",
            "Pulse almonds with cookies and sugar in a food processor until almonds and cookies are finely ground.",
            "Add butter and pulse to combine, then press evenly onto bottom and up side of tart pan or 1-inch up side of springform pan (a dry measuring cup with a smooth bottom is very useful for pressing crumbs into an even layer).",
            "Bake until set, 15 minutes. Cool on a rack 1 hour.",
            "Make filling: Whisk together milk, cream, stout, sugar, cornstarch, and cocoa in a medium saucepan and bring to a boil over medium heat, whisking constantly, then briskly simmer, whisking constantly, 2 minutes. Remove from heat and whisk in chopped chocolate and vanilla until smooth. Pour chocolate custard into cooled tart shell and cover surface with plastic wrap or wax paper (to prevent a skin from forming) and chill until set, about 3 hours.",
            "Whisk together milk, cream, stout, sugar, cornstarch, and cocoa in a medium saucepan and bring to a boil over medium heat, whisking constantly, then briskly simmer, whisking constantly, 2 minutes.",
            "Remove from heat and whisk in chopped chocolate and vanilla until smooth.",
            "Pour chocolate custard into cooled tart shell and cover surface with plastic wrap or wax paper (to prevent a skin from forming) and chill until set, about 3 hours.",
            "Make cream topping: Beat cream, bourbon, sugar, and vanilla in a bowl with an electric mixer just until stiff peaks form. Spread whipped cream decoratively on top of pie. Garnish with chocolate shavings or dust with cocoa powder, if desired.",
            "Beat cream, bourbon, sugar, and vanilla in a bowl with an electric mixer just until stiff peaks form. Spread whipped cream decoratively on top of pie.",
            "Garnish with chocolate shavings or dust with cocoa powder, if desired."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b42b962413537c0d45e8b9/6:4/w_274%2Ch_169/365216_chocolate-tart_1x1.jpg",
        "color": 3838837
    }
}