{
    "recipe": {
        "title": "Triple-Ginger Cream Sandwiches ",
        "ingredients": [
            "1 tablespoon ground ginger",
            "1 teaspoon finely grated peeled fresh ginger",
            "1 teaspoon freshly ground black pepper",
            "1 teaspoon ground cinnamon",
            "1 teaspoon kosher salt",
            "1/2 teaspoon baking soda",
            "1/2 teaspoon freshly grated nutmeg",
            "1/4 teaspoon ground cloves",
            "2 cups all-purpose flour, plus more for surface",
            "1 cup (packed) dark brown sugar",
            "1 stick (1/2 cup) unsalted butter, room temperature",
            "2 large egg yolks",
            "1/3 cup unsulphured molasses",
            "Pure cane or sanding sugar (for sprinkling)",
            "12 ounces cream cheese, room temperature",
            "1/2 cup powdered sugar",
            "1/4 cup finely chopped candied ginger",
            "A 2\" round cutter"
        ],
        "instructions": [
            "Whisk ground ginger, fresh ginger, pepper, cinnamon, salt, baking soda, nutmeg, cloves, and 2 cups flour in a medium bowl; set aside.",
            "Beat brown sugar and butter in the bowl of a stand mixer fitted with the paddle attachment on medium speed until pale and fluffy, 3–4 minutes. Add egg yolks and molasses and beat until combined. Add dry ingredients and beat on medium-low speed until well combined, about 3 minutes.",
            "Divide dough between 2 pieces of plastic wrap and flatten each into an 8\"-diameter disk. Wrap each disk in plastic and chill until firm, about 1 hour.",
            "Position racks in upper and lower thirds of oven; preheat to 350°F. On a lightly floured surface, roll out 1 disk of dough to an 1/8\" thickness. Using 2\" round cutter, cut out rounds, rerolling scraps once (you should have 36 rounds).",
            "Arrange rounds on 2 parchment-lined baking sheets at least 1/2\" apart; sprinkle with cane sugar. Bake, rotating sheets halfway through, until cookies are puffed and edges are lightly golden, 8–10 minutes. Transfer sheets to wire racks and let cookies cool. Repeat with remaining dough.",
            "Make the filling and assemble the sandwiches: Beat cream cheese, powdered sugar, and candied ginger in the bowl of stand mixer fitted with the whisk attachment on medium-high speed until smooth and fluffy, about 2 minutes. Just before serving, spread about 1 tsp. filling on flat side of half of the cookies. Sandwich with remaining cookies, sugared sides up.",
            "Beat cream cheese, powdered sugar, and candied ginger in the bowl of stand mixer fitted with the whisk attachment on medium-high speed until smooth and fluffy, about 2 minutes.",
            "Just before serving, spread about 1 tsp. filling on flat side of half of the cookies. Sandwich with remaining cookies, sugared sides up.",
            "Do ahead Unfilled cookies can be made up to 1 week ahead; store in an airtight container at room temperature. Filling can be made 3 days ahead; chill in an airtight container. Let filling come to room temperature and fill cookies just before serving.",
            "Unfilled cookies can be made up to 1 week ahead; store in an airtight container at room temperature. Filling can be made 3 days ahead; chill in an airtight container. Let filling come to room temperature and fill cookies just before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/565ddb9d22fc94021d54d204/6:4/w_274%2Ch_169/EP_11182015_christmascookies_ginger.jpg",
        "color": 9951451
    }
}