{
    "recipe": {
        "title": "Triticale with Smoked Trout and Artichokes in a Lemon Tahini Dressing ",
        "ingredients": [
            "1 cup triticale berries",
            "2 tablespoons fresh lemon juice",
            "1 1/2 tablespoons tahini",
            "1 tablespoon white balsamic vinegar",
            "1 tablespoon Dijon mustard",
            "1/2 teaspoon salt",
            "1/2 teaspoon ground black pepper",
            "1/2 cup olive oil",
            "1 package (9 ounces) frozen artichoke heart quarters, thawed, squeezed gently by the handfuls to remove excess moisture, and chopped",
            "8 ounces smoked trout, skinned and chopped"
        ],
        "instructions": [
            "1. Soak the triticale berries in a big bowl of cool water for at least 8 and up to 16 hours. Drain the berries in a fine-mesh sieve or small-holed colander set in the sink, then pour them into a large saucepan. Cover with more water, until they're submerged by several inches. Bring to a boil over high heat. Reduce the heat to low and simmer until tender, about 45 minutes. Drain once again in that sieve or colander; rinse with cool tap water until the grains are at room temperature. Shake the colander to drain the berries.",
            "2. Place the lemon juice, tahini, vinegar, mustard, salt, and pepper in a mini food processor or blender. Turn it on, then drizzle in the oil in dribs and drabs to make a rich dressing. You can also make this dressing in a small bowl with a whisk, but you'll need to give your forearm a workout. Whisk the first ingredients together, then whisk in the oil in a very small, steady stream.",
            "3. Pour the cooked triticale into a large bowl. Pour and scrape the salad dressing into the bowl as well. Add the artichoke hearts and smoked trout. Stir gently to avoid breaking the trout into minuscule threads but nonetheless make sure everything's well combined."
        ],
        "picture_link": null,
        "color": 200496
    }
}