{
    "recipe": {
        "title": "Trout Fillets with Mint Pipián ",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil, divided",
            "3 tablespoons raw pumpkin seeds (pepitas)",
            "1 large fresh poblano chile, stemmed, seeded, diced (about 1 cup)",
            "1/2 cup chopped white onion",
            "2 medium tomatillos, husked, rinsed, diced",
            "3 tablespoons chopped fresh mint plus small sprigs (for garnish)",
            "1 tablespoon (or more) fresh lime juice plus lime wedges (for garnish)",
            "2 whole 12-ounce trout, boned, butterflied, halved lengthwise"
        ],
        "instructions": [
            "Heat 1 tablespoon oil in medium skillet over medium heat. Add pumpkin seeds. Stir until beginning to pop, 1 to 2 minutes. Add chile, onion, and tomatillos. Cover and cook until vegetables begin to soften, about 5 minutes. Scrape mixture into processor; cool. Blend 1 minute. Blend in chopped mint and 1 tablespoon lime juice, adding more lime juice to taste (sauce will be very thick and not smooth). Season with salt and pepper. Heat 1 tablespoon oil in large nonstick skillet over medium-high heat. Sprinkle trout with salt and pepper. Add to skillet, flesh side down. Cook until just opaque in center, about 2 minutes per side. Spoon pián over fish. Garnish with mint sprigs and lime wedges.",
            "Heat 1 tablespoon oil in medium skillet over medium heat. Add pumpkin seeds. Stir until beginning to pop, 1 to 2 minutes. Add chile, onion, and tomatillos. Cover and cook until vegetables begin to soften, about 5 minutes.",
            "Scrape mixture into processor; cool. Blend 1 minute. Blend in chopped mint and 1 tablespoon lime juice, adding more lime juice to taste (sauce will be very thick and not smooth). Season with salt and pepper.",
            "Heat 1 tablespoon oil in large nonstick skillet over medium-high heat. Sprinkle trout with salt and pepper. Add to skillet, flesh side down. Cook until just opaque in center, about 2 minutes per side.",
            "Spoon pián over fish. Garnish with mint sprigs and lime wedges."
        ],
        "picture_link": null
    }
}