{
    "recipe": {
        "title": "Tuna Maki ",
        "ingredients": [
            "1/2 lemon, thinly sliced crosswise",
            "4 (8 1/4- by 7 1/4-inch) sheets roasted nori (dried seaweed), cut in half crosswise",
            "4 cups prepared sushi rice",
            "1/4 cup wasabi paste",
            "1/2 pound sushi-grade yellowfin or ahi tuna, cut into 3/4-inch strips",
            "1/2 cup sliced pickled ginger (gari)*",
            "1 small daikon radish, peeled and julienned using mandoline",
            "2 medium carrots, peeled and julienned using mandoline",
            "Soy sauce for dipping",
            "*Available at Asian markets",
            "mandoline, bamboo sushi mat*"
        ],
        "instructions": [
            "Fill large bowl with ice water and lemon slices.",
            "Place sushi mat on cutting board with slats running crosswise. Arrange 1 sheet nori, shiny side down, on mat, lining up long edge of sheet with edge of mat nearest you. Lightly moisten hands with lemon water, then gently spread about 3/4 cup rice onto nori in even layer, leaving 1/2-inch border on long end opposite you.",
            "Brush 1/2 teaspoon wasabi paste in thin horizontal line across rice about 1 inch from side nearest you. Arrange about 1/8 of tuna strips in horizontal line atop wasabi line, cutting tuna as necessary to fit from side to side.",
            "Beginning with edge nearest you, lift mat up with thumbs, holding filling in place with fingers, and fold mat over filling so that upper and lower edges of rice meet. Squeeze gently but firmly along length of roll and tug top edge of mat away from you to tighten. (Nori border will still be visible below top edge of mat.) Open mat and roll log forward 1/4 turn, then fold mat over again and squeeze gently but firmly to seal nori border. Repeat to form remaining rolls.",
            "Transfer 1 roll, seam side down, to cutting board. Dip sharp knife into lemon water, shaking off excess. Slice roll in half, then cut each half into 3 pieces. Slice remaining rolls in same manner. Serve immediately with remaining wasabi paste, ginger, daikon, carrots, and soy sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d7998f9a841923089d994/6:4/w_274%2Ch_169/350970.jpg",
        "color": 2770666
    }
}