{
    "recipe": {
        "title": "Tuna Burgers ",
        "ingredients": [
            "1 1/4 pounds bigeye or albacore tune",
            "1/4 cup minced scallions",
            "1 heaping tablespoon finely grated peeled ginger",
            "2 teaspoons finely grated garlic",
            "2 tablespoons mayonnaise",
            "4 teaspoons grapeseed or canola oil",
            "1 teaspoon toasted sesame oil",
            "Kosher salt, freshly ground pepper"
        ],
        "instructions": [
            "Cut fish into 1\" cubes. Place in a single layer on a rimmed baking sheet, cover with plastic wrap, and transfer to freezer. Chill protein until very cold (it should feel firm but still give when pressed with your finger), about 15 minutes. Meanwhile, place all grinding parts (the stand mixer's grinding attachment, including the dies, or the bowl and blade of the food processor) in the freezer until very cold, at least 15 minutes. Assemble grinder attachment with chilled coarse die. Set a bowl in a large bowl of ice; arrange beneath the attachment to catch ground tuna and keep it cold. Combine tuna, scallions, ginger, and garlic in a large bowl. Grind mixture in batches, with mixer on medium speed, and plunge gently to press through grinder. Add mayonnaise, grapeseed or canola oil, and toasted sesame oil to ground tuna mixture. Mix gently just to combine. Form into four 1/2\"-thick patties. Season with kosher salt and freshly ground black pepper. Grill or pan-fry burgers over medium heat until just cooked through, 3-4 minutes per side.",
            "Cut fish into 1\" cubes. Place in a single layer on a rimmed baking sheet, cover with plastic wrap, and transfer to freezer. Chill protein until very cold (it should feel firm but still give when pressed with your finger), about 15 minutes. Meanwhile, place all grinding parts (the stand mixer's grinding attachment, including the dies, or the bowl and blade of the food processor) in the freezer until very cold, at least 15 minutes. Assemble grinder attachment with chilled coarse die. Set a bowl in a large bowl of ice; arrange beneath the attachment to catch ground tuna and keep it cold.",
            "Combine tuna, scallions, ginger, and garlic in a large bowl. Grind mixture in batches, with mixer on medium speed, and plunge gently to press through grinder. Add mayonnaise, grapeseed or canola oil, and toasted sesame oil to ground tuna mixture. Mix gently just to combine.",
            "Form into four 1/2\"-thick patties. Season with kosher salt and freshly ground black pepper. Grill or pan-fry burgers over medium heat until just cooked through, 3-4 minutes per side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5aeb6f916287fc51ce6c8400/6:4/w_274%2Ch_169/tuna-burgers-recipe-050318.jpg"
    }
}