{
    "recipe": {
        "title": "Tuna Tostadas, Contramar Style ",
        "ingredients": [
            "1 egg yolk, chilled",
            "1 tablespoon freshly squeezed lemon juice",
            "1 clove garlic, minced",
            "1/2 cup vegetable oil",
            "1/4 cup drained, chopped chipotle chiles in adobo sauce",
            "1 teaspoon kosher salt",
            "Vegetable oil, for deep-frying",
            "12 (4- to 5-inch) corn tortillas (purchased this size or cut to size with scissors)",
            "3 large leeks, white and light green part only, halved lengthwise, then cut crosswise into 1/4-incht hick half-moons (3 cups)",
            "1/2 cup soy sauce",
            "1/2 cup freshly squeezed lime juice (from about 4 limes)",
            "1 pound sashimi-grade skinned tuna fillet, cut into 1/8-inch-thick slices",
            "2 avocados, halved, pitted, peeled, and cut into 24 slices each 1/8 inch thick",
            "Kosher salt",
            "12 lime wedges (about 2 limes)"
        ],
        "instructions": [
            "To make the aioli, combine the egg yolk, lemon juice, and garlic in a blender and blend for 30 to 45 seconds, until smooth. With the blender running, pour in the oil in a very slow, thin, steady stream until the mixture emulsifies and thickens. (If the aioli begins to break, try alternating the oil with drops of ice water until the mixture has emulsified.)",
            "Add the chiles and salt and process for an additional 30 seconds, until the chiles are fully incorporated. Transfer to a covered container and refrigerate until needed; it will keep for up to 3 days. To make the tostadas, pour the oil to a depth of 1 inch into a large, deep, heavy skillet and heat to 375°F on a deep-frying thermometer. Line a large plate with paper towels. Add the tortillas, one or two at a time (depending on the size of the pan), to the hot oil and cook, turning once with tongs, for 1 to 1 1/2 minutes on each side, until a uniformly deep golden color and crisp. Transfer to the towel-lined plate to absorb the excess oil. Fry the remaining tortillas the same way. Set aside.",
            "Remove the pan from the heat, reserving the oil in the pan to fry the leeks.",
            "Put the leeks and just enough water to cover in a small saucepan and bring to a boil over high heat. Remove from the heat, drain into a colander, and place under cold running water for about 30 seconds, until completely cool. Press gently on the leeks to remove any excess water, then press between paper towels to wick away excess moisture.",
            "Line a small plate with paper towels. If the tortillas have absorbed some of the oil in the skillet, add more oil until it is again 1 inch deep. Place the skillet over medium-low heat and heat the oil to 325°F. Carefully add the leeks to the hot oil and fry, stirring once about halfway through the frying, for about 5 minutes, until golden brown and crispy but still a little green. Be careful not to let them burn. Using a slotted spoon, transfer the leeks to the towel-lined plate to drain.",
            "Stir together the soy sauce and lime juice in a glass or ceramic bowl. Add the tuna slices and stir gently, coating all of slices with the marinade. Let marinate for 5 minutes, then pour off the excess marinade.",
            "To assemble the tostadas, place the tostadas on a flat work surface and spread about 2 teaspoons of the chipotle aioli on each tostada. Place 3 tuna slices on top of the aioli, then top each portion of tuna with about 2 teaspoons of the leeks. Finally, top each tostada with 2 avocado slices, then season the avocado with a tiny pinch of salt.",
            "Serve the tostadas immediately, accompanied with the lime wedges."
        ],
        "picture_link": "https://assets.epicurious.com/photos/555a0efd100d9bda6d81ce2e/6:4/w_274%2Ch_169/51249210_tuna-tostadas-contramar_1x1.jpg"
    }
}