{
    "recipe": {
        "title": "Turkey Enchiladas ",
        "ingredients": [
            "2 (28-ounce) cans whole, peeled San Marzano tomatoes, drained and seeded",
            "2 large onions, roughly chopped",
            "8 dried ancho chiles,* seeds removed",
            "20 dried arbol chiles, seeds removed",
            "4 heads garlic, cloves separated and peeled",
            "2 stalks celery, roughly chopped",
            "2 large carrots, roughly chopped",
            "4 tablespoons whole coriander seeds",
            "2 tablespoons whole cumin seeds",
            "2 tablespoons whole dill seeds",
            "Fine sea salt and freshly ground black pepper",
            "Your favorite roast turkey or 2 roast chickens",
            "3 tablespoons unsalted butter, softened, for greasing the baking dish",
            "About 4 cups pulled cooked turkey (from roast turkey) or chicken (from 2 roast chickens)",
            "8 (12-inch) flour tortillas",
            "3 cups grated queso fresco**",
            "3 cups shredded queso Chihuahua***",
            "Sour cream",
            "Limes, cut into wedges",
            "*Dried chiles are often quite spicy and can leave their heat on your hands so some cooks like to wear rubber gloves when working with them. Be careful not to touch your eyes.",
            "**Queso fresco is a mild, grainy Mexican cheese available at many supermarkets. Cotija and feta are good substitutes.",
            "***Queso Chihuahua is a stringy, melting Mexican cheese. If unavailable, use mozzarella.",
            "Equipment: 1 large roasting pan; food processor or blender; 2 (9- by 13-inch) baking dishes"
        ],
        "instructions": [
            "In a large bowl, combine the tomatoes, onions, ancho and arbol chiles, garlic, celery, carrots, coriander, cumin, and dill and stir to combine. Season with salt and pepper then transfer to the roasting pan you will roast the turkey in.",
            "Roast the turkey according to your recipe. As the turkey roasts, its juices and fat will drip down and cook the enchilada sauce ingredients. (Keep in mind that if you baste the turkey with the turkey juices, they'll be flavored with your enchilada sauce ingredients. To avoid flavoring your turkey this way, baste with melted butter, turkey or chicken stock, or low-sodium chicken broth—or a combination of these.)",
            "When you remove the turkey from the oven to rest, check to see that the vegetables are tender and if necessary return them to the oven to finish cooking.",
            "Working in batches, transfer the enchilada mixture to a food processor or blender and process until smooth—if necessary, use a few splashes of water to loosen or thin the mixture and create a smooth paste. Season with salt and pepper. DO AHEAD: The enchilada sauce can be prepared ahead and refrigerated, in an airtight container, up to 3 days, or frozen, up to 3 months.",
            "Assemble the enchiladas: Preheat the oven to 350°F and butter 2 (9- by 13-inch) baking dishes. Spread about 1 cup of the enchilada sauce in the bottom of each dish. Pick the meat off the leftover turkey carcass and transfer to a large bowl—you'll need about 4 cups of meat. Add half the remaining enchilada sauce, along with half the queso fresco and half the queso Chihuahua, and stir to combine. On a work surface, spread about 1 cup of the turkey filling on the bottom half of 1 tortilla and roll it up burrito-style, folding in the sides to seal them closed. Repeat with the remaining tortillas and filling. Arrange the enchiladas tightly in the 2 prepared baking dishes then cover with the remaining sauce, followed by the remaining queso fresco and queso Chihuahua. DO AHEAD: The turkey enchiladas can be assembled up to this point, covered, and refrigerated, up to 24 hours, or frozen up to 3 months. Cover the enchiladas with foil and bake until the cheese has melted and the sauce is thickened and dark, about 1 hour. Serve immediately with sour cream and limes.",
            "Preheat the oven to 350°F and butter 2 (9- by 13-inch) baking dishes. Spread about 1 cup of the enchilada sauce in the bottom of each dish.",
            "Pick the meat off the leftover turkey carcass and transfer to a large bowl—you'll need about 4 cups of meat. Add half the remaining enchilada sauce, along with half the queso fresco and half the queso Chihuahua, and stir to combine.",
            "On a work surface, spread about 1 cup of the turkey filling on the bottom half of 1 tortilla and roll it up burrito-style, folding in the sides to seal them closed. Repeat with the remaining tortillas and filling. Arrange the enchiladas tightly in the 2 prepared baking dishes then cover with the remaining sauce, followed by the remaining queso fresco and queso Chihuahua. DO AHEAD: The turkey enchiladas can be assembled up to this point, covered, and refrigerated, up to 24 hours, or frozen up to 3 months.",
            "Cover the enchiladas with foil and bake until the cheese has melted and the sauce is thickened and dark, about 1 hour. Serve immediately with sour cream and limes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad658319925f464b3b61e1/6:4/w_274%2Ch_169/51197020_turkey-enchiladas_1x1.jpg"
    }
}