{
    "recipe": {
        "title": "Turkey Pot Pie ",
        "ingredients": [
            "1 tablespoon unsalted butter",
            "1 tablespoon extra-virgin olive oil",
            "1 cup chopped onion",
            "6 ounces button mushrooms, stems trimmed, caps cut in half then thickly sliced crosswise",
            "1 cup thinly sliced peeled carrots (about 2 carrots)",
            "1/2 cup diced leftover cooked vegetables (optional)",
            "1 1/2 cups diced cooked turkey (7 to 8 ounces)",
            "1 to 1 1/4 cups gravy",
            "1 teaspoon chopped fresh thyme",
            "1/4 cup frozen green peas, thawed",
            "1 tablespoon chopped fresh Italian parsley plus additional parsley leaves for crust",
            "1 egg white, beaten to blend with 1 teaspoon water (for glaze)",
            "1 9-inch purchased pie crust",
            "Cranberry sauce"
        ],
        "instructions": [
            "Melt 1 tablespoon unsalted butter with 1 tablespoon extra-virgin olive oil in heavy large skillet over medium-high heat. Add chopped onion and sauté until golden, 7 to 8 minutes. Add sliced mushrooms; sprinkle with salt and pepper. Sauté until browned and tender, about 4 minutes. Add sliced carrots; cover and cook until carrots soften slightly, about 2 minutes. Add leftover vegetables, if desired. Add diced turkey, gravy, and chopped fresh thyme. Bring filling mixture to boil; reduce heat to low and simmer to thicken if necessary. Season to taste with salt and pepper. Mix in peas and chopped parsley. Pour filling into 9-inch-diameter glass pie dish and refrigerate until cool, about 30 minutes.",
            "Lightly brush rim (both top and underside) of filled pie dish with egg glaze. Place crust atop filling and fold edge of dough over edge of pie dish. Pinch dough rim to seal crust all around. Press down on top edge of crust with fork tines to seal decoratively. Chill 10 minutes.",
            "Preheat oven to 400°F. Lightly brush top of pie with glaze. Make three to four 1/4-inch slits in center of pie to allow steam to escape. Press some fresh parsley leaves onto crust. Bake pie until crust is golden and filling is bubbling, 30 to 35 minutes. Remove from oven and let cool 10 minutes. Serve with cranberry sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a74862fa7a9917c25a6c/6:4/w_274%2Ch_169/355790_hires.jpg"
    }
}