{
    "recipe": {
        "title": "Turkey Breast Roulade with Crimini, Porcini, and Pancetta ",
        "ingredients": [
            "1 cup water",
            "3/4 ounce (about 3/4 cup) dried porcini mushrooms",
            "4 ounces thinly sliced pancetta (Italian bacon), coarsely chopped",
            "4 tablespoons vegetable oil, divided",
            "6 ounces fresh crimini mushrooms, coarsely chopped",
            "1/2 cup finely chopped onion",
            "1/4 cup chopped fresh Italian parsley",
            "1 tablespoon chopped fresh rosemary",
            "1/2 teaspoon fennel seeds, crushed",
            "2 cups fresh breadcrumbs made from crustless French bread",
            "1 2 3/4-pound turkey breast half with skin, boned but skin left intact, double butterflied",
            "2 cups (about) low-salt chicken broth",
            "4 tablespoons (about) unsalted butter, room temperature, divided",
            "2 tablespoons all purpose flour",
            "1/4 cup dry white wine"
        ],
        "instructions": [
            "Bring 1 cup water and dried mushrooms to boil in heavy small saucepan. Remove from heat. Let stand until soft, about 30 minutes. Drain, reserving soaking liquid. Chop mushrooms. Sauté pancetta in heavy large skillet over medium heat until crisp, about 10 minutes. Using slotted spoon, transfer pancetta to paper towel to drain. Add 2 tablespoons oil to drippings in skillet. Add crimini mushrooms and onion. Sauté until mushrooms begin to brown and no liquid remains, about 8 minutes. Remove from heat. Stir in pancetta and chopped porcini, then parsley, rosemary, and fennel seeds. Mix in breadcrumbs; season stuffing to taste with salt and pepper. Mix in enough reserved mushroom-soaking liquid by tablespoonfuls to moisten (about 3). Cool stuffing completely. Cover opened turkey breast with waxed paper. Using rolling pin, pound to 1/2-inch-thick rectangle (about 14x10 inches). Remove waxed paper. Sprinkle turkey with salt and pepper. Spread stuffing over, leaving 1-inch plain border. Sprinkle with additional mushroom-soaking liquid if dry. Starting at 1 long side, roll up turkey jelly-roll style. Secure with metal turkey-lacing pins. Tie roll crosswise with kitchen string every 1 1/2 to 2 inches to hold shape. Tie roll once lengthwise to secure ends. Remove metal pins. (Can be made 1 day ahead. Cover and chill.) Preheat oven to 375°F. Heat remaining 2 tablespoons oil in heavy large ovenproof skillet or heavy roasting pan over medium-high heat. Brown turkey roll on all sides, turning often, about 12 minutes. Pour 1/3 cup broth over. Brush with 1 teaspoon butter. Cover skillet with foil. Roast turkey 30 minutes, basting 2 more times with 1/3 cup broth and brushing with 1 teaspoon butter. Remove foil. Roast until turkey is brown and thermometer inserted into center registers 170°F, basting with broth and brushing with more butter occasionally, about 15 minutes longer. Transfer turkey to platter; tent loosely with foil. Reserve skillet or pan. Strain pan juices into 2-cup glass measuring cup. Add more broth, if necessary, to measure 1 1/4 cups liquid. Blend 2 tablespoons butter and flour in small bowl. Place roasting skillet or pan over medium-high heat. Add 11/4 cups pan-juice mixture, wine, and remaining mushroom-soaking liquid, leaving any sediment in bowl. Simmer 5 minutes, scraping up any browned bits. Gradually whisk in flour paste. Simmer until gravy thickens, whisking constantly, about 3 minutes. Season with salt and pepper. Remove strings from turkey. Cut roast crosswise into 1/2-inch-thick slices and serve with gravy.",
            "Bring 1 cup water and dried mushrooms to boil in heavy small saucepan. Remove from heat. Let stand until soft, about 30 minutes. Drain, reserving soaking liquid. Chop mushrooms.",
            "Sauté pancetta in heavy large skillet over medium heat until crisp, about 10 minutes. Using slotted spoon, transfer pancetta to paper towel to drain. Add 2 tablespoons oil to drippings in skillet. Add crimini mushrooms and onion. Sauté until mushrooms begin to brown and no liquid remains, about 8 minutes. Remove from heat. Stir in pancetta and chopped porcini, then parsley, rosemary, and fennel seeds. Mix in breadcrumbs; season stuffing to taste with salt and pepper. Mix in enough reserved mushroom-soaking liquid by tablespoonfuls to moisten (about 3). Cool stuffing completely.",
            "Cover opened turkey breast with waxed paper. Using rolling pin, pound to 1/2-inch-thick rectangle (about 14x10 inches). Remove waxed paper. Sprinkle turkey with salt and pepper. Spread stuffing over, leaving 1-inch plain border. Sprinkle with additional mushroom-soaking liquid if dry. Starting at 1 long side, roll up turkey jelly-roll style. Secure with metal turkey-lacing pins. Tie roll crosswise with kitchen string every 1 1/2 to 2 inches to hold shape. Tie roll once lengthwise to secure ends. Remove metal pins. (Can be made 1 day ahead. Cover and chill.)",
            "Preheat oven to 375°F. Heat remaining 2 tablespoons oil in heavy large ovenproof skillet or heavy roasting pan over medium-high heat. Brown turkey roll on all sides, turning often, about 12 minutes. Pour 1/3 cup broth over. Brush with 1 teaspoon butter. Cover skillet with foil. Roast turkey 30 minutes, basting 2 more times with 1/3 cup broth and brushing with 1 teaspoon butter. Remove foil. Roast until turkey is brown and thermometer inserted into center registers 170°F, basting with broth and brushing with more butter occasionally, about 15 minutes longer. Transfer turkey to platter; tent loosely with foil. Reserve skillet or pan.",
            "Strain pan juices into 2-cup glass measuring cup. Add more broth, if necessary, to measure 1 1/4 cups liquid. Blend 2 tablespoons butter and flour in small bowl. Place roasting skillet or pan over medium-high heat. Add 11/4 cups pan-juice mixture, wine, and remaining mushroom-soaking liquid, leaving any sediment in bowl. Simmer 5 minutes, scraping up any browned bits. Gradually whisk in flour paste. Simmer until gravy thickens, whisking constantly, about 3 minutes. Season with salt and pepper.",
            "Remove strings from turkey. Cut roast crosswise into 1/2-inch-thick slices and serve with gravy."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560df2c7f3a00aeb2f1d5e04/6:4/w_274%2Ch_169/231089.jpg"
    }
}