{
    "recipe": {
        "title": "Turkey Chowder with Wild Rice, Crimini, and Pancetta ",
        "ingredients": [
            "2 1/2 cups water",
            "3/4 cup wild rice (about 5 ounces), rinsed, drained",
            "1/4 teaspoon salt",
            "1 tablespoon vegetable oil",
            "2 3-ounce packages sliced pancetta (Italian bacon), diced",
            "12 ounces crimini (baby bella) mushrooms, sliced (about 5 1/2 cups)",
            "1/4 cup ( 1/2 stick) butter",
            "2 carrots, diced",
            "2 celery stalks, chopped",
            "1/2 cup chopped shallots",
            "1/3 cup all purpose flour",
            "10 cups Turkey Stock",
            "1 teaspoon dried crushed rosemary",
            "2 to 4 cups chopped cooked turkey meat (reserved from carcass)",
            "1 1/2 cups frozen corn kernels",
            "1 cup heavy whipping cream",
            "Chopped fresh Italian parsley"
        ],
        "instructions": [
            "Bring 2 1/2 cups water, rice, and 1/4 teaspoon salt to boil in medium saucepan. Reduce heat to low, cover, and simmer until rice is tender but still firm to bite, 45 to 60 minutes (time will vary depending on variety of rice). Drain; set aside.",
            "Heat oil in heavy large pot over medium heat. Add pancetta and cook until browned, stirring often, about 8 minutes. Using slotted spoon, transfer pancetta to paper towels to drain. Add mushrooms to pot and cook until beginning to brown, about 8 minutes. Transfer to medium bowl. Add butter to same pot. Add carrots and celery. Cover; cook until vegetables begin to soften, stirring often, about 5 minutes. Add shallots; stir until soft, about 2 minutes. Sprinkle flour over and stir 1 minute. Return mushrooms to pot. Mix in Turkey Stock and rosemary; bring to boil, stirring occasionally. Reduce heat to medium-low, partially cover, and simmer 15 minutes.",
            "Add rice, pancetta, turkey meat, and corn to soup. Simmer to blend flavors, about 10 minutes. Stir in cream. Season to taste with salt and pepper. DO AHEAD: Can be made 3 days ahead. Cool slightly. Chill uncovered until cool. Cover and keep chilled. Rewarm over medium heat before serving.",
            "Divide soup among bowls, sprinkle with parsley, and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d9a527b55306961bf7885/6:4/w_274%2Ch_169/240373_hires.jpg",
        "color": 11695561
    }
}