{
    "recipe": {
        "title": "Turkey Croquettes ",
        "ingredients": [
            "2 to 2 1/2 cups bread crumbs",
            "1 large egg",
            "2 tablespoons water",
            "2 cups mashed potatoes",
            "2 cups stuffing",
            "2 cups chopped cooked turkey or rotisserie chicken",
            "4 to 6 tablespoons olive oil, as needed",
            "Cranberry sauce",
            "Warm turkey gravy",
            "Equipment: 1 large rimmed baking sheet"
        ],
        "instructions": [
            "In a small sauté pan over moderate heat, toast the bread crumbs until golden and crunchy, 3 to 4 minutes. Transfer to a small bowl and let cool. In a small bowl, beat together the egg and water. In a large bowl, combine the mashed potatoes, stuffing, and turkey. Using your hands or a spoon, shape the mixture into 2-inch-long, oblong-shaped croquettes (you should have about 24 croquettes) and transfer to a large rimmed baking sheet. Working with 1 croquette at a time, dredge them in the egg-water mixture, letting the excess drip off, then dredge them in the bread crumbs, and return them to the rimmed baking sheet. In a large skillet, over moderately high heat, warm 2 tablespoons of the oil. Working in batches, pan-fry the croquettes, turning them occasionally, until crispy on all sides, 5 to 6 minutes total. Repeat with the remaining croquettes, wiping the pan clean and adding 2 tablespoons of the oil to the pan between batches. DO AHEAD: The croquettes can be prepared ahead and frozen, well wrapped in foil, for up to 3 months. To reheat: Bake the frozen croquettes on a large baking sheet in a 475°F oven until golden brown, about 10 minutes. Remove the croquettes from the oven for about 5 minutes to let the interiors thaw, then return them to the oven to finish baking for another 2 minutes. Serve hot with cranberry sauce and/or warm gravy.",
            "In a small sauté pan over moderate heat, toast the bread crumbs until golden and crunchy, 3 to 4 minutes. Transfer to a small bowl and let cool.",
            "In a small bowl, beat together the egg and water.",
            "In a large bowl, combine the mashed potatoes, stuffing, and turkey. Using your hands or a spoon, shape the mixture into 2-inch-long, oblong-shaped croquettes (you should have about 24 croquettes) and transfer to a large rimmed baking sheet.",
            "Working with 1 croquette at a time, dredge them in the egg-water mixture, letting the excess drip off, then dredge them in the bread crumbs, and return them to the rimmed baking sheet.",
            "In a large skillet, over moderately high heat, warm 2 tablespoons of the oil. Working in batches, pan-fry the croquettes, turning them occasionally, until crispy on all sides, 5 to 6 minutes total. Repeat with the remaining croquettes, wiping the pan clean and adding 2 tablespoons of the oil to the pan between batches. DO AHEAD: The croquettes can be prepared ahead and frozen, well wrapped in foil, for up to 3 months. To reheat: Bake the frozen croquettes on a large baking sheet in a 475°F oven until golden brown, about 10 minutes. Remove the croquettes from the oven for about 5 minutes to let the interiors thaw, then return them to the oven to finish baking for another 2 minutes.",
            "Serve hot with cranberry sauce and/or warm gravy."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad65a119925f464b3b62c3/6:4/w_274%2Ch_169/51197010_turkey-croquettes_1x1.jpg"
    }
}