{
    "recipe": {
        "title": "Turkish Coffee-Rubbed Brisket ",
        "ingredients": [
            "2 onions, peeled and quartered",
            "2 large potatoes, scrubbed and cut into 1-inch-thick wedges",
            "1 large carrot, peeled and cut into 2-inch pieces",
            "1 fennel bulb, cut into 1 1/2-inch-thick wedges",
            "1 garlic head, unpeeled, sliced in half crosswise",
            "2 tablespoons extra-virgin olive oil",
            "1 tablespoon plus 1 teaspoon kosher salt, divided",
            "1 1/2 teaspoons freshly ground black pepper, divided",
            "1 tablespoon finely ground Turkish coffee or espresso",
            "1 tablespoon smoked cinnamon (available from www.laboiteny.com) or regular cinnamon",
            "1 teaspoon ground cardamom",
            "One 3 1/2- to 4-pound brisket, (first or second cut; Solomonov prefers well-marbled second cut)",
            "Heavy, large roasting pan"
        ],
        "instructions": [
            "Preheat oven to 400°F. Place onions, potatoes, carrot, fennel, and garlic in a heavy roasting pan. Toss with olive oil, 1 teaspoon salt, and 1/2 teaspoon pepper. In a small bowl, combine coffee, cinnamon, cardamom, remaining 1 tablespoon salt, and 1 teaspoon pepper. Rub all over brisket and nestle brisket into vegetables to rest on bottom of pan. Roast until vegetables are lightly browned, 45 minutes. Cover tightly with foil, lower oven to 300°F, and roast until fork-tender (you should be able to insert a roasting fork in the center and twist slightly with little resistance), 4 1/2 to 5 hours for first cut and 5 1/2 to 6 hours for second cut. As the brisket cooks, check on it every 45 minutes, adding 1/4 cup water to the pan if it starts to look dry. When the brisket is cooked, remove roasting pan from oven, cool to room temperature, and refrigerate with the vegetables until fat is solid, 8 to 24 hours. Transfer brisket to a cutting board and slice across the grain. Skim and discard fat in the roasting pan. Return brisket slices to the roasting pan with the vegetables and cooking juices. To serve, preheat oven to 300°F. Transfer roasting pan to oven and heat brisket until liquid is melted and brisket and vegetables are just warmed through, 15 to 20 minutes. Transfer the brisket and vegetables to a serving dish, cover with foil, and reserve. Set the roasting pan over two burners on the stovetop and simmer the liquid over medium heat until thickened, 10 to 15 minutes. Pour the thickened pan juices over the brisket and serve.",
            "Preheat oven to 400°F. Place onions, potatoes, carrot, fennel, and garlic in a heavy roasting pan. Toss with olive oil, 1 teaspoon salt, and 1/2 teaspoon pepper. In a small bowl, combine coffee, cinnamon, cardamom, remaining 1 tablespoon salt, and 1 teaspoon pepper. Rub all over brisket and nestle brisket into vegetables to rest on bottom of pan. Roast until vegetables are lightly browned, 45 minutes.",
            "Cover tightly with foil, lower oven to 300°F, and roast until fork-tender (you should be able to insert a roasting fork in the center and twist slightly with little resistance), 4 1/2 to 5 hours for first cut and 5 1/2 to 6 hours for second cut. As the brisket cooks, check on it every 45 minutes, adding 1/4 cup water to the pan if it starts to look dry. When the brisket is cooked, remove roasting pan from oven, cool to room temperature, and refrigerate with the vegetables until fat is solid, 8 to 24 hours. Transfer brisket to a cutting board and slice across the grain. Skim and discard fat in the roasting pan. Return brisket slices to the roasting pan with the vegetables and cooking juices.",
            "To serve, preheat oven to 300°F. Transfer roasting pan to oven and heat brisket until liquid is melted and brisket and vegetables are just warmed through, 15 to 20 minutes. Transfer the brisket and vegetables to a serving dish, cover with foil, and reserve. Set the roasting pan over two burners on the stovetop and simmer the liquid over medium heat until thickened, 10 to 15 minutes. Pour the thickened pan juices over the brisket and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b87b7e4bf78b800d89b2ff/6:4/w_274%2Ch_169/51250890_coffee-rubbed-brisket_1x1.jpg"
    }
}