{
    "recipe": {
        "title": "Turkey Marsala with Sautéed Spinach ",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil",
            "1 small onion, chopped",
            "5 ounces baby spinach (8 cups)",
            "4 (3-ounces) turkey cutlets",
            "2 tablespoons unsalted butter",
            "2 slices prosciutto (1 ounce), halved crosswise",
            "2 ounces Italian Fontina, thinly sliced",
            "1/2 cup sweet Marsala wine"
        ],
        "instructions": [
            "Heat oil in a 12-inch heavy skillet over medium heat until it shimmers. Cook onion with 1/4 teaspoon salt and 1/8 teaspoon pepper, stirring occasionally, until golden, about 6 minutes. Add spinach and cook, stirring occasionally, until tender and liquid spinach releases has evaporated, about 4 minutes. Divide between 2 plates. Pat turkey cutlets dry and season with 1/4 teaspoon each of salt and pepper (total). Heat butter in skillet over medium heat until foam subsides, then sear turkey until pale golden, 1 to 3 minutes. Flip cutlets over and place 1/2 slice prosciutto on each. Top with cheese, then cover and cook until cheese is melted and turkey is just cooked through, about 1 minute. Transfer turkey to plates with spinach. Add Marsala to skillet and boil, scraping up any brown bits, until reduced by half, then spoon over turkey and spinach.",
            "Heat oil in a 12-inch heavy skillet over medium heat until it shimmers. Cook onion with 1/4 teaspoon salt and 1/8 teaspoon pepper, stirring occasionally, until golden, about 6 minutes.",
            "Add spinach and cook, stirring occasionally, until tender and liquid spinach releases has evaporated, about 4 minutes. Divide between 2 plates.",
            "Pat turkey cutlets dry and season with 1/4 teaspoon each of salt and pepper (total).",
            "Heat butter in skillet over medium heat until foam subsides, then sear turkey until pale golden, 1 to 3 minutes. Flip cutlets over and place 1/2 slice prosciutto on each. Top with cheese, then cover and cook until cheese is melted and turkey is just cooked through, about 1 minute. Transfer turkey to plates with spinach.",
            "Add Marsala to skillet and boil, scraping up any brown bits, until reduced by half, then spoon over turkey and spinach."
        ],
        "picture_link": null
    }
}