{
    "recipe": {
        "title": "Turkish Kebabs ",
        "ingredients": [
            "3 cloves of garlic, minced to a fine paste",
            "3 tablespoons extra-virgin olive oil",
            "1 tablespoon tomato paste",
            "1/2 teaspoon paprika",
            "1/4 teaspoon cayenne pepper",
            "1/4 teaspoon ground cinnamon",
            "1/4 teaspoon ground cumin",
            "2 tablespoons fresh thyme leaves",
            "Sea salt and finely ground black pepper",
            "1 3/4 pounds (800 g) boneless lamb leg, trimmed of most of the fat and cut into 1-inch (2.5 cm) chunks",
            "24 cherry tomatoes",
            "Flatbread, for serving"
        ],
        "instructions": [
            "Mix together the garlic, olive oil, tomato paste, spices, thyme, and salt and pepper to taste.",
            "To prepare the kebabs: Add the meat to the marinade and toss. Let marinate for at least 2 hours. Prepare a charcoal fire in an outdoor grill, switch on the gas if you have an outdoor gas grill, or preheat the broiler to high. Thread the meat onto 7 long skewers and the tomatoes onto an eighth one. Grill over high heat or broil 3 to 4 minutes on each side, or until the meat and tomatoes are done to your liking. Slip the meat and tomatoes off the skewers onto flatbread and serve immediately.",
            "Add the meat to the marinade and toss. Let marinate for at least 2 hours.",
            "Prepare a charcoal fire in an outdoor grill, switch on the gas if you have an outdoor gas grill, or preheat the broiler to high.",
            "Thread the meat onto 7 long skewers and the tomatoes onto an eighth one. Grill over high heat or broil 3 to 4 minutes on each side, or until the meat and tomatoes are done to your liking. Slip the meat and tomatoes off the skewers onto flatbread and serve immediately."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b05b471e9b81d7dff0a462a/6:4/w_274%2Ch_169/turkish-kebabs-recipe-HC-052218.jpg"
    }
}