{
    "recipe": {
        "title": "Turkish Lamb Chops with Sumac, Tahini, and Dill ",
        "ingredients": [
            "1 tablespoon Turkish red pepper or Aleppo pepper (or use red chile flakes)",
            "2 teaspoons fennel seeds",
            "2 teaspoons coriander seeds",
            "2 teaspoons cumin seeds",
            "2 teaspoons kosher salt, plus more to taste",
            "1/2 teaspoon freshly ground black pepper",
            "3 pounds bone-in loin lamb chops, the thicker the better",
            "Extra-virgin olive oil, for grilling",
            "1/3 cup fresh lemon juice (from about 2 lemons)",
            "2 to 3 garlic cloves, grated on a Microplane or minced",
            "1 3/4 teaspoons kosher salt",
            "1 cup tahini",
            "1/2 teaspoon ground cumin",
            "4 to 6 tablespoons ice water",
            "Fresh dill sprigs",
            "Ground sumac (optional)"
        ],
        "instructions": [
            "Combine the Turkish red pepper, fennel seeds, coriander seeds, and cumin seeds in a small bowl. Heat a small skillet over medium-low heat, add the spice mixture, and toast until fragrant, 1 to 2 minutes. Pour the mixture into a mortar or spice grinder, add the salt and black pepper, and either pound or briefly grind until you get a coarse-textured spice mix. Don’t overdo it if you’ve gone electric here—the coarse texture is an essential part of the dish.",
            "Pat the spice mixture all over the lamb chops, and let them marinate at room temperature for at least 30 minutes, or uncovered in the fridge for up to 24 hours.",
            "Make the tahini sauce: While the lamb is marinating, in a food processor, blend the lemon juice, garlic, and salt. Let the mixture sit for 10 minutes. Then add the tahini and ground cumin, and blend until a thick paste forms. With the processor running, gradually add the ice water, 1 tablespoon at a time, until the sauce is smooth enough to drizzle. Heat a grill or broiler to high. Drizzle the chops lightly with olive oil. Grill the chops until they are charred on the outside and cooked to taste within (or broil the chops on a broiler pan or rimmed baking sheet). Cooking time will depend on how thick your chops are, so watch them carefully: 2-inch-thick bone-in chops will take at least 3 to 5 minutes per side for rare. You’ll need less time for thinner chops, and more time if you like them cooked medium rare or beyond. Let the lamb rest for 5 minutes before serving. To serve, drizzle the tahini sauce over the chops, and garnish them with the dill sprigs. Add a dusting of the red sumac if you like.",
            "While the lamb is marinating, in a food processor, blend the lemon juice, garlic, and salt. Let the mixture sit for 10 minutes. Then add the tahini and ground cumin, and blend until a thick paste forms. With the processor running, gradually add the ice water, 1 tablespoon at a time, until the sauce is smooth enough to drizzle.",
            "Heat a grill or broiler to high.",
            "Drizzle the chops lightly with olive oil. Grill the chops until they are charred on the outside and cooked to taste within (or broil the chops on a broiler pan or rimmed baking sheet). Cooking time will depend on how thick your chops are, so watch them carefully: 2-inch-thick bone-in chops will take at least 3 to 5 minutes per side for rare. You’ll need less time for thinner chops, and more time if you like them cooked medium rare or beyond. Let the lamb rest for 5 minutes before serving.",
            "To serve, drizzle the tahini sauce over the chops, and garnish them with the dill sprigs. Add a dusting of the red sumac if you like."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58af7eae7c592624b115423e/6:4/w_274%2Ch_169/turkish-lamb-chops-022317.jpg"
    }
}