{
    "recipe": {
        "title": "Turkey Gumbo ",
        "ingredients": [
            "4 stalks celery, chopped",
            "3 small yellow onions, chopped",
            "1 large green bell pepper, seeded and chopped",
            "3/4 cup canola oil",
            "3 tablespoons olive oil",
            "1 1/3 cups all-purpose flour",
            "16 ounces andouille sausage, sliced into thin rounds",
            "1 small red bell pepper, seeded and chopped",
            "8 cloves garlic, minced",
            "8 to 10 cups chicken stock or low-sodium chicken broth, as needed",
            "2 tablespoons fresh thyme leaves, chopped",
            "1 1/2 teaspoons cayenne pepper",
            "1/4 cup hot sauce, preferably Crystal",
            "1/4 cup Worcestershire sauce",
            "2 teaspoons kosher salt, as needed",
            "1 1/4 teaspoons freshly ground black pepper, as needed",
            "4 cups pulled cooked turkey meat or rotisserie chicken, skin removed"
        ],
        "instructions": [
            "In a food processor, combine 1/4 cup chopped celery, 1/4 cup chopped onion, and 1/4 cup chopped green bell pepper. Process until smooth. In a small bowl, combine 1/2 cup of the canola oil with the olive oil and whisk to combine. Transfer to a heavy medium saucepan or Dutch oven, add the flour, and place over moderate heat. Cook the mixture, stirring slowly and constantly, until the roux is dark brown, 20 to 25 minutes. Add the puréed vegetables, and stir to combine. Cover and reserve. In a heavy large pot over moderate heat, warm the remaining 1/4 cup canola oil. Add the andouille sausage and sauté, stirring occasionally, until browned on all sides, 6 to 8 minutes. Add the red bell pepper, along with the remaining green bell pepper, and sauté, stirring occasionally, until just soft and brown, 3 to 4 minutes. Add the remaining celery and onions, along with the garlic, and sauté, stirring occasionally, until the onions are softened, 3 to 4 minutes. Add 8 cups of chicken stock, along with the thyme, cayenne pepper, hot sauce, Worcestershire sauce, and the reserved roux, whisking as needed to dissolve the roux in the liquid. Bring the gumbo to a boil, stirring frequently, then reduce the heat to low, season the gumbo with salt and pepper, and simmer, stirring frequently, until thickened, about 15 minutes. (The gumbo should have the consistency of chowder. If it thickens too much as it simmers, add additional stock; if it's too thin, in a small bowl, stir together 1 tablespoon all-purpose flour and 3 tablespoons canola oil and gradually add this mixture to the gumbo, simmering the mixture for a few minutes between additions, until the desired consistency is reached.) Add the turkey meat and simmer, stirring occasionally, until the turkey is heated through, about 5 minutes. Serve hot. DO AHEAD: The gumbo can be prepared ahead and kept, covered in the refrigerator, up to 3 days, or frozen, in an airtight container, up to 3 months. To reheat: Warm the gumbo in a heavy pot over moderate heat, adding additional chicken stock as needed to adjust the consistency.",
            "In a food processor, combine 1/4 cup chopped celery, 1/4 cup chopped onion, and 1/4 cup chopped green bell pepper. Process until smooth.",
            "In a small bowl, combine 1/2 cup of the canola oil with the olive oil and whisk to combine. Transfer to a heavy medium saucepan or Dutch oven, add the flour, and place over moderate heat. Cook the mixture, stirring slowly and constantly, until the roux is dark brown, 20 to 25 minutes. Add the puréed vegetables, and stir to combine. Cover and reserve.",
            "In a heavy large pot over moderate heat, warm the remaining 1/4 cup canola oil. Add the andouille sausage and sauté, stirring occasionally, until browned on all sides, 6 to 8 minutes. Add the red bell pepper, along with the remaining green bell pepper, and sauté, stirring occasionally, until just soft and brown, 3 to 4 minutes. Add the remaining celery and onions, along with the garlic, and sauté, stirring occasionally, until the onions are softened, 3 to 4 minutes. Add 8 cups of chicken stock, along with the thyme, cayenne pepper, hot sauce, Worcestershire sauce, and the reserved roux, whisking as needed to dissolve the roux in the liquid.",
            "Bring the gumbo to a boil, stirring frequently, then reduce the heat to low, season the gumbo with salt and pepper, and simmer, stirring frequently, until thickened, about 15 minutes. (The gumbo should have the consistency of chowder. If it thickens too much as it simmers, add additional stock; if it's too thin, in a small bowl, stir together 1 tablespoon all-purpose flour and 3 tablespoons canola oil and gradually add this mixture to the gumbo, simmering the mixture for a few minutes between additions, until the desired consistency is reached.) Add the turkey meat and simmer, stirring occasionally, until the turkey is heated through, about 5 minutes. Serve hot. DO AHEAD: The gumbo can be prepared ahead and kept, covered in the refrigerator, up to 3 days, or frozen, in an airtight container, up to 3 months. To reheat: Warm the gumbo in a heavy pot over moderate heat, adding additional chicken stock as needed to adjust the consistency."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad656819925f464b3b60fe/6:4/w_274%2Ch_169/51197030_turkey-gumbo_1x1.jpg"
    }
}