{
    "recipe": {
        "title": "Turtle Ice Cream Pie ",
        "ingredients": [
            "1 1/2 cups pecan halves or pieces (6 to 7 ounces), toastedepi:recipelink, divided</epi:recipelink>",
            "3/4 cup graham cracker crumbs (about 5 whole graham crackers, finely crushed in resealable plastic bag)",
            "1/4 cup sugar",
            "6 tablespoons (3/4 stick) unsalted butter, melted",
            "3/4 cup (packed) dark brown sugar",
            "3/4 cup heavy whipping cream",
            "3 tablespoons dark corn syrup",
            "3 tablespoons unsalted butter",
            "1/2 teaspoon vanilla extract",
            "1/4 teaspoon salt",
            "2 pints (4 cups) premium vanilla ice cream, divided",
            "5 1/2 ounces bittersweet chocolate, chopped",
            "1/2 cup heavy whipping cream",
            "1 1/2 tablespoons dark corn syrup",
            "3/4 teaspoon vanilla extract",
            "Pinch of salt"
        ],
        "instructions": [
            "Preheat oven to 350°F. Using on/off turns, finely chop 1 cup pecans in processor; transfer to medium bowl. Mix in graham cracker crumbs and sugar. Drizzle butter over; blend until evenly moistened. Press mixture firmly over bottom and up sides of 9-inch glass pie dish (not on rim).",
            "Bake crust until golden brown, about 12 minutes (if crust puffs, press firmly back into place). Cool crust completely. Wrap in foil and freeze at least 1 hour. DO AHEAD: Can be made 2 days ahead. Keep frozen.",
            "For sauce and filling: Bring first 3 ingredients to boil in heavy medium saucepan over medium heat, whisking until sugar dissolves. Boil caramel 5 minutes, whisking occasionally. Turn off heat; whisk in butter, vanilla, and salt. Cool completely. Slightly soften 1 cup vanilla ice cream in microwave on low in 10-second intervals. Spread ice cream evenly in frozen pie crust; spread 1/4 cup caramel over. Freeze pie until ice cream and caramel are firm, about 1 hour. Repeat with remaining vanilla ice cream in three 1-cup portions and caramel in two 1/4-cup portions. Freeze pie overnight. Cover and reserve remaining caramel at room temperature.",
            "Bring first 3 ingredients to boil in heavy medium saucepan over medium heat, whisking until sugar dissolves. Boil caramel 5 minutes, whisking occasionally. Turn off heat; whisk in butter, vanilla, and salt. Cool completely.",
            "Slightly soften 1 cup vanilla ice cream in microwave on low in 10-second intervals. Spread ice cream evenly in frozen pie crust; spread 1/4 cup caramel over. Freeze pie until ice cream and caramel are firm, about 1 hour. Repeat with remaining vanilla ice cream in three 1-cup portions and caramel in two 1/4-cup portions. Freeze pie overnight. Cover and reserve remaining caramel at room temperature.",
            "For ganache topping: Combine chocolate, cream, and corn syrup in medium metal bowl. Place over saucepan of simmering water and whisk until melted and smooth. Remove from heat. Whisk in vanilla and salt. Cool ganache at room temperature until thick but still pourable, about 30 minutes. Pour ganache evenly over frozen pie. Sprinkle with remaining 1/2 cup pecans. Freeze until ganache is firm, at least 45 minutes. Drizzle decoratively with 1/4 cup reserved caramel. DO AHEAD: Can be made 2 days ahead. Cover and keep frozen. Cover and chill remaining caramel. Let pie stand 10 minutes at room temperature. Rewarm remaining caramel, stirring over low heat. Cut pie into wedges and serve with caramel.",
            "Combine chocolate, cream, and corn syrup in medium metal bowl. Place over saucepan of simmering water and whisk until melted and smooth. Remove from heat. Whisk in vanilla and salt. Cool ganache at room temperature until thick but still pourable, about 30 minutes.",
            "Pour ganache evenly over frozen pie. Sprinkle with remaining 1/2 cup pecans. Freeze until ganache is firm, at least 45 minutes. Drizzle decoratively with 1/4 cup reserved caramel. DO AHEAD: Can be made 2 days ahead. Cover and keep frozen. Cover and chill remaining caramel.",
            "Let pie stand 10 minutes at room temperature. Rewarm remaining caramel, stirring over low heat. Cut pie into wedges and serve with caramel."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a4fb62fa7a9917c25798/6:4/w_274%2Ch_169/351556_hires.jpg",
        "color": 10008762
    }
}