{
    "recipe": {
        "title": "Tuscan Beans ",
        "ingredients": [
            "2 1/2 cups dried white beans such as Great Northern or navy (1 lb), picked over and rinsed",
            "10 cups water",
            "2 fresh sage sprigs",
            "1 bay leaf (not California)",
            "1 head of garlic",
            "1 tablespoon coarse sea salt",
            "Accompaniment: fine-quality extra-virgin olive oil (preferably Tuscan)",
            "a 5-quart terra-cotta bean pot or heavy saucepan"
        ],
        "instructions": [
            "If using a terra-cotta pot for the first time, soak it in water to cover at least 6 hours, then drain. Put beans, water, sage, bay leaf, and whole head of garlic in bean pot. Cover and slowly bring to a simmer over low heat; this can take 2 3/4 hours in bean pot or 1 hour in saucepan. Simmer beans until tender and soft but not mushy, about 45 minutes in bean pot or 35 to 40 minutes in saucepan. Remove from heat and cool beans, covered, 15 minutes. Stir in sea salt. Drain almost all cooking liquid from beans (reserve for making soup if desired) and season beans with sea salt and pepper to taste.",
            "If using a terra-cotta pot for the first time, soak it in water to cover at least 6 hours, then drain.",
            "Put beans, water, sage, bay leaf, and whole head of garlic in bean pot. Cover and slowly bring to a simmer over low heat; this can take 2 3/4 hours in bean pot or 1 hour in saucepan.",
            "Simmer beans until tender and soft but not mushy, about 45 minutes in bean pot or 35 to 40 minutes in saucepan. Remove from heat and cool beans, covered, 15 minutes. Stir in sea salt.",
            "Drain almost all cooking liquid from beans (reserve for making soup if desired) and season beans with sea salt and pepper to taste.",
            "Dress beans with oil at the table.",
            "Dress beans with oil at the table."
        ],
        "picture_link": "https://assets.epicurious.com/photos/561026e3f3a00aeb2f1d7bfa/6:4/w_274%2Ch_169/104559.jpg"
    }
}