{
    "recipe": {
        "title": "Tuscan Beans in Summery Tomato Ragù ",
        "ingredients": [
            "1 pounds dried cannellini or Great Northern beans, picked over and rinsed",
            "2 pints grape tomatoes (about 1 pound)",
            "1 small onion, finely chopped",
            "1 celery rib, thinly sliced",
            "3 garlic cloves, minced",
            "2 tablespoons extra-virgin olive oil",
            "2 tablespoons unsalted butter, divided",
            "3 thyme sprigs",
            "1 teaspoon sugar",
            "1/2 cup grated Parmigiano-Reggiano",
            "Accompaniment: crusty bread"
        ],
        "instructions": [
            "Soak beans in water to cover by 2 inches overnight (8 hours) or quick-soak (see cooks' note, below), then drain.",
            "Cover beans with water by 2 inches in a 5-to 6-quart pot. Bring to a boil, then reduce heat and briskly simmer, uncovered, stirring occasionally and skimming foam, until beans are very tender, 40 to 50 minutes. Reserve 2 cups cooking water, then drain beans.",
            "Halve 1 cup tomatoes lengthwise and set aside. Pulse remaining tomatoes in a food processor until almost smooth.",
            "Preheat oven to 450°F with rack in middle.",
            "Cook onion, celery, and garlic in oil and 1 tablespoon butter with 1/4 teaspoon each of salt and pepper in a 12-inch heavy skillet, stirring occasionally, until softened, about 5 minutes. Add tomato purée, thyme, sugar, 3/4 teaspoon salt, and reserved 2 cups bean-cooking water and simmer, stirring occasionally, until liquid is slightly thickened, about 10 minutes. Whisk in remaining tablespoon butter, then stir in beans.",
            "Transfer to a 3-quart shallow baking dish. Sprinkle evenly with cheese, then scatter tomato halves over top. Bake, covered tightly with foil, until liquid is reduced and beans are saucy but not soupy, 25 to 30 minutes. Let stand, covered, 10 minutes before serving (beans will continue to absorb liquid).",
            "What to drink: Avignonesi Rosso di Toscana '05",
            "Avignonesi Rosso di Toscana '05"
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a566e0acd286555db7fa/6:4/w_274%2Ch_169/352874_hires.jpg",
        "color": 4140639
    }
}