{
    "recipe": {
        "title": "Twice-Baked Goat Cheese Souffles ",
        "ingredients": [
            "1 3/4 cups whole milk",
            "3/4 cup coarsely chopped onion",
            "2 whole cloves",
            "1/8 teaspoon ground nutmeg",
            "6 tablespoons (3/4 stick) butter",
            "9 tablespoons all purpose flour",
            "1/4 teaspoon dry mustard",
            "2 cups crumbled soft fresh goat cheese (such as Montrachet; about 9 ounces)",
            "6 large egg yolks",
            "1 1/4 teaspoons salt",
            "3/4 teaspoon ground black pepper",
            "8 large egg whites",
            "1 cup whipping cream"
        ],
        "instructions": [
            "Combine milk, onion, cloves and nutmeg in heavy medium saucepan over medium heat. Bring to boil. Remove from heat. Cover and let stand 30 minutes. Strain.",
            "Preheat oven to 350°F. Butter eight 1 1/4-cup soufflé dishes. Melt 6 tablespoons butter in heavy large saucepan over medium heat. Add flour and dry mustard and whisk 2 minutes. Gradually whisk in strained milk. Boil until mixture is very thick and smooth, whisking constantly, about 2 minutes. Transfer soufflé base to large bowl. Gradually add 1 1/2 cups cheese, whisking until melted and smooth. Add yolks, 1 teaspoon salt and pepper; whisk until smooth. Cool to lukewarm.",
            "Beat egg whites and remaining 1/4 teaspoon salt in another large bowl until stiff but not dry. Gently fold beaten whites into cheese mixture in 3 additions.",
            "Divide batter equally among prepared soufflé dishes. Arrange dishes in heavy 17x12-inch roasting pan. Pour enough hot water into pan to come halfway up sides of dishes. Bake until soufflés are puffed and just firm to touch on top, about 20 minutes. Transfer pan to rack and completely cool soufflés in water. (Can be prepared 2 hours ahead. Let stand at room temperature.)",
            "Preheat oven to 425°F. Butter heavy large baking sheet. Using small knife, cut around sides of soufflés to loosen. Invert each soufflé onto spatula and slide soufflés onto prepared sheet, spacing evenly. Sprinkle with 1/2 cup cheese. Bake until soufflés are puffed, about 10 minutes.",
            "Meanwhile, bring cream to boil in heavy small saucepan. Remove from heat and season with salt and pepper.",
            "Using spatula, transfer soufflés to plates. Spoon seasoned cream around soufflés and serve hot."
        ],
        "picture_link": null,
        "color": 3012853
    }
}