{
    "recipe": {
        "title": "Twice-Baked Garlic Soufflés ",
        "ingredients": [
            "5 tbsp butter",
            "1 head of fresh garlic, trimmed and chopped roughly, or 5 cloves dried garlic, papery skins removed, chopped",
            "1/2 tsp vinegar",
            "1 cup milk",
            "3 tbsp all-purpose flour",
            "leaves from a couple of sprigs of thyme",
            "1 cup grated Cantal, Comté or Cheddar cheese",
            "1/2 cup grated Parmesan",
            "4 large eggs, separated",
            "1 1/4 cups heavy cream",
            "seasoning, nutmeg, extra Parmesan, a few bread crumbs",
            "You will need six 3/4-cup individual soufflé dishes"
        ],
        "instructions": [
            "Melt 1 tbsp of the butter and add the garlic, 1/4 tsp salt, pepper to taste, 3/4 cup water and the vinegar. Simmer covered for 10 minutes, then uncover and boil till the water has evaporated. Add the milk, bring to the boil, then process in a blender. Measure 1 cup garlic-milk mixture. Heat the remaining butter and stir in the flour and thyme. Cook for a minute, then make a white sauce by gradually stirring in the garlic milk till thick. Transfer to a big bowl, add the grated cheese, three-quarters of the Parmesan, then the egg yolks. Set aside. Heat the oven to 350°F (325°F convection). Butter the individual soufflé dishes and dust the sides with the remaining Parmesan; if you have any left over, stir into the sauce. Set in a roasting pan and put a kettle on to boil. Beat egg whites till firm but not dry. Fold half into the soufflé base, then add the rest. Spoon into the dishes (fill them almost to the top), pour boiling water into the pan to one-third of the depth of the dishes and bake for 20-25 minutes, till puffed and cooked through. Remove from oven and leave to cool—they will sink. When cool, run a knife round the edge to loosen each soufflé, gently upend on to your hand, then put the right way up on one big dish or 6 gratin dishes. (You can make the soufflés a day ahead, or even freeze them. Make sure they are at room temperature before the second baking.) To serve, set your oven to 400°F (375°F convection). Mix the cream with salt and pepper, grated nutmeg and Parmesan or other cheese. Pour over the soufflés to cover completely, then if you wish sprinkle with bread crumbs. Bake for 10-15 minutes, till golden and the sauce bubbling. They will gently re-puff.",
            "Melt 1 tbsp of the butter and add the garlic, 1/4 tsp salt, pepper to taste, 3/4 cup water and the vinegar. Simmer covered for 10 minutes, then uncover and boil till the water has evaporated. Add the milk, bring to the boil, then process in a blender. Measure 1 cup garlic-milk mixture.",
            "Heat the remaining butter and stir in the flour and thyme. Cook for a minute, then make a white sauce by gradually stirring in the garlic milk till thick. Transfer to a big bowl, add the grated cheese, three-quarters of the Parmesan, then the egg yolks. Set aside.",
            "Heat the oven to 350°F (325°F convection). Butter the individual soufflé dishes and dust the sides with the remaining Parmesan; if you have any left over, stir into the sauce. Set in a roasting pan and put a kettle on to boil.",
            "Beat egg whites till firm but not dry. Fold half into the soufflé base, then add the rest. Spoon into the dishes (fill them almost to the top), pour boiling water into the pan to one-third of the depth of the dishes and bake for 20-25 minutes, till puffed and cooked through. Remove from oven and leave to cool—they will sink.",
            "When cool, run a knife round the edge to loosen each soufflé, gently upend on to your hand, then put the right way up on one big dish or 6 gratin dishes. (You can make the soufflés a day ahead, or even freeze them. Make sure they are at room temperature before the second baking.)",
            "To serve, set your oven to 400°F (375°F convection). Mix the cream with salt and pepper, grated nutmeg and Parmesan or other cheese. Pour over the soufflés to cover completely, then if you wish sprinkle with bread crumbs. Bake for 10-15 minutes, till golden and the sauce bubbling. They will gently re-puff."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5609a51be0acd286555db75e/6:4/w_274%2Ch_169/352038.jpg"
    }
}