{
    "recipe": {
        "title": "Twice-Baked Potatoes ",
        "ingredients": [
            "4 large russet potatoes",
            "2 tablespoons vegetable oil",
            "1/2 cup sour cream",
            "1/4 cup unsalted butter",
            "1/4 cup finely chopped fresh chives",
            "1 tablespoon finely chopped fresh tarragon (if desired)",
            "Salt",
            "Pepper",
            "Chives, bacon, cheddar, chili if desired"
        ],
        "instructions": [
            "Place a rack in middle of oven; preheat to 425°. Poke 4 large russet potatoes all over with a fork; rub with 2 tablespoons vegetable oil. Bake directly on oven rack until very soft when squeezed and skins are crisp, 50–60 minutes. Let cool just until you can hold them. Using a serrated knife, slice potatoes in half lengthwise and scoop flesh into a medium bowl. Add 1/2 cup sour cream, 1/4 cup unsalted butter, 1/4 cup finely chopped fresh chives, and 1 tablespoon finely chopped fresh tarragon (if desired); season generously with salt and pepper. Divide among 4 potato skin halves, piling gloriously high—don't pack too tightly. (And what about the leftover skins? We say add butter and salt and snack on them.) Increase oven temperature to 450°. Bake potatoes on a rimmed baking sheet until filling is puffed and browned in spots, 20–25 minutes. No need to stop at chives. Add bacon, cheddar, chili—why hold back now?",
            "Place a rack in middle of oven; preheat to 425°. Poke 4 large russet potatoes all over with a fork; rub with 2 tablespoons vegetable oil. Bake directly on oven rack until very soft when squeezed and skins are crisp, 50–60 minutes. Let cool just until you can hold them.",
            "Using a serrated knife, slice potatoes in half lengthwise and scoop flesh into a medium bowl. Add 1/2 cup sour cream, 1/4 cup unsalted butter, 1/4 cup finely chopped fresh chives, and 1 tablespoon finely chopped fresh tarragon (if desired); season generously with salt and pepper.",
            "Divide among 4 potato skin halves, piling gloriously high—don't pack too tightly. (And what about the leftover skins? We say add butter and salt and snack on them.)",
            "Increase oven temperature to 450°. Bake potatoes on a rimmed baking sheet until filling is puffed and browned in spots, 20–25 minutes.",
            "No need to stop at chives. Add bacon, cheddar, chili—why hold back now?"
        ],
        "picture_link": "https://assets.epicurious.com/photos/5509b7223f2f10b269088fc0/6:4/w_274%2Ch_169/51264040_twice-baked-potatoes_1x1.jpg"
    }
}