{
    "recipe": {
        "title": "Two-Ingredient Truffles ",
        "ingredients": [
            "2/3 cup heavy cream",
            "12 ounces good-quality finely chopped milk chocolate or semisweet chocolate, or chocolate chips",
            "For the coatings (pick one or more flavors; each combo makes enough to coat the full batch of truffles):",
            "1 tablespoon curry powder",
            "1 cup unsweetened grated coconut",
            "2 teaspoons finely grated orange zest",
            "3/4 cup shelled roasted salted pistachios",
            "1 1/2 cups freeze-dried strawberries",
            "1 tablespoon finely ground black pepper",
            "3/4 cup caramel popcorn",
            "3/4 cup roasted salted peanuts"
        ],
        "instructions": [
            "Make the truffle base: Set a heat-safe medium bowl over a medium saucepan filled with an inch or two of water (the bottom of the bowl should not touch the water in the pot). Heat over medium heat until water is simmering, then add cream to bowl and heat until warm, about 3 minutes. Add chocolate and cook, stirring constantly, until melted, about 3 minutes (or up to 5 minutes if using chocolate chips). Carefully remove the bowl from the saucepan and pour chocolate mixture into a second heatproof bowl or pie pan (preferably made from metal, since it cools more quickly). Let cool at room temperature 15 minutes, then freeze until truffle base is firm, about 1 hour. Line a baking sheet with parchment or wax paper. Once chocolate mixture has chilled, use a teaspoon, melon baller, or small scoop to drop truffle mixture by the heaping teaspoonful onto the prepared sheet. Form truffles into balls by rolling them quickly between the palms of your hands. This process is a little messy, so wash your hands in cold water halfway through rolling, if desired. Freeze truffles on prepared sheet for 20 minutes.",
            "Set a heat-safe medium bowl over a medium saucepan filled with an inch or two of water (the bottom of the bowl should not touch the water in the pot). Heat over medium heat until water is simmering, then add cream to bowl and heat until warm, about 3 minutes. Add chocolate and cook, stirring constantly, until melted, about 3 minutes (or up to 5 minutes if using chocolate chips).",
            "Carefully remove the bowl from the saucepan and pour chocolate mixture into a second heatproof bowl or pie pan (preferably made from metal, since it cools more quickly). Let cool at room temperature 15 minutes, then freeze until truffle base is firm, about 1 hour.",
            "Line a baking sheet with parchment or wax paper. Once chocolate mixture has chilled, use a teaspoon, melon baller, or small scoop to drop truffle mixture by the heaping teaspoonful onto the prepared sheet. Form truffles into balls by rolling them quickly between the palms of your hands. This process is a little messy, so wash your hands in cold water halfway through rolling, if desired. Freeze truffles on prepared sheet for 20 minutes.",
            "Meanwhile, prepare your choice of topping: Curry-Coconut In a medium bowl, mix together the curry powder and shredded coconut. Orange-Pistachio Finely chop the grated zest and pistachios by hand or using a food processor. Place in a medium bowl and roll the truffles in the mixture, pressing slightly to adhere the topping. Strawberry-Black Pepper Place strawberries in a resealable plastic bag. Use a rolling pin or other heavy object, crush the strawberries until a mix of small pieces and powder is formed. Place in a medium bowl and mix in the pepper. Caramel-Corn Finely chop the peanuts by hand or using a food processor. Finely chop the popcorn by hand or add to the chopped peanuts in the food processor and pulse a few times until popcorn is in small pieces. Mix the peanuts and popcorn in a medium bowl.",
            "Curry-Coconut In a medium bowl, mix together the curry powder and shredded coconut.",
            "Orange-Pistachio Finely chop the grated zest and pistachios by hand or using a food processor. Place in a medium bowl and roll the truffles in the mixture, pressing slightly to adhere the topping.",
            "Strawberry-Black Pepper Place strawberries in a resealable plastic bag. Use a rolling pin or other heavy object, crush the strawberries until a mix of small pieces and powder is formed. Place in a medium bowl and mix in the pepper.",
            "Caramel-Corn Finely chop the peanuts by hand or using a food processor. Finely chop the popcorn by hand or add to the chopped peanuts in the food processor and pulse a few times until popcorn is in small pieces. Mix the peanuts and popcorn in a medium bowl.",
            "Finish the truffles: Once chilled, roll truffles in the topping of your choice (see above), pressing slightly to adhere the ingredients to the truffles. Store finished truffles in the refrigerator up to 5 days; remove to room temperature for 15 minutes before serving.",
            "Once chilled, roll truffles in the topping of your choice (see above), pressing slightly to adhere the ingredients to the truffles. Store finished truffles in the refrigerator up to 5 days; remove to room temperature for 15 minutes before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54d97b074f77a310045cfdab/6:4/w_274%2Ch_169/EP_20150209_truffles1_6X4.jpg"
    }
}