{
    "recipe": {
        "title": "\"Tzimmes\" Chicken with Apricots, Prunes, and Carrots ",
        "ingredients": [
            "2 whole chickens (about 4 pounds), broken down into 8 pieces, wings and backbones reserved for another use",
            "4 teaspoons kosher salt, divided",
            "1/2 cup plus 2 tablespoons honey",
            "1/2 cup olive oil",
            "1/2 cup fresh lemon juice",
            "2 teaspoons freshly ground black pepper",
            "2 teaspoons ground cinnamon",
            "1 teaspoon ground cumin",
            "1/4 teaspoon cayenne pepper",
            "2 pounds carrots, preferably young carrots with greens attached, halved lengthwise or quartered if large",
            "1 large red onion, cut into 1/2\" wedges",
            "12 garlic cloves, peeled",
            "8 ounces dried apricots (about 1 1/2 cups)",
            "8 ounces dried prunes (about 1 1/2 cups)",
            "20 sprigs thyme",
            "1 1/2 cups dry white wine",
            "Parsley leaves with tender stems (optional, for serving)"
        ],
        "instructions": [
            "Arrange racks in top and lower thirds of oven; preheat to 400°F. Season chicken pieces with 2 tsp. salt.",
            "Whisk honey, oil, lemon juice, pepper, cinnamon, cumin, cayenne, and remaining 2 tsp. salt in a large bowl. Add chicken pieces, carrots, onion, garlic, apricots, prunes, and thyme and toss to combine. Divide everything but chicken between 2 rimmed baking sheets. Stir wine and 1/2 cup water in a 2-cup measuring cup, then pour half over each sheet.",
            "Cover sheets tightly with foil. Roast 15 minutes, then remove from oven. Remove foil, divide chicken between sheets, and continue to roast, rotating sheets top to bottom halfway through, until carrots are fork-tender, chicken is golden brown, and an instant-read thermometer inserted into the thickest part of a breast registers 165°F, 30–35 minutes (if some pieces of chicken are finished before others, transfer them to a serving platter).",
            "Transfer chicken mixture to serving platter. Pour pan juices over. Top with carrot greens or parsley before serving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58bdb21482824e5cd6363678/6:4/w_274%2Ch_169/Tsimmes-Chicken-0302201.jpg",
        "color": 8025068
    }
}