{
    "recipe": {
        "title": "Ube (Purple Yam) Candies ",
        "ingredients": [
            "12 ounces purple- or orange-fleshed sweet potatoes (about 2 medium)",
            "7 ounces sweetened condensed milk",
            "1/2 cup nonfat instant dry milk",
            "1/2 teaspoon finely grated lime zest",
            "Pinch of kosher salt",
            "2 tablespoons sugar, plus more",
            "A potato ricer or food mill"
        ],
        "instructions": [
            "Preheat oven to 350°F. Roast sweet potatoes on a rimmed baking sheet until tender, 40–50 minutes. Let cool. Halve lengthwise and scoop flesh from skins; discard skins. Press flesh through ricer into a bowl (you should have 1 packed cup). Cook sweet potato and condensed milk in a medium nonstick saucepan or skillet over medium heat, stirring often, until thickened and jammy, 6–8 minutes. Stir in powdered milk, lime zest, salt, and 2 Tbsp. sugar. Cook, stirring often, until slightly shiny, about 3 minutes. Transfer to a small bowl; cover with plastic wrap, pressing directly onto surface. Let cool. Turn out ube mixture onto a work surface and roll into 1/2\"-thick logs. Sprinkle sugar over surface; roll logs in sugar until generously coated. Cut into 1 1/2\" pieces.",
            "Preheat oven to 350°F. Roast sweet potatoes on a rimmed baking sheet until tender, 40–50 minutes. Let cool. Halve lengthwise and scoop flesh from skins; discard skins. Press flesh through ricer into a bowl (you should have 1 packed cup).",
            "Cook sweet potato and condensed milk in a medium nonstick saucepan or skillet over medium heat, stirring often, until thickened and jammy, 6–8 minutes. Stir in powdered milk, lime zest, salt, and 2 Tbsp. sugar. Cook, stirring often, until slightly shiny, about 3 minutes. Transfer to a small bowl; cover with plastic wrap, pressing directly onto surface. Let cool.",
            "Turn out ube mixture onto a work surface and roll into 1/2\"-thick logs. Sprinkle sugar over surface; roll logs in sugar until generously coated. Cut into 1 1/2\" pieces.",
            "Do Ahead Candies can be made 2 weeks ahead. Wrap tightly and chill.",
            "Candies can be made 2 weeks ahead. Wrap tightly and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a3002b41108fa327e38acc1/6:4/w_274%2Ch_169/ube-purple-yam-candies-recipe-BA-121217.jpg"
    }
}