{
    "recipe": {
        "title": "Ultimate Power Balls ",
        "ingredients": [
            "1/2 cup (10g) PUFFED MILLET",
            "1 cup (20g) PUFFED KAMUT or PUFFED RICE",
            "1/2 cup (90g) diced DRIED PLUMS (prunes; see Note)",
            "1/3 cup (60g) SEMISWEET CHOCOLATE CHIPS",
            "1/4 cup (35g) SESAME SEEDS",
            "1/3 cup (80g) SUNFLOWER BUTTER, at room temperature",
            "1/2 cup (125ml) HONEY",
            "3/4 cup (40g) shredded unsweetened COCONUT"
        ],
        "instructions": [
            "1. In a large bowl, toss together the puffed millet and puffed kamut or rice. Add the dried plums, chocolate chips, and sesame seeds. 2. Stir in the sunflower butter and the honey. You should have a nice sticky mess! Cover the bowl with plastic wrap and refrigerate for 30 minutes. 3. Place the coconut in a small bowl. Using a tablespoon, scoop the mixture and form it into 1-inch (2.5cm) balls with your hands. Roll the balls in the coconut and transfer to a container. You can store the power balls in the refrigerator for up to 1 week, or in the freezer in a zip-top freezer bag for up to 1 month, but I bet they won't last that long!",
            "1. In a large bowl, toss together the puffed millet and puffed kamut or rice. Add the dried plums, chocolate chips, and sesame seeds.",
            "2. Stir in the sunflower butter and the honey. You should have a nice sticky mess! Cover the bowl with plastic wrap and refrigerate for 30 minutes.",
            "3. Place the coconut in a small bowl. Using a tablespoon, scoop the mixture and form it into 1-inch (2.5cm) balls with your hands. Roll the balls in the coconut and transfer to a container. You can store the power balls in the refrigerator for up to 1 week, or in the freezer in a zip-top freezer bag for up to 1 month, but I bet they won't last that long!"
        ],
        "picture_link": "https://assets.epicurious.com/photos/54aca45219925f464b3ae00d/6:4/w_274%2Ch_169/51218420_ultimate-power-balls-_1x1.jpg"
    }
}