{
    "recipe": {
        "title": "Ultra-Creamy Mashed Potatoes ",
        "ingredients": [
            "4 pounds medium Yukon Gold potatoes, scrubbed",
            "4 teaspoons kosher salt, plus more",
            "1 1/2 cups whole milk",
            "1/2 cup heavy cream",
            "1 head of garlic, halved crosswise",
            "3 sprigs rosemary",
            "1 cup (2 sticks) unsalted butter, room temperature, cut into pieces",
            "Freshly ground black pepper",
            "A potato ricer or food mill fitted with fine disk"
        ],
        "instructions": [
            "Place potatoes in a large pot and pour in cold water to cover by 1\". Add a large handful of salt (water should taste briny, like the ocean) and bring to a boil. Reduce heat and simmer until potatoes are very tender but not crumbly, 30–35 minutes. Drain, briefly rinse with cool water to remove any excess starch, and return potatoes to warm pot (off heat) to dry while you heat the milk mixture.",
            "Warm milk, cream, garlic, and rosemary sprigs in a small saucepan over medium until fragrant, about 5 minutes. Remove pan from heat.",
            "Pass hot potatoes through ricer or food mill into a large bowl (cold potatoes will become gummy). Add butter and 4 tsp. salt and stir until butter is completely incorporated. Strain warm milk mixture through a fine-mesh sieve into a large measuring glass. Pour into potatoes 1/2-cupful at a time, stirring after each addition until liquid is fully incorporated and mixture is smooth before adding more.",
            "Serve mashed potatoes topped with a few grinds of pepper.",
            "Do Ahead Mashed potatoes can be made 1 day ahead. Cover and chill. Reheat over medium, stirring often and adding 1/4 cup milk or stock to thin out if needed.",
            "Mashed potatoes can be made 1 day ahead. Cover and chill. Reheat over medium, stirring often and adding 1/4 cup milk or stock to thin out if needed."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a05db0f543d902dfd5e0628/6:4/w_274%2Ch_169/ultra-creamy-mashed-potatoes-recipe-BA-111017.jpg",
        "color": 15803643
    }
}