{
    "recipe": {
        "title": "Valentine\u0092s Day Party Ryes for Divorcées ",
        "ingredients": [
            "1 package hot dogs",
            "1/2 pound Swiss cheese",
            "1 loaf rye bread",
            "4 gay men",
            "Vodka",
            "Grand Marnier",
            "Cranberry juice",
            "Juice of one lime",
            "Martina McBride CD"
        ],
        "instructions": [
            "Round up all the gals in the subdivision, 'cause this Valentine's Day is going to be a blast! No more sitting at home moping and drooling over Keith Olbermann. Not this year. No, ma'am! In a large glass pitcher mix 2 cups vodka, 1/2 cup Grand Marnier, 1/2 cup cranberry juice, and lime juice, 'cause you sassy ladies are gonna drink cosmos! Wooo! Call the boys too—they will love this! (Note: if you live in a so-called red state and can't locate 4 gay men, look for attractive, single, good-smelling men over the age of forty.) Preheat oven to 375°F. Cut hot dogs into small rounds. Place slices of rye bread on a baking sheet, top with hot-dog rounds, and cover with Swiss cheese. Bake in oven until cheese is melted and bread is toasted. Remove from oven, cut each piece of bread into quarters, and arrange on a platter in an attractive fashion. When guests arrive, serve cosmos with party ryes. Some suggestions for activities include: Dance contest to empowering Martina McBride music, using aerobics moves you learned at Curves Pin the tail on the trophy wife Watch First Wives Club and drink every time Bette Midler delivers a snappy insult to ex-husband Alter old wedding dresses into cute halter tops or jaunty berets Duck duck Grey Goose Uh-oh! Sexy Officer Thunder has arrived to issue a noise complaint! Most of all, keep the cosmos flowing to ensure a good time for all!",
            "Round up all the gals in the subdivision, 'cause this Valentine's Day is going to be a blast! No more sitting at home moping and drooling over Keith Olbermann. Not this year. No, ma'am! In a large glass pitcher mix 2 cups vodka, 1/2 cup Grand Marnier, 1/2 cup cranberry juice, and lime juice, 'cause you sassy ladies are gonna drink cosmos! Wooo!",
            "Call the boys too—they will love this! (Note: if you live in a so-called red state and can't locate 4 gay men, look for attractive, single, good-smelling men over the age of forty.)",
            "Preheat oven to 375°F. Cut hot dogs into small rounds. Place slices of rye bread on a baking sheet, top with hot-dog rounds, and cover with Swiss cheese. Bake in oven until cheese is melted and bread is toasted. Remove from oven, cut each piece of bread into quarters, and arrange on a platter in an attractive fashion.",
            "When guests arrive, serve cosmos with party ryes. Some suggestions for activities include:",
            "Dance contest to empowering Martina McBride music, using aerobics moves you learned at Curves",
            "Pin the tail on the trophy wife",
            "Watch First Wives Club and drink every time Bette Midler delivers a snappy insult to ex-husband",
            "Alter old wedding dresses into cute halter tops or jaunty berets",
            "Duck duck Grey Goose",
            "Uh-oh! Sexy Officer Thunder has arrived to issue a noise complaint!",
            "Most of all, keep the cosmos flowing to ensure a good time for all!"
        ],
        "picture_link": null
    }
}