{
    "recipe": {
        "title": "Vanilla Creams with Strawberries in Cassis ",
        "ingredients": [
            "1 1/2 cups plain whole-milk yogurt",
            "1 3/4 cups fromage blanc*",
            "1 vanilla bean, split lengthwise",
            "5 tablespoons superfine sugar, divided",
            "1 1/2 teaspoons finely grated lemon peel",
            "1 large egg white",
            "1 1/2 pounds strawberries, hulled, halved (about 5 cups)",
            "2 tablespoons crème de cassis (black-currant liqueur)",
            "Brown sugar"
        ],
        "instructions": [
            "Place 2 sieves over bowls; line sieves with cheesecloth or damp kitchen towel. Spoon yogurt into 1 sieve; spoon fromage blanc into second sieve. Cover; chill overnight. Scrape drained yogurt and fromage blanc into large bowl; whisk to combine. Scrape in seeds from vanilla bean. Gently mix in 3 tablespoons sugar and lemon peel. Whisk egg white in medium bowl until peaks form. Gently fold egg white into cheese mixture. Divide among 6 small bowls. Cover; chill at least 8 hours. DO AHEAD: Can be made 1 day ahead. Keep chilled. Toss berries, 2 tablespoons sugar, and cassis in large bowl. Let stand until berries release juices, stirring occasionally, at least 30 minutes and up to 2 hours. Sift or sprinkle brown sugar evenly over each dessert. Spoon berries and juices over.",
            "Place 2 sieves over bowls; line sieves with cheesecloth or damp kitchen towel. Spoon yogurt into 1 sieve; spoon fromage blanc into second sieve. Cover; chill overnight. Scrape drained yogurt and fromage blanc into large bowl; whisk to combine. Scrape in seeds from vanilla bean. Gently mix in 3 tablespoons sugar and lemon peel. Whisk egg white in medium bowl until peaks form. Gently fold egg white into cheese mixture. Divide among 6 small bowls. Cover; chill at least 8 hours. DO AHEAD: Can be made 1 day ahead. Keep chilled.",
            "Toss berries, 2 tablespoons sugar, and cassis in large bowl. Let stand until berries release juices, stirring occasionally, at least 30 minutes and up to 2 hours.",
            "Sift or sprinkle brown sugar evenly over each dessert. Spoon berries and juices over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3b47321388ef838b0abcc/6:4/w_274%2Ch_169/358565_vanilla-creams-strawberries-cassis_1x1.jpg"
    }
}