{
    "recipe": {
        "title": "Vanilla Whipped Buttercream ",
        "ingredients": [
            "2 sticks (1 cup) organic unsalted butter, softened",
            "1 cup organic cane sugar",
            "1 cup organic whole milk",
            "1/4 cup sifted organic all-purpose flour",
            "1 1/2 tablespoons organic vanilla extract"
        ],
        "instructions": [
            "Cream the butter on medium speed, 3 to 5 minutes, in a standing mixer or with a hand mixer until soft, about 30 seconds. Add the sugar and beat on high speed until light and fluffy, 5 to 7 minutes.",
            "In a small saucepan, combine 1/4 cup of the milk, the flour, and the vanilla extract, and whisk until there are no lumps. Over medium heat, slowly add the remaining 3/4 cup milk, whisking constantly, and cook until the mixture comes to a low boil. Then reduce the heat to low and keep whisking for a few more minutes, until the mixture starts to thicken.",
            "Immediately remove the pan from the heat, but keep stirring. (After you have removed the pan from the heat, the mixture will continue to cook for a minute or two on its own. If you overheat it and get small lumps, try to whisk vigorously to get them out, or pass the mixture through a fine-mesh sieve.) If necessary, place the pan over a bowl of ice water to stop the cooking process and allow the mixture to cool.",
            "Once the milk mixture has thickened, set it aside to cool to room temperature. You can stick it in the freezer to rush the cooling.",
            "With the mixer on low speed, slowly pour the milk mixture into the butter-sugar mixture. Increase the speed to medium and beat until the frosting is light and fluffy, 3 to 5 minutes. Add vanilla to combine.",
            "Espresso Whipped Buttercream This version works beautifully as a filling with a dark-chocolate frosting—you get the best of both worlds: Dissolve 1 heaping teaspoon instant espresso powder in 1 tablespoon boiling water. Combine with the butter-sugar mixture.",
            "This version works beautifully as a filling with a dark-chocolate frosting—you get the best of both worlds: Dissolve 1 heaping teaspoon instant espresso powder in 1 tablespoon boiling water. Combine with the butter-sugar mixture.",
            "Chocolate Whipped Buttercream This light and fluffy chocolate frosting tastes like whipped cream with a hint of chocolate: While the milk mixture is cooling, melt 4 ounces unsweetened or dark chocolate in the top of a double boiler set over simmering water, or in 30-second bursts in a microwave. Cool to room temperature. With the mixer on low speed, combine the chocolate with the butter-sugar mixture.",
            "This light and fluffy chocolate frosting tastes like whipped cream with a hint of chocolate: While the milk mixture is cooling, melt 4 ounces unsweetened or dark chocolate in the top of a double boiler set over simmering water, or in 30-second bursts in a microwave. Cool to room temperature. With the mixer on low speed, combine the chocolate with the butter-sugar mixture."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57a38414437fcffe02f72451/6:4/w_274%2Ch_169/vanilla-whipped-buttercream.jpg"
    }
}