{
    "recipe": {
        "title": "Vanilla-Poached Pineapple ",
        "ingredients": [
            "1 large extra-sweet pineapple",
            "1 vanilla bean, split lengthwise",
            "4 cups dry white wine",
            "1/3 cup Grand Marnier",
            "1/3 cup packed light brown sugar",
            "1 (2-to 3-inch) piece of cinnamon stick",
            "1 Turkish or 1/2 California bay leaf",
            "2 cloves",
            "1 1/2 tablespoons granulated sugar",
            "Accompaniment: vanilla ice cream"
        ],
        "instructions": [
            "Peel pineapple, then quarter lengthwise. Cut out core, then cut each quarter lengthwise into 4 pieces (for a total of 16). Scrape seeds from vanilla bean into a 12-inch heavy skillet with tip of a paring knife, then add pod, wine, Grand Marnier, brown sugar, cinnamon stick, bay leaf, cloves, and a large pinch of salt. Bring to a boil, stirring until sugar has dissolved. Add pineapple to wine mixture and return to a boil. Remove from heat. Cool pineapple in liquid, about 1 hour. Transfer pineapple with a slotted spoon to a 4-sided sheet pan, then boil liquid until reduced to about 2/3 cup, about 35 minutes. Preheat broiler. Sprinkle pineapple with granulated sugar, then broil 3 to 4 inches from heat until slightly caramelized and lightly charred in spots, 10 to 15 minutes (watch carefully and remove any pineapple that colors more quickly). Serve drizzled with syrup.",
            "Peel pineapple, then quarter lengthwise. Cut out core, then cut each quarter lengthwise into 4 pieces (for a total of 16).",
            "Scrape seeds from vanilla bean into a 12-inch heavy skillet with tip of a paring knife, then add pod, wine, Grand Marnier, brown sugar, cinnamon stick, bay leaf, cloves, and a large pinch of salt. Bring to a boil, stirring until sugar has dissolved.",
            "Add pineapple to wine mixture and return to a boil. Remove from heat. Cool pineapple in liquid, about 1 hour. Transfer pineapple with a slotted spoon to a 4-sided sheet pan, then boil liquid until reduced to about 2/3 cup, about 35 minutes.",
            "Preheat broiler.",
            "Sprinkle pineapple with granulated sugar, then broil 3 to 4 inches from heat until slightly caramelized and lightly charred in spots, 10 to 15 minutes (watch carefully and remove any pineapple that colors more quickly). Serve drizzled with syrup."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d79927b55306961bf36aa/6:4/w_274%2Ch_169/350954_hires.jpg"
    }
}