{
    "recipe": {
        "title": "Vanilla Bean Tarte Tatin ",
        "ingredients": [
            "5 Pink Lady or other crisp apples (about 2 pounds), peeled",
            "1/2 cup sugar",
            "1/2 vanilla bean, split lengthwise",
            "2 tablespoons unsalted butter",
            "1 tablespoon apple cider vinegar",
            "1/8 teaspoon kosher salt",
            "1 sheet frozen puff pastry (one 14-ounce package or half of a 17.3-ounce package), thawed",
            "All-purpose flour (for surface)"
        ],
        "instructions": [
            "Preheat oven to 425°. Cut apples as close to core as possible into three lobes; set aside. Scatter half of sugar in a heavy 9\" skillet and scrape in vanilla seeds; discard pod. Cook over medium heat, stirring occasionally, until sugar is melted and starting to caramelize, 6–8 minutes (if using a cast-iron skillet, test the color of the caramel by spooning some onto a white plate. It should be pale amber). Add remaining sugar and cook until all sugar is dissolved and has taken on a deep amber color. Stir in butter, vinegar, and salt. Place apples cut side down in skillet and cook until they start giving up some of their juices and shrink slightly, 5–8 minutes. Carefully turn apples over and scoot them together so they overlap slightly. (The apples will shrink more as they bake, so they need to be tightly packed from the beginning.) Remove from heat. Gently roll out puff pastry on a lightly floured work surface just to smooth out creases; cut into a round that will fit snugly and flush inside skillet. Drape puff pastry over apples and transfer skillet to oven. Bake until pastry is puffed and starting to brown in spots, 20–25 minutes. Reduce heat to 350° and bake until apples are tender and pastry is golden brown and cooked all the way through, 20–25 minutes longer. Let rest 5 minutes before inverting onto a platter.",
            "Preheat oven to 425°. Cut apples as close to core as possible into three lobes; set aside. Scatter half of sugar in a heavy 9\" skillet and scrape in vanilla seeds; discard pod. Cook over medium heat, stirring occasionally, until sugar is melted and starting to caramelize, 6–8 minutes (if using a cast-iron skillet, test the color of the caramel by spooning some onto a white plate. It should be pale amber). Add remaining sugar and cook until all sugar is dissolved and has taken on a deep amber color.",
            "Stir in butter, vinegar, and salt. Place apples cut side down in skillet and cook until they start giving up some of their juices and shrink slightly, 5–8 minutes. Carefully turn apples over and scoot them together so they overlap slightly. (The apples will shrink more as they bake, so they need to be tightly packed from the beginning.) Remove from heat. Gently roll out puff pastry on a lightly floured work surface just to smooth out creases; cut into a round that will fit snugly and flush inside skillet. Drape puff pastry over apples and transfer skillet to oven.",
            "Bake until pastry is puffed and starting to brown in spots, 20–25 minutes. Reduce heat to 350° and bake until apples are tender and pastry is golden brown and cooked all the way through, 20–25 minutes longer. Let rest 5 minutes before inverting onto a platter."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5509b4993f2f10b2690887ad/6:4/w_274%2Ch_169/51264460_vanilla-bean-tarte-tatin_1x1.jpg"
    }
}