{
    "recipe": {
        "title": "Veal with Vinegar Sauce ",
        "ingredients": [
            "1/3 cup all purpose flour",
            "Pinch of cayenne pepper",
            "1 pound veal (preferably top round), cut into 1/4-inch-thick slices",
            "3 tablespoons olive oil",
            "4 garlic cloves, minced",
            "1/4 cup red wine vinegar",
            "1 1/2 cups canned unsalted beef broth",
            "1/2 cup packed chopped fresh Italian parsley"
        ],
        "instructions": [
            "Stir flour and pinch of cayenne pepper in shallow pie dish. Lightly coat veal with flour mixture, shaking off excess. Heat olive oil in large nonstick skillet over medium-high heat. Add veal in batches and cook just until outside is no longer pink, about 1 minute per side. Transfer veal to platter. Add minced garlic to skillet and sauté 1 minute. Return veal to skillet. Pour vinegar over (mixture will steam). Pour beef broth over. Boil until sauce is reduced by half and veal is tender, about 6 minutes. Transfer veal to platter. Tent with aluminum foil to keep warm. Add chopped parsley to skillet. Cook until sauce is thick, about 5 minutes. Season to taste with salt. Pour sauce over veal and serve.",
            "Stir flour and pinch of cayenne pepper in shallow pie dish. Lightly coat veal with flour mixture, shaking off excess. Heat olive oil in large nonstick skillet over medium-high heat. Add veal in batches and cook just until outside is no longer pink, about 1 minute per side. Transfer veal to platter.",
            "Add minced garlic to skillet and sauté 1 minute. Return veal to skillet. Pour vinegar over (mixture will steam). Pour beef broth over. Boil until sauce is reduced by half and veal is tender, about 6 minutes. Transfer veal to platter. Tent with aluminum foil to keep warm. Add chopped parsley to skillet. Cook until sauce is thick, about 5 minutes. Season to taste with salt. Pour sauce over veal and serve."
        ],
        "picture_link": null
    }
}