{
    "recipe": {
        "title": "Vegetable Barley Couscous ",
        "ingredients": [
            "3/4 cup dried chickpeas (4 1/2 ounces)",
            "1/2 teaspoon crumbled saffron threads",
            "2 medium tomatoes",
            "1/3 cup extra-virgin olive oil",
            "2 medium onions, coarsely chopped",
            "1 teaspoon black pepper",
            "2 teaspoons ground ginger",
            "1 tablespoon salt",
            "1 tablespoon tomato paste",
            "6 cups water",
            "1 teaspoon ground ras-el-hanout",
            "3/4 pound carrots, peeled and halved crosswise, then halved lengthwise",
            "2 medium turnips, peeled and cut into 1 1/2-inch-wide wedges",
            "2 medium zucchini, trimmed, halved crosswise, then halved lengthwise",
            "1/2 medium green cabbage, cut into 6 wedges",
            "3/4 pound butternut squash, peeled, seeded, and cut into 2-inch pieces",
            "1/2 teaspoon fiery harissa plus additional for serving",
            "2 1/2 cups barley couscous",
            "1 1/4 teaspoons salt",
            "1/4 cup extra-virgin olive oil",
            "2 1/2 to 3 cups water",
            "1/2 cup olive oil",
            "3/4 cup whole blanched almonds (4 ounces)",
            "Accompaniment: \"epi:recipeLink id=\"238426\">honeyed red-onion confit",
            "a couscoussière"
        ],
        "instructions": [
            "Soak dried chickpeas in 3 cups water at least 8 hours and up to 24.",
            "Drain soaked chickpeas and combine with 6 cups cold water in a 3- to 4-quart saucepan and simmer, uncovered, until tender, about 1 hour. Drain and set aside.",
            "Make broth while chickpeas cook: Lightly toast saffron in a dry small heavy skillet over moderately low heat, shaking skillet, just until fragrant, about 1 minute, then transfer to a small dish. Halve tomatoes and grate flesh on large round holes of a box grater, discarding skin. Put oil, grated tomato, onions, pepper, ginger, salt, tomato paste, and saffron in lower portion of couscoussière (or in 5- to 6-quart pot) and cook over moderate heat, stirring frequently, until onions are softened, about 10 minutes. Add water and ras-el-hanout and bring broth to a simmer.",
            "Lightly toast saffron in a dry small heavy skillet over moderately low heat, shaking skillet, just until fragrant, about 1 minute, then transfer to a small dish.",
            "Halve tomatoes and grate flesh on large round holes of a box grater, discarding skin.",
            "Put oil, grated tomato, onions, pepper, ginger, salt, tomato paste, and saffron in lower portion of couscoussière (or in 5- to 6-quart pot) and cook over moderate heat, stirring frequently, until onions are softened, about 10 minutes. Add water and ras-el-hanout and bring broth to a simmer.",
            "Make couscous: While broth comes to a simmer, put couscous in a large wide bowl and toss with salt, then drizzle with 2 tablespoons oil, rubbing grains between your palms to distribute oil. Sprinkle couscous with 1 cup tepid water, rubbing to evenly distribute and breaking up any lumps. Sprinkle top portion of couscoussière (if using a colander or steamer, line with cheesecloth) with couscous in an even, loose layer without packing. Set couscous over simmering broth and steam, uncovered, until steam rises up evenly over surface of couscous, about 10 minutes. Transfer couscous to cleaned bowl (reserving cheesecloth if using). Let stand until cool enough to handle, then sprinkle with 1 cup water again and gently rub couscous between palms. Let couscous stand 10 minutes. While couscous stands, add carrots and turnips to broth in couscoussière and return to a simmer. Return couscous to top of couscoussière and steam a second time, uncovered, in same manner, until steam rises evenly over surface, then transfer to bowl again (reserving cheesecloth). Stir just enough water (1/2 to 3/4 cup) into couscous to make it come together when a squeezed handful holds its shape without cracking. Let couscous stand, uncovered, 10 minutes. While couscous stands, add zucchini, cabbage, and butternut squash to broth and cook, covered, until vegetables are almost tender, then add cooked chickpeas. Rub remaining 2 tablespoons oil into couscous, then transfer to top of couscoussière and steam couscous a third time in same manner as above.",
            "While broth comes to a simmer, put couscous in a large wide bowl and toss with salt, then drizzle with 2 tablespoons oil, rubbing grains between your palms to distribute oil. Sprinkle couscous with 1 cup tepid water, rubbing to evenly distribute and breaking up any lumps. Sprinkle top portion of couscoussière (if using a colander or steamer, line with cheesecloth) with couscous in an even, loose layer without packing.",
            "Set couscous over simmering broth and steam, uncovered, until steam rises up evenly over surface of couscous, about 10 minutes. Transfer couscous to cleaned bowl (reserving cheesecloth if using).",
            "Let stand until cool enough to handle, then sprinkle with 1 cup water again and gently rub couscous between palms. Let couscous stand 10 minutes.",
            "While couscous stands, add carrots and turnips to broth in couscoussière and return to a simmer.",
            "Return couscous to top of couscoussière and steam a second time, uncovered, in same manner, until steam rises evenly over surface, then transfer to bowl again (reserving cheesecloth). Stir just enough water (1/2 to 3/4 cup) into couscous to make it come together when a squeezed handful holds its shape without cracking. Let couscous stand, uncovered, 10 minutes.",
            "While couscous stands, add zucchini, cabbage, and butternut squash to broth and cook, covered, until vegetables are almost tender, then add cooked chickpeas.",
            "Rub remaining 2 tablespoons oil into couscous, then transfer to top of couscoussière and steam couscous a third time in same manner as above.",
            "Fry almonds during third steaming: Heat oil in a 7- to 8-inch skillet over moderate heat until just hot and cook almonds, stirring occasionally, until golden, 1 to 2 minutes. Transfer with a slotted spoon to paper towels to drain.",
            "Heat oil in a 7- to 8-inch skillet over moderate heat until just hot and cook almonds, stirring occasionally, until golden, 1 to 2 minutes. Transfer with a slotted spoon to paper towels to drain.",
            "To serve: Gently stir 1/2 teaspoon harissa into broth and serve couscous with vegetables, broth, fried almonds, honeyed red-onion confit, and harissa.",
            "Gently stir 1/2 teaspoon harissa into broth and serve couscous with vegetables, broth, fried almonds, honeyed red-onion confit, and harissa."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d99a9f3a00aeb2f1cf602/6:4/w_274%2Ch_169/238425.jpg",
        "color": 3550992
    }
}