{
    "recipe": {
        "title": "Vegetarian Pho ",
        "ingredients": [
            "2 tablespoons good-quality vegetable oil",
            "1 large onion, halved and sliced",
            "1 head garlic, cloves separated but unpeeled",
            "1 2-inch piece fresh ginger, cut into coins",
            "Salt",
            "Pinch sugar",
            "3 or 4 star anise pods",
            "1 cinnamon stick",
            "2 bay leaves",
            "2 tablespoons black peppercorns",
            "6 cups vegetable stock",
            "1/4 cup soy sauce, plus more to taste",
            "1 tablespoon cider vinegar",
            "1 bunch fresh cilantro",
            "1/2 pound mushrooms (any kind), trimmed",
            "8 ounces thin rice vermicelli",
            "6 cups boiling water",
            "4 scallions, sliced, for garnish",
            "2 or 3 limes, cut into wedges, for garnish",
            "Additional toppings as you like (see the list that follows)",
            "2 tablespoons olive oil",
            "4 carrots, sliced",
            "4 celery stalks (plus any vegetable leaves), sliced",
            "2 onions, quartered (don't bother to peel!)",
            "2 baking potatoes, peeled and cut into chunks",
            "1 head garlic (separate the cloves but don't bother to peel)",
            "1 pound white button mushrooms, trimmed and halved or sliced",
            "Salt and pepper",
            "10–20 parsley sprigs",
            "2 bay leaves"
        ],
        "instructions": [
            "Put the oil in a large pot over medium heat. When it's hot, add the carrots, celery, onion, potatoes, garlic, and mushrooms. Sprinkle with salt and pepper, cover, and cook, undisturbed, until you hear the vegetables sizzle, 3 to 5 minutes. Uncover, stir once or twice, and cook, stirring only enough to prevent burning until the vegetables release their liquid and begin to brown, 15 to 20 minutes. (If you have more time, keep going another 15 to 20 minutes or until they're even darker.)",
            "Add 10 cups water, the parsley, and the bay leaves. Bring to a boil, then adjust the heat so the mixture bubbles steadily but gently. Cook until the vegetables are very tender, anywhere from 15 to 60 minutes depending how much time you can spare.",
            "Strain through a fine-mesh strainer. Taste and adjust the seasoning before using or cooling and storing.",
            "Pho Put the oil in a large pot over medium heat. When it’s hot, add the onion, garlic, and ginger. Sprinkle with some salt and the sugar and cook, stirring occasionally, until the vegetables soften, 3 to 5 minutes. Add the star anise, cinnamon, bay leaves, and peppercorns and stir until warm and fragrant, no more than a minute. Add the stock, soy sauce, vinegar, half the cilantro (save therest for garnish), mushrooms, and 1 cup water. Bring to a boil, then lower the heat so the stock bubbles gently. Cook, partially covered, until you are happy with the concentration of flavor, 30 to 60 minutes. Put the rice vermicelli in a large bowl, sprinkle with salt, and cover with the boiling water. Soak until the noodles are barely tender; start checking after 3 minutes. Drain the noodles, then rinse them and the bowl with cold water to cool down. Return the noodles to the bowl, add enough cold water to cover, and let sit until you’re ready to serve. Strain the broth through a fine-meshed strainer, return it to the pot, and keep at a gentle bubble. Taste and adjust the seasoning, adding more soy sauce if you’d like. (You can make the broth to this point, cool, and store it in the refrigerator for several days or the freezer for a few months. Return it to a boil and keep hot until time to serve.) Prepare any additional toppings from the list that follows (or whatever else you’d like) and put them in bowls or platters. Drain the noodles and divide them among big bowls; ladle some broth over the noodles. Garnish with the scallions, limes, and sprigs of the reserved cilantro. Top the soup with other additions as you like.",
            "Put the oil in a large pot over medium heat. When it’s hot, add the onion, garlic, and ginger. Sprinkle with some salt and the sugar and cook, stirring occasionally, until the vegetables soften, 3 to 5 minutes. Add the star anise, cinnamon, bay leaves, and peppercorns and stir until warm and fragrant, no more than a minute. Add the stock, soy sauce, vinegar, half the cilantro (save therest for garnish), mushrooms, and 1 cup water. Bring to a boil, then lower the heat so the stock bubbles gently. Cook, partially covered, until you are happy with the concentration of flavor, 30 to 60 minutes.",
            "Put the rice vermicelli in a large bowl, sprinkle with salt, and cover with the boiling water. Soak until the noodles are barely tender; start checking after 3 minutes. Drain the noodles, then rinse them and the bowl with cold water to cool down. Return the noodles to the bowl, add enough cold water to cover, and let sit until you’re ready to serve.",
            "Strain the broth through a fine-meshed strainer, return it to the pot, and keep at a gentle bubble. Taste and adjust the seasoning, adding more soy sauce if you’d like. (You can make the broth to this point, cool, and store it in the refrigerator for several days or the freezer for a few months. Return it to a boil and keep hot until time to serve.)",
            "Prepare any additional toppings from the list that follows (or whatever else you’d like) and put them in bowls or platters. Drain the noodles and divide them among big bowls; ladle some broth over the noodles. Garnish with the scallions, limes, and sprigs of the reserved cilantro. Top the soup with other additions as you like."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a4c0554ecf02957c2366a4b/6:4/w_274%2Ch_169/Vegetarian%20Pho.jpg",
        "color": 10404806
    }
}