{
    "recipe": {
        "title": "Vegetarian Three-Bean Chili ",
        "ingredients": [
            "2 tablespoons vegetable oil, plus more for frying (about 2 cups)",
            "3/4 cup mild or medium chunky corn and tomato salsa (not corn and black bean salsa, which usually has a puréed bean base)",
            "1 1/2 teaspoons ground cumin",
            "1 teaspoon chili powder",
            "1 teaspoon dried oregano",
            "1/2 teaspoon garlic powder",
            "1 (15-ounce) can black beans, rinsed, drained",
            "1 (15-ounce) can pinto beans, rinsed, drained",
            "1 (15-ounce) can red kidney beans, rinsed, drained",
            "1 (15-ounce) can puréed tomatoes or tomato sauce",
            "3 cups low-sodium vegetable broth",
            "3/4 teaspoon kosher salt, plus more",
            "1/4 teaspoon (or more) freshly ground black pepper",
            "2 (5–6\") corn tortillas, sliced into 1/4\"-wide strips",
            "Sliced pickled jalapeños (for serving; optional)",
            "A deep-fry thermometer"
        ],
        "instructions": [
            "Heat 2 Tbsp. oil in large heavy pot over medium-high. Cook salsa, cumin, chili powder, oregano, and garlic powder, stirring, until fragrant and slightly reduced, 1–2 minutes. Add black, pinto, and kidney beans, tomatoes, broth, 3/4 tsp. salt, and 1/4 tsp. pepper. Bring to a simmer, stirring occasionally. Reduce heat to medium and continue to simmer, stirring occasionally, until flavors are blended and chili is thickened, about 15 minutes. Taste and season with salt and pepper, if needed.",
            "Pour oil into a medium skillet to a depth of 1/2\". Heat over medium-high until thermometer registers 375°F. Working in 2 batches, fry tortilla strips, turning occasionally, until crisp and pale golden, about 2 minutes per batch. Using a slotted spoon, transfer strips to a paper towel-lined plate or rimmed baking sheet to drain; immediately season with salt.",
            "Ladle chili into bowls. Top with crispy tortilla strips and jalapeños, if using.",
            "Do Ahead Chili can be made 3 days ahead. Cover and chill.",
            "Chili can be made 3 days ahead. Cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a049a81f819553e017bd97f/6:4/w_274%2Ch_169/google-express-Bean-Chili-110317.jpg"
    }
}