{
    "recipe": {
        "title": "Venetian Crab Soup ",
        "ingredients": [
            "2 tablespoons canola oil",
            "1 small onion, chopped",
            "1 celery rib, chopped",
            "1 small fennel bulb, trimmed and chopped",
            "Shrimp shells from 2 pounds shrimp (reserve shrimp for another use)",
            "1 (28-ounce) can whole tomatoes in juice",
            "1 (1/2-inch) piece ginger, peeled and chopped",
            "1 large pinch saffron threads, crumbled",
            "1/4 teaspoon curry powder",
            "1/2 California bay leaf or 1 Turkish",
            "2 quart chicken stock or reduced-sodium chicken broth",
            "1 (8-ounce) Yukon Gold potato",
            "1 small celery root (celeriac)",
            "1 tablespoon unsalted butter",
            "1 pound jumbo lump crabmeat"
        ],
        "instructions": [
            "Heat oil in a wide 6-quart heavy pot over medium heat until it shimmers. Cook onion, celery, and fennel, stirring occasionally, until golden, 8 to 10 minutes. Add shrimp shells and cook, stirring occasionally, until shells turn pink. Stir in tomatoes with their juice. Simmer, breaking up tomatoes slightly with a wooden spoon, 3 minutes, then add ginger, saffron, curry powder, and bay leaf and simmer 5 minutes. Add chicken stock and boil uncovered 5 minutes. Reduce heat and simmer uncovered 45 minutes.",
            "Discard bay leaf, then purée soup (including shrimp shells) in batches in a blender until finely ground, about 2 minutes per batch (use caution when blending hot liquids). Strain soup through a fine-mesh sieve into a clean pot, discarding solids.",
            "Peel and dice potato. Peel and dice enough celery root to measure 1/2 cup. Add potato and celery root to soup and gently simmer uncovered until tender, about 10 minutes. Remove from heat and stir in butter and crabmeat. Season with salt and pepper."
        ],
        "picture_link": null,
        "color": 3914949
    }
}