{
    "recipe": {
        "title": "Vermicelli Noodles with Lemongrass Pork Meatballs ",
        "ingredients": [
            "2 stalks lemongrass",
            "2 pounds ground pork",
            "1 tablespoon fish sauce",
            "2 1/2 teaspoons kosher salt",
            "2 teaspoons sugar",
            "1/4 teaspoon white pepper",
            "1/4 cup fish sauce",
            "2 tablespoons sugar",
            "2 tablespoons lime juice or white vinegar",
            "1 clove garlic, peeled and minced",
            "1 Thai chile or half of a serrano chile, stemmed and minced",
            "2 cups canola oil",
            "4 shallots, peeled and thinly sliced",
            "1 pound rice vermicelli",
            "2 carrots, peeled and julienned",
            "1 small cucumber, peeled and thinly sliced",
            "Shredded lettuce",
            "Mint leaves",
            "Cilantro leaves",
            "Chopped peanuts"
        ],
        "instructions": [
            "Make the meatballs: Cut the bottom 1/2 inch off each lemongrass stalk and trim the woody top portion of each stalk and discard. Peel the outer layers of each stalk until you reach the tender center. Thinly slice the stalks into coins, then very finely mince. Transfer to a medium bowl and add the pork, fish sauce, salt, sugar, and white pepper and mix to combine. Roll into 1 1/2-inch meatballs and set on a rimmed baking sheet. The meatballs can be made beforehand; transfer to a lidded container or tightly wrap the baking sheet with plastic wrap. Refrigerate until ready to use but no longer than 24 hours.",
            "Cut the bottom 1/2 inch off each lemongrass stalk and trim the woody top portion of each stalk and discard. Peel the outer layers of each stalk until you reach the tender center. Thinly slice the stalks into coins, then very finely mince. Transfer to a medium bowl and add the pork, fish sauce, salt, sugar, and white pepper and mix to combine. Roll into 1 1/2-inch meatballs and set on a rimmed baking sheet. The meatballs can be made beforehand; transfer to a lidded container or tightly wrap the baking sheet with plastic wrap. Refrigerate until ready to use but no longer than 24 hours.",
            "Make the dressing: In a small jar with a lid, combine the fish sauce, sugar, lime juice, garlic, and minced chile. Put the lid on the jar and shake vigorously until the sugar has dissolved. Set aside (the dressing will keep, refrigerated, for up to a week, though it gets spicier as it sits).",
            "In a small jar with a lid, combine the fish sauce, sugar, lime juice, garlic, and minced chile. Put the lid on the jar and shake vigorously until the sugar has dissolved. Set aside (the dressing will keep, refrigerated, for up to a week, though it gets spicier as it sits).",
            "Make the fried shallots: Pour the oil into a medium heavy-bottomed saucepan over medium heat and add the sliced shallots to the cold oil. Line a plate with paper towels and set it nearby. As the oil heats, the shallots will begin to sizzle and bubble; fry, stirring frequently for even cooking, until the shallots begin to brown, about 6 to 8 minutes. Continue cooking, stirring constantly, until they are an even golden brown and crisp (at this stage, they can go from nicely browned to acrid and overcooked very quickly, so be vigilant). Use a spider or slotted spoon to transfer the shallots to the paper-towel- lined plate. Let the oil cool, then pour through a fine- mesh sieve into a clean jar. (Do not discard the oil; it’s liquid gold, great for another batch of fried shallots or to add flavor to dressings and sautéed vegetables, and you can also use it to make a batch of aioli.) The fried shallots can be made in advance. Let cool, then store in an airtight container at room temperature. Resist snacking on them; they'll keep for about a week. Bring a large pot of water to a boil. When the water is boiling add the vermicelli noodles and cook according to package instructions until tender. Drain, rinse with cold water, and transfer to a rimmed baking sheet. Drizzle with a tablespoon of the shallot oil (it’s fine if it’s still warm) and toss to coat. Preheat the broiler to high. Transfer the baking sheet of meatballs to the oven, positioning it a few inches from the heating element. Broil the meatballs until browned, about 3 minutes, then roll the meatballs to the second side and broil for 3 minutes longer. Transfer to a bowl. To serve, arrange the vermicelli on a platter and surround with carrots, cucumber slices, lettuce, mint, and cilantro leaves. Serve the meatballs, dressing, fried shallots, and chopped peanuts alongside. Let the diners dig in, serving themselves some of the noodles, carrots, and cucumbers, garnished with herbs, shallots, and peanuts. Spoon dressing over each serving and top with a few meatballs.",
            "Pour the oil into a medium heavy-bottomed saucepan over medium heat and add the sliced shallots to the cold oil. Line a plate with paper towels and set it nearby. As the oil heats, the shallots will begin to sizzle and bubble; fry, stirring frequently for even cooking, until the shallots begin to brown, about 6 to 8 minutes. Continue cooking, stirring constantly, until they are an even golden brown and crisp (at this stage, they can go from nicely browned to acrid and overcooked very quickly, so be vigilant). Use a spider or slotted spoon to transfer the shallots to the paper-towel- lined plate. Let the oil cool, then pour through a fine- mesh sieve into a clean jar. (Do not discard the oil; it’s liquid gold, great for another batch of fried shallots or to add flavor to dressings and sautéed vegetables, and you can also use it to make a batch of aioli.) The fried shallots can be made in advance. Let cool, then store in an airtight container at room temperature. Resist snacking on them; they'll keep for about a week.",
            "Bring a large pot of water to a boil. When the water is boiling add the vermicelli noodles and cook according to package instructions until tender. Drain, rinse with cold water, and transfer to a rimmed baking sheet. Drizzle with a tablespoon of the shallot oil (it’s fine if it’s still warm) and toss to coat.",
            "Preheat the broiler to high. Transfer the baking sheet of meatballs to the oven, positioning it a few inches from the heating element. Broil the meatballs until browned, about 3 minutes, then roll the meatballs to the second side and broil for 3 minutes longer. Transfer to a bowl.",
            "To serve, arrange the vermicelli on a platter and surround with carrots, cucumber slices, lettuce, mint, and cilantro leaves. Serve the meatballs, dressing, fried shallots, and chopped peanuts alongside. Let the diners dig in, serving themselves some of the noodles, carrots, and cucumbers, garnished with herbs, shallots, and peanuts. Spoon dressing over each serving and top with a few meatballs."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5af0a0f8d0e87c226f24859f/6:4/w_274%2Ch_169/vermicelli-noodles-with-lemongrass-meatballs-recipe-050718.jpg"
    }
}