{
    "recipe": {
        "title": "Very Classic Dry-Brined Roast Turkey ",
        "ingredients": [
            "3/4 cup Diamond Crystal or 7 tablespoons Morton kosher salt",
            "3 tablespoons light brown sugar",
            "1 (12–14-pound) turkey, neck and giblets removed, patted dry",
            "2 sprigs rosemary",
            "2 garlic cloves, crushed",
            "1/2 cup (1 stick) unsalted butter",
            "2 teaspoons soy sauce"
        ],
        "instructions": [
            "Place salt and brown sugar in a medium bowl and work together with your fingers to incorporate. Place turkey on a flat or V-shape roasting rack set inside a large roasting pan. Pack dry brine all over turkey, inside and out, nudging some into areas where the skin naturally separates from the bird, such as around the neck and top of the breast and between the legs and breast. Chill, uncovered, at least 12 hours and up to 2 days. Place oven rack in lower third of oven; preheat to 425°F. Rinse turkey and pat dry. Rinse roasting pan and rack if needed. Place turkey, breast side up, on rack in roasting pan and pour 1 cup water into pan. This will prevent drippings from burning. Roast turkey, rotating pan back to front halfway through and adding more water by 1/2-cupfuls as needed to maintain some liquid in the pan, until skin is browned all over, 35–45 minutes. Meanwhile, cook rosemary, garlic, butter, and soy sauce in a small saucepan over medium heat until bubbling and fragrant, about 5 minutes; keep warm. Reduce oven temperature to 350°F and continue to roast turkey, basting with butter mixture every 10–15 minutes and rotating pan every 30 minutes or so if bird is browning unevenly, until an instant-read thermometer inserted into the thickest part of breast registers 150°F (temperature will continue to climb as the bird rests), 40–70 minutes longer. Transfer turkey to a cutting board and let rest at least 30 minutes and up to 1 hour before carving.",
            "Place salt and brown sugar in a medium bowl and work together with your fingers to incorporate. Place turkey on a flat or V-shape roasting rack set inside a large roasting pan. Pack dry brine all over turkey, inside and out, nudging some into areas where the skin naturally separates from the bird, such as around the neck and top of the breast and between the legs and breast. Chill, uncovered, at least 12 hours and up to 2 days.",
            "Place oven rack in lower third of oven; preheat to 425°F. Rinse turkey and pat dry. Rinse roasting pan and rack if needed. Place turkey, breast side up, on rack in roasting pan and pour 1 cup water into pan. This will prevent drippings from burning. Roast turkey, rotating pan back to front halfway through and adding more water by 1/2-cupfuls as needed to maintain some liquid in the pan, until skin is browned all over, 35–45 minutes.",
            "Meanwhile, cook rosemary, garlic, butter, and soy sauce in a small saucepan over medium heat until bubbling and fragrant, about 5 minutes; keep warm.",
            "Reduce oven temperature to 350°F and continue to roast turkey, basting with butter mixture every 10–15 minutes and rotating pan every 30 minutes or so if bird is browning unevenly, until an instant-read thermometer inserted into the thickest part of breast registers 150°F (temperature will continue to climb as the bird rests), 40–70 minutes longer. Transfer turkey to a cutting board and let rest at least 30 minutes and up to 1 hour before carving."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5a05db120d874930000cee77/6:4/w_274%2Ch_169/very-classic-dry-brined-roast-turkey-recipe-BA-111017.jpg"
    }
}