{
    "recipe": {
        "title": "Vietnamese Pork Chops with Pickled Watermelon ",
        "ingredients": [
            "2 small shallots, thinly sliced into rings",
            "1/4 cup reduced-sodium soy sauce",
            "2 tablespoons fish sauce (such as nam pla or nuoc nam)",
            "2 tablespoons sugar",
            "1/2 teaspoon Sriracha",
            "4 1\"-thick bone-in pork chops (about 2 1/2 pounds total)",
            "6 tablespoons vegetable oil, divided",
            "4 small shallots, thinly sliced",
            "Kosher salt",
            "1 tablespoon unseasoned rice vinegar",
            "1 teaspoon reduced-sodium soy sauce",
            "1/4 teaspoon sugar",
            "Freshly ground black pepper",
            "4 cups trimmed purslane or arugula",
            "1/2 pound seedless watermelon, rind removed, cut into pieces, thinly sliced",
            "1/2 cup Pickled Watermelon Rind , thinly sliced"
        ],
        "instructions": [
            "Pork Chops: Whisk shallots, soy sauce, fish sauce, sugar, and Sriracha in a shallow baking dish. Add pork chops and turn to coat. Cover and chill, turning occasionally, at least 1 hour. Prepare grill for medium-high heat. Remove pork chops from marinade, scraping off excess, and grill until cooked through, about 3 minutes per side. Do ahead: Pork chops can be marinated 12 hours ahead. Keep chilled.",
            "Whisk shallots, soy sauce, fish sauce, sugar, and Sriracha in a shallow baking dish. Add pork chops and turn to coat. Cover and chill, turning occasionally, at least 1 hour.",
            "Prepare grill for medium-high heat.",
            "Remove pork chops from marinade, scraping off excess, and grill until cooked through, about 3 minutes per side.",
            "Do ahead: Pork chops can be marinated 12 hours ahead. Keep chilled.",
            "Salad: Heat 4 tablespoons oil in a small saucepan over medium heat. Add shallots and cook, stirring occasionally, until golden brown and crisp, about 4 minutes. Transfer to paper towels to drain; season with salt. Whisk vinegar, soy sauce, sugar, and remaining 2 tablespoons oil in a large bowl; season with salt and pepper. Add purslane, watermelon, and Pickled Watermelon Rind; season with salt and pepper and toss gently to coat. Serve pork chops with watermelon salad topped with fried shallots.",
            "Heat 4 tablespoons oil in a small saucepan over medium heat. Add shallots and cook, stirring occasionally, until golden brown and crisp, about 4 minutes. Transfer to paper towels to drain; season with salt.",
            "Whisk vinegar, soy sauce, sugar, and remaining 2 tablespoons oil in a large bowl; season with salt and pepper. Add purslane, watermelon, and Pickled Watermelon Rind; season with salt and pepper and toss gently to coat.",
            "Serve pork chops with watermelon salad topped with fried shallots."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5783cc76437061851e8aad88/6:4/w_274%2Ch_169/vietnamese-pork-chops-watermelon-070112016.jpg"
    }
}