{
    "recipe": {
        "title": "Vietnamese Chicken Sandwich (Banh Mi) ",
        "ingredients": [
            "1/2 pound daikon, peeled",
            "1 carrot, peeled",
            "1/2 cup rice vinegar (not seasoned)",
            "1 tablespoon sugar",
            "1 (24-inch) soft baguette",
            "2 tablespoons vegetable oil",
            "1 tablespoon Asian fish sauce",
            "1/2 teaspoon soy sauce",
            "1/4 pound liverwurst",
            "2 fresh jalapeños, thinly sliced",
            "1/2 sweet onion, cut into 1/4-inch rings",
            "3/4 cup packed cilantro sprigs",
            "2 cooked chicken breasts from a rotisserie chicken, thinly sliced",
            "Lettuce leaves",
            "2 tablespoons mayonnaise"
        ],
        "instructions": [
            "Preheat oven to 350°F with rack in middle. Shred daikon and carrot in a food processor fitted with medium shredding disk. Stir together vinegar, sugar, and 1/2 teaspoon salt and toss with shredded vegetables. Let slaw stand, stirring occasionally, 15 minutes. Meanwhile, heat baguette on rack in oven until crusty, about 5 minutes. Cut off and discard round ends, then split baguette. Mix together oil, fish sauce, and soy sauce and brush on cut sides of bread. Spread liverwurst on bottom layer of bread and top with chiles, onion, and cilantro. Drain slaw in a colander. Arrange chicken, slaw, and lettuce on cilantro. Spread top layer of bread with mayonnaise and cut sandwich crosswise into fourths.",
            "Preheat oven to 350°F with rack in middle.",
            "Shred daikon and carrot in a food processor fitted with medium shredding disk. Stir together vinegar, sugar, and 1/2 teaspoon salt and toss with shredded vegetables. Let slaw stand, stirring occasionally, 15 minutes.",
            "Meanwhile, heat baguette on rack in oven until crusty, about 5 minutes. Cut off and discard round ends, then split baguette.",
            "Mix together oil, fish sauce, and soy sauce and brush on cut sides of bread. Spread liverwurst on bottom layer of bread and top with chiles, onion, and cilantro.",
            "Drain slaw in a colander.",
            "Arrange chicken, slaw, and lettuce on cilantro. Spread top layer of bread with mayonnaise and cut sandwich crosswise into fourths."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d77e6f9a841923089d53a/6:4/w_274%2Ch_169/241475_hires.jpg"
    }
}