{
    "recipe": {
        "title": "Vietnamese Duck Soup ",
        "ingredients": [
            "6 duck leg-thigh pieces",
            "16 cups low-salt chicken broth",
            "1 large onion, peeled, halved",
            "6 tablespoons finely chopped peeled fresh ginger",
            "2 tablespoons (or more) fish sauce (such as nam pla or nuoc nam)*",
            "1 tablespoon sugar",
            "1 6.75-ounce package rice vermicelli",
            "3 cups sliced shallots (about 10 large)",
            "2 1/4 pounds plum tomatoes, chopped",
            "3 8-ounce cans sliced bamboo shoots, drained",
            "6 cups thinly sliced Napa cabbage",
            "1/3 cup chopped fresh mint",
            "1/3 cup chopped fresh cilantro",
            "1/3 cup chopped fresh chives",
            "Hot chili sauce (such as sriracha)*",
            "Lime wedges"
        ],
        "instructions": [
            "For soup: Heat heavy large pot over high heat. Sprinkle duck with salt and pepper. Add to pot; sauté until deep brown, about 6 minutes per side. Add broth, onion, ginger, 2 tablespoons fish sauce, and sugar; bring to boil. Reduce heat; simmer uncovered until duck is very tender, adjusting heat to maintain simmer, 45 to 60 minutes. Using tongs, transfer duck to rimmed baking sheet. Cool 30 minutes. Skin and bone duck. Coarsely shred duck meat. Strain broth into large bowl; discard solids. Spoon fat from top of broth into small bowl; reserve. Return broth and duck to same pot. DO AHEAD: Can be made 1 day ahead. Chill soup uncovered until cold, then cover and keep chilled. Cover and chill duck fat.",
            "Heat heavy large pot over high heat. Sprinkle duck with salt and pepper. Add to pot; sauté until deep brown, about 6 minutes per side. Add broth, onion, ginger, 2 tablespoons fish sauce, and sugar; bring to boil. Reduce heat; simmer uncovered until duck is very tender, adjusting heat to maintain simmer, 45 to 60 minutes. Using tongs, transfer duck to rimmed baking sheet. Cool 30 minutes. Skin and bone duck. Coarsely shred duck meat. Strain broth into large bowl; discard solids. Spoon fat from top of broth into small bowl; reserve. Return broth and duck to same pot. DO AHEAD: Can be made 1 day ahead. Chill soup uncovered until cold, then cover and keep chilled. Cover and chill duck fat.",
            "For garnishes: Cook rice vermicelli in large saucepan of boiling water until just tender, stirring occasionally, 3 to 5 minutes. Drain, rinse with cold water, and drain again. Cut noodles in half to shorten. Melt 2 tablespoons reserved duck fat in same saucepan over medium-high heat. Add shallots; sauté 3 minutes. Add tomatoes and bamboo shoots. Cook until juices thicken, about 7 minutes longer. Add tomato mixture to soup. Simmer until flavors blend, 5 to 10 minutes. Season with salt, pepper, and more fish sauce if desired. Divide noodles, cabbage, and herbs among 6 large bowls. Ladle in soup. Serve, passing hot sauce and lime wedges.",
            "Cook rice vermicelli in large saucepan of boiling water until just tender, stirring occasionally, 3 to 5 minutes. Drain, rinse with cold water, and drain again. Cut noodles in half to shorten.",
            "Melt 2 tablespoons reserved duck fat in same saucepan over medium-high heat. Add shallots; sauté 3 minutes. Add tomatoes and bamboo shoots. Cook until juices thicken, about 7 minutes longer. Add tomato mixture to soup. Simmer until flavors blend, 5 to 10 minutes. Season with salt, pepper, and more fish sauce if desired.",
            "Divide noodles, cabbage, and herbs among 6 large bowls. Ladle in soup. Serve, passing hot sauce and lime wedges.",
            "A vailable in the Asian foods section of many supermarkets, at some specialty foods stores, and at Asian markets.",
            "A vailable in the Asian foods section of many supermarkets, at some specialty foods stores, and at Asian markets.",
            "A vailable in the Asian foods section of many supermarkets, at some specialty foods stores, and at Asian markets."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57ea88a9cf9338f824b78b43/6:4/w_274%2Ch_169/vietnamese-duck-soup.jpg"
    }
}