{
    "recipe": {
        "title": "Walnut and Herb-Stuffed Salmon with Spicy Tahini Sauce ",
        "ingredients": [
            "Two 1 lb salmon fillets, skin on, center-cut and trimmed to be the same size",
            "1 tsp cinnamon",
            "1/2 cup walnuts, toasted",
            "4 cloves garlic, minced",
            "1/2 cup fresh cilantro, chopped coarsely",
            "1/2 cup flat-leaf parsley, chopped coarsely",
            "Juice of 1/2 lemon",
            "Zest of 1 lemon",
            "4 hot red chilies, seeded and chopped",
            "1 tsp paprika",
            "1 tsp cumin",
            "1/4 cup extra virgin olive oil",
            "Salt and pepper",
            "Kitchen twine"
        ],
        "instructions": [
            "Preheat the oven to 375°F. Prepare the salmon fillets by trimming the extra thin belly part. Use tweezers to pull out any bones. Blot dry and sprinkle half of the cinnamon on the meat side of each fillet and set aside to make the filling.",
            "In a food processor, place the walnuts, garlic, cilantro, parsley, lemon juice and zest, chilies, paprika, cumin, cinnamon, olive oil, salt and pepper. Pulse a couple of times until all the ingredients are chopped. Don't overprocess—try to keep a slightly coarse texture.",
            "Place one fillet skin side down on a working surface and place enough of the spicy walnut filling to fully coat the fish. Cover with the other fillet skin side up. Using the kitchen twine, gently tie up the fish to ensure the filling stays in place. Drizzle olive oil in the baking dish and put in the prepared fillet, drizzling a little more oil on top. Season with salt and pepper. Bake for about 20-25 minutes until done. Serve with tabbouleh and spicy tahini sauce on the side to drizzle over the cooked fish."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54bac22be231becc7f3d2b8b/6:4/w_274%2Ch_169/walnut-herb-stuffed-salmon-spicy-tahini-6x4.jpg"
    }
}