{
    "recipe": {
        "title": "Warm Chocolate Tarts with Pink Peppercorn Ice Cream ",
        "ingredients": [
            "1/3 cup sliced almonds (about 1 1/4 ounces)",
            "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
            "3/4 cup powdered sugar",
            "1 large egg",
            "2 1/4 cups all purpose flour",
            "3/4 teaspoon salt",
            "6 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
            "6 tablespoons (3/4 stick) unsalted butter",
            "4 large eggs",
            "1/2 cup sugar",
            "2 1/2 tablespoons all purpose flour",
            "Pink Peppercorn Ice Cream"
        ],
        "instructions": [
            "For crust: Using on/off turns, finely grind almonds in processor. Transfer ground almonds to small bowl. Add butter and sugar to processor; blend until smooth. Blend in egg. Add ground almonds, flour, and salt; using on/off turns, process just to blend. Gather dough into ball and flatten into disk. Wrap dough in plastic and refrigerate overnight. (Can be made 2 days ahead. Keep refrigerated.) Roll out dough on lightly floured surface to 1/4-inch thickness. Using 5-inch-diameter plate or bowl as guide, cut out rounds. Gather dough scraps and repeat to form 8 rounds total. Press each dough round over bottom and up sides of 4 1/4- to 4 1/2-inch-diameter by 3/4-inch-high tartlet pan with removable bottom. Refrigerate 30 minutes. Preheat oven to 375°F. Arrange tartlet pans on large rimmed baking sheet. Bake crusts until golden brown around edges, pressing with back of fork if crusts bubble, about 20 minutes. Cool crusts 10 minutes.",
            "Using on/off turns, finely grind almonds in processor. Transfer ground almonds to small bowl. Add butter and sugar to processor; blend until smooth. Blend in egg. Add ground almonds, flour, and salt; using on/off turns, process just to blend. Gather dough into ball and flatten into disk. Wrap dough in plastic and refrigerate overnight. (Can be made 2 days ahead. Keep refrigerated.)",
            "Roll out dough on lightly floured surface to 1/4-inch thickness. Using 5-inch-diameter plate or bowl as guide, cut out rounds. Gather dough scraps and repeat to form 8 rounds total. Press each dough round over bottom and up sides of 4 1/4- to 4 1/2-inch-diameter by 3/4-inch-high tartlet pan with removable bottom. Refrigerate 30 minutes.",
            "Preheat oven to 375°F. Arrange tartlet pans on large rimmed baking sheet. Bake crusts until golden brown around edges, pressing with back of fork if crusts bubble, about 20 minutes. Cool crusts 10 minutes.",
            "For filling: Preheat oven to 350°F. Stir chocolate and butter in double boiler over barely simmering water until melted and smooth; cool slightly. Beat eggs and sugar in large bowl to blend. Fold chocolate mixture into egg mixture. Fold in flour. Divide filling among crusts. Bake tarts on baking sheet until filling is puffed and set, about 13 minutes. Cool slightly. Remove tartlet pan sides. (Can be made 1 day ahead. Cool completely in pans. Cover tarts with foil. Let stand at room temperature. Rewarm on sheet in 350°F oven 5 minutes.)",
            "Preheat oven to 350°F. Stir chocolate and butter in double boiler over barely simmering water until melted and smooth; cool slightly. Beat eggs and sugar in large bowl to blend. Fold chocolate mixture into egg mixture. Fold in flour.",
            "Divide filling among crusts. Bake tarts on baking sheet until filling is puffed and set, about 13 minutes. Cool slightly. Remove tartlet pan sides. (Can be made 1 day ahead. Cool completely in pans. Cover tarts with foil. Let stand at room temperature. Rewarm on sheet in 350°F oven 5 minutes.)",
            "Serve tarts warm with Pink Peppercorn Ice Cream.",
            "Serve tarts warm with Pink Peppercorn Ice Cream."
        ],
        "picture_link": null
    }
}