{
    "recipe": {
        "title": "Warm Apple Cobbler ",
        "ingredients": [
            "4 medium granny smith apples, peeled, cored, cut into 1/2-inch-thick slices (about 5 1/2 cups)",
            "3 large fuji apples, peeled, cored, cut into 1/2-inch-thick slices (about 4 cups)",
            "1 tablespoon fresh lemon juice",
            "1 teaspoon finely grated lemon peel",
            "1 teaspoon vanilla extract",
            "1/3 cup (packed) golden brown sugar",
            "2 tablespoons all purpose flour",
            "1/4 teaspoon ground cinnamon",
            "6 tablespoons (3/4 stick) unsalted butter, melted, cooled slightly",
            "3 tablespoons white miso",
            "2 large eggs",
            "2 cups all purpose flour",
            "1 1/3 cups sugar",
            "1 teaspoon baking powder",
            "1/2 teaspoon ground cinnamon",
            "1/4 teaspoon ground ginger",
            "Vanilla ice cream"
        ],
        "instructions": [
            "Preheat oven to 350°F. Butter 13 x 9 x 2-inch glass baking dish. Toss first 5 ingredients in large bowl. Add sugar, flour, and cinnamon; toss to combine. Transfer to baking dish.",
            "For streusel: Whisk butter, miso, and eggs in medium bowl until smooth. Combine flour, sugar, baking powder, cinnamon, and ginger in large bowl. Form well in center of flour mixture and add butter mixture. Using rubber spatula, toss until large clumps form. Using fingertips, break up streusel clumps into smaller pieces and sprinkle streusel topping over apples. Bake until apple mixture is bubbling and streusel is golden brown, 50 to 55 minutes. Cool slightly. Serve cobbler slightly warm topped with vanilla ice cream.",
            "Whisk butter, miso, and eggs in medium bowl until smooth. Combine flour, sugar, baking powder, cinnamon, and ginger in large bowl. Form well in center of flour mixture and add butter mixture. Using rubber spatula, toss until large clumps form.",
            "Using fingertips, break up streusel clumps into smaller pieces and sprinkle streusel topping over apples. Bake until apple mixture is bubbling and streusel is golden brown, 50 to 55 minutes. Cool slightly. Serve cobbler slightly warm topped with vanilla ice cream."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b427142413537c0d45d62d/6:4/w_274%2Ch_169/362930_warm-apple-cobbler_1x1.jpg"
    }
}