{
    "recipe": {
        "title": "Warm Asparagus and Prosciutto Salad ",
        "ingredients": [
            "3 ounces thinly sliced prosciutto",
            "1 1/4 pounds asparagus, trimmed",
            "3 tablespoons plus 1/2 cup olive oil",
            "2 anchovy fillets, chopped",
            "3 garlic cloves, thinly sliced",
            "1/3 cup fresh lemon juice",
            "1 5-ounce package mixed baby greens (about 10 cups)",
            "Farinata Wedges"
        ],
        "instructions": [
            "Preheat oven to 350°F. Line baking sheet with parchment paper. Place prosciutto slices in single layer on parchment. Bake until crisp, about 18 minutes. Cool. Break prosciutto into bite-size pieces. Meanwhile, cook asparagus in heavy large pot of boiling salted water until crisp-tender, about 4 minutes. Drain. Transfer asparagus to bowl filled with ice water to cool. Drain thoroughly. Heat 3 tablespoons olive oil in large nonstick skillet over medium heat. Add chopped anchovies and garlic and sauté until garlic is golden, about 1 minute. Add asparagus and prosciutto and sauté until heated through, about 3 minutes. Add fresh lemon juice and remaining 1/2 cup olive oil and simmer 1 minute. Remove from heat. Season to taste with salt and pepper. Divide greens among 6 plates. Top with asparagus mixture, dividing equally. Pour dressing from skillet over each serving. Serve warm with Farinata Wedges.",
            "Preheat oven to 350°F. Line baking sheet with parchment paper. Place prosciutto slices in single layer on parchment. Bake until crisp, about 18 minutes. Cool. Break prosciutto into bite-size pieces.",
            "Meanwhile, cook asparagus in heavy large pot of boiling salted water until crisp-tender, about 4 minutes.",
            "Drain. Transfer asparagus to bowl filled with ice water to cool. Drain thoroughly.",
            "Heat 3 tablespoons olive oil in large nonstick skillet over medium heat. Add chopped anchovies and garlic and sauté until garlic is golden, about 1 minute. Add asparagus and prosciutto and sauté until heated through, about 3 minutes. Add fresh lemon juice and remaining 1/2 cup olive oil and simmer 1 minute. Remove from heat. Season to taste with salt and pepper. Divide greens among 6 plates. Top with asparagus mixture, dividing equally. Pour dressing from skillet over each serving. Serve warm with Farinata Wedges."
        ],
        "picture_link": null
    }
}