{
    "recipe": {
        "title": "Warm Chicken Salad with Asparagus and Creamy Dill Dressing ",
        "ingredients": [
            "Kosher salt",
            "1 pound baby new potatoes",
            "1 (2 1/2-pound) rotisserie chicken",
            "1/3 cup mayonnaise",
            "1/4 cup finely chopped dill",
            "3 tablespoons lemon juice",
            "2 tablespoons Dijon mustard",
            "1/2 teaspoon freshly ground black pepper",
            "1 pound asparagus (about 1 bunch), trimmed",
            "2 cups watercress or baby arugula",
            "1/2 cup mint leaves",
            "Lemon wedges (for serving)"
        ],
        "instructions": [
            "Set a steamer basket in a large pot filled with about 1\" salted water. Cover pot and bring water to a boil. Add potatoes, cover, and steam until just tender, about 10 minutes. Meanwhile, cut breast meat from chicken, remove and discard skin, and slice on the bias into 1/2\" slices. Remove legs from carcass, remove and discard skin, and slice meat off bones into 1/2\" slices. Whisk mayonnaise, dill, lemon juice, mustard, pepper, and 1/4 tsp. salt in a medium bowl. Add asparagus and chicken slices to potatoes in steamer, cover, and steam until asparagus is crisp-tender and chicken is warmed through, about 3 minutes. Transfer potatoes, asparagus, and chicken to a platter or plates and drizzle with dressing. Top with watercress and mint and serve with lemon wedges alongside.",
            "Set a steamer basket in a large pot filled with about 1\" salted water. Cover pot and bring water to a boil. Add potatoes, cover, and steam until just tender, about 10 minutes.",
            "Meanwhile, cut breast meat from chicken, remove and discard skin, and slice on the bias into 1/2\" slices. Remove legs from carcass, remove and discard skin, and slice meat off bones into 1/2\" slices.",
            "Whisk mayonnaise, dill, lemon juice, mustard, pepper, and 1/4 tsp. salt in a medium bowl.",
            "Add asparagus and chicken slices to potatoes in steamer, cover, and steam until asparagus is crisp-tender and chicken is warmed through, about 3 minutes. Transfer potatoes, asparagus, and chicken to a platter or plates and drizzle with dressing. Top with watercress and mint and serve with lemon wedges alongside."
        ],
        "picture_link": "https://assets.epicurious.com/photos/58e5292f227e417196e6d0d0/6:4/w_274%2Ch_169/Warm-Chicken-Salad-With-Asparagus-Potatoes-and-Creamy-Dill-Dressing-05042017-3.jpg"
    }
}