{
    "recipe": {
        "title": "Weeknight Steak and Rice Noodle Salad ",
        "ingredients": [
            "3 small serrano chiles",
            "1 small garlic clove",
            "Kosher salt",
            "1/4 cup plus 2 Tbsp. fresh lime juice",
            "3 Tbsp. fish sauce",
            "3 Tbsp. honey",
            "2 Tbsp. vegetable oil, divided",
            "8 oz. skirt steak",
            "6 oz. wide rice noodles",
            "1/2 small head of Napa cabbage, coarsely chopped",
            "2 small Persian cucumbers, thinly sliced",
            "1 (6\") piece daikon, peeled, halved, thinly sliced",
            "1/2 cup finely chopped mint, plus leaves for serving",
            "1/2 cup chopped salted, dry-roasted peanuts, plus more for serving"
        ],
        "instructions": [
            "Remove seeds from 2 chiles, then finely chop with remaining chile. Thinly slice garlic. Sprinkle a pinch of kosher salt over chiles and garlic. Smash chiles and garlic with the flat side of a chef’s knife, alternating chopping and mashing, until a coarse paste forms. Transfer mixture to a large bowl and add lime juice, fish sauce, honey, and 1 Tbsp. oil. Stir vigorously to dissolve honey. This is your dressing. Place steak in a medium bowl. Drizzle 3 Tbsp. dressing over, holding back chiles with a spoon; set remaining dressing aside. Let steak sit, turning occasionally, at least 10 minutes and up to 1 hour. Meanwhile, bring a medium pot of salted water to a boil. Remove from heat, add noodles, and cover pot. Let sit, stirring every minute or so to keep noodles from sticking, until al dente, 5–8 minutes. Drain and rinse under cold running water; set aside. Using your hands, toss cabbage, cucumbers, and daikon in a large bowl; season lightly with kosher salt. Massage vegetables with your hands to release excess water, then pour off any liquid that has collected in the bottom of the bowl. Pat steak dry and season lightly with kosher salt. Heat remaining 1 Tbsp. oil in a large nonstick skillet over medium-high. Cook steak until browned, about 4 minutes per side for medium-rare. Transfer steak to a cutting board and let rest 5 minutes. Thinly slice. Add steak, cabbage mixture, reserved noodles, 1/2 cup mint, and 1/2 cup peanuts to bowl with reserved dressing and toss well; season with more kosher salt if needed. Divide among bowls. Sprinkle with sea salt; top with mint leaves and more peanuts.",
            "Remove seeds from 2 chiles, then finely chop with remaining chile. Thinly slice garlic. Sprinkle a pinch of kosher salt over chiles and garlic. Smash chiles and garlic with the flat side of a chef’s knife, alternating chopping and mashing, until a coarse paste forms. Transfer mixture to a large bowl and add lime juice, fish sauce, honey, and 1 Tbsp. oil. Stir vigorously to dissolve honey. This is your dressing.",
            "Place steak in a medium bowl. Drizzle 3 Tbsp. dressing over, holding back chiles with a spoon; set remaining dressing aside. Let steak sit, turning occasionally, at least 10 minutes and up to 1 hour.",
            "Meanwhile, bring a medium pot of salted water to a boil. Remove from heat, add noodles, and cover pot. Let sit, stirring every minute or so to keep noodles from sticking, until al dente, 5–8 minutes. Drain and rinse under cold running water; set aside.",
            "Using your hands, toss cabbage, cucumbers, and daikon in a large bowl; season lightly with kosher salt. Massage vegetables with your hands to release excess water, then pour off any liquid that has collected in the bottom of the bowl.",
            "Pat steak dry and season lightly with kosher salt. Heat remaining 1 Tbsp. oil in a large nonstick skillet over medium-high. Cook steak until browned, about 4 minutes per side for medium-rare. Transfer steak to a cutting board and let rest 5 minutes. Thinly slice.",
            "Add steak, cabbage mixture, reserved noodles, 1/2 cup mint, and 1/2 cup peanuts to bowl with reserved dressing and toss well; season with more kosher salt if needed. Divide among bowls. Sprinkle with sea salt; top with mint leaves and more peanuts."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5cb9dec2d279ef2e84adfa5a/6:4/w_274%2Ch_169/weeknight-steak-and-rice-noolde-salad-recipe-BA-040819.jpg"
    }
}