{
    "recipe": {
        "title": "Whiskeyed Peach Shortcakes ",
        "ingredients": [
            "2 1/2 cups unbleached all-purpose flour",
            "1 tablespoon baking powder",
            "1/3 cup granulated sugar",
            "1 teaspoon fine sea salt",
            "3/4 cup (1 1/2 sticks) cold unsalted butter, cut into 1-inch pieces",
            "3/4 cup half-and-half, plus more as needed",
            "2 egg yolks",
            "1 whole egg plus 1 tablespoon water, whisked together to make an egg wash",
            "1/4 cup turbinado sugar",
            "1/4 cup heavy cream, plus more if needed",
            "3 tablespoons granulated sugar",
            "1 cup Crème Fraîche",
            "1/4 cup heavy cream, plus more if needed",
            "3 tablespoons granulated sugar",
            "1 cup Crème Fraîche (above)",
            "2 tablespoons unsalted butter",
            "4 firm-ripe (slightly hard) peaches, peeled and cut into 1-inch pieces",
            "Juice of 1 lemon",
            "1/2 cup whiskey or bourbon",
            "1/2 cup sugar",
            "1/2 teaspoon kosher salt",
            "1 vanilla bean, split, or 1/2 teaspoon vanilla extract"
        ],
        "instructions": [
            "For the shortcakes: Heat the oven to 475°F. In a mixing bowl, combine the flour, baking powder, granulated sugar, and salt. Add the butter to the dry ingredients and work the mixture between your thumbs and fingers to stretch the butter into flat pieces. Leave a few larger chunks of cold butter in the flour mixture. Start by adding 3/4 cup half- and-half, and stir it into the flour mixture with a large spoon. If the mixture is too dry, add a little more half-and-half until it holds together. Do not overmix. Turn the dough out onto a lightly floured surface, and gently knead—just two to three turns—and form into a ball. Pat the dough ball down to create a flat surface. With a lightly floured rolling pin, roll the dough out to 1 inch thick. With the tines of a fork dipped in dry flour, pierce the dough about every inch, making sure to pierce through to the bottom of the dough, to create holes for steam to escape. Using a pastry brush, lightly coat the surface of the rolled-out dough with the egg wash, then sprinkle the turbinado sugar across the top evenly. Using a 3-inch biscuit cutter, cut out the shortcakes with a deliberate vertical push and then gently remove from the cutter. Place shortcakes side by side on a parchment-lined baking sheet, with edges touching. Use scraps of dough to fill in any large gaps between shortcakes; this helps the cakes hold their shape. Bake until the cakes are golden brown and spring back when lightly touched, 10 to 12 minutes. Let cool 5 minutes, then transfer to a wire rack to cool completely.",
            "Heat the oven to 475°F. In a mixing bowl, combine the flour, baking powder, granulated sugar, and salt. Add the butter to the dry ingredients and work the mixture between your thumbs and fingers to stretch the butter into flat pieces. Leave a few larger chunks of cold butter in the flour mixture. Start by adding 3/4 cup half- and-half, and stir it into the flour mixture with a large spoon. If the mixture is too dry, add a little more half-and-half until it holds together. Do not overmix.",
            "Turn the dough out onto a lightly floured surface, and gently knead—just two to three turns—and form into a ball. Pat the dough ball down to create a flat surface. With a lightly floured rolling pin, roll the dough out to 1 inch thick. With the tines of a fork dipped in dry flour, pierce the dough about every inch, making sure to pierce through to the bottom of the dough, to create holes for steam to escape. Using a pastry brush, lightly coat the surface of the rolled-out dough with the egg wash, then sprinkle the turbinado sugar across the top evenly. Using a 3-inch biscuit cutter, cut out the shortcakes with a deliberate vertical push and then gently remove from the cutter. Place shortcakes side by side on a parchment-lined baking sheet, with edges touching. Use scraps of dough to fill in any large gaps between shortcakes; this helps the cakes hold their shape.",
            "Bake until the cakes are golden brown and spring back when lightly touched, 10 to 12 minutes. Let cool 5 minutes, then transfer to a wire rack to cool completely.",
            "For the whipped sweetened crème fraîche: Whisk the heavy cream and sugar to combine. Add the crème fraîche and whisk rapidly until it tightens up to whipped cream consistency with soft peaks, 1 to 2 minutes. If the mixture gets overwhipped, fold in a little more cream to thin it out.",
            "Whisk the heavy cream and sugar to combine. Add the crème fraîche and whisk rapidly until it tightens up to whipped cream consistency with soft peaks, 1 to 2 minutes. If the mixture gets overwhipped, fold in a little more cream to thin it out.",
            "For the whipped sweetened crème fraîche: Combine the cream and buttermilk in a shallow container that holds the liquid at a depth of 1 to 2 inches. Cover the container with a lid or plastic wrap and let sit at room temperature overnight. Refrigerate when thickened.",
            "Combine the cream and buttermilk in a shallow container that holds the liquid at a depth of 1 to 2 inches. Cover the container with a lid or plastic wrap and let sit at room temperature overnight. Refrigerate when thickened.",
            "Variation: When we made this dessert for the photo shoot, recipe tester Deborah Geering layered the extra shortcake halves, peaches and their juices, and whipped crème fraîche in a casserole dish like a summer pudding.",
            "When we made this dessert for the photo shoot, recipe tester Deborah Geering layered the extra shortcake halves, peaches and their juices, and whipped crème fraîche in a casserole dish like a summer pudding.",
            "Make the whiskeyed peaches: In a large skillet over high heat, melt the butter until foamy. Add the peaches, lemon juice, whiskey, sugar, salt, and vanilla and sauté, stirring to prevent burning, until the peaches are tender, 5 to 10 minutes, depending on their initial firmness. Remove from the heat and let cool. (You should have about 3 cups.) Make the sweetened crème fraîche.",
            "In a large skillet over high heat, melt the butter until foamy. Add the peaches, lemon juice, whiskey, sugar, salt, and vanilla and sauté, stirring to prevent burning, until the peaches are tender, 5 to 10 minutes, depending on their initial firmness. Remove from the heat and let cool. (You should have about 3 cups.) Make the sweetened crème fraîche.",
            "To assemble: Split the shortcakes in half and place the bottoms, cut side up, on each plate. Spoon a large dollop of the sweetened crème fraîche onto each half, then layer a scant 1/3 cup peach mixture and some of the syrup onto each half. Layer with more sweetened crème fraîche and then set the other halves on top.",
            "Split the shortcakes in half and place the bottoms, cut side up, on each plate. Spoon a large dollop of the sweetened crème fraîche onto each half, then layer a scant 1/3 cup peach mixture and some of the syrup onto each half. Layer with more sweetened crème fraîche and then set the other halves on top."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55a3fa3898d8666b6dcd7a15/6:4/w_274%2Ch_169/56389789_whiskeyed-peach-shortcakes_1x1.jpg"
    }
}