{
    "recipe": {
        "title": "White Chocolate and Strawberry Cheesecake ",
        "ingredients": [
            "1 9-ounce package chocolate wafer cookies, broken into pieces",
            "1/2 cup (1 stick) unsalted butter, melted",
            "1 pound good-quality white chocolate (such as Lindt or Baker’s), finely chopped",
            "4 8-ounce packages cream cheese, room temperature",
            "1 cup sugar",
            "1/4 teaspoon salt",
            "4 large eggs",
            "1 cup sour cream",
            "1/2 cup whipping cream",
            "2 tablespoons vanilla extract",
            "3 1-pint baskets strawberries, hulled, halved",
            "1/2 cup apricot preserves",
            "2 tablespoons brandy"
        ],
        "instructions": [
            "Position rack in center of oven; preheat to 325°F. Butter 10-inch-diameter springform pan. Wrap outside of pan with foil. Finely grind cookies in processor. Add melted butter; process until crumbs are moist. Press crumbs onto bottom and 2 inches up sides of pan. Bake until set, about 15 minutes. Cool on rack. Maintain oven temperature.",
            "for filling: Stir white chocolate in top of double boiler set over barely simmering water until melted and smooth. Remove from over water. Cool to lukewarm, stirring occasionally. Using electric mixer, beat cream cheese in large bowl until fluffy, about 3 minutes. Gradually add sugar, then salt; beat until smooth. Add eggs 1 at a time, beating well after each addition. Add sour cream, whipping cream and vanilla; beat until well blended. Bake cake until top begins to brown but center still moves slightly when pan is gently shaken, about 1 hour 20 minutes. Open oven door slightly; turn off oven. Leave cake in oven 30 minutes. Chill cake uncovered overnight. (Can be made 2 days ahead. Cover; keep refrigerated.) Run small knife between pan sides and cake. Release pan sides. Starting at outer edge of top of cake, arrange strawberry halves in slightly overlapping concentric circles, covering top completely. Stir preserves and brandy in heavy small saucepan over medium heat until mixture boils. Strain preserves. Brush glaze generously over strawberries, allowing some glaze to drip between berries. (Can be made 4 hours ahead. Chill.)",
            "Stir white chocolate in top of double boiler set over barely simmering water until melted and smooth. Remove from over water. Cool to lukewarm, stirring occasionally.",
            "Using electric mixer, beat cream cheese in large bowl until fluffy, about 3 minutes. Gradually add sugar, then salt; beat until smooth. Add eggs 1 at a time, beating well after each addition. Add sour cream, whipping cream and vanilla; beat until well blended.",
            "Bake cake until top begins to brown but center still moves slightly when pan is gently shaken, about 1 hour 20 minutes. Open oven door slightly; turn off oven. Leave cake in oven 30 minutes. Chill cake uncovered overnight. (Can be made 2 days ahead. Cover; keep refrigerated.)",
            "Run small knife between pan sides and cake. Release pan sides. Starting at outer edge of top of cake, arrange strawberry halves in slightly overlapping concentric circles, covering top completely. Stir preserves and brandy in heavy small saucepan over medium heat until mixture boils. Strain preserves. Brush glaze generously over strawberries, allowing some glaze to drip between berries. (Can be made 4 hours ahead. Chill.)"
        ],
        "picture_link": "https://assets.epicurious.com/photos/561025db7b55306961bffeb3/6:4/w_274%2Ch_169/103290.jpg"
    }
}