{
    "recipe": {
        "title": "White Chocolate-Ginger Cheesecake ",
        "ingredients": [
            "13 ounces gingersnap cookies (about 50 cookies)",
            "2 tablespoons sugar",
            "1 teaspoon ground ginger",
            "6 1/2 tablespoons unsalted butter, melted, cooled",
            "1 pound good-quality chocolate (such as Lindt or Baker's), finely chopped",
            "4 8-ounce packages cream cheese, room temperature",
            "1/4 cup sugar",
            "4 large eggs, room temperature",
            "1 tablespoon vanilla extract",
            "1 teaspoon ground ginger",
            "2/3 cup minced crystallized ginger",
            "White chocolate curls"
        ],
        "instructions": [
            "Butter 9-inch-diameter springform pan with 2 3/4-inch-high sides. Wrap outside of pan with 2 layers of heavy-duty foil. Finely grind cookies, sugar and ginger in processor. Add butter; blend until moist clumps form. Press onto bottom and up sides of pan. Chill while preparing filling.",
            "FOR FILLING: Position rack in center of oven and preheat to 300°F. Stir white chocolate in top of double boiler set over hot water until chocolate melts. Cool to lukewarm, stirring occasionally. Using electric mixer, beat cream cheese and sugar in large bowl until fluffy, about 3 minutes. Add eggs and yolk 1 at a time, beating just until combined after each addition. Beat in vanilla and ground ginger. Gradually beat in melted white chocolate. Stir in crystallized ginger. Transfer filling to prepared crust. Place springform pan in large roasting pan. Pour enough hot water into roasting pan to come halfway up sides of springform pan. Bake until cheesecake puffs and edges crack slightly, about 1 1/2 hours. Transfer cake to rack. Run small knife around sides of cake to loosen. Cool completely. Remove foil from pan sides. Chill cake overnight. (Can be prepared 3 days ahead. Cover and keep chilled.) Release pan sides. Transfer cake to platter. Top with chocolate curls.",
            "Position rack in center of oven and preheat to 300°F. Stir white chocolate in top of double boiler set over hot water until chocolate melts. Cool to lukewarm, stirring occasionally.",
            "Using electric mixer, beat cream cheese and sugar in large bowl until fluffy, about 3 minutes. Add eggs and yolk 1 at a time, beating just until combined after each addition. Beat in vanilla and ground ginger. Gradually beat in melted white chocolate. Stir in crystallized ginger.",
            "Transfer filling to prepared crust. Place springform pan in large roasting pan. Pour enough hot water into roasting pan to come halfway up sides of springform pan. Bake until cheesecake puffs and edges crack slightly, about 1 1/2 hours.",
            "Transfer cake to rack. Run small knife around sides of cake to loosen. Cool completely. Remove foil from pan sides. Chill cake overnight. (Can be prepared 3 days ahead. Cover and keep chilled.)",
            "Release pan sides. Transfer cake to platter. Top with chocolate curls."
        ],
        "picture_link": null,
        "color": 15890676
    }
}