{
    "recipe": {
        "title": "White Pizza with Shaved Vegetables and Pesto ",
        "ingredients": [
            "1/2 cup whole-milk ricotta",
            "16 ounces prepared pizza dough, room temperature",
            "2 tablespoons plus 1 teaspoon olive oil, divided, plus more for pan",
            "1 medium zucchini (about 8 ounces), trimmed, thinly shaved with a vegetable peeler",
            "2 small leeks, whites and pale-green parts cut into half moons, very thinly sliced (about 1 cup)",
            "4 ounces asparagus, trimmed, thinly shaved with a vegetable peeler",
            "1/2 cup frozen sweet peas, thawed",
            "1/2 teaspoon kosher salt",
            "1/2 cup shredded low-moisture mozzarella",
            "1/4 cup homemade or store-bought pesto",
            "1 garlic clove, finely chopped",
            "1/2 teaspoon finely grated lemon zest",
            "1/2 cup watercress",
            "1/4 cup torn basil",
            "1.5 ounces Pecorino, shaved into curls with a vegetable peeler (about 1/2 cup)",
            "1/3 cup unsalted, roasted pistachios, coarsely chopped"
        ],
        "instructions": [
            "Place a rack in lower third of oven; preheat to 500°F. Drain ricotta in a paper towel-lined colander.",
            "Gently stretch dough to a 16x12\" oval and transfer to a lightly oiled rimmed baking sheet. (If dough springs back, cover with plastic wrap and let rest 10 minutes, then stretch again, resting as needed.) Brush with 1 Tbsp. oil, then bake until dry and golden, about 5 minutes.",
            "Meanwhile, toss zucchini, leeks, asparagus, peas, salt, and 1 Tbsp. oil in a medium bowl. Whisk ricotta, mozzarella, pesto, garlic, and lemon zest in another medium bowl until smooth.",
            "Spread ricotta mixture over dough, then arrange vegetables over. Bake pizza, rotating pan halfway through, until cheese is melted, vegetables are roasted and tender, and crust is golden brown, 7–9 minutes.",
            "Meanwhile, toss watercress and basil with remaining 1 tsp. oil. Remove baking sheet from oven, then transfer pizza with a pizza peel or offset spatula to wire rack. Top pizza with watercress mixture, Pecorino, and pistachios. Let cool slightly, then cut into wedges and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/590b9f9db6288b426f0b4404/6:4/w_274%2Ch_169/White-Pizza-with-Shaved-Vegetables-and-Pesto-recipe-03052017.jpg",
        "color": 9691147
    }
}