{
    "recipe": {
        "title": "White Chocolate Cheesecake with Cinnamon and Lemon ",
        "ingredients": [
            "1 cup whole almonds, toasted",
            "3/4 cup ground crisp lemon-flavored cookies (about 2 1/2 ounces)",
            "3 tablespoons sugar",
            "1 teaspoon grated lemon peel",
            "1/4 cup (1/2 stick) unsalted butter, melted",
            "3 ounces good-quality white chocolate (such as Lindt or Baker's), chopped",
            "2 8-ounce packages cream cheese, room temperature",
            "1 1/4 cups sugar",
            "1 cup sour cream, room temperature",
            "1/4 cup fresh lemon juice",
            "2 teaspoons finely grated lemon peel",
            "2 teaspoons vanilla extract",
            "1 1/2 teaspoons ground cinnamon",
            "5 large eggs",
            "4 ounces good-quality white chocolate (such as Lindt or Baker's), chopped",
            "1/4 cup whipping cream",
            "2 teaspoons (packed) grated lemon peel",
            "1/3 cup sliced almonds, toasted",
            "White chocolate curls"
        ],
        "instructions": [
            "For crust Position rack in center or oven and preheat to 325°F. Wrap outside of 9-inch-diameter springform pan with 2 3/4-inch-high sides with 2 layers of foil. Finely grind 1/2 cup almonds, cookies, sugar and lemon peel in processor. Add butter and 1/2 cup almonds. Process until nuts are chopped and moist clumps form. Press mixture onto bottom (not sides) of pan. Bake until crust is golden, about 20 minutes. Cook. Maintain oven temperature.",
            "Position rack in center or oven and preheat to 325°F. Wrap outside of 9-inch-diameter springform pan with 2 3/4-inch-high sides with 2 layers of foil. Finely grind 1/2 cup almonds, cookies, sugar and lemon peel in processor. Add butter and 1/2 cup almonds. Process until nuts are chopped and moist clumps form. Press mixture onto bottom (not sides) of pan. Bake until crust is golden, about 20 minutes. Cook. Maintain oven temperature.",
            "For filling Stir white chocolate in top of double boiler set over simmering water until chocolate melts. Cool to lukewarm, stirring occasionally. Using electric mixer, beat cream cheese and sugar in large bowl until smooth. Gradually beat in sour cream and juice, then melted chocolate, peel, vanilla and cinnamon. Beat in eggs 1 at a time.",
            "Stir white chocolate in top of double boiler set over simmering water until chocolate melts. Cool to lukewarm, stirring occasionally.",
            "Using electric mixer, beat cream cheese and sugar in large bowl until smooth. Gradually beat in sour cream and juice, then melted chocolate, peel, vanilla and cinnamon. Beat in eggs 1 at a time.",
            "Transfer filling to crust. Bake until edges of cheesecake puff and crack and center is just set, about 1 hour 15 minutes. Remove from oven. Run small knife around sides of cake to loosen. Remove foil. Chill cheesecake uncovered overnight.",
            "Transfer filling to crust. Bake until edges of cheesecake puff and crack and center is just set, about 1 hour 15 minutes. Remove from oven. Run small knife around sides of cake to loosen. Remove foil. Chill cheesecake uncovered overnight.",
            "For topping Combine white chocolate and cream in top of double boiler set over simmering water. Stir until chocolate melts. Whisk in grated lemon peel. Cool to room temperature. Release pan sides from cake. Transfer cake to platter. Pour topping over center of cake, spreading evenly and leaving 1/2-inch border around edge of cake. Garnish with sliced almonds and white chocolate curls. Chill until topping is cold. (Can be made 1 day ahead. Cover; keep chilled.)",
            "Combine white chocolate and cream in top of double boiler set over simmering water. Stir until chocolate melts. Whisk in grated lemon peel. Cool to room temperature.",
            "Release pan sides from cake. Transfer cake to platter. Pour topping over center of cake, spreading evenly and leaving 1/2-inch border around edge of cake. Garnish with sliced almonds and white chocolate curls. Chill until topping is cold. (Can be made 1 day ahead. Cover; keep chilled.)"
        ],
        "picture_link": null
    }
}