{
    "recipe": {
        "title": "White Chili ",
        "ingredients": [
            "2 tablespoons olive oil",
            "1 pound boneless chicken breast, cut into bite-size chunks",
            "1 large onion, diced",
            "3 garlic cloves, minced",
            "2 (4-ounce) cans chopped mild green chilis, with juice",
            "1/2 cup tomatillo salsa",
            "1 (14.5-ounce) can low-sodium chicken broth",
            "1/4 teaspoon ground cumin",
            "1/2 teaspoon dried oregano",
            "2 (15.5-ounce) cans white beans, like cannellini, preferably low-sodium, drained and rinsed",
            "3 tablespoons lime juice",
            "Salt to taste",
            "1/2 cup fresh cilantro, chopped",
            "1 cup nonfat plain yogurt",
            "1/2 cup shredded sharp cheddar cheese"
        ],
        "instructions": [
            "1. Heat 1 tablespoon of the oil in a large saucepan over a medium-high flame. Add the chicken pieces and sauté for 5 minutes, or until cooked through. Remove from the pan and set aside. 2. Add the remaining tablespoon of oil and the onion to the pan, and sauté over medium heat until the onion is tender, about 3 minutes. Add the garlic and sauté for 1 minute more. Add the chilis, salsa, chicken broth, cumin, and oregano, and bring to a boil. Reduce the heat and simmer for 20 minutes. 3. Add the chicken and beans, and cook for 5 minutes more. Stir in the lime juice, then season with salt to taste. Serve topped with cilantro, yogurt, and cheese.",
            "1. Heat 1 tablespoon of the oil in a large saucepan over a medium-high flame. Add the chicken pieces and sauté for 5 minutes, or until cooked through. Remove from the pan and set aside.",
            "2. Add the remaining tablespoon of oil and the onion to the pan, and sauté over medium heat until the onion is tender, about 3 minutes. Add the garlic and sauté for 1 minute more. Add the chilis, salsa, chicken broth, cumin, and oregano, and bring to a boil. Reduce the heat and simmer for 20 minutes.",
            "3. Add the chicken and beans, and cook for 5 minutes more. Stir in the lime juice, then season with salt to taste. Serve topped with cilantro, yogurt, and cheese."
        ],
        "picture_link": null
    }
}