{
    "recipe": {
        "title": "Whole-Grain and Honey Bread ",
        "ingredients": [
            "1/2 cup uncooked bulgur",
            "1/2 cup boiling water",
            "2 cups water",
            "1/2 cup honey",
            "2 tablespoons canola or corn oil",
            "2 teaspoons active dry yeast",
            "1/2 teaspoon salt",
            "2 cups bread flour or all-purpose flour",
            "1/4 cup toasted wheat germ",
            "4 cups whole-wheat flour and 1/2 cup whole-wheat flour, divided use",
            "Cooking spray"
        ],
        "instructions": [
            "1. In a small bowl, stir together the bulgur and 1/2 cup boiling water. Let stand for 15 minutes to allow the bulgur to soften.",
            "2. In a large bowl, combine the 2 cups water, honey, oil, yeast, and salt, stirring to dissolve the yeast.",
            "3. Stir in the bread flour, wheat germ, and softened bulgur mixture. Stir in as much of the 4 cups whole-wheat flour as you can until the dough starts to pull away from the side of the bowl.",
            "4. Knead for 6 to 7 minutes, gradually adding, if needed, enough of the remaining 1/2 cup whole-wheat flour to make the dough smooth and elastic. (The dough shouldn't be dry or stick to the surface. You may not need any of the additional 1/2 cup whole-wheat flour, or you may need the entire amount if the dough is too sticky.)",
            "5. Using cooking spray, lightly spray a large bowl and a piece of plastic wrap large enough to cover the top of the bowl. Transfer the dough to the bowl, turning to coat all sides with the cooking spray. Cover the bowl with the plastic wrap with the sprayed side down. Let the dough rise in a warm, draft-free place (about 85°F) for 1 1/2 to 2 hours, or until doubled in bulk.",
            "6. Using cooking spray, lightly spray two 81/2 x 41/2 x 2 1/2-inch loaf pans and 2 pieces of plastic wrap large enough to cover the pans. Punch the dough down. Divide it in half. Shape each half into a loaf. Place each loaf in one of the pans. Cover the pans with the plastic wrap with the sprayed side down. Let the dough rise in a warm, draft-free place for 1 1/2 to 2 hours, or until the dough is 1 1/2 inches higher than the top of the pans.",
            "7. Preheat the oven to 350°F.",
            "8. Bake for 30 minutes, or until the loaves sound hollow when tapped. (Tent the bread with aluminum foil during the last 10 minutes if necessary to prevent overbrowning.) Turn the loaves out onto a cooling rack. Let the bread cool for 15 to 20 minutes before slicing.",
            "9. To freeze one loaf of dough to bake later, follow the preceding directions to the point where you place the shaped dough in a loaf pan. Cover the pan with plastic wrap or aluminum foil, and freeze the dough. After the dough is frozen, about 4 hours, remove it from the pan and wrap it tightly in plastic wrap, then in aluminum foil. When you are ready to bake, unwrap the dough and place it in a sprayed loaf pan. Cover the pan with lightly sprayed plastic wrap with the sprayed side down and let the dough thaw and rise at room temperature in a draft-free place (the thawing and rising will take 4 to 5 hours) or let the dough thaw overnight in the refrigerator and rise as directed. Bake as directed."
        ],
        "picture_link": null,
        "color": 13534784
    }
}