{
    "recipe": {
        "title": "Whole Roasted Duck ",
        "ingredients": [
            "1 (2 1/2-pound) Rouen Clair or Duclair duck (preferably aged), neck removed",
            "3/4 cup dry red wine",
            "3/4 cup soy sauce",
            "1 tablespoon fresh lemon juice",
            "1/3 cup hoisin sauce",
            "1 teaspoon Sichuan peppercorns (optional)",
            "1 (2 1/2-inch) cinnamon stick",
            "1/8 teaspoon dried hot red pepper flakes",
            "3 garlic cloves, smashed",
            "1 (1/4-inch-thick) piece peeled fresh ginger, smashed",
            "1 small onion, quartered",
            "1 cup water",
            "1 tablespoon all-purpose flour",
            "kitchen string; an instant-read thermometer"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 400°F.",
            "Wash and dry duck, then \"groom\" it by removing any remaining feathers and quills with tweezers or needlenose pliers. Tie legs together using string, then tuck wings under body to secure.",
            "Combine all remaining ingredients except water and flour in a large sealable plastic bag and add duck. Marinate, chilled, 1 hour.",
            "Transfer duck to a 13- by 9- by 3-inch roasting pan and reserve marinade. Roast 15 minutes. Meanwhile, pour 3/4 cup marinade through a sieve into a 1-quart saucepan and discard remainder. Boil 1 minute and baste duck with marinade. Continue to roast duck until thermometer registers 155°F when inserted in meaty part of a thigh or 160°F in breast (do not touch bone), 15 to 20 minutes more.",
            "While duck continues to roast, add 1 cup water to marinade in saucepan and bring to a boil. Put flour in a heatproof bowl and whisk in 1/4 cup marinade until smooth. Whisk flour mixture into remaining marinade in saucepan until combined well. Simmer over low heat, stirring occasionally, until thick enough to coat back of a spoon, about 3 minutes. Keep warm over low heat, stirring occasionally.",
            "Remove duck from oven and let stand 10 minutes before carving. (Duck will continue to cook, reaching 160°F at leg and 165°F at breast.)",
            "Serve duck with sauce.",
            "Serve duck with sauce."
        ],
        "picture_link": null,
        "color": 10942116
    }
}