{
    "recipe": {
        "title": "Whole Grain Pancakes with Blackberries ",
        "ingredients": [
            "3/4 cup whole wheat flour",
            "1/2 cup all-purpose flour",
            "2 Tbsp. sugar",
            "1 tsp. baking powder",
            "1 tsp. baking soda",
            "1 tsp. kosher salt",
            "1 large egg",
            "1 1/2 cups buttermilk",
            "2 cups mixed cooked whole grains (such as barley, farro, rye, spelt, kamut, and/or quinoa)",
            "Melted unsalted butter (for pan)",
            "Room-temperature butter, fresh blackberries, and pure maple syrup (for serving)"
        ],
        "instructions": [
            "Whisk whole wheat and all-purpose flours, sugar, baking powder, baking soda, and salt in a large bowl. Whisk egg and buttermilk in a medium bowl just to incorporate. Using a few swift strokes, whisk egg mixture into dry ingredients just to combine. Stir grains into batter (you can pulse the grains in a food processor first if you prefer them in smaller pieces). Heat a large nonstick skillet over medium-high. Lightly brush with butter. Add half of batter to skillet, spreading into an even layer as wide as the skillet. Cook pancake until bubbles have formed and broken across the entire surface and underside is golden brown, about 5 minutes. Using 2 spatulas (or sliding onto a flat plate before inverting back into skillet), flip pancake. Continue to cook until lightly browned underneath, about 1 minute. Transfer pancake to a plate. Repeat with remaining batter. Serve pancakes topped with butter, fruit, and syrup.",
            "Whisk whole wheat and all-purpose flours, sugar, baking powder, baking soda, and salt in a large bowl. Whisk egg and buttermilk in a medium bowl just to incorporate. Using a few swift strokes, whisk egg mixture into dry ingredients just to combine. Stir grains into batter (you can pulse the grains in a food processor first if you prefer them in smaller pieces).",
            "Heat a large nonstick skillet over medium-high. Lightly brush with butter. Add half of batter to skillet, spreading into an even layer as wide as the skillet. Cook pancake until bubbles have formed and broken across the entire surface and underside is golden brown, about 5 minutes. Using 2 spatulas (or sliding onto a flat plate before inverting back into skillet), flip pancake. Continue to cook until lightly browned underneath, about 1 minute. Transfer pancake to a plate. Repeat with remaining batter.",
            "Serve pancakes topped with butter, fruit, and syrup."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ac2735e3e01605efd1b46bf/6:4/w_274%2Ch_169/whole-grain-pancakes-with-blackberries-recipe-BA-032918.jpg"
    }
}