{
    "recipe": {
        "title": "Wild Rice Dressing ",
        "ingredients": [
            "1 cup pecans",
            "2 cups wild rice",
            "Kosher salt",
            "1/4 cup red wine vinegar",
            "2 Tbsp. fresh orange juice",
            "2 Tbsp. honey",
            "1 garlic clove, crushed",
            "1/2 cup extra-virgin olive oil, divided, plus more for drizzling",
            "2 large leeks, white and pale green parts only, tough outer layer removed, halved lengthwise, thinly sliced crosswise",
            "12 oz. mushrooms (such as maitake, chanterelle, and/or oyster), torn or cut into large pieces",
            "Freshly ground black pepper",
            "2 tsp. chopped thyme",
            "1/3 cup sliced chives"
        ],
        "instructions": [
            "Preheat oven to 350°F. Toast pecans on a rimmed baking sheet, tossing once, until slightly darkened and fragrant, 6–8 minutes. Let cool, then coarsely chop. Cook wild rice in a large pot of boiling salted water until most of the grains have split and all are tender, 40–50 minutes; drain and rinse under cold running water. Shake off as much water as possible and let cool. Meanwhile, whisk vinegar, orange juice, and honey in a large bowl to combine. Add garlic and let sit 10 minutes to infuse. Fish out garlic; discard. Add rice and toss to coat. Heat 1/4 cup oil in a large skillet over medium-high. Cook leeks, stirring occasionally, until tender and browned in spots, 8–10 minutes. Season with salt and transfer to bowl with rice; toss to coat. Wipe out skillet and heat another 1/4 cup oil over medium-high until just beginning to smoke. Arrange mushrooms in skillet in a single layer and cook, undisturbed, until undersides are golden brown, about 2 minutes. Season with salt and pepper, toss, and continue to cook, tossing often and reducing heat as needed to avoid scorching, until golden brown all over, about 3 minutes longer. Mix in thyme and immediately transfer to bowl with rice. Add pecans and chives and drizzle with more oil; toss once more.",
            "Preheat oven to 350°F. Toast pecans on a rimmed baking sheet, tossing once, until slightly darkened and fragrant, 6–8 minutes. Let cool, then coarsely chop.",
            "Cook wild rice in a large pot of boiling salted water until most of the grains have split and all are tender, 40–50 minutes; drain and rinse under cold running water. Shake off as much water as possible and let cool.",
            "Meanwhile, whisk vinegar, orange juice, and honey in a large bowl to combine. Add garlic and let sit 10 minutes to infuse. Fish out garlic; discard. Add rice and toss to coat.",
            "Heat 1/4 cup oil in a large skillet over medium-high. Cook leeks, stirring occasionally, until tender and browned in spots, 8–10 minutes. Season with salt and transfer to bowl with rice; toss to coat.",
            "Wipe out skillet and heat another 1/4 cup oil over medium-high until just beginning to smoke. Arrange mushrooms in skillet in a single layer and cook, undisturbed, until undersides are golden brown, about 2 minutes. Season with salt and pepper, toss, and continue to cook, tossing often and reducing heat as needed to avoid scorching, until golden brown all over, about 3 minutes longer. Mix in thyme and immediately transfer to bowl with rice. Add pecans and chives and drizzle with more oil; toss once more.",
            "Do Ahead Rice can be cooked 1 day ahead. Let cool; cover and chill. Dressing can be made 3 hours ahead; store tightly wrapped at room temperature.",
            "Rice can be cooked 1 day ahead. Let cool; cover and chill. Dressing can be made 3 hours ahead; store tightly wrapped at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5be07fc55261fb2d904669b9/6:4/w_274%2Ch_169/wild-rice-dressing-recipe-BA-110518.jpg"
    }
}