{
    "recipe": {
        "title": "Wild Rice with Wild Mushrooms ",
        "ingredients": [
            "1 1/2 cups canned chicken broth",
            "3/4 ounce dried porcini mushrooms, rinsed under cold water",
            "1 1/4 cups wild rice, rinsed under cold water",
            "1 teaspoon salt",
            "1 1/2 bay leaves",
            "3 tablespoons butter",
            "3/4 cup finely chopped onion",
            "1/2 cup finely chopped carrot",
            "2 garlic cloves, minced",
            "3/4 teaspoon dried marjoram",
            "1/2 teaspoon dried thyme",
            "9 medium crimini or button mushrooms, sliced"
        ],
        "instructions": [
            "Bring broth to boil in small saucepan. Remove from heat; add porcini mushrooms and let stand until soft, about 30 minutes. Drain, reserving soaking liquid. Finely chop porcini. Bring medium saucepan of water to boil. Add rice, salt and bay leaves. Reduce heat to medium and simmer until rice is almost tender, about 45 minutes. Drain; discard bay leaves. (Porcini and rice can be prepared 1 day ahead. Cover porcini, soaking liquid and rice separately and refrigerate.) Melt butter in large nonstick skillet over medium heat. Add onion, carrot, garlic, marjoram, thyme and porcini and sauté 5 minutes. Add crimini mushrooms; sauté until tender, about 7 minutes. Add rice and reserved porcini soaking liquid, discarding sediment in bottom. Simmer until almost all liquid absorbed but mixture is still moist, about 10 minutes. Season with salt and pepper.",
            "Bring broth to boil in small saucepan. Remove from heat; add porcini mushrooms and let stand until soft, about 30 minutes. Drain, reserving soaking liquid. Finely chop porcini.",
            "Bring medium saucepan of water to boil. Add rice, salt and bay leaves. Reduce heat to medium and simmer until rice is almost tender, about 45 minutes. Drain; discard bay leaves. (Porcini and rice can be prepared 1 day ahead. Cover porcini, soaking liquid and rice separately and refrigerate.)",
            "Melt butter in large nonstick skillet over medium heat. Add onion, carrot, garlic, marjoram, thyme and porcini and sauté 5 minutes. Add crimini mushrooms; sauté until tender, about 7 minutes. Add rice and reserved porcini soaking liquid, discarding sediment in bottom. Simmer until almost all liquid absorbed but mixture is still moist, about 10 minutes. Season with salt and pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57bdeb4fd8f441e50948d273/6:4/w_274%2Ch_169/wild-rice-with-wild-mushrooms.jpg"
    }
}