{
    "recipe": {
        "title": "Wild Mushroom Polenta with Porcini Sauce ",
        "ingredients": [
            "1 ounce dried porcini mushrooms",
            "1 tablespoon extra-virgin olive oil",
            "1 small shallot, peeled and finely chopped",
            "2 garlic cloves, minced",
            "1/2 cup dry white wine",
            "1 bay leaf",
            "1 1/2 cups vegetable stock",
            "1 tablespoon butter, room temperature",
            "2 teaspoons all-purpose flour",
            "Salt",
            "freshly ground pepper",
            "1 1/2 pounds mixed wild mushrooms (such as maitake, chanterelle, shiitake); large mushrooms torn into smaller pieces",
            "1 tablespoon fresh thyme leaves",
            "1/4 cup extra-virgin olive oil",
            "Salt",
            "freshly ground black pepper",
            "1/2 teaspoon salt",
            "2 cups polenta",
            "1/2 teaspoon freshly ground black pepper",
            "1/2 cup freshly grated Parmigiano-Reggiano",
            "2 tablespoons unsalted butter"
        ],
        "instructions": [
            "In a small bowl, combine porcini mushrooms and 1 cup warm water. Let stand until mushrooms soften, about 30 minutes. Remove porcini mushrooms from the liquid, strain and reserve liquid. Finely chop the mushrooms and set aside.",
            "Roast the mushrooms: While the porcini are soaking, set racks in the upper and lower thirds of the oven and preheat oven to 450°F. On two rimmed baking sheets, gently toss mushrooms with thyme and oil; season with salt and pepper. Roast mushrooms until edges are browned, about 10 minutes. Set aside until ready to use. Heat oil in a large saucepan over medium-high heat. Sauté shallot until softened, about 5 minutes. Add garlic, and sauté for 2 minutes more. Add white wine and bay leaf and increase heat; boil until most liquid evaporates, about 7 minutes. Add reserved chopped porcini mushrooms, vegetable stock, and reserved mushroom liquid. Boil until liquid is reduced to 1 cup, 15 to 20 minutes. Remove bay leaf. In a small bowl, stir butter and flour together until it forms a paste. Whisk the butter mixture into the mushroom sauce. Simmer until sauce thickens, about 1 minute. Season with salt and pepper.",
            "While the porcini are soaking, set racks in the upper and lower thirds of the oven and preheat oven to 450°F. On two rimmed baking sheets, gently toss mushrooms with thyme and oil; season with salt and pepper. Roast mushrooms until edges are browned, about 10 minutes. Set aside until ready to use.",
            "Heat oil in a large saucepan over medium-high heat. Sauté shallot until softened, about 5 minutes. Add garlic, and sauté for 2 minutes more. Add white wine and bay leaf and increase heat; boil until most liquid evaporates, about 7 minutes. Add reserved chopped porcini mushrooms, vegetable stock, and reserved mushroom liquid. Boil until liquid is reduced to 1 cup, 15 to 20 minutes. Remove bay leaf.",
            "In a small bowl, stir butter and flour together until it forms a paste. Whisk the butter mixture into the mushroom sauce. Simmer until sauce thickens, about 1 minute. Season with salt and pepper.",
            "Make the polenta: In a large saucepan, bring 6 cups water and the salt to a boil. Reduce the heat to medium-low and whisk in the polenta, whisking constantly to make sure there are no lumps. Cook, stirring occasionally with a wooden spoon, until thickened and cooked through, 15 to 20 minutes. Remove from heat; stir in the cheese,and butter. Season with salt and pepper. Serve polenta immediately topped with porcini sauce and roasted mushrooms.",
            "In a large saucepan, bring 6 cups water and the salt to a boil. Reduce the heat to medium-low and whisk in the polenta, whisking constantly to make sure there are no lumps. Cook, stirring occasionally with a wooden spoon, until thickened and cooked through, 15 to 20 minutes. Remove from heat; stir in the cheese,and butter. Season with salt and pepper. Serve polenta immediately topped with porcini sauce and roasted mushrooms."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b8784b4bf78b800d89a7de/6:4/w_274%2Ch_169/51255320_wild-mushroom-polenta_1x1.jpg"
    }
}