{
    "recipe": {
        "title": "Wild Mushroom and Roasted Garlic Sandwich ",
        "ingredients": [
            "About 1/4 cup extra virgin olive oil",
            "2 tablespoons unsalted butter",
            "1 pound mixed wild and domestic mushrooms, such as shiitakes (stems removed), creminis, portobellos, oyster mushrooms, and chanterelles, cleaned and cut into 1-inch pieces.",
            "Kosher salt",
            "freshly ground black pepper",
            "2 garlic cloves, finely chopped",
            "1 shallot, finely chopped",
            "1 teaspoon chopped fresh thyme",
            "1/4 cup dry white wine",
            "2 tablespoons chopped fresh parsley",
            "12 slices of country-style bread, about 3 inches long and ⅓ inch thick",
            "4 whole heads of roasted garlic, cloves squeezed to remove the softened garlic"
        ],
        "instructions": [
            "In a large sauté pan, heat 3 to 4 tablespoons of the olive oil and 2 tablespoons of the butter over medium-high heat until the butter is very hot. Add the meatiest of your mushrooms, such as the creminis and portobellos, and cook them on both sides until they brown lightly and begin to lose their juices, about 5 minutes. Add the rest of the mushrooms and season with salt and pepper to taste. Continue to cook over medium heat, stirring the mushrooms every few minutes, for about another 5 minutes.",
            "Add the chopped fresh garlic, the shallot, and the thyme, and cook until fragrant, about 2 minutes. Add the white wine and continue cooking the mushrooms until they are tender and most of the wine and mushroom juices have evaporated, about another 10 minutes. Season with more salt and pepper. Add the parsley and keep the mushrooms warm until ready to serve.",
            "To Assemble the Sandwiches Toast the bread on both sides either under the broiler or on a grill until golden brown. Spread each piece generously with some roasted garlic. Top 6 of the slices of bread with the mushrooms. Cover with the remaining slices of bread, garlic side down.",
            "Toast the bread on both sides either under the broiler or on a grill until golden brown. Spread each piece generously with some roasted garlic. Top 6 of the slices of bread with the mushrooms. Cover with the remaining slices of bread, garlic side down."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56098ee56a59cdb91b5f7852/6:4/w_274%2Ch_169/358375.jpg"
    }
}