{
    "recipe": {
        "title": "Wild Rice with Watercress and Hazelnuts ",
        "ingredients": [
            "2 cups wild rice",
            "1 bay leaf",
            "Kosher salt",
            "1/3 cup skin-on hazelnuts",
            "6 tablespoons unsalted butter",
            "1 large onion, thinly sliced",
            "6 garlic cloves, thinly sliced",
            "1/4 cup sherry vinegar or red wine vinegar",
            "1 tablespoon pure maple syrup",
            "1 tablespoon whole grain Dijon mustard",
            "Freshly ground black pepper",
            "2 cups trimmed watercress, upland cress, or micro cress"
        ],
        "instructions": [
            "Cook rice and bay leaf in a large pot of boiling salted water until some grains have burst and rice is tender, 45–55 minutes. Drain thoroughly and spread out rice on a rimmed baking sheet to cool; discard bay leaf.",
            "Meanwhile, preheat oven to 350°F. Toast hazelnuts on a rimmed baking sheet, tossing halfway through, until slightly darkened and fragrant, 8–10 minutes. Let cool, then rub hazelnuts in a clean kitchen towel to remove some of the skins. Gently crush nuts by pressing under the flat side of a chef’s knife; set aside.",
            "Heat butter in a large skillet over medium-low. Cook onion and garlic, stirring often, until onion is golden, 15–20 minutes. Remove from heat.",
            "Whisk vinegar, maple syrup, and mustard in a large bowl until smooth. Scrape in onion mixture and cooled rice and toss to coat; season with salt and pepper. Fold in nearly all of the hazelnuts and cress, then transfer to a platter. Top with remaining hazelnuts and cress.",
            "Do Ahead Rice can be cooked 2 days ahead. Let cool; cover and chill. Rice mixture (without hazelnuts and cress) can be made 3 hours ahead; store airtight at room temperature.",
            "Rice can be cooked 2 days ahead. Let cool; cover and chill. Rice mixture (without hazelnuts and cress) can be made 3 hours ahead; store airtight at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/59233d8100cf0627ec115d4b/6:4/w_274%2Ch_169/wild-rice-with-watercress-and-hazelnuts-BA-052217.jpg",
        "color": 16193800
    }
}