{
    "recipe": {
        "title": "Wilted Greens in Tomato-Bacon Broth ",
        "ingredients": [
            "1 Tbsp. extra-virgin olive oil, plus more for drizzling",
            "4 slices bacon, coarsely chopped",
            "1 small onion, chopped",
            "4 garlic cloves, smashed",
            "1 pint Sun Gold or cherry tomatoes",
            "2 Tbsp. sherry vinegar or red wine vinegar",
            "2 tsp. honey",
            "Kosher salt",
            "10 cups torn greens (such as escarole, Swiss chard, and/or mustard)",
            "1 Fresno chile, thinly sliced into rings"
        ],
        "instructions": [
            "Heat 1 Tbsp. oil in a large saucepan over medium-low. Add bacon and cook, stirring often, until brown and crisp around the edges, 5–7 minutes. Add onion and garlic and cook, stirring often, until onion is translucent, about 5 minutes. Increase heat to high and add tomatoes. Cook, stirring occasionally, until tomatoes have mostly burst and are lightly charred in spots, about 5 minutes. Mix in vinegar, honey, and 1 1/2 cups water. Season lightly with salt and simmer over low heat to allow flavors to blend, 8–10 minutes. Working a handful at a time, add greens, stirring to wilt before adding more, and cook until all greens are wilted and submerged in the broth. Season with more salt; let cool slightly. Transfer greens to a serving dish. Generously drizzle with oil and scatter chile over.",
            "Heat 1 Tbsp. oil in a large saucepan over medium-low. Add bacon and cook, stirring often, until brown and crisp around the edges, 5–7 minutes. Add onion and garlic and cook, stirring often, until onion is translucent, about 5 minutes. Increase heat to high and add tomatoes. Cook, stirring occasionally, until tomatoes have mostly burst and are lightly charred in spots, about 5 minutes. Mix in vinegar, honey, and 1 1/2 cups water. Season lightly with salt and simmer over low heat to allow flavors to blend, 8–10 minutes.",
            "Working a handful at a time, add greens, stirring to wilt before adding more, and cook until all greens are wilted and submerged in the broth. Season with more salt; let cool slightly.",
            "Transfer greens to a serving dish. Generously drizzle with oil and scatter chile over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5b16fb103674e370f3a0ce13/6:4/w_274%2Ch_169/wilted-greens-in-tomato-bacon-broth-recipe-BA-060518.jpg"
    }
}