{
    "recipe": {
        "title": "Wilted Escarole Salad ",
        "ingredients": [
            "1/2 loaf country-style bread (about 8 ounces), crust removed, torn into 1\" pieces (about 5 cups)",
            "7 tablespoons olive oil, divided",
            "Kosher salt, freshly ground pepper",
            "2 garlic cloves, coarsely chopped",
            "1–2 anchovy fillets packed in oil",
            "1/4 teaspoons crushed red pepper flakes",
            "2 tablespoons (or more) white wine vinegar",
            "1 large head escarole, outer leaves removed, inner leaves torn into large pieces"
        ],
        "instructions": [
            "Preheat oven to 350°F. Toss bread and 3 tablespoons oil on a large rimmed baking sheet, squeezing bread so it absorbs oil evenly; season with salt and pepper. Spread out bread pieces in an even layer and bake, tossing occasionally, until crisp on the outside but still chewy in the center, 10–15 minutes. Let croutons cool. Meanwhile, heat remaining 4 tablespoons oil in a small skillet over medium heat. Add garlic and cook, stirring often, until golden, about 2 minutes. Add anchovies and, using a spoon, mash into oil. Add red pepper flakes and remove skillet from heat. Add vinegar, scraping up any bits; season vinaigrette with salt and pepper. Just before serving, toss escarole, croutons and warm vinaigrette in a large bowl until escarole is slightly wilted; season with salt, pepper, and more vinegar, if desired. DO AHEAD: Croutons and vinaigrette can be made and escarole can be prepped 1 day ahead. Store croutons wrapped airtight at room temperature. Let vinaigrette cool; cover and chill. Gently reheat vinaigrette before using.",
            "Preheat oven to 350°F. Toss bread and 3 tablespoons oil on a large rimmed baking sheet, squeezing bread so it absorbs oil evenly; season with salt and pepper. Spread out bread pieces in an even layer and bake, tossing occasionally, until crisp on the outside but still chewy in the center, 10–15 minutes. Let croutons cool.",
            "Meanwhile, heat remaining 4 tablespoons oil in a small skillet over medium heat. Add garlic and cook, stirring often, until golden, about 2 minutes. Add anchovies and, using a spoon, mash into oil. Add red pepper flakes and remove skillet from heat. Add vinegar, scraping up any bits; season vinaigrette with salt and pepper.",
            "Just before serving, toss escarole, croutons and warm vinaigrette in a large bowl until escarole is slightly wilted; season with salt, pepper, and more vinegar, if desired.",
            "DO AHEAD: Croutons and vinaigrette can be made and escarole can be prepped 1 day ahead. Store croutons wrapped airtight at room temperature. Let vinaigrette cool; cover and chill. Gently reheat vinaigrette before using."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad694a19925f464b3b6c6c/6:4/w_274%2Ch_169/51193830_escarole-salad_1x1.jpg"
    }
}