{
    "recipe": {
        "title": "Wilted Greens Salad with Squash, Apples, and Country Ham ",
        "ingredients": [
            "10 cups fresh turnip or beet greens, or savoy spinach (about 2 bunches), bottom stems trimmed",
            "2 tablespoons kosher salt plus more for seasoning",
            "2 cups 1\" cubes peeled butternut squash",
            "3 tablespoons extra-virgin olive oil, divided",
            "2 tablespoons vegetable oil",
            "4 ounces thinly sliced country ham or prosciutto, torn into pieces",
            "1 apple, such as Braeburn or Fuji, quartered, cored, thinly sliced",
            "2 tablespoons minced shallot",
            "2 tablespoons (or more) fresh lemon juice",
            "3 tablespoons buttermilk",
            "Coarsely cracked whole black peppercorns"
        ],
        "instructions": [
            "Gently rub greens with 2 tablespoons salt in a large bowl. Let stand, checking often, until the greens begin to release water and soften, about 15 minutes. Rinse in two changes of cold water. Squeeze greens dry and pat with a kitchen towel; transfer to a clean bowl. Meanwhile, preheat oven to 425°F. Line a rimmed baking sheet with foil. Toss squash with 1 tablespoon olive oil on prepared sheet; season with salt. Roast squash, turning occasionally, until lightly browned and tender, 20-25 minutes. Let cool. Heat vegetable oil in a medium skillet over medium-high heat. Working in batches, add ham and cook until crisp, 1-2 minutes per side. Transfer to paper towels to drain. Add squash, apple, shallot, lemon juice, and remaining 2 tablespoons olive oil to greens. Toss to combine; season to taste with salt. Divide evenly among plates. Drizzle with buttermilk. Arrange fried ham over. Season with cracked pepper.",
            "Gently rub greens with 2 tablespoons salt in a large bowl. Let stand, checking often, until the greens begin to release water and soften, about 15 minutes. Rinse in two changes of cold water. Squeeze greens dry and pat with a kitchen towel; transfer to a clean bowl.",
            "Meanwhile, preheat oven to 425°F. Line a rimmed baking sheet with foil. Toss squash with 1 tablespoon olive oil on prepared sheet; season with salt. Roast squash, turning occasionally, until lightly browned and tender, 20-25 minutes. Let cool.",
            "Heat vegetable oil in a medium skillet over medium-high heat. Working in batches, add ham and cook until crisp, 1-2 minutes per side. Transfer to paper towels to drain.",
            "Add squash, apple, shallot, lemon juice, and remaining 2 tablespoons olive oil to greens. Toss to combine; season to taste with salt. Divide evenly among plates. Drizzle with buttermilk. Arrange fried ham over. Season with cracked pepper."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b40f12d5e8c3e1070b027c/6:4/w_274%2Ch_169/388731_wilted-greens-squash-salad_1x1.jpg"
    }
}