{
    "recipe": {
        "title": "Wine-Braised Chuck Roast with Onions ",
        "ingredients": [
            "4 pounds boneless beef chuck roast",
            "2 teaspoons salt",
            "3/4 teaspoon black pepper",
            "2 tablespoons vegetable oil",
            "2 pounds onions (4 to 6 medium), halved lengthwise and thinly sliced",
            "2 large garlic cloves, finely chopped",
            "1 tablespoon tomato paste",
            "1 teaspoon chopped fresh thyme or 1/4 teaspoon dried, crumbled",
            "1 teaspoon chopped fresh rosemary or 1/4 teaspoon dried, crumbled",
            "1 1/2 cups dry white wine",
            "1 cup water",
            "Accompaniment: 1/2 pound egg noodles, boiled until al dente",
            "Garnish: chopped fresh flat-leaf parsley"
        ],
        "instructions": [
            "Put oven rack in middle position and preheat oven to 325°F.",
            "Pat beef dry and rub all over with 1 1/2 teaspoons salt and 1/2 teaspoon pepper. Heat oil in an ovenproof 5-quart wide heavy pot over moderately high heat until hot but not smoking and brown beef on all sides, about 15 minutes total. Transfer beef to a plate.",
            "Add onions to pot and sauté over moderately high heat, stirring frequently, until pale golden, about 10 minutes. Add garlic, tomato paste, thyme, rosemary, and remaining 1/2 teaspoon salt and 1/4 teaspoon pepper and cook, stirring, 2 minutes. Add wine and water and bring to a boil. Return beef to pot, then cover tightly and braise in oven, turning once after 1 hour, until beef is very tender, 2 1/2 to 3 hours total.",
            "Let beef stand, uncovered, in onion sauce about 30 minutes.",
            "If reserving some meat for beef salad , cut off one third of roast, and, when cool enough to handle, shred and toss with 3/4 cup onion sauce. Cool completely, uncovered, then chill in an airtight container.",
            "While shredded beef cools, preheat oven to 350°F and transfer remaining beef to a cutting board and cut into 1/2-inch-thick slices. Season with salt and pepper and return beef to sauce. Reheat, covered, 20 minutes."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560de50cf9a84192308a7a65/6:4/w_274%2Ch_169/231357.jpg"
    }
}