{
    "recipe": {
        "title": "Winter Spice Cake with Caramelized Apple Topping ",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "13 tablespoons unsalted butter, room temperature",
            "6 medium Golden Delicious apples (about 2 1/4 pounds), peeled, each cut into 6 wedges, cored",
            "4 tablespoons plus 1 3/4 cups sugar",
            "1 cup whipping cream",
            "1/2 teaspoon apple cider vinegar",
            "1 1/4 cups all purpose flour",
            "1 1/4 teaspoons ground cinnamon",
            "1 teaspoon baking powder",
            "1 teaspoon ground ginger",
            "1/2 teaspoon ground allspice",
            "1/2 teaspoon salt",
            "1/4 teaspoon baking soda",
            "2 large eggs",
            "1 1/2 teaspoons vanilla extract",
            "1/2 cup sour cream"
        ],
        "instructions": [
            "Preheat oven to 350°F. Spray bottom of 9-inch-diameter springform pan with nonstick spray. Line bottom with foil; spray foil. Wrap outside of pan with foil. Melt 3 tablespoons butter in large nonstick skillet over medium-high heat. Add apples; sprinkle with 1 tablespoon sugar. Sauté apples until almost tender and beginning to brown, about 6 minutes. Sprinkle with 3 tablespoons sugar. Increase heat to high and toss until sugar melts and apples are deep brown, about 4 minutes. Pour apple mixture onto large plate (do not clean skillet). Melt 4 tablespoons butter in same skillet over medium-high heat. Add 3/4 cup sugar and cook until mixture is deep golden brown, stirring often, about 7 minutes (mixture will be grainy). Add cream and vinegar (do not stir). Cover skillet, reduce heat to medium-low and simmer without stirring until most of caramel bits dissolve, about 8 minutes. Uncover and whisk until sauce is slightly thick, deep brown and reduced to generous 1 cup, about 3 minutes longer. Pour caramel sauce into small saucepan. Spread 3 tablespoons caramel sauce over bottom of prepared pan. Arrange apple wedges side by side, rounded side down, in caramel in 2 concentric circles. Sift flour and next 6 ingredients into bowl. Beat 6 tablespoons butter and 1 cup sugar in large bowl to blend (mixture will be grainy). Beat in eggs 1 at a time, then vanilla and 1/4 cup caramel sauce. Beat in half of dry ingredients, then sour cream, then remaining dry ingredients. Spoon batter evenly over apples. Bake cake until tester inserted into center comes out clean, about 1 hour 15 minutes. Cool cake in pan 5 minutes. Cut around cake; remove pan sides. Cool cake 15 minutes longer. Place platter atop cake; invert cake onto platter. Remove pan bottom and foil. Replace any dislodged apples. Rewarm remaining caramel sauce. Serve cake warm or at room temperature with sauce.",
            "Preheat oven to 350°F. Spray bottom of 9-inch-diameter springform pan with nonstick spray. Line bottom with foil; spray foil. Wrap outside of pan with foil.",
            "Melt 3 tablespoons butter in large nonstick skillet over medium-high heat. Add apples; sprinkle with 1 tablespoon sugar. Sauté apples until almost tender and beginning to brown, about 6 minutes. Sprinkle with 3 tablespoons sugar. Increase heat to high and toss until sugar melts and apples are deep brown, about 4 minutes. Pour apple mixture onto large plate (do not clean skillet).",
            "Melt 4 tablespoons butter in same skillet over medium-high heat. Add 3/4 cup sugar and cook until mixture is deep golden brown, stirring often, about 7 minutes (mixture will be grainy). Add cream and vinegar (do not stir). Cover skillet, reduce heat to medium-low and simmer without stirring until most of caramel bits dissolve, about 8 minutes. Uncover and whisk until sauce is slightly thick, deep brown and reduced to generous 1 cup, about 3 minutes longer. Pour caramel sauce into small saucepan.",
            "Spread 3 tablespoons caramel sauce over bottom of prepared pan. Arrange apple wedges side by side, rounded side down, in caramel in 2 concentric circles. Sift flour and next 6 ingredients into bowl. Beat 6 tablespoons butter and 1 cup sugar in large bowl to blend (mixture will be grainy). Beat in eggs 1 at a time, then vanilla and 1/4 cup caramel sauce. Beat in half of dry ingredients, then sour cream, then remaining dry ingredients.",
            "Spoon batter evenly over apples. Bake cake until tester inserted into center comes out clean, about 1 hour 15 minutes. Cool cake in pan 5 minutes.",
            "Cut around cake; remove pan sides. Cool cake 15 minutes longer. Place platter atop cake; invert cake onto platter. Remove pan bottom and foil. Replace any dislodged apples. Rewarm remaining caramel sauce. Serve cake warm or at room temperature with sauce."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5612e587928970611e0a7f54/6:4/w_274%2Ch_169/100971.jpg"
    }
}