{
    "recipe": {
        "title": "Winter Squash Carbonara with Pancetta and Sage ",
        "ingredients": [
            "2 tablespoons olive oil",
            "4 ounces pancetta (Italian bacon), chopped",
            "1 tablespoon finely chopped fresh sage",
            "1 2-pound kabocha or butternut squash, peeled, seeded, cut into 1/2\" pieces (about 3 cups)",
            "1 small onion, chopped",
            "2 garlic cloves, chopped",
            "Kosher salt, freshly ground pepper",
            "2 cups low-sodium chicken broth",
            "12 ounces fettucine or linguine",
            "1/4 cup finely grated Pecorino, plus shaved for serving"
        ],
        "instructions": [
            "Heat oil in a large skillet over medium-high heat. Add pancetta, reduce heat to medium, and cook, stirring occasionally, until crisp, 8–10 minutes. Add sage and toss to coat. Using a slotted spoon, transfer pancetta and sage to a small bowl; set aside.",
            "Add squash, onion, and garlic to skillet; season with salt and pepper and cook, stirring occasionally, until onion is translucent, 8–10 minutes. Add broth. Bring to a boil, reduce heat, and simmer until squash is soft and liquid is reduced by half, 15–20 minutes. Let cool slightly, then purée in a blender until smooth; season with salt and pepper. Reserve skillet.",
            "Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 cup pasta cooking liquid.",
            "Combine pasta, squash purée, and 1/4 cup pasta cooking liquid in reserved skillet and cook over medium heat, tossing and adding more pasta cooking liquid as needed, until sauce coats pasta, about 2 minutes. Mix in 1/4 cup Pecorino; season with salt and pepper.",
            "Serve pasta topped with reserved pancetta and sage, shaved Pecorino, and more pepper.",
            "DO AHEAD: Squash purée can be made 3 days ahead. Let cool; cover and chill."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3f933460b4423363f9768/6:4/w_274%2Ch_169/51214610_winter-squash-carbonara_1x1.jpg",
        "color": 12559450
    }
}