{
    "recipe": {
        "title": "Winter Squash Agrodolce ",
        "ingredients": [
            "1 (2 pound) kabocha squash, peeled, seeds removed, cut into 1\" wedges",
            "2 delicata or dumpling squashes, seeds removed, cut into 1\" wedges",
            "2 tablespoons olive oil",
            "Kosher salt, freshly ground pepper",
            "2 Fresno chiles, thinly sliced",
            "3/4 cup red wine vinegar",
            "1/4 cup honey",
            "2 tablespoons golden raisins, chopped",
            "1 teaspoons crushed red pepper flakes"
        ],
        "instructions": [
            "Preheat oven to 400°F. Place kabocha and delicata squash on separate large rimmed baking sheets. Drizzle with oil; season with salt and pepper. Roast, tossing occasionally, until squashes are golden brown and tender, 30–35 minutes for kabocha and 20-25 minutes for delicata. Meanwhile, bring chiles, vinegar, honey, raisins, red pepper flakes, and a pinch of salt to a boil in a small saucepan over medium heat. Reduce heat and simmer until syrupy, 8–10 minutes. Brush half of warm agrodolce over warm squash. Transfer to a platter. Just before serving, reheat remaining agrodolce, adding a splash of water if needed to loosen. Spoon over squash.",
            "Preheat oven to 400°F. Place kabocha and delicata squash on separate large rimmed baking sheets. Drizzle with oil; season with salt and pepper. Roast, tossing occasionally, until squashes are golden brown and tender, 30–35 minutes for kabocha and 20-25 minutes for delicata.",
            "Meanwhile, bring chiles, vinegar, honey, raisins, red pepper flakes, and a pinch of salt to a boil in a small saucepan over medium heat. Reduce heat and simmer until syrupy, 8–10 minutes.",
            "Brush half of warm agrodolce over warm squash. Transfer to a platter.",
            "Just before serving, reheat remaining agrodolce, adding a splash of water if needed to loosen. Spoon over squash.",
            "Do ahead Dish can be made 3 hours ahead. Store tightly wrapped at room temperature.",
            "Dish can be made 3 hours ahead. Store tightly wrapped at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/563a3ceb89987d44229602bc/6:4/w_274%2Ch_169/winter-squash-agrodolce.jpg"
    }
}