{
    "recipe": {
        "title": "Yeasted Brown-Butter Waffles ",
        "ingredients": [
            "3/4 cup (1 1/2 sticks) unsalted butter plus more for serving",
            "2 cups warm whole milk",
            "1/2 cup buttermilk",
            "2 tablespoons sugar",
            "1 1/4-ounce envelope active dry yeast (about 2 1/4 teaspoon)",
            "1 1/4 teaspoon kosher salt",
            "2 cups all-purpose flour",
            "2 large eggs",
            "1/4 teaspoon baking soda",
            "Nonstick vegetable oil spray",
            "Pure maple syrup (for serving)"
        ],
        "instructions": [
            "Melt 3/4 cup butter in a medium saucepan over medium heat and cook, stirring often, until butter foams, then browns (do not burn), 5–8 minutes. Pour into a medium bowl; let cool. Whisk milk, buttermilk, sugar, yeast, and salt in a large bowl. Whisk in flour and brown butter; cover with plastic wrap and let batter sit at room temperature at least 8 hours and up to 12 hours. Heat waffle iron until very hot. Whisk eggs and baking soda into batter. Coat waffle iron with nonstick spray and pour batter onto waffle iron, spreading it to cover surface (amount of batter needed will vary according to machine). Cook waffles until golden brown and cooked through. Serve immediately with maple syrup and more butter.",
            "Melt 3/4 cup butter in a medium saucepan over medium heat and cook, stirring often, until butter foams, then browns (do not burn), 5–8 minutes. Pour into a medium bowl; let cool.",
            "Whisk milk, buttermilk, sugar, yeast, and salt in a large bowl. Whisk in flour and brown butter; cover with plastic wrap and let batter sit at room temperature at least 8 hours and up to 12 hours.",
            "Heat waffle iron until very hot. Whisk eggs and baking soda into batter. Coat waffle iron with nonstick spray and pour batter onto waffle iron, spreading it to cover surface (amount of batter needed will vary according to machine). Cook waffles until golden brown and cooked through.",
            "Serve immediately with maple syrup and more butter."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ad4aa619925f464b3b3daa/6:4/w_274%2Ch_169/51198490_brown-butter-waffles_1x1.jpg"
    }
}