{
    "recipe": {
        "title": "Yellow Rice with Pigeon Peas ",
        "ingredients": [
            "1 Cubanelle pepper (Italian frying pepper), seeded and chopped",
            "5 fresh ají dulce (small sweet chiles), halved and seeded",
            "1/2 cup chopped onion",
            "2 garlic cloves, chopped",
            "1/2 cup coarsely chopped cilantro",
            "3 fresh recao leaves (culantro; see cooks' note, below), chopped",
            "1 plum tomato, chopped",
            "1 (1/4-pound) piece smoked ham, diced",
            "1/4 cup annatto oil",
            "1/3 cup chopped pimiento-stuffed olives",
            "1 tablespoon drained bottled capers",
            "2 cups long-grain white rice",
            "1 (15-ounce) can pigeon peas, rinsed and drained",
            "3 1/2 cups water"
        ],
        "instructions": [
            "Make Sofrito: Purée all sofrito ingredients in a food processor.",
            "Purée all sofrito ingredients in a food processor.",
            "Make rice: Cut out a round of parchment or wax paper slightly larger than diameter of a wide 4- to 5-quart pot. Pat ham dry and cook in annatto oil in pot over medium-high heat, stirring occasionally, until starting to crisp, about 4 minutes. Add sofrito, olives, and capers and cook, stirring, until liquid has evaporated, about 5 minutes. Add rice and cook, stirring, until it sizzles, about 2 minutes. Stir in peas, water, and 1 1/4 teaspoons salt and bring to a simmer. Simmer, uncovered, over medium-high heat until almost all of liquid is absorbed, about 10 minutes, reducing heat to medium once water is below level of rice. Gently stir from bottom to top, then smooth top of rice. Place parchment round directly over rice and cover pot with a tight-fitting lid. Reduce heat to low and cook, undisturbed, 30 minutes. Remove from heat, then discard parchment and gently fluff rice with a fork. Cover with lid and let stand 10 minutes.",
            "Cut out a round of parchment or wax paper slightly larger than diameter of a wide 4- to 5-quart pot.",
            "Pat ham dry and cook in annatto oil in pot over medium-high heat, stirring occasionally, until starting to crisp, about 4 minutes. Add sofrito, olives, and capers and cook, stirring, until liquid has evaporated, about 5 minutes. Add rice and cook, stirring, until it sizzles, about 2 minutes.",
            "Stir in peas, water, and 1 1/4 teaspoons salt and bring to a simmer. Simmer, uncovered, over medium-high heat until almost all of liquid is absorbed, about 10 minutes, reducing heat to medium once water is below level of rice.",
            "Gently stir from bottom to top, then smooth top of rice. Place parchment round directly over rice and cover pot with a tight-fitting lid. Reduce heat to low and cook, undisturbed, 30 minutes.",
            "Remove from heat, then discard parchment and gently fluff rice with a fork. Cover with lid and let stand 10 minutes."
        ],
        "picture_link": null
    }
}