{
    "recipe": {
        "title": "Yellow Pepper and Corn Salad with Turmeric Dressing ",
        "ingredients": [
            "1 jalapeño, seeds removed, chopped",
            "1 (4-inch) piece turmeric, peeled, chopped, or 3/4 teaspoon ground turmeric",
            "1 (1-inch) piece ginger, peeled, chopped",
            "1 garlic clove, crushed",
            "1 cup coarsely chopped cilantro",
            "1/4 cup olive oil",
            "1/2 teaspoon finely grated lime zest",
            "3 tablespoons fresh lime juice",
            "Kosher salt",
            "3 ears of corn, husked",
            "2 yellow bell peppers",
            "4 ounces Sun Gold or cherry tomatoes",
            "2 endive, leaves separated, halved if large, or 1 large head of frisée, torn into bite-size pieces",
            "2 cups dandelion greens or arugula",
            "Kosher salt"
        ],
        "instructions": [
            "Pulse jalapeño, turmeric, ginger, garlic, cilantro, oil, lime zest, and lime juice in a food processor until smooth with a few flecks of cilantro. Transfer to a small bowl; season with salt.",
            "Salad assembly: Prepare a grill for high heat. Grill corn, turning occasionally, until charred and cooked through, 6–8 minutes. Let cool; cut kernels off cobs and place in a large bowl. (Or, cut kernels from cobs and char in a dry cast-iron skillet over medium-high, 8–10 minutes.) Heat broiler. Broil peppers on a rimmed baking sheet, turning occasionally, until blackened in spots and nearly cooked through, 12–18 minutes. Let cool; cut into 1\" strips, retaining as much charred skin as possible; add to corn. Broil tomatoes on same baking sheet, tossing once, until blackened in spots and starting to burst, about 5 minutes. Let cool. Add tomatoes, endive, and greens to corn; toss to combine. Drizzle dressing over and toss to coat; season with salt.",
            "Prepare a grill for high heat. Grill corn, turning occasionally, until charred and cooked through, 6–8 minutes. Let cool; cut kernels off cobs and place in a large bowl. (Or, cut kernels from cobs and char in a dry cast-iron skillet over medium-high, 8–10 minutes.)",
            "Heat broiler. Broil peppers on a rimmed baking sheet, turning occasionally, until blackened in spots and nearly cooked through, 12–18 minutes. Let cool; cut into 1\" strips, retaining as much charred skin as possible; add to corn.",
            "Broil tomatoes on same baking sheet, tossing once, until blackened in spots and starting to burst, about 5 minutes. Let cool. Add tomatoes, endive, and greens to corn; toss to combine. Drizzle dressing over and toss to coat; season with salt."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57d1f0bcde27564257b657ad/6:4/w_274%2Ch_169/yellow-pepper-corn-salad-turmeric-dressing-BA-090816.jpg",
        "color": 5576636
    }
}