{
    "recipe": {
        "title": "Yogurt-Marinated Grilled Chicken ",
        "ingredients": [
            "8 skinless, boneless chicken breasts (about 3 pounds)",
            "2 cups plain whole-milk yogurt",
            "1 cup coarsely chopped fresh cilantro leaves and stems",
            "1/2 large onion, coarsely chopped",
            "1/3 cup olive oil plus more for brushing",
            "6 garlic cloves, coarsely chopped",
            "1 tablespoon fresh lime juice",
            "1 tablespoon garam masala",
            "2 teaspoons kosher salt plus more for seasoning",
            "1 teaspoons freshly ground black pepper",
            "1 2\" piece fresh ginger, peeled and chopped",
            "**Ingredient info:**Garam masala, an Indian spice blend, is sold in the spice section of better supermarkets and at Indian markets"
        ],
        "instructions": [
            "Working with one chicken breast at a time, put chicken between 2 sheets of waxed paper and pound to 1/2\" thickness. Transfer chicken breasts to a resealable plastic bag. Combine the remaining ingredients in a food processor and blend until smooth. Pour yogurt mixture over chicken, seal bag, and turn to coat. Marinate chicken in the refrigerator for at least 3 hours or overnight. Build a medium fire in a charcoal grill, or heat a gas grill to medium-high. Brush grill grates with oil. Scrape excess marinade off chicken; season with salt. Grill chicken, turning once, until browned and cooked through, 3-4 minutes per side.",
            "Working with one chicken breast at a time, put chicken between 2 sheets of waxed paper and pound to 1/2\" thickness. Transfer chicken breasts to a resealable plastic bag.",
            "Combine the remaining ingredients in a food processor and blend until smooth. Pour yogurt mixture over chicken, seal bag, and turn to coat. Marinate chicken in the refrigerator for at least 3 hours or overnight.",
            "Build a medium fire in a charcoal grill, or heat a gas grill to medium-high. Brush grill grates with oil. Scrape excess marinade off chicken; season with salt. Grill chicken, turning once, until browned and cooked through, 3-4 minutes per side."
        ],
        "picture_link": "https://assets.epicurious.com/photos/57b35e694924889253994108/6:4/w_274%2Ch_169/yogurt-marinated-grilled-chicken.jpg"
    }
}