{
    "recipe": {
        "title": "Yogurt and Brown-Sugar Panna Cotta With Grape Gelée ",
        "ingredients": [
            "1 teaspoon unflavored gelatin (from a 1/4-oz envelope)",
            "1 cup all natural Concord grape juice",
            "1 tablespoon fresh lemon juice",
            "1 cup red and green seedless grapes (6 ounces), thinly sliced crosswise",
            "1 tablespoon grappa",
            "Vegetable oil for greasing ramekins",
            "2 teaspoons unflavored gelatin (from another 1/4-oz envelope)",
            "1 cup heavy cream",
            "1/2 cup packed dark brown sugar",
            "2 cups low-fat plain yogurt",
            "2 tablespoons grappa",
            "1/8 teaspoon salt",
            "6 (8-oounce) ramekins"
        ],
        "instructions": [
            "Make gelée: Sprinkle gelatin over 1/4 cup grape juice in a 1-quart heavy saucepan and let stand 1 minute to soften. Bring to a simmer, stirring until gelatin is dissolved. Remove from heat and stir in remaining 3/4 cup grape juice with lemon juice, grapes, and grappa. Lightly oil ramekins and put in a shallow baking pan. Divide grape mixture among ramekins and chill in freezer until just set, about 30 minutes.",
            "Sprinkle gelatin over 1/4 cup grape juice in a 1-quart heavy saucepan and let stand 1 minute to soften. Bring to a simmer, stirring until gelatin is dissolved. Remove from heat and stir in remaining 3/4 cup grape juice with lemon juice, grapes, and grappa.",
            "Lightly oil ramekins and put in a shallow baking pan. Divide grape mixture among ramekins and chill in freezer until just set, about 30 minutes.",
            "Make panna cotta while gelée sets: Stir together gelatin and 1/4 cup cream in cleaned 1-quart heavy saucepan and let stand 1 minute to soften. Bring to a simmer over moderate heat, stirring until gelatin is dissolved. Add remaining 3/4 cup cream with brown sugar and return to a simmer, stirring until sugar is dissolved. Whisk together yogurt, grappa, and salt until smooth in a large measuring cup, then pour in cream mixture and whisk until combined well. Pour mixture into ramekins (over set gelée) and chill (in refrigerator), covered, until firm, at least 8 hours. To unmold, run a thin sharp knife along edge of each ramekin to loosen, then dip in a small bowl of very warm water 6 seconds. Invert a plate over each ramekin and then invert panna cotta with gelée onto plates, gently lifting off ramekins.",
            "Stir together gelatin and 1/4 cup cream in cleaned 1-quart heavy saucepan and let stand 1 minute to soften. Bring to a simmer over moderate heat, stirring until gelatin is dissolved. Add remaining 3/4 cup cream with brown sugar and return to a simmer, stirring until sugar is dissolved.",
            "Whisk together yogurt, grappa, and salt until smooth in a large measuring cup, then pour in cream mixture and whisk until combined well.",
            "Pour mixture into ramekins (over set gelée) and chill (in refrigerator), covered, until firm, at least 8 hours.",
            "To unmold, run a thin sharp knife along edge of each ramekin to loosen, then dip in a small bowl of very warm water 6 seconds. Invert a plate over each ramekin and then invert panna cotta with gelée onto plates, gently lifting off ramekins."
        ],
        "picture_link": "https://assets.epicurious.com/photos/55b7bd43a188eea213e64e0b/6:4/w_274%2Ch_169/235773_yogurt-brown-sugar-panna-cotta_6x4.jpg"
    }
}