{
    "recipe": {
        "title": "Yogurt-Braised Chicken Legs with Garlic and Ginger ",
        "ingredients": [
            "4 whole chicken legs (thigh and drumstick), patted dry with paper towels",
            "Kosher salt, freshly ground pepper",
            "2 Tbsp. extra-virgin olive oil",
            "1 head of garlic, halved crosswise, plus 1 clove",
            "1 (3\") piece ginger, peeled, scrubbed, thinly sliced",
            "1 Tbsp. coriander seeds",
            "1 Tbsp. cumin seeds",
            "1/2 tsp. crushed red pepper flakes",
            "1 tsp. ground turmeric",
            "3 cups plain whole-milk yogurt (not Greek), divided",
            "1 (15-oz.) can chickpeas, rinsed",
            "Thinly sliced scallions, mint leaves, and lime wedges (for serving)"
        ],
        "instructions": [
            "Generously season chicken legs all over with salt and pepper. Heat oil in a medium Dutch oven over medium. Arrange chicken legs in pot skin side down (you want them to fit snugly) and cook, lifting up once or twice to let hot fat run underneath, until skin is golden brown and crisp, 10–15 minutes. Transfer chicken to a plate, placing skin side up. Reduce heat to medium-low and add head of garlic, cut sides down, and ginger to pot. Cook, stirring occasionally, until ginger is starting to brown and curl around the edges and garlic is golden, about 4 minutes. Add coriander, cumin, and red pepper flakes and cook, stirring often, until spices are fragrant, about 1 minute. Stir in turmeric followed by 2 cups yogurt and mix until smooth; season with salt. Nestle legs back into pot, skin side up, in a single layer and add water just until legs are almost submerged with skin barely peeking out. Bring to a very gentle simmer, adjusting heat if needed, and cook, uncovered, until meat is very tender and just about falling off the bone, 75–90 minutes (the yogurt will separate and look curdled, which is fine). Let cool 10 minutes. Meanwhile, finely grate remaining garlic clove into a small bowl. Add remaining 1 cup yogurt and stir to combine; season with salt and pepper. Smear yogurt mixture across a platter and scatter chickpeas over. Carefully transfer chicken legs to platter. Using a large spoon or small ladle, skim off bright yellow fat that has collected on surface of braising liquid and drizzle all over platter (it’s okay if some rogue spices make it onto platter). Top with scallions and mint, then squeeze lime wedges over.",
            "Generously season chicken legs all over with salt and pepper. Heat oil in a medium Dutch oven over medium. Arrange chicken legs in pot skin side down (you want them to fit snugly) and cook, lifting up once or twice to let hot fat run underneath, until skin is golden brown and crisp, 10–15 minutes. Transfer chicken to a plate, placing skin side up.",
            "Reduce heat to medium-low and add head of garlic, cut sides down, and ginger to pot. Cook, stirring occasionally, until ginger is starting to brown and curl around the edges and garlic is golden, about 4 minutes. Add coriander, cumin, and red pepper flakes and cook, stirring often, until spices are fragrant, about 1 minute. Stir in turmeric followed by 2 cups yogurt and mix until smooth; season with salt.",
            "Nestle legs back into pot, skin side up, in a single layer and add water just until legs are almost submerged with skin barely peeking out. Bring to a very gentle simmer, adjusting heat if needed, and cook, uncovered, until meat is very tender and just about falling off the bone, 75–90 minutes (the yogurt will separate and look curdled, which is fine). Let cool 10 minutes.",
            "Meanwhile, finely grate remaining garlic clove into a small bowl. Add remaining 1 cup yogurt and stir to combine; season with salt and pepper.",
            "Smear yogurt mixture across a platter and scatter chickpeas over. Carefully transfer chicken legs to platter. Using a large spoon or small ladle, skim off bright yellow fat that has collected on surface of braising liquid and drizzle all over platter (it’s okay if some rogue spices make it onto platter). Top with scallions and mint, then squeeze lime wedges over."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5ab3cef20f4ab164841eb0d8/6:4/w_274%2Ch_169/Chicken-Legs-Braised-in-Spiced-Turmeric-Yogurt-09032018.jpg"
    }
}