{
    "recipe": {
        "title": "Yucatecan -Style Grilled Mahi-Mahi ",
        "ingredients": [
            "4 6-to 8-ounce mahi-mahi fillets",
            "1/4 cup achiote paste",
            "2 tablespoons fresh orange juice",
            "2 tablespoons fresh lime juice",
            "2 tablespoons distilled white vinegar",
            "2 garlic cloves, minced",
            "1 teaspoon dried oregano (preferably Mexican)",
            "1/2 teaspoon coarse kosher salt or sea salt",
            "1/2 teaspoon ground black pepper",
            "2 3-foot-long pieces of banana leaves",
            "2 tablespoons extra-virgin olive oil",
            "1/4 cup dry white wine",
            "4 bay leaves",
            "4 fresh epazote or Italian parsley sprigs or 4 pinches of dried epazote",
            "2 plum tomatoes, thinly sliced",
            "2 limes, thinly sliced",
            "Yucatecan Pickled Onions",
            "Habanero-Tomato Salsa"
        ],
        "instructions": [
            "Place fish in 13x9x2-inch glass baking dish. Whisk achiote paste and next 7 ingredients in medium bowl. Pour achiote mixture over fish; turn to coat. Cover and chill 1 hour.",
            "Prepare barbecue (high heat). Brush shiny side of banana leaves with 2 tablespoons oil; place each on baking sheet, oiled side down (some of leaf will hang over edge of sheet). Arrange 2 fillets with marinade still clinging crosswise in center of each banana leaf, spacing 2 inches apart. Drizzle wine around fish in leaves. Top each fillet with 1 bay leaf and 1 sprig of fresh epazote or parsley or 1 pinch of dried epazote. Fold overhanging edges of banana leaf over fish to enclose loosely. Transfer fish from baking sheet to grill, folded edges up. Cover and grill until fillets are just opaque in center, about 10 minutes.",
            "Open banana leaves. Transfer fish to plates. Garnish with tomato and lime slices. Serve with Yucatecan Pickled Onions and Habanero-Tomato Salsa."
        ],
        "picture_link": "https://assets.epicurious.com/photos/560d7851f9a841923089d649/6:4/w_274%2Ch_169/242125_hires.jpg"
    }
}