{
    "recipe": {
        "title": "Za'atar Roast Chicken with Green Tahini Sauce ",
        "ingredients": [
            "2 garlic cloves, smashed",
            "1 cup (lightly packed) flat-leaf parsley leaves with tender stems",
            "1/2 cup tahini",
            "1/4 cup fresh lemon juice",
            "Kosher salt",
            "1 3 1/2–4-pound chicken, cut into quarters, or 2 large skin-on, bone-in chicken breasts and 2 skin-on, bone-in chicken legs",
            "2 medium red onions, thinly sliced",
            "2 garlic cloves, smashed",
            "1 lemon, thinly sliced, seeds removed",
            "1 tablespoon sumac",
            "1 1/2 teaspoons ground allspice",
            "1 teaspoon ground cinnamon",
            "1 cup low-sodium chicken broth or water",
            "1/4 cup olive oil, plus more for drizzling",
            "Kosher salt, freshly ground pepper",
            "2 tablespoons za'atar",
            "2 tablespoons unsalted butter",
            "1/4 cup pine nuts",
            "6 pieces lavash or other flatbread",
            "Za'atar and sumac are available at Middle Eastern markets and specialty foods stores, and online."
        ],
        "instructions": [
            "Green tahini sauce Pulse garlic, parsley, tahini, lemon juice, and 1/2 cup water in a food processor, adding more water if needed, until smooth (sauce should be the consistency of a thin mayonnaise); season with salt.",
            "Do ahead: Sauce can be made 1 day ahead. Cover and chill.",
            "Chicken and assembly Preheat oven to 400°. Toss chicken, onions, garlic, lemon, sumac, allspice, cinnamon, broth, and 1/4 cup oil in a large resealable plastic bag; season with salt and pepper. Chill at least 2 hours.",
            "Place chicken, onions, garlic, and lemon on a rimmed baking sheet, spooning any remaining marinade over and around chicken. Sprinkle with za'atar and roast until chicken is browned and cooked through, 45–55 minutes.",
            "Meanwhile, melt butter in a small skillet over medium-high heat. Add pine nuts and cook, stirring often, until butter foams, then browns, and nuts are golden brown (be careful not to burn), about 4 minutes; season with salt.",
            "Slice chicken breasts, if desired. Serve chicken with roasted onion and lemon, topped with pine nuts, with green tahini sauce and lavash.",
            "Do ahead: Chicken can be marinated 1 day ahead. Keep chilled."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54ac008c6529d92b2c0351ca/6:4/w_274%2Ch_169/51241990_za-atar-roast-chicken_1x1.jpg",
        "color": 6186648
    }
}