{
    "recipe": {
        "title": "Zebra-Striped Shortbread Cookies ",
        "ingredients": [
            "2 1/3 cups all-purpose flour, divided",
            "1 1/2 tsp. kosher salt, divided",
            "1/3 cup Dutch-process cocoa powder",
            "1 1/4 cups (2 1/2 sticks) unsalted butter, room temperature",
            "2/3 cup granulated sugar",
            "1/4 cup powdered sugar",
            "1 large egg yolk",
            "1 tsp. vanilla extract or paste",
            "1 large egg, beaten to blend",
            "1/4 cup sanding sugar (any color)"
        ],
        "instructions": [
            "Whisk 1 1/3 cups flour and 3/4 tsp. salt in a medium bowl. Whisk cocoa powder, remaining 1 cup flour, and remaining 3/4 tsp. salt in another medium bowl. These are the bases for your chocolate and vanilla doughs.",
            "Beat butter, granulated sugar, and powdered sugar in the bowl of a stand mixer on medium-high speed until light and fluffy, about 4 minutes. Add egg and vanilla and beat until smooth. Divide mixture between the 2 bowls of dry ingredients (about 1 cup in each). Scrape vanilla mixture back into stand mixer bowl (save the mixing bowl) and beat on low speed just until combined. Return to reserved bowl. Repeat process with chocolate mixture.",
            "Arrange 2 large sheets of parchment paper on a work surface. Dollop one-quarter of chocolate dough in the center of each sheet and pat into rough 6x2\" rectangles. Dollop one-quarter of vanilla dough on top of each chocolate slab and pat into rectangles the same size and shape so that you have 2 layers each. Repeat entire process so you have 4 alternating layers. Tightly press stacked dough into cylinders about 1 1/2\" wide and 8\" long, using the parchment to help you. Wrap logs in plastic wrap and chill until very firm, at least 2 hours.",
            "Place racks in upper and lower thirds of oven; preheat to 350°F. Working one at a time, unwrap dough and brush with egg. Carefully sprinkle surface with sanding sugar and roll logs in sugar to coat well (really press dough into sugar so it sticks). Slice into rounds a generous 1/4\" thick, rotating after every few cuts to keep slices round. Arrange cookies on parchment-lined baking sheets, spacing 2\" apart. Bake, rotating baking sheets top to bottom and front to back halfway through, until edges are just set, 12–14 minutes. Let cool on baking sheets.",
            "Do Ahead Dough can be made 3 days ahead; keep chilled. Cookies can be baked 5 days ahead; store airtight at room temperature.",
            "Dough can be made 3 days ahead; keep chilled. Cookies can be baked 5 days ahead; store airtight at room temperature."
        ],
        "picture_link": "https://assets.epicurious.com/photos/5c114618408fc007de3879d5/6:4/w_274%2Ch_169/zebra-striped-shortbread-cookies-recipe-BA-121218.jpg"
    }
}