{
    "recipe": {
        "title": "Zeppole with Chocolate Sauce ",
        "ingredients": [
            "8 ounces 70% bittersweet chocolate, chopped",
            "1 cup heavy whipping cream",
            "1/4 cup honey",
            "2 cups plus 1/2 tablespoon bread flour",
            "1/2 cup plus 1/2 tablespoon whole milk",
            "3 tablespoons sugar",
            "1 1/2 teaspoons lemon zest",
            "3/4 teaspoon active dry yeast (from 1 envelope)",
            "3/4 teaspoon fine sea salt",
            "2 large eggs",
            "3/4 cup (1 1/2 stick) unsalted butter, room temperature, cut into cubes",
            "Vegetable oil (for deep-frying)",
            "Powdered sugar"
        ],
        "instructions": [
            "Put chocolate in a medium bowl. Stir cream and honey in a small saucepan over medium heat until mixture starts to bubble; pour over chocolate and whisk until smooth. Keep warm. DO AHEAD: Can be made 3 days ahead. Cover and chill. Rewarm before using.",
            "For zeppole: In the bowl of a stand mixer fitted with a paddle, combine flour and next 6 ingredients. Beat at low speed until dough forms. Gradually add butter, beating until absorbed between additions and occasionally scraping down sides of bowl. Increase speed to medium and beat until smooth and glossy, about 3 minutes. Scrape dough from paddle and sides of bowl. Cover with plastic wrap; let rise for 2 hours. Pour enough oil into a deep, heavy 5-quart pot to reach a depth of 1 1/2\" Attach a deep-fry thermometer to side of pot and heat oil over medium heat until it reaches 325°F. Working in batches, drop dough into oil by heaping teaspoonfuls (about 1\"-diameter rounds). Cook, turning occasionally, until zeppole are golden and cooked, about 4 minutes per batch. Using a slotted spoon, transfer zeppole to paper towels; drain. Sift powdered sugar over zeppole or put sugar in a paper bag and add zeppole; shake gently to coat. Serve with sauce for dipping.",
            "In the bowl of a stand mixer fitted with a paddle, combine flour and next 6 ingredients. Beat at low speed until dough forms. Gradually add butter, beating until absorbed between additions and occasionally scraping down sides of bowl. Increase speed to medium and beat until smooth and glossy, about 3 minutes. Scrape dough from paddle and sides of bowl. Cover with plastic wrap; let rise for 2 hours. Pour enough oil into a deep, heavy 5-quart pot to reach a depth of 1 1/2\" Attach a deep-fry thermometer to side of pot and heat oil over medium heat until it reaches 325°F. Working in batches, drop dough into oil by heaping teaspoonfuls (about 1\"-diameter rounds). Cook, turning occasionally, until zeppole are golden and cooked, about 4 minutes per batch. Using a slotted spoon, transfer zeppole to paper towels; drain. Sift powdered sugar over zeppole or put sugar in a paper bag and add zeppole; shake gently to coat. Serve with sauce for dipping."
        ],
        "picture_link": "https://assets.epicurious.com/photos/56043a3c7c9cb37c518d5bd6/6:4/w_274%2Ch_169/365179_hires.jpg",
        "color": 15922676
    }
}