{
    "recipe": {
        "title": "Ziti with Roasted Zucchini ",
        "ingredients": [
            "2 pounds medium zucchini, trimmed, cut into 1/4-inch-thick rounds",
            "12 garlic cloves, peeled, halved",
            "8 large shallots, halved, thinly sliced",
            "7 tablespoons olive oil, divided",
            "1/2 teaspoon dried crushed red pepper",
            "2 1-pound boxes ziti, cooked, drained, 3/4 cup cooking liquid reserved",
            "1 cup chopped fresh basil, divided",
            "3/4 cup grated Pecorino Romano cheese"
        ],
        "instructions": [
            "Preheat oven to 400°F. Toss zucchini, garlic, shallots, 5 tablespoons oil, and crushed red pepper in bowl. Spread on 2 large rimmed baking sheets; sprinkle with salt and pepper. Roast vegetables until tender, turning occasionally, 30 to 35 minutes. Toss cooked pasta in large bowl with 1 tablespoon oil. Transfer half of pasta (8 cups) to another bowl; cool, stirring occasionally. Cover; chill (reserve for mac and cheese). Place remaining pasta in large pot. Add roasted vegetables, 1/4 cup pasta cooking liquid, and 1 tablespoon oil; stir over medium heat until heated through. Add 3/4 cup basil and cheese. Toss, adding reserved cooking liquid by tablespoonfuls to moisten if dry. Season with salt and pepper. Transfer pasta to large platter. Sprinkle pasta with remaining 1/4 cup basil.",
            "Preheat oven to 400°F. Toss zucchini, garlic, shallots, 5 tablespoons oil, and crushed red pepper in bowl. Spread on 2 large rimmed baking sheets; sprinkle with salt and pepper. Roast vegetables until tender, turning occasionally, 30 to 35 minutes.",
            "Toss cooked pasta in large bowl with 1 tablespoon oil. Transfer half of pasta (8 cups) to another bowl; cool, stirring occasionally. Cover; chill (reserve for mac and cheese).",
            "Place remaining pasta in large pot. Add roasted vegetables, 1/4 cup pasta cooking liquid, and 1 tablespoon oil; stir over medium heat until heated through. Add 3/4 cup basil and cheese. Toss, adding reserved cooking liquid by tablespoonfuls to moisten if dry. Season with salt and pepper. Transfer pasta to large platter. Sprinkle pasta with remaining 1/4 cup basil."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b3235d460b4423363edabb/6:4/w_274%2Ch_169/361191_ziti-zucchini_1x1.jpg"
    }
}