{
    "recipe": {
        "title": "Ziti with Poblanos and Chipotle Sauce ",
        "ingredients": [
            "1 large onion, thinly sliced (2 1/4 cups)",
            "1/2 pound fresh poblano chiles, stemmed, seeded, and thinly sliced lengthwise",
            "2 tablespoons olive oil",
            "1 cup chopped bottled roasted red peppers",
            "1 pound ziti or penne",
            "1 tablespoon chopped canned chipotles in adobo",
            "1 1/2 cups sour cream",
            "1 cup chopped scallions (about 1 bunch)",
            "1/4 cup chopped cilantro",
            "raw green (hulled) pumpkin seeds (pepitas), toasted"
        ],
        "instructions": [
            "Cook onion, poblanos, and 1/2 teaspoon salt in oil in a heavy medium pot over medium heat, covered, stirring occasionally, until onion is golden, 8 to 10 minutes. Add red peppers and cook, stirring occasionally, until onion is tender, 2 to 3 minutes. Meanwhile, cook ziti in a pasta pot of boiling salted water (2 tablespoons salt for 6 quarts water) until al dente. Reserve 1 cup cooking water, then drain ziti. While ziti cooks, purée chipotles with sour cream in a blender. Add purée to onion mixture with scallions, cilantro, 1/4 cup cooking water, and 1/2 teaspoon salt and bring to a simmer, stirring. Add ziti and toss, moistening with additional cooking water if desired. Season with salt.",
            "Cook onion, poblanos, and 1/2 teaspoon salt in oil in a heavy medium pot over medium heat, covered, stirring occasionally, until onion is golden, 8 to 10 minutes. Add red peppers and cook, stirring occasionally, until onion is tender, 2 to 3 minutes.",
            "Meanwhile, cook ziti in a pasta pot of boiling salted water (2 tablespoons salt for 6 quarts water) until al dente. Reserve 1 cup cooking water, then drain ziti.",
            "While ziti cooks, purée chipotles with sour cream in a blender.",
            "Add purée to onion mixture with scallions, cilantro, 1/4 cup cooking water, and 1/2 teaspoon salt and bring to a simmer, stirring. Add ziti and toss, moistening with additional cooking water if desired. Season with salt."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b32b6521388ef838b0689f/6:4/w_274%2Ch_169/357997_ziti-poblanos-chipotle_1x1.jpg"
    }
}