{
    "recipe": {
        "title": "Zucchini Cakes with Smoked Trout ",
        "ingredients": [
            "1 pound zucchini, trimmed, coarsely grated in processor",
            "1 teaspoon salt",
            "1/4 cup all purpose flour",
            "2 tablespoons finely grated Parmesan cheese",
            "2 tablespoons minced shallot",
            "1 large egg plus 1 large egg white, beaten to blend",
            "1/2 teaspoon freshly ground black pepper",
            "Canola oil (for frying)",
            "1/3 cup (about) sour cream",
            "2 ounces smoked trout or smoked salmon, broken into 1 x 1/2-inch pieces",
            "Chopped fresh dill"
        ],
        "instructions": [
            "Place zucchini in colander set over bowl; sprinkle with salt and toss to coat. Place small plate atop zucchini to weigh down. Let stand 30 minutes to drain. Squeeze zucchini as dry as possible in kitchen towel. Transfer zucchini to medium bowl. Stir in flour, Parmesan, and shallot, then stir in beaten egg mixture and pepper. Line large rimmed baking sheet with parchment paper. Brush large nonstick skillet with enough oil to coat; heat over medium-high heat. Working in batches, drop zucchini mixture into skillet by scant 1 tablespoonfuls, spacing apart. Using spatula, flatten cakes to 2-inch rounds. Cook until golden on bottom, brushing skillet with more oil as needed between batches, about 1 to 1 1/2 minutes per side. Transfer cakes to prepared baking sheet. DO AHEAD: Can be made 1 day ahead. Cool completely, then cover and chill. Rewarm uncovered in 325°F oven until heated through, about 10 minutes. Place warm zucchini cakes on platter. Top each with small dollop of sour cream and piece of smoked trout. Sprinkle with chopped dill and serve.",
            "Place zucchini in colander set over bowl; sprinkle with salt and toss to coat. Place small plate atop zucchini to weigh down. Let stand 30 minutes to drain.",
            "Squeeze zucchini as dry as possible in kitchen towel. Transfer zucchini to medium bowl. Stir in flour, Parmesan, and shallot, then stir in beaten egg mixture and pepper.",
            "Line large rimmed baking sheet with parchment paper. Brush large nonstick skillet with enough oil to coat; heat over medium-high heat. Working in batches, drop zucchini mixture into skillet by scant 1 tablespoonfuls, spacing apart. Using spatula, flatten cakes to 2-inch rounds. Cook until golden on bottom, brushing skillet with more oil as needed between batches, about 1 to 1 1/2 minutes per side. Transfer cakes to prepared baking sheet. DO AHEAD: Can be made 1 day ahead. Cool completely, then cover and chill. Rewarm uncovered in 325°F oven until heated through, about 10 minutes.",
            "Place warm zucchini cakes on platter. Top each with small dollop of sour cream and piece of smoked trout. Sprinkle with chopped dill and serve."
        ],
        "picture_link": "https://assets.epicurious.com/photos/54b340f0460b4423363f27a2/6:4/w_274%2Ch_169/359333_zucchini-cakes-smoked-trout_1x1.jpg"
    }
}